{
    "add": {
        "doc": {
            "aliases": [
                "Rocky Davis", 
                "Lightningbolt"
            ], 
            "citizenship": "U.S.A. with a criminal record", 
            "content": "Loki wasn't finished with his lackey, yet. He helped Creel re-form his body and transported him to Asgard, in hopes that he would help him take over. But when the Absorbing Man dared to consider his power better than that of Odin's, lord of the Asgardians, he challenged Odin and was waved away, transported into space. Creel eventually managed to return to Earth by hitching a ride on a comet and immediately encountered the Hulk. The Absorbing Man nearly defeated his powerful opponent, lying him low and about to crush him with a huge boulder. But, in absorbing the Hulk's power during his transformation back into his alter ego, Bruce Banner, Creel was also transformed back to normal and buried by his own boulder. Loki freed him again so as to challenge Thor once more, but Thor tricked him into turning into water, and the Absorbing Man was dissipated. A short time later, Creel managed to reintegrate himself, fight Thor and later the Hulk, only to find himself defeated time and again.Eventually coming to his right mind and returning to America, he stalked Dazzler to acquire her light-powers to use against the Avengers. He was defeated, however, when Dazzler sought aid from the Fantastic Four and found Black Bolt instead. Black Bolt's sonic powers combined with Dazzler to overpower the Absorbing Man.Creel was abducted from prison by the omnipotent alien known as the Beyonder to fight in the so-called Secret Wars, after which he was restored to Earth. During this time, Creel met the villainess Titania (Mary MacPherran), and the two developed a relationship. Upon their return, Creel and Titania were contacted by the second Baron Zemo, who was forming a new Masters of Evil. After several independent assignments, they were defeated by the Ant-Man (Scott Lang) and the Wasp.Creel continued to engage in various criminal activities, most often with Titania, although the two often ran afoul of one superhero or another, including his arch-enemy Thor. Perhaps again tiring of battling superhuman opponents, the Absorbing Man seemed committed to try to give up his criminal ways, earning a friendly respect with the hero Thunderstrike, but later abandoned such attempts.After many months, Titania and Creel got married. Both villains had turned away from more malicious actions, preferring to quietly keep each other's company, although they never gave up bank robberies and other activities completely. Creel and Titania occasionally continued to come into conflict with superheroes, such as when the Black Widow (Natasha Romanova) was under a vendetta to dispose of all Avengers' villains, and she shattered Creel's altered form. Another time, Creel was duped by the villain Crossbones to keep Captain America busy while Crossbones ignited a bomb. Creel, however, claiming not to be a murderer, absorbed the properties of Captain America's shield to save the city from the explosion. Creel escaped to seek revenge on Crossbones, but the details of the outcome have yet to be revealed.When Titania was diagnosed with cancer, the couple felt that they had nowhere to turn. They kidnapped a doctor but were confronted by Thor, who convinced them to seek professional care. About this time, Thor assumed the rule of Asgard and brought it into Earth's plane of existence. He attracted a religious following while helping humanity, and Creel became one of his followers.", 
            "durability": 6, 
            "education": "High school dropout", 
            "energy": 4, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "Journey into Mystery #114 (1965)\n", 
            "groupaffiliation": [
                "Lethal Legion", 
                "formerly Masters of Evil", 
                "unnamed team on Battleworld"
            ], 
            "hair": "Bald\n", 
            "height": 76, 
            "id": "Absorbing_Man", 
            "identity": "Publicly known", 
            "intelligence": 2, 
            "knownrelatives": "Mary MacPherran (Titania, wife); Davis Rockwell (cousin)", 
            "occupation": [
                "Professional criminal", 
                "former boxer"
            ], 
            "origin": "Journey into Mystery #114 (1965)", 
            "placeofbirth": [
                "New York City", 
                "New York"
            ], 
            "powers": "The Absorbing Man can alter the molecular structure of his body, his clothes, and his wrecking ball to mimic the properties of any material he touches. This process also gives him enhanced strength, endurance, and in most cases, resistance to injury. If the object touched holds some form of energy, such as a battery or a blast furnace, Creel absorbs these properties as well. He also has limited shape-changing abilities when absorbing certain objects, such as forming hammer-like fists when touching a hammer or growing to enormous size when copying items of massive power or strength. More recently, Creel has developed the ability to control the mind of another, even over vast distances. He was been shown to be able to \"re-grow\" his arm when it fell off (in his rocky form) by re-attaching it, then changing back to human form.", 
            "realname": "Carl \"Crusher\" Creel", 
            "significantissues": [
                "Given powers by Loki, believed he drove off Thor, defeated by Thor (Journey into Mystery #114, 1965)", 
                "used by Loki in Asgardian takeover, cast into space by Odin (Journey into Mystery #123, 1965)", 
                "returned to Earth, first fought the Hulk (Incredible Hulk #125, 1970)", 
                "confronted by Avengers before skipping the country, washed out to sea (Avengers #183-194, 1979)", 
                "fought Hulk on Easter Island (Incredible Hulk #261, 1981)", 
                "fought in the Secret Wars, met Titania (Secret Wars #1-12, 1984-1985)", 
                "with Masters of Evil, thwarted by Ant-Man and Wasp (Avengers #273-275)", 
                "married Titania (Avengers Unplugged 4, 1996)", 
                "discovered his wife had cancer (Thor #25, 2000)", 
                "became a follower of Thor (Thor #55, 2002)", 
                "displayed new power, controlled Hulk to free himself but seemingly dying (Incredible Hulk #55-59, 2003)", 
                "revealed to be alive, fought She-Hulk (She-Hulk #5-6, 2004)"
            ], 
            "speed": 3, 
            "strength": 6, 
            "universe": "Marvel Universe", 
            "weight": 365
        }
    }
}