{
    "aliases": "Super-Adaptoids", 
    "citizenship": "Inapplicable", 
    "content": "Hearing of the alert, S.H.I.E.L.D.'s Nick Fury ordered the Avengers to investigate. When the Avengers arrived on the island the Super-Adaptoid ordered his \"children\" to attack them. The newly formed Adaptoids swarmed around the Avengers hoping to overpower them with sheer numbers. However the then team leader Goliath ordered his team to find the Super-Adaptoid while he face against the majority of the Adaptoid spawn. During this fight hundreds or perhaps thousands of Adaptoid spawn attacked Goliath at once, but somehow Goliath defeated them all while his team tried to find the Super-Adaptoid which had already fled from the island.Sometime later the Super-Adaptoid formed a group called Heavy Metal, a group of robots and androids united to destroy the Avengers. Soon after its formation the team faced off against the Avengers on Hydrobase, where the Super-Adaptoid met with his \"brother\" Kubik. Since the Adaptoid was made from a piece of the Cosmic Cube, he copied the powers of his \"brother\" which also originated from the Cosmic Cube and gained limitless power. Deciding to use this power to turn the Earth's inhabitants into Adaptoids themselves he created another batch of Adaptoid spawn. These spawn copied the appearances and powers of several Avengers including Captain America, Doctor Druid, Namor, and others. However when captured Doctor Druid tricked the Super-Adaptoid and caused his defeat. After his defeat the Adaptoid spawn simply disappeared.", 
    "durability": 1, 
    "education": "Inapplicable", 
    "energy": 1, 
    "eyes": "Variable\n", 
    "fighting": 1, 
    "groupaffiliation": "None", 
    "hair": "Variable\n", 
    "height": 0, 
    "id": "Adaptoid_(Spawn)", 
    "identity": "Inapplicable", 
    "intelligence": 1, 
    "knownrelatives": "A.I.M. (creators), Super-Adaptoid (creator, \"father\"), Ultra-Adaptoid (fellow Adaptoid), Batch-13 (fellow Adaptoid), Super-Adaptoid (Yelena Belova) (fellow Adaptoid), Paragon (fellow Adaptoid), Adaptoid (New Enforcers) (fellow Adaptoid), Kubik (\"uncle\")", 
    "occupation": "Inapplicable", 
    "placeofbirth": "Inapplicable", 
    "powers": "They have the ability to copy the powers, attributes, physical characteristics, vocal patterns, thumbprints, fighting styles, weapons, and other things of those they wish. They can copy the persons' or things' power by seeing and scanning the subject(s). The Adaptoid spawn are like the Super-Adaptoid, however they are not as resiliant or strong as the original. Some Adaptoid spawn have taken the complete form and powers of Captain America, Doctor Druid, Black Knight, Namor, and other Avengers. The powers which many of these Adaptoid spawn have shown are the powers and abilities of: Captain America, Quicksilver, Hawkeye, Wasp, Iron Man, Goliath, Thor, Hercules, Scarlet Witch, and various other Avengers.", 
    "realname": "Adaptoids", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}