{
    "aliases": [
        "Lady of All Sorrows", 
        "She of All Sorrows"
    ], 
    "citizenship": "Inapplicable", 
    "content": "Unfortunately it was through the Crunch Cascade that the Annihilation Wave started its invasion of the positive universe. The wave did irreparable damage to the Kyln, and Aegis and Tenebrous were released back into the living universe once more, adding further fuel to the chaos that was engulfing all life. They were two other former powerful inmates freed from the Kyln, Kosmos the Maker formerly the Beyonder, and the Fallen One first Herald of Galactus. After Tenebrous captured and drained the Fallen One of his power, leaving him as a lifeless husk. Thanos of Titan came to the rescue of the Fallen One. Aegis noticed a small winged woman on the shoulder of Thanos. She stated that she was indeed a Chaos Mite. Aegis was puzzled as to how the Mite (Skreet) had managed to escape the great purge. Skreet refused to reveal her secrete.", 
    "durability": 7, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "White\n", 
    "fighting": 6, 
    "firstappearance": "Annihilation: Silver Surfer #3 (2006)\n", 
    "groupaffiliation": "Proemial Gods", 
    "hair": "Variable\n", 
    "height": 0, 
    "id": "Aegis_(Lady_of_All_Sorrows)", 
    "identity": [
        "Inapplicable", 
        "the general populace of Earth is unaware of Aegis' existence"
    ], 
    "intelligence": 7, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Tasked with culling the living universe of divergences and aberrations", 
    "origin": "Annihilation: Heralds of Galactus #2 (2007)", 
    "placeofbirth": "The Living Universe", 
    "powers": "She possesses massive cosmic powers, the full extent of these powers have not been revealed. She has shown that she can make hyper jumps through out the universe.", 
    "realname": "Aegis", 
    "significantissues": [
        "Aegis and Tenebrous was revealed for the first time (Annihilation: Silver Surfer #3, 2006)", 
        "Tenebrous and Aegis were both defeated by the Silver Surfer (Annihilation: Heralds of Galactus #2, 2007)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe"
}