{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Savage Land", 
            "content": "However, the Mutates later regained their powers thanks to the effects of the technology that changed them, causing them to regain their superhuman abilities should they ever lose them. Renaming themselves the Beast Brood, the Mutates proceeded to capture scientists in the hop of forcing them to mutate other Savage Land natives into superhuman beings. The costumed adventurers known as the Avengers and the Norse goddess Sif came searching for the scientists and defeated the Beast Brood, delivering them to legal authorities in Chile, the nearest nation to the Savage Land.The Mutates eventually escaped custody in Chile and returned home to the Savage Land.  One of the Mutates, Brainchild, assumed leadership of the group. Under Brainchild's leadership, the Mutates clashed with the winged X-Man named Angel, the costumed crimefighter Spider-Man, and Ka-Zar. The trio of heroes were searching for Karl Lykos, the human alter ego of the mutant pterosaur known as Sauron. Captured by the Mutates, the heroes were freed by Lykos but at a terrible cost, as Lykos became Sauron once more.The Mutates subsequently came under the leadership of Zaladane, a Savage Land priestess who once served the being known as Garokk, the Petrified Man. Zaladane subsequently led the Mutates in raids on Antarctic research stations, plundering Chilean cities, and kidnapping scientists in an effort to cement her seat of power in the Savage Land. Zaladane then dispatched the mutates to kidnap the former X-Man named Polaris, who was unknowingly Zaladane's sister. Zaladane stole her mutant ability to manipulate magnetism and the Mutates clashed with the X-Men who had come to rescue their missing friend.Following Zaladane's death at the hands of Magneto, the Mutates came under the leadership of Sauron and clashed once more with the X-Men who were searching the Savage Land for clues as to Magneto's whereabouts.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Yellow\n", 
            "fighting": 1, 
            "firstappearance": "X-Men #62 (1969)\n", 
            "groupaffiliation": [
                "Savage Land Mutates", 
                "formerly Swamp Men"
            ], 
            "hair": "None\n", 
            "height": 72, 
            "id": "Amphibius", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "None", 
            "occupation": "Terrorist", 
            "placeofbirth": [
                "Savage Land", 
                "Antarctica"
            ], 
            "powers": "Amphibius is an artificially mutated being who appears as a human-sized frog-like creature. In this form, Amphibius possesses superhuman strength in his legs, allowing him to leap to heights and over distances that ordinary humans cannot. Amphibius can also stretch his tongue to ensnare his foes. The exact extent to which he can stretch his tongue are as yet unknown. Furthermore, Amphibius possesses the ability to command water-dwelling creatures to do his bidding.\nAmphibius also possesses razor-sharp teeth. It is presumed that Amphibius is also a true amphibian, able to operate under water as easily as he does on land.", 
            "realname": "Unrevealed", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 145
        }
    }
}