{
    "add": {
        "doc": {
            "aliases": [
                "The Living Death That Walks", 
                "Lord of the Negative Zone"
            ], 
            "citizenship": "Arthros", 
            "content": "Annihilus first encountered the Fantastic Four when Reed, Thing, and Johnny entered the Negative Zone seeking anti-particles needed to treat Sue's cosmic ray-related pregnancy complications. Annihilus' minions captured the heroes, but they escaped, stealing his Control Rod. They returned it after siphoning off the needed anti-particles and returned to Earth. Annihilus next invaded the microverse, a dimension accessed via the energies of shrinking, sending his Insectivorid drones to conquer worlds in his name. Psycho-Man tried to control the dimensional interface leading to the microverse, but the Insectovorids, emotionless and immune to his power, overran the entire Sub-Atomica System and forced him to retreat to his worldship. Psycho-Man captured the Silver Surfer and Spider-Man to power his weapons and drive off the invaders, but the heroes escaped, leaving Annihilus and Psycho-Man to battle for control of the worldship. Annihilus' microverse invasion was presumably repelled.Shortly thereafter, Dr. Doom stole Annihilus' Rod in a complex scheme to steal Galactus's cosmic power. Almost immediately, Annihilus captured the human Rick Jones, who was often stranded in the Negative Zone through a bond he shared with Kree soldier Captain Mar-Vell. Annihilus released Jones when the Fantastic Four retrieved his Control Rod from Dr. Doom. Later, Annihilus was challenged by Janus the Nega-Man, a research scientist and contemporary of Reed who developed a module capable of harnessing anti-matter energy, within the Negative Zone. Annihilus defeated Janus, forcing the Nega-Man to lead him to Earth, but Janus was instead seemingly killed in the exploding atmosphere where matter meets anti-matter. When Mar-Vell used Reed's technology to free Rick Jones from the Negative Zone, Annihilus nearly crossed over to Earth along with Jones, but was driven back by the Avengers. Jones later returned to the Negative Zone, but his ability to access the Destiny Force--a near-infinite power source inherent in all humanity--protected him from Annihilus. Sensing great power within Franklin Richards, Annihilus once abducted him, amplifying his powers out of control. The Four defeated Annihilus and escaped back to Earth, but Reed was forced to temporarily shut down Franklin's mind to protect Earth's solar system.When the Mad Thinker regained control of his \"most powerful android\", which Annihilus had previously transmuted into one of his Scavenger servants, it stole Annihilus' Control Rod, morphing into monster form. Annihilus was forced to team up with Reed, who had been stranded in the Negative Zone by the Brute (Reed Richards of the High Evolutionary's Counter-Earth), to foil the Mad Thinker's plan to conquer both the Negative Zone and Earth. The monster android was ultimately defeated, and Annihilus regained his Rod. Annihilus next forged the first of many uneasy alliances with Blastaar, another Negative Zone warlord who ruled the planet Baluur. When his monarchy was overthrown, Blastaar offered to serve Annihilus in exchange for assistance in regaining control of Baluur. Although Annihilus viewed Blastaar as emotional and weak, he agreed to Blastaar's proposal, secretly planning to betray his newfound ally.Annihilus showed Blastaar his new weapon, the Super-Adaptoid-a powerful Advanced Idea Mechanics android which Annihilus \"found\" and reprogrammed, but when Nyglar, Blastaar's mate, grew suspicious of Annihilus and sent out a distress signal, the Thing and Avengers responded and defeated the villains. Annihilus slew Nyglar, after which Blastaar stole the Control Rod and left Annihilus to weaken and deteriorate rapidly. Dying and desperate, Annihilus slipped through the portal to Earth while the Fantastic Four were in the Negative Zone. Taking Franklin and Alicia Masters hostage, he attempted to merge the Earth universe with the Negative Zone, nearly destroying both in the process. Narrowly surviving the ensuing conflict, Annihilus eventually regained his Control Rod with the unwitting aid of Blastaar.Annihilus next attacked the dimension of Asgard, home of the Norse Gods, which had partially drifted into the Negative Zone for a time after the Rainbow Bridge was shattered. Annihilus slew several of Asgard's elite guard, the Crimson Hawks, and even defeated the mighty Thor before finally falling in battle to Odin, King of Asgard. Later, when Odin entered a week-long \"Odinsleep\" to renew his godly energies, Annihilus kidnapped his dormant body and transported it to the Negative Zone. Annihilus was soon located by the god Heimdall and defeated by Thor, who returned Odin to Asgard. Shortly thereafter, the extra-dimensional energy vampire Rune was defeated and cast into the Negative Zone. The weakened Rune attempted to steal the Control Rod, but was defeated by Annihilus and held prisoner within a cosmic singularity until eventually escaping through a portal.After investigating a strong energy pulse within the Negative Zone, Annihilus and Blastaar were imprisoned alongside the Fantastic Four by the Brute, who had enslaved the Tyannans as his personal army. Annihilus and his fellow captives eventually escaped and defeated the Brute, but Reed helped the Tyannans seal themselves off from the rest of the Negative Zone before a vengeful Annihilus and Blastaar were able to conquer them. Soon after, Annihilus and Blastaar joined forces with fellow Negative Zone warlord Syphonn, who created the Conqueror Wheel to access the Earth universe. During a confrontation with Adam Warlock, Annihilus and Blastaar realized that Syphonn planned to betray them-so they betrayed him first, forcing Syphonn to retreat as his Conqueror Wheel was destroyed by Warlock's allies.Stranded on the Negative Zone world of Argor by a glitch in Reed's Fold Space Transceptor prototype, the Fantastic Four stowed aboard Annihilus' monstrous spacecraft, but were soon detected and fought a heated battle with Annihilus inside a cargo hold. Seizing the Control Rod, Reed combined its technology with his Fold Space Transceptor and opened an access portal that allowed the Fantastic Four to escape Annihilus' spacecraft. Later, Annihilus faced a major setback when the N-Explorers, a team funded by the Gideon Trust to explore and loot the Negative Zone, stole his Control Rod. While fighting the N-Explorers for possession of his Rod, Annihilus was decapitated and slain by Hellscout, a descendant of 17th-century Puritan setters who had been stranded in the Negative Zone for centuries. Upon Annihilus' death, his body released a pod containing a nymph-like clone possessing his memories. After his new body's maturation, Annihilus awoke from his rebirth, but found the Control Rod missing and his empire in ruins.When Reed planned a new superhuman prison in the Negative Zone, the Fantastic Four were assaulted by Annihilus, who believed they had stolen his Control Rod. After a brief skirmish, the Fantastic Four subdued him, only to be attacked by a second Annihilus who had apparently also been spawned upon the death of his predecessor. Each believing himself to be the true Annihilus and the other the thief, the two Annihilus fought each other, allowing the Fantastic Four to escape.", 
            "durability": 6, 
            "education": "Unrevealed", 
            "energy": 7, 
            "eyes": "Green\n", 
            "fighting": 5, 
            "firstappearance": "Fantastic Four Annual #6 (1968)\n", 
            "groupaffiliation": "Sometime ally of Blastaar", 
            "hair": "None\n", 
            "height": 71, 
            "id": "Annihilus", 
            "identity": "No dual identity", 
            "intelligence": 5, 
            "knownrelatives": "Annihilus is a series of clonal scions", 
            "occupation": [
                "Conqueror", 
                "scavenger"
            ], 
            "origin": "Fantastic Four #140 (1973)", 
            "placeofbirth": [
                "Planet of Arthros", 
                "Sector 17A", 
                "Negative Zone"
            ], 
            "powers": "Annihilus' chitinous exoskeleton renders him superhumanly strong and durable. He can survive in space for up to a year via efficient energy and oxygen conversion and storage. Upon physical death, Annihilus spawns immature clones of himself that retain his memories. He can fly at 150 mph.", 
            "realname": "Annihilus", 
            "speed": 5, 
            "strength": 6, 
            "universe": "Marvel Universe", 
            "weight": 200
        }
    }
}