{
    "aliases": "Myrmidon", 
    "citizenship": "U.S.A. with a criminal record", 
    "content": "When his daughter was diagnosed with a fatal heart condition, Lang sought help from Dr. Erica Sondheim, who was kidnapped by Cross Technological Enterprises founder Darren Cross, for help with his own heart condition. In order to rescue her, and save his daughter, Lang broke in to the home of Dr. Henry Pym, the first Ant-Man, and stole his technology. After a successful rescue, Lang tried to turn himself in, but Pym allowed him to keep the suit, but for the purpose of good.Dividing his time between costumed heroics and his family responsibilities, Ant-Man worked alongside several super heroes, aiding members of the Avengers against the mercenary Taskmaster on two occasions. When Baron Zemo’s Masters of Evil attacked the Avengers and took control of the Avengers Mansion, Ant-Man offered his assistance to the Avengers in defeating the criminal super-team. The Fantastic Four subsequently hired him as an electronics expert when Mister Fantastic was believed to be dead, and he was inducted into the team.Following Mister Fantastic’s return, Ant-Man joined the team known as Heroes for Hire and clashed with such enemies as Ghaur and the Master. After Heroes For Hire disbanded, he again aided the Avengers against the Taskmaster; he also began dating former super hero Jessica Jones, although their relationship ended after he learned she was pregnant with Luke Cage’s child. Ant-Man next fought alongside the Avengers against the menace of Scorpio and the In-Betweener, then was invited to join full-time, a role he only accepted after losing custody of his daughter to his ex-wife.", 
    "durability": 2, 
    "energy": 4, 
    "eyes": "Blue\n", 
    "fighting": 2, 
    "firstappearance": "(as Scott Lang) Avengers #181, (as Ant-Man) Marvel Premiere #47 (1979)\n", 
    "groupaffiliation": [
        "Formerly Avengers", 
        "Fantastic Four", 
        "Heroes for Hire"
    ], 
    "hair": "Reddish blonde\n", 
    "height": 72, 
    "id": "Ant-Man_(Scott_Lang)", 
    "identity": "Known to some government officials", 
    "intelligence": 4, 
    "knownrelatives": "Peggy Rae Lang (ex-wife, divorced), Cassandra Lang, (Stature, daughter)", 
    "occupation": [
        "Former electronic technician", 
        "thief"
    ], 
    "origin": "Marvel Premiere #47-48 (1979)", 
    "placeofbirth": [
        "Coral Gables", 
        "Florida"
    ], 
    "powers": "Has the ability to shrink to roughly the size of an ant, also can communicate telepathically with insects, and (as Ant-Man) can punch with as much force as a normal sized person", 
    "realname": "Scott Edward Harris Lang", 
    "significantissues": [
        "Aided Avengers against Taskmaster (Avengers #195-196, 1980)", 
        "teamed with Hawkeye against Taskmaster (Avengers #223, 1982)", 
        "joined the Fantastic Four (Fantastic Four #385, 1994)", 
        "joined Heroes For Hire (Heroes For Hire #6, 1997)", 
        "began dating Jessica Jones (Alias #15, 2002)", 
        "joined Avengers (Avengers #62, 2003)", 
        "slain by Jack of Hearts (Avengers #500, 2004)"
    ], 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 190
}