{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "One morning, during surveillance duty, Eric and Chris received a visitor in the form of Agent Mitch Carson, who requested their aid in posing as security guards as he and the real security guards were needed in another part of the S.H.I.E.L.D. Helicarrier. As the security guards gave Eric and Chris their guns and departed, Eric realized that Mitch neglected to tell them whether they were meant to keep anybody from entering the door they were guarding or prevent them from leaving. It was at that moment that the door opened up and Eric, in a state of panic, knocked Dr. Henry Pym unconscious. They dragged his body back into the lab and began panicking. Inside that Eric noticed a suit of armor and goaded Chris into trying it on. Chris put on the costume but as he tried to find a way to take it off, he accidentally pushed a button and disappeared in front of Eric’s eyes. Eric panicked once again and ran out of the room, leaving Chris stuck ant-sized. Mitch later found out what had happened and confronted Eric about the missing Ant-Man suit. He revealed to Eric that Dr. Pym was working on a new Ant-Man suit for S.H.I.E.L.D. and that Mitch was one of the agents selected to try out for the suits detail. He ordered Eric to keep his mouth shut about the situation. In the meantime, Chris was having difficulty in trying to control the suit in the Helicarrier's ventilation system. He listened in on a conversation between Eric and Veronica as Eric tried to explain Chris’ disappearance to her (he was on a classified mission). He also lied to her by saying Chris was seeing somebody else behind Veronica’s back, much to both Chris and Veronica’s dismay. As Chris went off to confront Eric about what he had said, the S.H.I.E.L.D. Helicarrier was suddenly besieged by a number of supervillains. Chris entered Eric’s room and was struck by a frightened Eric, momentarily thinking Chris was one of the villains. As Chris told Eric what he had been up to for the past day, Eric’s room came under attack by two villains. Using the code to open his door, Eric pushed Chris out of the way and made his exit. However Chris was shot in the head and killed before the door closed over, preventing the villains from following them. Weeping for his fallen friend, and with the S.H.I.E.L.D. Helicarrier coming under heavy attack, Eric took the Ant-Man costume off the body of his best friend just as the Helicarrier crashed to the ground of Arkansas.Hours later, as Eric was helping victims of the crash, he met up with Veronica and told her that Chris was killed during the assault. With the Helicarrier destroyed, the surviving agents were put on leave. A week later, Eric and Veronica traveled to Chris’ hometown and met up with his parents, who allowed them to stay at their home. Meanwhile, Mitch was contacted by Henry Pym and Maria Hill and told to bring in the thief that stole the Ant-Man suit. They suspected that the thief was a S.H.I.E.L.D. agent and gave Mitch a device that could detect the Pym Particles left behind every time the person shrunk to ant-size. The day after Chris’s funeral, Veronica went to visit Chris’s grave but was followed by Eric. Feeling angry and alone, Veronica made out with Eric and, just as they were about to make love on Chris’s grave, Veronica came to her senses and left before she made a big mistake.Some months later, the agents returned to work aboard the newly repaired S.H.I.E.L.D. Helicarrier. As Eric settled in, he donned his costume and, while ant-sized, entered the ladies' shower room and began to spy on the women showering, but was noticed by one of the women. Escaping into the ventilation system, Eric was confronted by an army of ants and discovered that he could communicate with them. Unbeknownst to Eric, Mitch had donned an Ant-Man armor of his own, built by Henry Pym, but this armor was only a prototype and wasn’t as advanced as Eric’s costume. Nevertheless Mitch used it to track down the thief and bring him in. In the meantime, Veronica and Eric had gotten a lot closer and both of them slept with each other. That night, Eric donned the Ant-Man costume again and went to meet up with his new ant friends but instead was attacked by Mitch Carson, wearing his Ant-Man costume. As the two fought, Eric communicated with the ants to attack Mitch and made his escape. The next day after work, Veronica asked Eric out. But Eric, having slept with her, was now bored and blew her off. Eric didn’t realize that Veronica was now pregnant following her one night stand with Eric. That night, Eric and some other agents were playing poker in Mitch’s room. As Eric was winning, Mitch tried to see his bluff but Eric admitted that if there was one thing he was good at, it was lying. At that moment, Mitch realized that Eric was the costume thief and attacked him. He dragged Eric to his quarters and demanded entry to his room. As Eric input his room’s entry code, he pushed Mitch out of the way and locked himself inside. He then put on his costume and entered a ventilation shaft, but was followed by Mitch, now wearing his Ant-Man costume, and attacked. As Eric tried to make his getaway using his jets, the feedback burned the left half of Mitch’s face, leaving him horribly scarred. Ant-Man brought Mitch to the infirmary and made his getaway from the Helicarrier.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "Irredeemable Ant-Man # 1 (2006)\n", 
    "groupaffiliation": [
        "Secret Avengers", 
        "formerly Thunderbolts", 
        "S.H.I.E.L.D."
    ], 
    "hair": "Red\n", 
    "height": 71, 
    "id": "Ant-Man", 
    "identity": "Known to certain officials", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "former S.H.I.E.L.D. surveillance monitor", 
    "placeofbirth": [
        "Lancaster", 
        "Vermont"
    ], 
    "powers": "None", 
    "realname": "Eric O’Grady", 
    "significantissues": "Takes Ant-Man armor off Chris’s dead body (Irredeemable Ant-Man # 2, 2006), joined Thunderbolts (Thunderbolts #128, 2009)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 185
}