{
    "aliases": [
        "High Lord", 
        "Forever Walker", 
        "Son of the Morning Fire", 
        "\"The First One", 
        "\" Set", 
        "Huitxilopochti", 
        "Sauru", 
        "Kali-Ma", 
        "Aten", 
        "many others"
    ], 
    "citizenship": "Egypt", 
    "content": "Apparently, Apocalypse would use Rama Tut’s technology to \"regenerate\" for long periods of time, becoming more and more powerful when awakening. He was also known to have traveled around the world during these ancient years, appearing to various primitive cultures as their death god. At some point, when traveling through Mongolia, Apocalypse encountered a spaceship abandoned by the planet-judging aliens, the Celestials. His travels then became fueled by a single-minded purpose-- to find the key that would unlock the secrets to this alien technology. He found it in the person of Nathan Summers, then wandering various eras as the Traveler. The two fought, and although Apocalypse was nearly killed, he was saved by Ozymandias and taken to the Celestial ship. Apocalypse’s blood had become infected with Summers’ techno-organic virus during the battle, and the infection allowed Apocalypse to not only transform into an even more powerful being, but to also interface with the Celestial ship, claiming it as his own.Another reawakening occurred during the 12th century Crusades. Apocalypse's regeneration chamber was thought to be a temple of great power, and was sought out by the Black Knight and his friend Bennet du Paris, whom Apocalypse recognized as a mutant, and created him into the being known as Exodus.Later, Apocalypse surfaced in late 19th-century England, about the same time Darwin was proposing his \"survival of the fittest\" theories. Apocalypse, searching for underlings, met the scientist Nathaniel Essex, whose own desire for scientific knowledge led him to foresee the abundance of mutants that would occur in modern times. Apocalypse earned the allegiance of Essex, turning him into the being now known as Mister Sinister, but was soon defeated by the time-lost mutants, Cyclops and Phoenix.In recent years, Apocalypse was somehow awakened by the arrival of Cyclops’ son from the future, Cable. Apocalypse made another move against Cyclops and his team, X-Factor, by pitting them against a team of his own creation, the Alliance of Evil. Although he never used his Alliance again, Apocalypse soon formed the Horsemen of Apocalypse to plague humankind, when his ideas to \"cull\" humanity in order for the rise of mutant supremacy were beginning. He fought X-Factor again, and even captured their member Angel to turn into his Horseman of Death, although he defected, to be later replaced by X-Factor's ally, Caliban. Later, Apocalypse infected Cyclops' son, Nathan (who would become Cable) with the techno-organic virus (which would also inadvertently create Cable’s counterpart, Stryfe, as well as ensure his own infection when he met Cable as the Traveler) but was defeated by X-Factor in final battle.Apocalypse abandoned his Horsemen in favor of his Riders of the Storm (a.k.a. the Dark Riders) and later became the target of time-traveling Stryfe, who, as a clone of Nathan, was raised by Apocalypse in a horrific alternate future in which Apocalypse had risen to power. Eventually, Stryfe left Apocalypse withered and dying on the surface of the moon, where he was confronted by his Dark Riders and left for dead.Later, Apocalypse tried to revive his team of Horseman, transforming the Hulk into War, until Hulk broke free and went his own way. Over time, Apocalypse managed to re-create his Horsemen, transforming recognized heroes and villains into versions of War, Pestilence, Famine, and Death, (specifically Deathbird, Caliban, the X-Men’s associate, Rory Campbell, and Wolverine.)About the same time, Apocalypse apparently encountered and agreed to lead a faction of the Skrulls, who were investigating their own race's mutations. Apocalypse led these Skrulls in finally assembling what Apocalypse called \"the Twelve,\" mutants who Apocalypse would absorb powers from, giving him god-like abilities to re-create the world in Apocalypse's image. Many of the Twelve were members of the X-Men, and the team assembled to stop Apocalyspe. In the process of absorbing all of the Twelve’s powers into himself, Cyclops was merged with Apocalypse instead of Nate Grey, whom Apocalypse preferred. Unable to cope with the influx of power due to Cyclops' involvement, Apocalypse rejected the power, escaping and abandoning his mission, although Cyclops' body was seeming killed in the process.Soon, Phoenix and Cable left the X-Men in order to focus their attention on a search for Summers, whom they believed to still be alive. They tracked Apocalypse to his birth place in Egypt, where Summers, now an amalgamation of himself and Apocalypse, fought them. Ultimately, Jean was able to physically rip Apocalypse from Summers' body using her mental powers, and Cable destroyed Apocalypse's essence with his own telepathic powers.", 
    "durability": 6, 
    "education": "Centuries of study and experience", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 7, 
    "firstappearance": "Marvel Graphic Novel #17; (fully identified) X-Factor #5 (1986)\n", 
    "groupaffiliation": [
        "Founder and leader of the Alliance of Evil", 
        "the Horsemen of Apocalypse", 
        "the Riders of the Storm/Dark Riders"
    ], 
    "hair": "None\n", 
    "height": 0, 
    "id": "Apocalypse", 
    "identity": "Secret", 
    "intelligence": 7, 
    "knownrelatives": "Baal (adopted father, deceased)", 
    "occupation": [
        "Conqueror", 
        "(formerly) rebel leader", 
        "slave", 
        "nomad"
    ], 
    "origin": "Rise of Apocalypse #1-4", 
    "placeofbirth": "Akkaba region of Ancient Egypt", 
    "powers": "Apocalypse's full extent of powers remain to be revealed, especially to the extent of which powers have since been augmented by alien technology. Apocalypse claims to have control of his body on the molecular level-- allowing him to shape change and elongate with virtually unlimited range, to increase density and allow his body to mimic metals and armors, to teleport, and to be virtually immune to the effects of age. Apocalypse can also increase his strength to levels surpassing that of the Hulk, grow to giant sizes, and gain the power of flight, sometimes through turning his arms into wings or jets. Apocalypse can also transform himself into a variety of human disguises.\nHe has exhibited energy absorbing and projecting abilities in the past. Apocalypse has been termed an \"External,\" due to his mutant ability of immortality. Briefly, Apocalypse has shown potential to be a powerful psionic.\n\nIt has further been hinted that Apocalypse's body is ravaged by a techno-organic disease. Many of his regenerated bodies must use an exoskeleton body armor to prevent his energies from consuming him. Apocalypse can apparently merge/switch host bodies to continually revive his self-consuming body.", 
    "realname": "En Sabah Nur", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 300
}