{
    "aliases": [
        "Formerly Death", 
        "Dark Angel", 
        "Angel", 
        "Avenging Angel"
    ], 
    "citizenship": "U.S.A. (no criminal record)", 
    "content": "When the sentient island Krakoa captured the X-Men, Professor X assembled a new squad of X-Men to rescue them. After this, most of the original students -  including Warren - left the team. Warren inherited his family fortune and used a portion of it to fund a Los Angeles-based super-team, the Champions. Warren revealed to the general public that he was the Angel, though his connection to Xavier's school remained secret. After the Champions disbanded, Warren eventually rejoined the X-Men, but his constant clashes with Wolverine soon led him to quit. After declining the first of two invitations to join the Avengers, Angel teamed with Spider-Man, Ka-Zar and the X-Men to defeat Sauron and the Savage Land Mutates; helped the Avengers battle his rampaging ex-Champions teammate Ghost Rider (John Blaze); defeated his French counterpart Le Peregrine during the Grandmaster's Contest of Champions; and befriended the new Dazzler, mutant singer Alison Blaire, whom he romantically pursued for a time. Later, Angel joined the Defenders when that group reorganized as a more formal team under the guidance of his fellow X-Men graduate Beast. Angel served as financier of the new group, which was managed for a time by his girlfriend Candy, but they disbanded after most of its members seemingly died in battle with the Dragon of the Moon.After Professor X was publicly exposed as a mutant, Warren took a more public role in his business activities, speaking to the G8 summit about mutants in the world economy. When the X-Men were captured by the plant-like mutant Black Tom Cassidy, Warren's skin reverted to normal after Tom drained some of his life-force. Subsequently recovering from his injuries, Warren underwent a secondary mutation that gave his blood healing properties. When Xavier Institute student Husk uncovered corruption within Worthington Industries, she and Warren encountered the mutant werewolves the Dominant Species, whose leader, Maximus Lobo, claimed to have been the one who killed Warren's father. When Husk was severely injured by the werewolves, Warren used his newfound power to save her life, and the pair soon became romantically involved. After Cyclops became co-headmaster of the Institute, he asked Warren to establish a high-profile charity to improve mutantkind's image. Inspired by Robert A. Heinlein's story, \"The Menace from Earth,\" Warren established \"Wings over the World,\" a recreation center wherein visitors don artificial wings and fly by means of anti-gravity. Warren later also established \"Mutantes Sans Frontières,\" a global outreach organization that sends trained mutant volunteers to places where the X-Men have no official presence. Setting up office in Zanzibar, Warren and Husk became involved in an attempt by the Hellfire Club's White Queen Courtney Ross to destabilize the country by employing the mercenary Viper and the Weaponeers. Alongside the country's President - who was secretly the superhero Askari - and Genoshan reinforcements, the heroes managed to repel the invaders.Following the events of \"M-Day,\" when many of the world's mutants lost their powers, a mutant named the Ghoul began murdering fellow mutants. To help lure him into the open, Warren faked losing his powers and was interviewed by journalist Sally Floyd. When the Ghoul appeared and captured Floyd, he was opposed and defeated by the X-Men. Recently, the powers of Warren come back and during the Civil War, he returned to the X-Men.", 
    "durability": 4, 
    "education": "College degree from Xavier's School for Gifted Youngsters", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "(as Angel) X-Men #1 (1963); (as Avenging Angel) X-Men #54 (1969); (as Death) X-Factor #18 (1987); (as Dark Angel) X-Factor #34 (1988); (as Archangel) X-Factor #38 (1989)\n", 
    "groupaffiliation": [
        "X-Men", 
        "X-Force", 
        "formerly  Mutantes Sans Frontières", 
        "Hellfire Club", 
        "Secret Defenders", 
        "X-Factor", 
        "Horsemen of Apocalypse", 
        "Defenders", 
        "Death's champions", 
        "Champions of Los Angeles"
    ], 
    "hair": "Blond\n", 
    "height": 72, 
    "id": "Archangel", 
    "identity": "Publicly known", 
    "intelligence": 3, 
    "knownrelatives": "Warren Kenneth Worthington Sr. (grandfather, deceased), Warren Kenneth Worthington Jr. (father, deceased), Kathryn Worthington (mother, deceased), Burtram \"Burt\" Worthington (Dazzler, paternal uncle), unidentified cousin", 
    "occupation": [
        "Adventurer", 
        "chairman & principal stockholder of Worthington Industries", 
        "former terrorist"
    ], 
    "origin": "X-Men #54-56 (1969)", 
    "placeofbirth": [
        "Centerport", 
        "Long Island", 
        "New York"
    ], 
    "powers": "Archangel has fully feathered wings that span 16' and have a very flexible skeletal structure. He can fly by flapping his wings, and can reach speeds of up to 150 mph. Though he generally flies below the height of clouds at 6,500 feet, Archangel can reach a height of 10,000 feet with little effort. His wings are strong enough to carry aloft at least 200 pounds in addition to his own body weight. Archangel's entire anatomy is adapted for flight, having hollow bones; a body virtually devoid of fat, granting him enhanced proportionate muscle strength; eyes that can withstand high-speed winds; enhanced eyesight enabling him to see at distances far greater than the average human; and a special respiratory membrane that extracts oxygen from the air at extreme velocities and altitudes. Following his secondary mutation, Archangel can heal fatal injuries and cure most known diseases at an accelerated speed by mixing his blood with that of the victims, so long as they have a compatible blood type.\nAfter genetic alteration by Apocalypse, Archangel's wings became composed of a razor-sharp organic steel-like material, allowing him to use them as slashing weapons. He can also expel his feathers at great speed and with tremendous force, enabling them to pierce even steel. The feathers are tipped with a paralyzing chemical generated by his body (he is immune). He also briefly possessed the ability to convert his life-force into solid light to form a pair of energy wings.", 
    "realname": "Warren Kenneth Worthington III", 
    "significantissues": [
        "Joined X-Men (X-Men #56, 1969)", 
        "father killed, learned Dazzler was uncle (Ka-Zar #2-3/Marvel Tales #30, 1970/1971)", 
        "mother died (X-Men: The Hidden Years #15, 2001)", 
        "founded Champions, revealed identity to public, inherited fortune (Champions #1-5, 1975-1976)", 
        "joined Defenders (New Defenders #125, 1983)", 
        "co-founded X-Factor (X-Factor #1, 1986)", 
        "wings critically damaged (Thor #373-374, 1986)", 
        "possessed by Darkforce, vs New Warriors (New Warriors #32-34/New Warriors Annual #3, 1993)", 
        "feathered wings returned (Uncanny X-Men #338, 1996)", 
        "skin color returned to normal (Uncanny X-Men #411-412, 2002)", 
        "discovered healing ability (Uncanny X-Men #420, 2003)", 
        "established Wings over the World (X-Men Unlimited #8, 2005)", 
        "with Husk, established Mutantes Sans Frontières, vs Weaponeers in Zanzibar (Excalibur #11-13, 2005)", 
        "post \"M-Day,\" faked losing powers to help capture Ghoul (Generation M #4-5, 2006)", 
        "return to X-Men (Civil War: X-Men #1, 2006)"
    ], 
    "speed": 3, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 150
}