{
    "add": {
        "doc": {
            "aliases": "Omega Ray", 
            "citizenship": "Unrevealed", 
            "content": "Asteroth’s powers would grow with every feeding, and soon she would be almost unstoppable. Stardust and Beta Ray Bill fought the cosmic demon, but she was just too powerful for them. In a final effort to annihilate Asteroth, Stardust used his Power Cosmic to create a black hole so the gravity it produced would pull her inside, but even that did not faze her. If not for the sudden return of a fully recovered, cosmically charged Alpha Ray, Asteroth may have succeeded in killing the two beings that opposed her. Sacrificing himself, intending to eliminate Asteroth in the process, Alpha Ray forced her into the black hole along with Stardust.Time passed and soon Beta Ray Bill found himself on what was left of the fabled city of Asgard after the events of Ragnarok. He was in search of his lost meta-orb, the object that held the life forces of his people, but when he found it something had emerged from within. It was Asteroth in the body of a warped version of the Korbinite, and she was furious. Asteroth had to implant her essence inside the orb before her body was crushed by the black hole, and she had to feed off the Korbinite spirits in the orb to regain her strength and come forth once again. No longer at the energy levels of a god, Asteroth claimed to be the equal of Beta Ray Bill and called herself Omega Ray to mock her rival. Consumed by rage when he thought that he failed to protect his people, Beta Ray Bill unleashed the full power of his mallet, Stormbreaker, and killed Asteroth once again.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "White\n", 
            "fighting": 1, 
            "firstappearance": "Stormbreaker: The Saga of Beta Ray Bill limited series #3 (2005)\n", 
            "groupaffiliation": "None", 
            "hair": "Black (as Asteroth), None (as Omega Ray)\n", 
            "id": "Asteroth", 
            "identity": "Extradimensional demon", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Universal destroyer", 
            "origin": "Unrevealed", 
            "placeofbirth": "Unrevealed", 
            "powers": "Little is known of the full extent of Asteroth's powers, but it is clear that she was one of the most powerful cosmic entities before her banishment to cosmic hell. She fed on the energies of planets and was nearly indestructible with possibly limitless strength. She displayed the abilities to manipulate the gravity of a black hole, she could fly using her bat-like wings, and she could withstand the hardships of space indefinitely with no food, air, or water. However, when her body was destroyed, and she was forced to take the form of Omega Ray her powers were diminished to the same levels of a being as powerful as Beta Ray Bill.", 
            "realname": "Asteroth", 
            "significantissues": "Stormbreaker: The Saga of Beta Ray Bill limited series #3-6", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}