{
    "add": {
        "doc": {
            "aliases": [
                "Power Man", 
                "Smuggler", 
                "Goliath"
            ], 
            "citizenship": [
                "U.S.A. with a criminal record", 
                "pardoned"
            ], 
            "content": "Zemo's ally, Amora the Enchantress, soon seduced Josten into serving her. Using Zemo's ionic ray machines (which had previously transformed Simon Williams into Wonder Man), she gave Josten superhuman strength and durability, dubbing him Power Man. They conspired together to destroy the Avengers, but their plot failed, and the Enchantress abandoned Josten. The embittered Power Man turned to crime, forming a long-running partnership with fellow super-mercenary the Swordsman (Jacques Duquesne). Battling the Avengers as agents of the Black Widow (Natasha Romanova), then a brainwashed communist pawn), they were defeated by Swordsman's old protégé Hawkeye. Later serving the Red Skull, the duo was defeated by Captain America. After that, Power Man and Swordsman began working in larger groups. They fought an early incarnation of Alpha Flight as members of Egghead's Emissaries of Evil, and battled the Avengers twice more as agents of the Mandarin and as founding members of the Lethal Legion, but they were defeated repeatedly. The increasingly weary and disillusioned Swordsman abandoned their partnership and eventually reformed, dying in action as a member of the Avengers. Josten, meanwhile, sank into obscurity. His powers seemed to be gradually fading, possibly because Zemo's machines had been tailored to the physiology of Simon Williams (who was far more consistently powerful as Wonder Man than Josten was as Power Man.) The public had already mostly forgotten Josten when superhuman hero-for-hire Luke Cage began using the costumed alias Power Man. Enraged by this unwitting slight, Josten challenged Cage to a grudge match for the rights to the Power Man name.  Cage beat him soundly. Retreating into anonymity as a dock worker, Josten was recruited into crime lord Count Nefaria's new Lethal Legion, all of whom had their powers boosted by Nefaria's scientist Kenneth Sturdy. The boost proved temporary, and Nefaria siphoned away their energies to empower himself, resulting in the enfeebled Legion's swift defeat by the Avengers.Reduced to a tiny fraction of his former power, Josten returned to his old smuggling profession, adopting a less flamboyant (and less imaginative) identity as the Smuggler. Joining the Maggia crime syndicate, the Smuggler soon headed his own small gang, but he was defeated and captured by Spider-Man. Agreeing to testify against the Maggia, he was kidnapped by Maggia enforcers but escaped with the aid of Spider-Man, who delivered a seriously injured Josten to the police. Desperate to regain his former might, Josten later sought out criminal scientist Karl Malus, who restored Josten's superhuman strength and durability while infusing Josten with Pym particles that gave him the power to grow to gigantic size. Dubbing himself Goliath, Josten set out to become a major super-criminal, promptly abandoning Malus, since he no longer wanted to be anyone's minion.   During skirmishes with the new western Avengers roster, Goliath pushed his new powers beyond their limits and fell comatose.Recovering somewhat (though his mind and body remained unstable), Josten was defeated repeatedly by the Avengers, once while serving with a new Lethal Legion. Joining the Masters of Evil assembled by the new Baron Zemo (Heinrich's son Helmut), Goliath participated in their occupation of Avengers Mansion, during which he and several other Masters nearly beat Hercules to death. When the Avengers retook the Mansion, Goliath escaped, but subsequently lost several battles with Spider-Man. Imprisoned in the Vault, Josten participated in a mass escape attempt foiled by the Avengers and Freedom Force. By this time, Josten's ionic-powered counterpart Wonder Man was a successful celebrity as both an Avengers member and a Hollywood actor. Growing obsessively jealous of Williams, Josten attacked Wonder Man and was defeated. Later, acting as an agent of size-changing criminal Doctor Nemesis (Michael Stockton), Goliath was defeated by the new Giant-Man (Bill Foster). Goliath also lost a battle with the new Ant-Man (Scott Lang). When adventurer Clint Barton (best known as the archer Hawkeye) briefly resumed his own use of the Goliath identity and its growth powers, Josten fought him for the rights to the name. Barton defeated him with the aid of his wife, Mockingbird. An electrical discharge during this fight exacerbated Josten's growing mental and physical instability, attracting the attention of the extra dimensional Kosmosians, whose realm was the source of most human size-changers' powers. After battling Wonder Man again during a baffling deception staged by the demon Mephisto, Josten was abducted by criminal Kosmosians and used as an unwilling pawn in their invasion of Earth. The invasion was thwarted and Josten rescued by the original Giant-Man (Hank Pym), but Josten was left in a coma. Josten was later abducted by the Kosmosian authorities, who tortured the \"Intruder from Beyond\" for his supposed crimes until he was rescued by Helmut Zemo's latest Masters, earning Zemo Josten's fanatical loyalty.When the Avengers apparently died in battle with Onslaught, Zemo's new Masters filled this hero void by masquerading as a new super-team called the Thunderbolts whilst plotting world domination. His physical appearance altered by his team mate Techno (Norbert Ebersol), Josten began enjoying his new guise as the superhero Atlas, romancing the team's mayoral liaison Dallas Riordan, as well as befriending the innocent teen adventurer Jolt, whom the Thunderbolts had recruited as part of their pose. When Zemo enacted his world conquest scheme, exposing the Thunderbolts' true identities in the process, Atlas was heartbroken at losing Dallas and his new life. Josten initially remained loyal to Zemo, helping Zemo and Techno subdue the dissenting Thunderbolts. After the Baron threatened to kill Jolt, Atlas finally turned against Zemo, helping the Thunderbolts and other heroes thwart Zemo's plot. However, Atlas also secretly helped the defeated Zemo escape, trying to settle the debt he owed the Zemo family.The remaining Thunderbolts continued operating as a heroic team in hopes of winning back public approval. Atlas, demoralized by his betrayals of Dallas and Zemo, decided he was no good to anyone and fled back to Madison, Wisconsin. Once there, Atlas learned that his super-criminal reputation had all but destroyed the Josten family; other townsfolk spurned the Jostens and refused to do business with them, driving their farm into bankruptcy. Erik's parents had died penniless and broken-hearted, his brother Carl had become a pathetic drunk, and their other brother Conrad had moved away and changed his name. Guilt-stricken, Atlas tried to protect Carl from a local loan shark, but Carl was shot and killed. Vowing never to run away from his problems and responsibilities again, Atlas rejoined the Thunderbolts, staying with them even after his old foe Hawkeye joined as the group's new leader. Atlas was suspicious and scornful of Hawkeye at first, but the archer won his respect by protecting him from a vengeful Hercules. With a good friend in Jolt and a strong leader in Hawkeye, Atlas found new purpose as a mainstay of the Thunderbolts.Unfortunately, Erik still nursed doubts about his own worthiness and about the team's chances of success, doubts that intensified after Jolt was apparently murdered by Scourge (Jack Monroe). These doubts grew even stronger after Atlas was betrayed by Man-Killer, a fellow Masters of Evil veteran whom he had befriended in hopes that she might reform. When Count Nefaria mind-controlled Wonder Man into attacking Atlas, Man-Killer abandoned Josten during the battle and fled, mocking Erik's naiveté. Defeated and abducted by Wonder Man, Atlas fell under Nefaria's mental control as well, and his ionic powers were augmented in the process. As Nefaria's pawns, Atlas and Wonder Man battled the Avengers and the Thunderbolts until they were freed from his control. Wonder Man and Atlas absorbed the energy of an ionic bomb with which Nefaria had hoped to mutate the entire world. Nefaria's plan was thwarted, but Erik's body was critically overcharged by the surplus ionic energy. Atlas lay in stasis while the Thunderbolts tried to cure his condition. During an attack on their Mount Charteris headquarters by Scourge, a feverish Atlas burst out of his bio chamber, growing to impossibly huge size and experiencing incredible physical agony. Unable to contain his bodily energies or control his growth spurts, Atlas realized he was a danger to the populace of nearby Burton Canyon, and decided to die rather than threaten innocents. He allowed himself to explode despite the protests of his newly resurrected \"little sister\" Jolt.Dallas Riordan, politically disgraced by the revelation of the Thunderbolts' true identities, had lost her job in the mayor's office and become the latest Citizen V, chief field operative of the V-Battalion covert organization. As Citizen V, Riordan encountered the Thunderbolts as both an adversary and an ally until she was fired by the V-Battalion and crippled during a battle with the Crimson Cowl (Justine Hammer). Confined to a wheelchair, Riordan returned to civilian life only to find she was seemingly haunted by the ghost of Erik Josten. In reality, Josten had survived as disembodied energy and was trying to return to the physical world, drawn to Dallas because of his love for her. Riordan sought aid from the Avengers, who advised her regarding Josten's condition, but they could not fully resurrect Atlas. Instead, Erik's energies and consciousness soon inhabited the body of Dallas Riordan herself, restoring her mobility and endowing her with superhuman power whenever Erik's consciousness took over their shared form.This new Riordan-Josten incarnation of Atlas helped the Thunderbolts oppose would-be world-conqueror Graviton, who had already slaughtered most of the government-sponsored, Thunderbolts-inspired Redeemers super-team.  This included Erik's long-lost brother Conrad, trying to redeem the Josten family name as the new Smuggler. In the end, Graviton was apparently killed and the Thunderbolts, including the Riordan-Josten Atlas, were hurled to the Franklin Richards-created Counter-Earth. Since that world had been devastated by a series of disasters, the Thunderbolts began rebuilding Counter-Earth, becoming its leading heroes. In the process, Erik and Dallas grew comfortable with their new shared existence as Atlas, enjoying this unique form of intimacy. Erik became more confident and optimistic than before, buoyed by Dallas' spirit and her faith in him. Eventually, while saving Counter-Earth from an all-consuming void, the Thunderbolts were hurled back to their native Earth. During these events, Erik and Dallas were split back into two separate beings. Ironically, Erik was now a normal human, while Dallas - who had regained her full mobility - found her physical abilities enhanced to superhuman levels. Erik soon regained his growth power after their team mate, the Fixer (Ebersol), infused him with Pym particles.Renewing their old romance, Atlas and Dallas remained with the Thunderbolts after the team reorganized under the leadership of a supposedly reformed Baron Helmut Zemo. Dallas (using the costumed alias Vantage) stayed on largely to monitor the Baron. Zemo's new Thunderbolts became increasingly successful and respected, but when they created the \"Liberator\" device to impose world peace by draining \"transnormal\" energies on a global scale, the Avengers attacked them, fearing the Thunderbolts would abuse their new power. The battle sparked a good deal of in-fighting among the Thunderbolts themselves, and a crazed Moonstone injured Vantage. Atlas flew into an insane rage, beating Moonstone savagely until Hawkeye (back with the Avengers) restrained him. Once the fight was over, the Thunderbolts disbanded and Atlas asked the Avengers' Hank Pym to purge the size-changing Pym particles from his system, fearing they were feeding his emotional instability. Pym agreed, and Josten was left a seemingly ordinary man again.Dallas became an agent of Homeland Security, and she and Erik broke up. Lonely and seeking purpose, Josten joined MACH-IV's new Thunderbolts, serving as the team's one-man support staff. However, when the alien Captain Marvel (Genis-Vell) aided them against Fathom's Five, an overprotective Erik was irritated by Marvel's obnoxious attitude and his obvious romantic interest in MACH-IV's girlfriend, Songbird. Unobserved by his teammates and acting on instinct, a furious Josten assumed gigantic size and beat Marvel senseless, tossing him in the ocean to cover up his crime. His powers restored, Erik rejoined the Thunderbolts as Atlas; but his teammates worried about his growing emotional instability, notably a capacity for violent rage which increased dramatically when he used his powers. Investigating, Songbird discovered that Dallas was wheelchair-bound again, and that Erik had unwittingly and possibly irreversibly drawn the ionic energy out of her and back into himself. Songbird also learned of Erik's attack on Genis, who had since recovered and joined the Thunderbolts as the semi-amnesiac Photon. Later, during an extended conflict with the mind-controlling Purple Man, the Thunderbolts battled the Purple Man's pawn, a mysterious new Swordsman who sliced Atlas open, causing Josten to explode. Atlas was reduced to disembodied energy for ten days, during which the Scarlet Witch created a temporary, mutant-dominated alternate reality in which Josten was reborn as a heroic military man. This alternate reality and its version of Josten soon vanished, but Erik's memories of the experience helped give him new confidence once he finally managed to reintegrate his dispersed bodily energies. He regained physical form in time to rescue Songbird from the Purple Man's pawns and help the Thunderbolts defeat the Purple Man himself.", 
            "durability": 7, 
            "education": "High school dropout, military training", 
            "energy": 1, 
            "eyes": "Brown, formerly blue\n", 
            "fighting": 4, 
            "firstappearance": "(As Power Man) Avengers #21 (1965); (as Smuggler) Spectacular Spider-Man #49 (1980); (as Goliath) Iron Man Annual #7 (1984); (as Atlas) Incredible Hulk #449 (1997)\n", 
            "groupaffiliation": [
                "Formerly Defenders", 
                "Thunderbolts", 
                "Masters of Evil", 
                "Maggia", 
                "Lethal Legion", 
                "Mandarin's Minions", 
                "Emissaries of Evil", 
                "former partner of Dallas Riordan and Swordsman (Jacques Duquesne)"
            ], 
            "hair": "Red, formerly brown\n", 
            "height": 72, 
            "id": "Atlas_(Erik_Josten)", 
            "identity": "Publicly known", 
            "intelligence": 2, 
            "knownrelatives": "Parents (full names unrevealed, deceased), Carl Josten (brother, deceased), Conrad Josten (Smuggler, brother), Lindy Josten (sister, deceased)", 
            "occupation": [
                "Adventurer", 
                "formerly professional criminal", 
                "mercenary", 
                "dock worker", 
                "soldier"
            ], 
            "origin": [
                "Thunderbolts #18 (1998)", 
                "Thunderbolts '97 Annual (1997)"
            ], 
            "placeofbirth": [
                "Milwaukee", 
                "Wisconsin"
            ], 
            "powers": "Erik Josten’s body is charged with ionic energy which he can channel into augmented strength and durability, and the power to grow to gigantic sizes. In the past, he has been superhumanly strong and durable at normal human size. More recently, his enhanced strength and durability have only been active when he changes sizes, increasing as he grows, though this limitation may be more psychological than physical. Josten's mental stability seems to decrease with the use of his power, deteriorating further the larger he gets. This is not surprising given that other ionic-powered beings and self-enlarging beings have demonstrated unstable personalities linked to their powers; Josten being both ionic-powered and self-enlarging, a certain degree of mental instability seems almost inevitable. If he overtaxes his powers, or his body is overcharged with energy, or if he is seriously wounded, Josten runs the risk of exploding and being reduced to disembodied energy. To regain physical form, he seems to need some sort of emotional focal point, such as his love for Dallas or his concern for his teammates; and even then, the reintegration process takes days or weeks.", 
            "realname": "Erik Stephan Josten", 
            "significantissues": [
                "Official Handbook Bibliography", 
                "joined Defenders (Last Defenders #3, 2008)"
            ], 
            "speed": 2, 
            "strength": 7, 
            "universe": "Marvel Universe", 
            "weight": 225
        }
    }
}