{
    "aliases": "Unrevealed", 
    "citizenship": "Transylvania", 
    "content": "In 1943, Krowler allied himself with Sir Anthony Baskerville. He secretly relocated to Castle Baskerville in Cornwall with a German squadron, using the future’s Karl Mordo to bring the sorceress Clea to 1943 and capture Doctor Strange. Krowler and Baskerville plotted to use the terror and hatred generated at the peak of the Blitz, as well as the sacrifice of Clea, to cause the materialization of Dormammu on Earth. Krowler asked Dormammu to release his grandson, but the Dread One instead turned Future-Mordo into a ball of energy, which he gave to Baskerville. Dormammu then took over Krowler’s body. Baskerville later arranged for Future-Mordo to take over the body of Morgana Blessing, who had also traveled back to 1943, and was staying with Lady Pamela Hawley. This attracted the attention of Pam’s lover, Sergeant Nick Fury, who led his Howling Commandos to attack Castle Baskerville. Eventually, the power of love which bound Strange to Clea, Morgana to Strange, and Fury to Pamela, was enough to counteract the hate generated by the London Blitz. Morgana rejected Future-Mordo’s hatred and simultaneously blasted Dormammu in the body of Krowler and enabled Doctor Strange (whose astral form had escaped Krowler’s initial attack) to blast through Dormammu’s snares and strike at Krowler as well. Dormammu was banished; Krowler’s mind was annihilated.After Krowler returned to Germany, Sara Mordo cared for her invalid father. Young Karl Mordo, who had proven himself a sorcerous prodigy to the Ancient One, retained his interest in destructive magic and secretly spied on his mother and grandfather. Seeing an opportunity at last to fulfill his oath, he traveled to Castle Krowler, captured his mother and grandfather, and sacrificed both their lives to the Dread Dormammu, thereby sealing his alliance with the Dark Lord. Feeling Mordo was beyond redemption, the Ancient One feared that his own power might be insufficient to defeat him, but could do nothing without forcing his pupil’s hand.Returning to Transylvania, Mordo became master of his home village, sacrificing many residents in his quest for greater power. After some years, he learned of Il Libro di Cagliostro (the Book of Cagliostro), a tome of great mystic knowledge, including methods of time travel.  It was written by a great sorcerer of two centuries past. The book was held by the witch-queen Lilia, who was the daughter of Nikolai Mordo and Miarka’s daughter, while Miarka was rumored to have been the daughter of Cagliostro himself. Fully aware of his relation to Lilia, Mordo seduced her to gain the tome, then attacked her and left her for dead, unaware that she was pregnant with his daughter. Mordo was unable to wait until he had mastered his new tome, and began his campaign to slay both the Ancient One and Strange. Mordo and Strange became archenemies, although most of their early battles are unrecorded.Mordo’s feud with Strange endured into the modern era, when he subjected both Strange and the Ancient One to multiple attacks, beginning with an attempt to poison the Ancient One. Soon afterward, he impersonated Strange’s deceased ally Clive Bentley and trapped his enemy in a paralytic vapor, only to be foiled by the timely interruption of Bentley’s daughter Victoria. Weeks later, he teleported Strange’s Sanctum Sanctorum into another dimension in hope of robbing the Ancient One of his successor’s protection.. He fared no better in abducting Strange’s physical form, as the Master of the Mystic Arts was able to outthink Mordo as well as outfight him. Finally, he sent his followers after Strange en masse and captured the Ancient One during this distraction, only to be repelled once more by the power of Strange’s amulet, the Eye of Agamotto; its “light of righteousness” drove Mordo away.When the dread Dormammu sought his own vengeance on Strange, he recruited Mordo as a pawn.  Enhanced by his patron, Mordo stormed the Ancient One’s sanctum and would have killed the aged mystic if Strange, no match for Mordo’s augmented might, had not hurried his mentor to safety. As Strange searched the world for the means to defeat his enemy, Mordo, having recruited sorcerers from around the world to do his bidding, hounded him in Hong Kong, England, and elsewhere. After a long battle of wits, Mordo captured the Ancient One and lured Strange to Dormammu’s domain, the Dark Dimension.  As Dormammu vented his rage upon Strange, Mordo struck his enemy from behind, enraging the dreaded one’s sense of alien honor. Unwilling to suffer his lackey any further, Dormammu banished Mordo to another dimension, only to meet defeat himself when his pride dictated he once more battle Strange.Months later, Strange inadvertently unleashed a plague of uncontrolled magic upon the world, awakening the dormant sorcerous powers of untold numbers worldwide.   The Living Tribunal, preserver of mystic and cosmic balances, declared that Earth would be destroyed unless the status quo was restored. Mordo, inadvertently released by the same uncontrolled magic, rallied the new sorcerers to his leadership.  To save the Earth, Strange forced Mordo’s cooperation as both drew the novices‘; power into themselves. With the excess magic dispelled, Mordo predictably sought to re-gather it for himself, only for Strange to banish him again.When Strange briefly abdicated his protective duties, Mordo returned yet again, impersonating Strange to lure the sorcerer back to action, only to be defeated again. Realizing he had but repeated his error of drawing Strange back to his destiny, Mordo, having finally deciphered the time-traveling secrets of the Book of Cagliostro, decided to literally start over by altering the timeline so that he, not Strange or the Ancient One, was the world’s ruling mystic. Ironically, Strange learned of this scheme when, having become Sorcerer Supreme after the Ancient One’s death, he sought to reconcile with Mordo but followed him into the past instead. In the eighteenth century, both sorcerers encountered a man who seemed to be Cagliostro himself. He was revealed as Sise-Neg, a sorcerer of the future gathering mystic energy from past eras in order to alter not the timeline but time itself by journeying to the birth of the universe. Mordo and Strange followed him through history, one hoping to serve him and the other to stop him, but when Sise-Neg achieved the power he craved, he recognized the pettiness of his own ambitions and allowed the universe’s creation to proceed unaltered. Mordo was driven into catatonic madness by the sight, and Strange, pitying his arch enemy, returned to the present with Mordo, and cared for him at his sanctum.Mordo launched his most ambitious project yet when, having been brought to his nadir at the dawn of time, he resolved to bring about its end by opening the dreaded Seven Gates of Chaos, destroying the universe but leaving him intact to find an alternate earth where history had already proceeded according to his preferences. Collecting sacrifices once again, he transformed Strange’s ally Lord (Julian) Phyffe into the deadly Azrael, setting him against the mage. Nevertheless, Strange tracked Mordo to the Nexus of All Realities, whose guardian, the Man-Thing, Mordo had manipulated for his own purpose.  Mordo undermined himself yet again when he restored the Man-Thing’s human persona of Ted Sallis to make him a suitable and ironic sacrifice. Unable to bear the forces invoked, Sallis disrupted Mordo’s ceremony, throwing him yet again into inter-dimensional exile.Mordo’s fate proved to be fortune in disguise, for the invoked power brought him to a dimensional focal point, where he drew energies from uncounted dimensions to restore his might. Striving for subtlety, he manipulated Strange into meeting writer Morgana Blessing, who visited Strange accompanied by what she believed was her cat Magellan but was in fact Mordo transformed. Having thus penetrated Strange’s defenses, Mordo attacked, but when Strange threatened to overwhelm him even now, he absconded into the past with Blessing and Strange’s lover Clea, only for Dormammu to draw them into 1943 as part of a scheme by none other than Viscount Krowler; destined to play a part in his grandfather’s scheme, it was Mordo’s own power that, via Krowler’s transfer spell, Krowler and Baskerville called upon to summon the Dreaded One to conquer the Earth dimension in an era before Strange was empowered to defend it. Contemptuously reduced to his barest essence by Dormammu, Mordo took mystic possession of Blessing, whom Krowler, now possessed by Dormammu, made the focal point of the power he had stolen from Mordo as he prepared to sacrifice Clea. While the Howling Commandos attacked Krowler’s stronghold, Blessing’s growing love for Strange enabled her to escape all of her controllers, as well as enabling Strange to drive Dormammu from Krowler’s body and end the menace. Having played the roles that history had dictated for them, Strange, Clea, and Blessing returned to the present.Mordo somehow returned to the present as well and was among the evildoers manipulated by the omnipotent Beyonder. He then put his susceptibility to more powerful entities to his advantage, selling his soul to two demonic Hell-Lords, Mephisto and Satannish, knowing that the rival demons’ fight over his soul would require Strange to drive them from the Earth dimension, theoretically weakening him enough for Mordo to slay him at last; but after Strange indeed vanquished the demons, Mordo was downed with one punch, an ignominious end to his elaborate scheme.Since extra-dimensional exile had proven so unreliable, Strange imprisoned Mordo in his sanctum instead, but over the weeks Mordo slowly won the sympathy of Strange’s associate Sara Wolfe. When Dormammu, having been deposed by Strange’s disciple Clea, once more invaded Earth and seemingly had Strange at his mercy, Wolfe released Mordo, hoping he would help, but Mordo sided with Dormammu only long enough to win the patronage of his sister Umar. After Strange and Clea defeated Dormammu, Umar offered a truce which left her as ruler of the Dark Dimension, with Mordo as her consort, finally giving him the new world he so craved. However, Mordo’s good fortune was short-lived, for Clea soon led powerful allies to re-take the Dark Dimension, but with Umar deposed, Dormammu was free to reclaim his lost throne. Finally able, it seemed, to see when he was in over his head, Mordo retreated to Earth and played no role in Strange’s subsequent battles with Dormammu.His magic power reduced to almost nothing, Mordo was stunned to learn he had developed cancer. To his credit, his thoughts turned not to a final scheme but to atonement for all others.  He returned to the Ancient One’s sanctum, hoping to end his days in peace among the monks who now made it their home. But Strange, himself nearly a broken man from recent setbacks, also sought spiritual solace in Tibet.   It was now Strange who kept their feud alive, almost beating Mordo to death before being cast out by the monks.Unknown to either man, a third player had positioned herself to end the rivalry at last, and both were stunned by the intervention of Astrid Mordo, Mordo’s unrecognized and forgotten daughter by Lilia. Hoping to succeed where her father failed, Astrid transferred Mordo’s cancer to Strange, hoping to weaken him. Bringing both Strange and Mordo to the long-abandoned castle of Nikolai Mordo, Astrid granted her father the opportunity to kill Strange, but Mordo, sincere in his repentance, restored Strange by re-absorbing the cancer.  He then rendered his daughter comatose with a mystic dagger before transporting her to another dimension. Mordo died shortly afterward, having sacrificed his life for the man who had been his enemy for nearly half a century.", 
    "durability": 4, 
    "education": "Private tutors; extensive sorcery training under his grandfather, the Ancient One, others, and independent study", 
    "energy": 6, 
    "eyes": "Brown\n", 
    "fighting": 3, 
    "firstappearance": "Strange Tales #111 (1963)\n", 
    "groupaffiliation": [
        "Frequent ally of Dormammu", 
        "former consort of Umar", 
        "former student of the Ancient One", 
        "formerly served by the Minions of Mordo"
    ], 
    "hair": "Gray\n", 
    "height": 0, 
    "id": "Baron_Mordo", 
    "identity": "Secret", 
    "intelligence": 3, 
    "knownrelatives": "Nikolai Mordo (father, deceased), Sara Krowler Mordo (mother, deceased), Heinrich Krowler (grandfather, deceased), Lilia (half-sister), Lilia II (niece), Astrid Mordo (daughter)", 
    "occupation": [
        "Would-be conqueror", 
        "former mystic disciple"
    ], 
    "origin": [
        "Strange Tales #115 (1963)", 
        "Doctor Strange: Sorcerer Supreme #6-8 (1989)"
    ], 
    "placeofbirth": [
        "Varf Mandra", 
        "Transylvania"
    ], 
    "powers": "Baron Mordo is one of the most powerful sorcerers in existence, drawing his power from three primary sources: the invocation of powerful mystic entities (principalities) or objects, the manipulation of the universe’s ambient magical energy, and his own psychic resources. The many effects he can achieve include energy projection and manipulation, matter transformation, animation of inanimate objects, teleportation, illusion-casting, mesmerism, thought projection, astral projection, travel to other dimensions and time eras, and mental possession.", 
    "realname": "Karl Amadeus Mordo", 
    "significantissues": [
        "First fought Doctor Strange in modern era (Strange Tales #111, 1963)", 
        "sent followers to attack Doctor Strange (Strange Tales #125, 1964)", 
        "pursued Doctor Strange across the world, helped Dormammu capture him (Strange Tales #130-141, 1965-1966)", 
        "vs Doctor Strange & Spider-Man (Untold Tales of Spider-Man: Strange Encounter #1, 1998)", 
        "gained control of nascent sorcerers, defeated by Doctor Strange (Strange Tales #159-162, 1967)", 
        "impersonated Doctor Strange (Marvel Feature #1, 1971)", 
        "accompanied Sise-Neg on voyage through time (Marvel Premiere #13-14, 1974)", 
        "gained control of the Aged Genghis (Doctor Strange #12, 1976)", 
        "failed to open the Seven Gates of Chaos (Doctor Strange #41, 1980)", 
        "attacked Doctor Strange, caught in Dormammu´s 1943 scheme (Doctor Strange #49-51, 1981-1982)", 
        "sold soul to Mephisto and Satannish, rescued by Doctor Strange (Doctor Strange: Sorcerer Supreme #5-8, 1989)", 
        "became involved in fight for rule of Dark Dimension, became Umar´s consort (Doctor Strange: Sorcerer Supreme #21-24, 1990)", 
        "with Umar, deposed by Clea (Doctor Strange: Sorcerer Supreme #48, 1992)", 
        "sought to make amends with Doctor Strange, kept Astrid Mordo from killing him, succumbed to cancer (Doctor Strange: Sorcerer Supreme #85-87, 1995)", 
        "returned to life (Amazing Spider-Man #500, 2003)"
    ], 
    "speed": 7, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 250
}