{
    "aliases": "unrevealed", 
    "citizenship": "Germany", 
    "content": "As World War II began, Strucker was appointed wing commander of the Death's Head Squadron by Hitler, and, in 1941, he was sent to Madripoor to help the Hand ninja cult transform young Natasha Romanova into their master assassin, only to be defeated by Wolverine, Captain America, and Ivan Petrovitch. Later in 1941, Strucker invaded Latveria, seeking to use the Sturm-Fånger (\"Storm-Catcher\") to control cosmic energies; the device was wrecked by time-traveling members of X-Force.After the United States entered the war, the First Attack Squad of Able Company (the Howling Commandos (WWII)) became a constant thorn in the Nazis' side, and Hitler turned to Strucker, ordering him to publicly humiliate the Howlers' leader Nick Fury. Strucker challenged Fury to a duel on the island of Norsehaven, and Fury violated direct orders to meet Strucker and satisfy his pride. Before their duel with plywood swords, Strucker offered Fury a toast, and secretly drugged Fury's drink. As they fought, Strucker was surprised to find that despite his superior swordsmanship and the effects of the drug, Fury was a tenacious foe, but Fury finally succumbed to the drug's effects. Strucker had the event recorded and sent back to Germany as propaganda material to destroy Fury's reputation. Soon after, Fury encountered Strucker again while on another mission, and was determined to regain his honor. Strucker tried to drug Fury again, but Howler Dino Manelli warned Fury, who then bested Strucker in combat. Howler Dum-Dum Dugan photographed Strucker's defeat and circulated pictures, ruining the Nazis' earlier propaganda victory.Hitler demanded that Strucker capture the Howlers so they could be executed in Berlin. Strucker assembled the Blitzkrieg Squad, who could match each of the Howlers skill for skill, but the Howlers defeated them at every turn. Strucker also led the Blitzkreig Squad to England to assassinate Prime Minister Winston Churchill and Field Marshal Bernard Law Montgomery, but they were foiled by the Invaders. Strucker finally abandoned the Blitzkrieg Squad, who were later led by Colonel Klaue. While vacationing in Berlin, Strucker witnessed the Asgardian Thor's attack on the Chancellery, after which Strucker followed a bandaged man through a portal in space. Realizing he had traveled decades into the future, Strucker stole some history books about the end of World War II. He encountered the time machine's creator, Dr. Doom, who allowed him to return to the past, not believing that Strucker could win the war even with the knowledge he had obtained.Tiring of Strucker's failures, Hitler assigned him to topple the resistance in the French town of Cherbeaux, or else destroy the town. Strucker rounded up the resistance to send them to camps to avoid having to destroy the town, but the Howling Commandos derailed his train, freeing the captives. Hitler demanded that Strucker destroy the town, and Strucker set the explosives, but then came face-to-face with Fury, who had rigged an explosive powerful enough to kill Strucker. Caught in a stalemate, Strucker agreed to let the people of Cherbeaux evacuate so that he and Fury could battle again. When the evacuation was complete, Strucker and Fury fought while Cherbeaux was destroyed around them, and Fury lost Strucker in the upheaval. For allowing the evacuation of Cherbeaux, Hitler had Strucker marked for death by the Gestapo.Strucker escaped Germany because of the Red Skull, Hitler's right hand man, who foresaw Hitler's fall, and wanted an alternative power base. The Red Skull sent Strucker to Japan to form this organization, but Strucker intended to run it for himself. In Japan, Strucker joined forces with the Hand and an underground subversive movement which later became Hydra. Strucker was instrumental in Hydra's earliest raids on war plants to supply their troops, and finally confronted the Supreme Hydra, claiming that as the organization's true mastermind, he should be Hydra's leader. The Supreme Hydra refused and shot him, but Strucker had worn a bulletproof vest, and slew the Supreme Hydra, claiming his title. Strucker also slew the jonin (leader) of the Hand in single combat, severing ties with the Hand to prevent Hydra agents from being seduced by promises of the dark power of the demonic Beast of the Hand.Strucker moved Hydra's operations to a private island in the pacific, named Hydra Island. After he used an undetectable \"phantom\" submarine to assault allied and Japanese ships, Hydra Island was investigated by the allies' Captain Simon Savage and his Leatherneck Raiders, and the Japanese Samurai Squad. Captain Savage and the others managed to overcome Hydra's forces, and Strucker was forced to detonate the island. With Hydra's plans temporarily waylaid, Strucker was forced to return to Germany.To regain Hitler's favor, Strucker subjected Fury to a hallucinogenic drug in Africa, offering the formula to Hitler if it proved successful in the field. Fury was overcome by the hallucinations, but the Howlers rescued him, enabling his recovery. Ever more uncomfortable with the progress of the war, Strucker continued to operate Hydra from the shadows while pretending to be a loyal Nazi, secretly funneling Hitler's resources into his own operation. He also obtained the Dragon of Death, a powerful Japanese submarine, and made it Hydra's new mobile headquarters. Using his knowledge of the future, Strucker attempted to complete the atom bomb before the allies, sending Hydra agents to obtain the materials. Learning of this plot, the Invaders ultimately scuttled the Dragon, again delaying Strucker's plans, and during the clash Strucker lost the books he had brought from the future.In 1944, Strucker encountered the Gnobians, a benevolent race of empathic extraterrestrials who had crashed near Gruenstadt. Realizing what their technology could do for Hydra, Strucker befriended the naïve creatures and killed the population of Gruenstadt to cover his tracks. The Howlers arrived, too late to prevent the tragedy, but fatally wounded Strucker. The Gnobians healed Strucker with their powers, but they went insane from absorbing some of his hate-filled psyche in the process. Strucker fled their crashed ship, taking discs of their information to his scientists. As Germany fell in 1945, Strucker had the Nazis' two greatest superhumans Master Man and Warrior Woman placed into suspended animation in opposite sides of Berlin to await later revival. Strucker also gave the Red Skull the gas used to preserve them, and it also preserved the Skull when he was buried alive in his bunker during a battle with Captain America.Avoiding prosecution for war crimes, Baron Strucker had his scientists provide him with age-retarding serum so he could personally oversee Hydra's progress for decades to come. He and the Baroness Adelicia Von Krupp once captured the CIA's Agent Ten, who proved to be Strucker's old enemy Logan, but Logan was rescued by CIA agents Richard and Mary Parker. Needing more finances for Hydra, Strucker abducted Gabrielle Haller, who had a map leading to a fortune in lost Nazi gold hidden within her mind, but Haller was defended by her friends, the mutants Charles Xavier and Magnus, and Magnus took the gold for his own purposes.Strucker married more than once in the years that followed, resulting in a son, Werner, who resisted his father's influence, and two twins, Andrea and Andreas, mutants whose powers were altered by Hydra scientists. Strucker rebuilt Hydra Island, but concealed his role in the organization by using a front called \"THEM,\" in which he was Grand Imperator. In this role, he assigned Arnold Brown to be his Imperial Hydra, supposedly the true master of Hydra. Brown's rule of Hydra ended when he was overcome by S.H.I.E.L.D., an espionage organization led by Nick Fury and designed to thwart Hydra, and the unmasked Brown was mistakenly shot by his own men as Hydra crumbled about him. THEM also found and revived the long-lost Red Skull, but Strucker finally abandoned THEM when the scientific research arm of Hydra and another branch splintered away to become A.I.M. and the Secret Empire, respectively.Strucker continued to conceal his identity, acting as Don Antonio Caballero, Emir Ali Bey, and S.H.I.E.L.D agent John Bronson. He finally revealed himself as Hydra's true leader when he prepared to unleash the Death Spore bomb from Hydra Island.  Fury invaded the island and disguised himself as Strucker, then put a mask of his own face on Strucker's, tricking Strucker's own men into shooting him. Strucker fell into the Death Spore bomb, and was apparently destroyed.In the ensuing years, the roboticist Machinesmith built a robot duplicate of Strucker, using it to test the abilities and morality of Captain America. The robot fooled even S.H.I.E.L.D into thinking they had captured the real Strucker. Strucker also lived on in the form of several different android LMDs (Life Model Decoy) based on his mind; one was activated on Hydra Island after Strucker's death and believed itself to be the true Strucker, finally meeting its doom battling Captain America, Fury, and the one-time Howling Commandos. Another tricked Canada's Department H into selling Hydra the battlesuit worn by their hero Guardian.  The most destructive was the Deltite, an LMD Strucker had planted within S.H.I.E.L.D to tear the organization apart, and ultimately wound up running S.H.I.E.L.D and Hydra simultaneously, playing the two against each other. By the time the Deltite was finally revealed and destroyed, it had managed to sow distrust throughout S.H.I.E.L.D, and killed many agents, leading Fury to disband the organization.Hydra suffered without Strucker's leadership, and the Red Skull championed an effort to bring the Baron back, providing a distraction to occupy Fury's newly-rebuilt S.H.I.E.L.D while Hydra scientists found Strucker's body and sacrificed their lives to revive him with the Death Spore bonded to his form. Strucker was appalled at what his once-feared organization had become, and began eliminating Hydra's weak, taking notice of one Cassandra Romulus along the way and making her his lover and lieutenant. To prove themselves to the world, Strucker had an LMD explode S.H.I.E.L.D Central, killing 1,500 graduating agents.Determined to bring down Hydra, Fury was unaware of Strucker's resurrection. Strucker next allowed genetically-altered experiments Sathan, Guillotine and Lt. Romulus to escape, and sent the Hydra bounty hunters Ron Takimoto, Dakini and Carl Striklan to capture them. Fury, Daredevil, the Punisher, and Captain America became involved in the hunt, and ultimately Sathan, Takimoto, Dakini were killed, Striklan went rogue, and only Guillotine & Romulus returned to Hydra. Strucker had achieved his true goal: to analyze U.S. superhuman resources.Strucker won another impressive victory when he secretly began to purchase control over WFET, a television station owned by the Kingpin (Wilson Fisk). When S.H.I.E.L.D became aware of Hydra's involvement, they tipped off Daredevil, who then let word reach the streets. Fisk thought Hydra was his enemy and turned on them, only to have Hydra steal nearly all of his money, destroy his businesses, and help to end his reign as the Kingpin. When the Kingpin's assets were divided amongst criminal factions-including Werner, Andrea, and Andreas, Baron Strucker re-linked with the Hand, who sent their magical warrior Izanami to thin the competition. Strucker also posed as Snakeskin, bodyguard to Werner (who posed as the mastermind of the new Hydra) before slaying Werner for being an unworthy successor.Strucker faced rivalries within Hydra itself, including splinter groups like the Genesis Coalition, and hired the mercenary Next Wave to bring them down; they were assisted by Silver Sable's Wild Pack. Strucker masterminded an attack on the United Nations, but by then, Fury had found proof that Strucker was Hydra's leader.  He tracked him to his base in Iceland, where Strucker killed Fury's lover Kate Neville before his very eyes. Fury and Strucker fought each other on the side of a mountain, and the fight ended with Fury cutting off Strucker's right hand to make him fall towards apparent death.Surviving, Strucker gained a bionic replacement \"Satan Claw\" for his lost hand. He then employed the techno-junkies of System Crash to strengthen Hydra through controlling the information highway, though Daredevil defeated his agents. When the Earth was enthralled by the powers of the Goddess, the \"good\" counterpart of Adam Warlock, Strucker was unaffected, and took the opportunity to attempt revenge upon Striklan-now the Wild Pack mercenary Crippler. Wild Pack and S.H.I.E.L.D saved Crippler. Strucker met with a group of American neo-Nazis to assassinate Slovenian president Wassily Kurov to usurp rule of his nation. Kurov was saved by the Skrull Kill Krew and Captain America, but was also exposed as a Skrull imposter. Strucker also briefly joined with Baron Helmut Zemo in a world-conquering plot foiled by the Avengers and Thunderbolts, though Stucker and Zemo parted as foes.Strucker eventually launched an ambitious plan where he infested key people such as Henry Gyrich of the Commission on Superhuman Activities with nannites, allowing him to control them. Under Strucker's influence, Gyrich nearly killed every superhuman on Earth with the nannites. Strucker's involvement was finally discovered by the V-Battalion, who thwarted his attempt to control everyone on Earth with nannites.", 
    "durability": 4, 
    "education": "University graduate", 
    "energy": 3, 
    "eyes": "Blue\n", 
    "fighting": 5, 
    "firstappearance": "Sgt. Fury and his Howling Commandos #5 (1964)\n", 
    "groupaffiliation": [
        "Hydra", 
        "formerly THEM", 
        "Nazi Party", 
        "Death's Head Squadron", 
        "Blitzkrieg Squad"
    ], 
    "hair": "Bald\n", 
    "height": 74, 
    "id": "Baron_Strucker", 
    "identity": "No dual identity", 
    "intelligence": 4, 
    "knownrelatives": "Andrea von Strucker (daughter, deceased), Andreas von Strucker (Swordsman, son), Werner von Strucker (son, deceased), Elsbeth von Strucker (third wife, deceased)", 
    "occupation": [
        "Terrorist", 
        "Hydra leader"
    ], 
    "placeofbirth": [
        "Strucker Castle", 
        "Bavaria", 
        "Germany"
    ], 
    "powers": "Strucker's body hosts the Death Spore Virus, and he can transmit it by touch, killing victims almost instantly. The virus has enhanced Strucker's own physical abilities, allowing him to heal from most wounds. If Strucker is killed again, the virus will be released from his body, becoming airborne and threatening  life on Earth. Strucker is a master swordsman and marksman. His chief weapon is his mechanical right hand, the Satan Claw, which channels energy, increases his strength, and contains gattling guns, claws, knives, and teleportation technology.", 
    "realname": "Wolfgang von Strucker; Baron Strucker", 
    "speed": 2, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 225
}