{
    "aliases": [
        "Dr. Charles Cromwell", 
        "John Falsworth Jr."
    ], 
    "citizenship": "British", 
    "content": "After World War I began John started to work for German Intelligence, and was given the codename Baron Blood, eventually becoming the German's greatest secret weapon near the end of the war, battling such foes as the Freedom's Five and other heroes. During the final weeks of the war Blood was in London, causing chaos by murdering military leaders and other important Britons. When he was confronted by the original Union Jack, Blood fled England.After World War I ended Blood studied the occult. Blood then joined Adolf Hitler and the Nazi Party in their conquest of Europe. Working for German Intelligence yet again he allowed German scientists to experiment with his body, finally allowing him to walk and work in sunlight for short periods of time. Seeking revenge Blood returned to Falsworth Manor under the guise of John Falsworth Junior, where he almost killed Montgomery's daughter Jacqueline with his bite. This action caused Blood to have another confrontation with the original Union Jack and the Invaders. During the battle the Invaders and Union Jack discovered that John Falsworth Jr. was actually Baron Blood. As the battle raged on Blood was caught unaware and fell onto a stalagmite.Baron Blood was resurrected months later and joined the Super-Axis. During this time Blood was again apparently killed by a wooden stake and was interned in the Tower of London. Years later Dracula arrived in England and forced Dr.Charles Cromwell to resurrect Baron Blood. To make sure no one suspected anything Cromwell placed a skeleton where the once-dead Baron Blood had lain. After Baron Blood's resurrection Dr.Charles Cromwell fell under his hypnotic control and moved near Falsworth Manor, where he helped Baron Blood feed on unsuspecting villagers. After being identified by a crowd of villagers Blood killed Cromwell and his daughter. Taking Cromwell's identity he set up shop in an undisclosed location, feeding on small portions of his patients' blood. After a while to sate his hunger he began a series of gruesome \"slasher\" murders, hiding his feeding behind the guise of a serial killer.His brother Montgomery learned of the attacks and correctly deducing the culprit, contacted Captain America to help him stop his brother. At this time however Baron Blood, under the guise of Dr.Cromwell, was acting as Montgomery's physician, waiting for his brother to become so old that when he bit him he would stay old and frail for eternity.Returning to London Captain America discovered that the skeleton in the Tower of London was not Baron Blood's. Captain America and Baron Blood soon clashed after. Lord Montgomery's grandson Kenneth eventually discovered that Baron Blood was posing as Dr.Cromwell and alerted Captain America to this news. Captain America confronted Baron Blood one more time, where he killed Blood by decapitating him with his shield. To make sure that the Baron was dead Captain America and Montgomery burned Blood's head and body separately and the ashes were scattered in different areas. Sometime later due to the Montesi Formula, a spell cast by Doctor Strange in order to rid the world of all vampires, even his ashes disappeared.", 
    "durability": 1, 
    "education": "Unknown", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "Invaders #7\n", 
    "groupaffiliation": [
        "Formerly Mys-Tech", 
        "Super-Axis", 
        "Nazi Party"
    ], 
    "hair": "Black\n", 
    "height": 70, 
    "id": "Baron_Blood_(Falsworth)", 
    "identity": "Known to European and US Government", 
    "intelligence": 1, 
    "knownrelatives": "Spitfire (Jacqueline Falsworth Crichton, niece), Baron Blood (Crichton) (Kenneth Crichton, Grandnephew), Union Jack (Brian Falsworth) (cousin, deceased), Union Jack (Montgomery Falsworth) (brother, deceased), William Falsworth (father, deceased)", 
    "occupation": "Former Assassin", 
    "origin": "Invaders #7", 
    "placeofbirth": [
        "Falsworth Manor", 
        "England"
    ], 
    "powers": "Baron Blood possesses all the powers of a standard vampire, but with greater strength and potency than most vampires. Baron Blood could hypnotize victims, lift at least 1,500 lbs, command certain types of animals such as vermin, and control the weather to an unknown degree. Baron Blood could walk in sunlight for about half an hour without feeling pain or burning up and unlike other vampires could fly without transforming into a bat. He also had the power to change his shape, although the extent of this power has never been determined. When he was resurrected after the Montesi Formula lost its effect he was outfitted with cybernetic parts, these parts increased his already inhuman strength and also increased his speed.", 
    "realname": "Lord John Falsworth", 
    "significantissues": "Invaders #7, Captain America #254", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 180
}