{
    "add": {
        "doc": {
            "aliases": "Lucifer", 
            "citizenship": "Italy", 
            "content": "Belasco has suggested that it was he who kidnapped Beatrice, the lover of the poet Danté, in order to perpetuate his demon race. Danté's pursuit for his love took him through an ancient Atlantean outpost that became the inspiration of his poem Inferno. In the final showdown with Belasco, Danté caused the villain to break an overhead pipe, releasing a freezing liquid on himself that placed him into suspended animation for centuries. It wasn't until more recent years that a nearby volcano released him from his icy animation (although this story fails to account for the loss of his right arm, a fact which still remains a mystery.)Returning to his original mission, Belasco tried to again summon the Elder Gods to Earth, while at the same time he kidnapped Shanna The She-Devil as the next mother of his new race of demons. Ka-Zar thwarted his schemes, of course, and Belasco found himself banished into a Limbo dimension by the Elder Gods as punishment.Belasco eventually became absolute master of the Limbo dimension. However, his rule was threatened when the young Illyana Rasputin, Magik, found that her teleportation power enabled her to enter Limbo. Belasco sensed the opportunity to gain a powerful ally, and he taught Magik true magic abilities, even unleashing her \"Darkchilde\" form. Ultimately, Magik rebelled, deposing Belasco and claiming the leadership of Limbo for herself.When Illyana Rasputin died, Belasco began an elaborate plot to reclaim his title as Master of Limbo, and stole Illyana's Soulsword by way of the heroes Amanda Sefton and Nightcrawler and their mother, Margali Szardos. Sefton ultimately defeated Belasco and claimed the Soulsword, and thus the rule of Limbo, for herself.Almost immediately, Belasco reappeared, having his right arm restored by the Elder Gods, and formed an alliance with the demons known as the N'Garai. The N'Garai and Belasco wanted to used Limbo as a launching pad for a demonic attack in order to regain their lost kingdoms. To accomplish this, Belasco stole the Shadowcat's soul and the N'Garai switched their souls for those of five other X-Men. Shadowcat and Sefton, know calling herself Magik, defeated Belasco and the N'Garai, restoring the X-Men's souls.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Black\n", 
            "fighting": 1, 
            "firstappearance": "Ka-Zar The Savage #11 (1982)\n", 
            "groupaffiliation": "Leader of demonic henchmen", 
            "hair": "Brown\n", 
            "height": 76, 
            "id": "Belasco", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Witchfire (daughter); several other demonic offspring", 
            "occupation": [
                "Ruler of Limbo", 
                "sorcerer", 
                "servitor of the Elder Gods"
            ], 
            "origin": "Ka-Zar The Savage #12 (1982)", 
            "placeofbirth": [
                "Florence", 
                "Italy"
            ], 
            "powers": "Magical spells of immense power, including detection and mind control, transformation of his body or that of others, usually transforming others into demonic versions of themselves. Belasco has also ensnared victims in crystal, extracting their skeletons while the victims remained alive. Belasco can control fire, summon blasts of magical energy, raise the dead, and summon the powerful Elder Gods (a process which requires five bloodstones in a ritual.) His powers had become linked with that of Limbo, as evidenced when Illyana assumed more magical power and took on a demonic form, reverting Belasco to a human appearance, and vice versa when Illyana cast off her demonic form. He similarly remained vulnerable to Illyana's Soulsword, the manifestation of her mystic potential.", 
            "realname": "Belasco (full name unrevealed)", 
            "significantissues": [
                "Released by volcanic activity, captured Shanna the She-Devil, defeated by Ka-Zar and banished to Limbo (Ka-Zar The Savage #11-12, 1982)", 
                "corrupted Illyana Rasputin (Magik: Storm and Illyana #1-4, 1983-4)", 
                "attempted to re-assume control of Limbo, thwarted by Amanda Sefton and Nightcrawler (X-Men Unlimited #19, 1998)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 250
        }
    }
}