{
    "aliases": [
        "Beta Ray Thor", 
        "Simon Walters"
    ], 
    "citizenship": [
        "None", 
        "former citizen of New Korbin"
    ], 
    "content": "As the fleet approached the Milky Way galaxy, it was detected by a S.H.I.E.L.D. satellite. Nick Fury asked Thor to investigate. Thor was deemed a threat by Skuttlebutt, so Beta fought him. During the battle Thor was separated from his hammer, Mjolnir, and reverted to Donald Blake. Curious, Bill picked up Mjolnir and the hammer deemed him worthy, granting him the power of Thor. Skuttlebutt landed but both were transported to Asgard by Odin. Bill said the hammer should remain his as he had won it fairly.Odin subsequently decreed the two battle in Skartheim to the death to see who would reclaim the hammer. Bill's Korbinite physiology gave him somewhat of an advantage in the lava-filled realm, and he was able to win. However, he refused to take Thor's life. It is believed that Odin chose this location to further test Bill's worthiness and to teach Thor a lesson. Mjolnir was returned to Thor, with Odin ordering the creation of the hammer Stormbreaker for Bill to use. Bill continued to protect his people and assist the Asgardians. He grew particularly close to Sif, who accompanied him to battle Surtur's demons.At one point, a mysterious disease seemed to kill the Korbinites, but they were able to be revived. Bill spent time in space as part of the Star Masters, and was called to join his fellow hammer wielders Thor, Thunderstrike, and Dargo Ktor to battle as the Thor Corps. His body briefly was reconfigured to use cosmic rather than mystical powers through a special synthesis by Odin and the Silver Surfer.Years later, long after Bill had found a new home for his people, Ragnarok loomed over Asgard and Bill, drawn by the Asgardian magic in his hammer, returned to fight along side the surviving Asgardians in the final battle, reducing Fenris to a skeleton on his arrival as punishment for threatening a weakened Thor. He fought ferociously, willing to die alongside the Asgardians in the climactic final battle against Surtur's forces. But Thor sent him back to his people, asking him to keep the memory of Asgard alive and to honor his memory. Very reluctantly, Bill went.The Korbinites had settled on a new planet, but were in danger due to an approaching foe. Bill was chastised for spending too much time with the Asgardians. His old rival Alpha Ray even attempted to sabotage his efforts to prove he was no longer worthy of being the race's guardian. The foe was actually Galactus, Stormbreaker revealing his familiar humanoid form, with a new herald named Stardust. The planet was lost and some of the fleet was destroyed. Stardust continued to attack Bill as Galactus fed on the planet's energies. During their battle the evil Asteroth was mistakenly freed from its prison by a portal Stardust opened. Asteroth was defeated, and Bill eventually found himself on Earth. He has since bonded with a man named Simon Walters.After the Civil War, Bill, in the form of Simon Walters, was compelled by magic forces to travel to Canada. There he found the Wrecking Crew running riot in a museum. Seeking to protect the innocent bystanders Simon changed into Beta Ray Bill and fought the magically powered thugs. And due to a recent increase in their powers by a magical entity the battle came to a draw between them. However the new Omega Flight soon came by in order to rescue their teammate Sasquatch who at the time was possessed by the demonic Tanaraq. During the battle hordes of demons rioted throughout the city causing mass chaos. Once the Wrecking Crew and Sasquatch were secured Beta Ray Bill led the demons back into the portal while fellow Omega Flight member Guardian destroyed the portal behind them, closing it. Beta Ray Bill was then trapped in that other dimension fighting demon hordes.", 
    "durability": 7, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "(As Bill) No visible pupils or irises; (as Walters) Brown\n", 
    "fighting": 7, 
    "firstappearance": "Thor #337 (1983)\n", 
    "groupaffiliation": [
        "None", 
        "Formerly Star Masters", 
        "Thor Corps", 
        "honorary member of Omega Flight", 
        "honorary warrior of Asgard"
    ], 
    "hair": "(As Bill) None; (as Walters) Black\n", 
    "height": 0, 
    "id": "Beta_Ray_Bill", 
    "identity": "Secret", 
    "intelligence": 5, 
    "knownrelatives": "None", 
    "occupation": [
        "Warrior", 
        "(former) guardian of the space fleet of his alien race"
    ], 
    "origin": "Thor #337 (1983)", 
    "placeofbirth": [
        "Planet Korbin", 
        "\"Burning Galaxy\""
    ], 
    "powers": "Beta has obtained powers and physical attributes similar to Thor, augmenting his already powerful cyborg body. He is very strong, nearly invulnerable, immune to disease, and is virtually immortal. He can also use Stormbreaker to fly, manipulate weather, absorb and channel various energies, and as a detector. He can also turn into his pre-cyborg Korbinite form, or currently to Simon Walters by stamping the hammer, which then turns into a cane.", 
    "realname": "Bill; legally changed to Beta Ray Bill", 
    "significantissues": [
        "Official Handbook Bibliography", 
        "helped Omega Flight against Tanaraq and its demon minions, got trapped in Tanaraq's dimension (Omega Flight #2-5, 2006-2007)", 
        "revealed to be captured by the Skrulls, fought them with other Asgardians during the Skrull invasion of Earth (Secret Invasion: Thor #1-3, 2008)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 480
}