{
    "add": {
        "doc": {
            "aliases": [
                "Natasha Romanoff", 
                "Nadine Roman", 
                "\"Nat", 
                "\" Tsarina", 
                "Oktober", 
                "Laura Matthers", 
                "Nancy Rushman", 
                "Black Pearl", 
                "Natalia Shostakova", 
                "Natuska", 
                "Czarina", 
                "others", 
                "impersonated Yelena Belova"
            ], 
            "citizenship": [
                "Former citizen of Russia/U.S.S.R.", 
                "resident in United States of America under extended visa authorized by S.H.I.E.L.D."
            ], 
            "content": "Logan, his memories of their past relationship suppressed by Weapon X, traveled to the USA following his recruitment by Canada’s Department H, Natasha protected him from Hydra assassins, as did his former intelligence comrades Nick Fury and Carol Danvers. Natasha and Logan ended up on opposite sides when he joined Danvers and pilot Ben Grimm to steal a Russian asset she oversaw, the top-secret Red Storm Project. She also trained fellow Russian operatives, including Boris Bullski, who became her partner in various assignments.After Russian scientist Anton Vanko left Russia to work with Iron Man (Tony Stark), Natasha’s superiors sent her and another operative, Boris Turgenov, to assassinate both men. When Turgenov stole Vanko’s Crimson Dynamo armor, both Turgenov and Vanko died in battle but Natasha escaped. Later, feigning repentance, she romanced Stark long enough to steal his experimental anti-gravity ray. With it, she performed several acts of sabotage against the USA until Iron Man deactivated the device. Her cover blown, she romanced and manipulated the outlaw archer Hawkeye (Clint Barton) into working with her, helping him enhance his archery arsenal with high-tech arrows. The pair attacked Iron Man, who deflected one of Hawkeye’s explosive arrows, its impact felling Natasha and ending the battle when Hawkeye rushed her to safety. While recovering, she persuaded Hawkeye to attack her superiors’ next target, Williams Innovations, but Spider-Man’s intervention drove Hawkeye away. The idealistic Hawkeye’s growing influence upon Natasha led her to rebel against her communist superiors, who extorted her into returning to action with a new costume and weapons, but she and Hawkeye again failed against Iron Man.After fighting alongside Daredevil against the terrorists of Black Spectre and Hydra, Natasha encountered another terrorist group, the Sword of Judgement and discovered their leader Agamemnon to be her long lost friend Andre Rostov, who was arrested after a clash with her and the Thing. Growing alienated from Daredevil since she felt he did not regard her as an equal, Natasha ultimately ended their relationship but remained in California. She found herself first among equals after chance brought her together with X-Men alumni Angel (Warren Worthington III) and Iceman (Robert Drake), as well as demonic vigilante Ghost Rider (Johnny Blaze), to help her fellow Avenger Hercules and Venus against their enemy Pluto. After Venus’ departure, the remaining heroes formed a new super-team, the Los Angeles-based Champions. Although the wealthy Angel was the team’s financier and biggest public backer, Natasha was unanimously recognized as the most qualified tactician and she agreed to become team leader, also embarking on a rebound romance with Hercules.Following the Champions’ defeats of insane scientists Dr. Edward Lansing and Rampage (Stuart Clarke), she and Ivan, as well as the now-defected Alexi Bruskin, were attacked by several Russian super-agents, including Ivan’s son Yuri, using the Crimson Dynamo armor, and Boris Bullski, now Titanium Man; the Champions thwarted the Russians’ scheme of vengeance, and young Russian mutant Darkstar (Laynia Petrovna) defected to the heroes’ team. After battling many villains, the Champions ultimately disbanded due to conflicting priorities and personalities.Natasha and Hercules remained together for a time, and she returned to occasional S.H.I.E.L.D. assignments. She assisted the Avengers on a few adventures, including their clash with the cosmic-powered Korvac; during that case Natasha realized how fleeting mortal relationships must seem to an immortal like Hercules, leading the couple to drift apart. She and the Avengers intervened when Daredevil was mind-controlled by Death-Stalker (Philip Sterling), and following Daredevil’s recovery, she fought alongside him against the Unholy Trio. After an Avengers roster shake-up orchestrated by Henry Peter Gyrich excluded her, Natasha was captured by Viper but escaped and retreated into a pre-programmed S.H.I.E.L.D. persona, schoolteacher Nancy Rushman; when her true psyche was restored, she joined Spider-Man and others in rescuing the entire S.H.I.E.L.D. Helicarrier from Viper. Abducted by Bullseye because of her status as Daredevil’s longtime ally, Natasha soon escaped and helped Daredevil defeat the insane assassin. Weeks later, Natasha rescued Ivan from Damon Dran, whose grudge was no less undying than he was, and Natasha fought several costumed mercenaries, including former Russian agent Iron Maiden, in the process.A chance investigation once more brought Natasha into contact with the Hand, who struck her down with a fatal poison. Daredevil’s ally Stone, of the Chaste, an order of warriors opposed to the Hand, mystically resurrected her. She joined the two men in battling the Hand, seemingly thwarting the ninja clan’s efforts to similarly resurrect Daredevil’s long-lost love, the assassin Elektra Natchios, who was nonetheless revived.By now Daredevil had rekindled his relationship with an earlier lover, Karen Page, whose life Natasha saved during the Inferno crisis. Natasha was drawn back to Avengers duty during such major crises as the Acts of Vengeance and a series of attacks from Atlantis (orchestrated to restore the Elder God Set), and she gained a new, far different ally when she joined the Punisher against the Sunrise Society, a cabal with origins linked to World War II. After Russian dissidents manipulated her into crime using an LMD (android) version of Alexi Shostakov, Natasha revisited another piece of her past by reuniting with longtime friend Logan, now the X-Man Wolverine, to once more battle the Hand in Madripoor. Soon afterward, she rejoined the Avengers full-time when the team reorganized under a new United Nations charter, becoming Captain America’s deputy leader; between missions, she and fellow ex-Champion Darkstar battled Starlight, another former Russian operative who had once succeeded Shostakov as the Red Guardian. When Natasha’s long-dormant Oktober persona was activated, Iron Man helped her break her brainwashing.Despite her Avengers duties against the likes of Thanos, the Mole Man and others, Natasha still found time for occasional government work, as when she and Daredevil battled the telepathic Rose, who had slaughtered a number of S.H.I.E.L.D.’s ESPer agents. Soon afterward, she once more returned to Russia to investigate increasing activities of the nation’s mobsters, some of them perhaps once among her communist overseers, only to be caught in a battle between the decades-old vigilante Night Raven and his nemesis Yi Yang. Circumstances forced her to side with S.H.I.E.L.D. against Wolverine when the latter freed from S.H.I.E.L.D. custody the feral young woman Lynx, who was briefly programmed with a false S.H.I.E.L.D. identity once used by Natasha herself. Nevertheless, Natasha’s heart was not in the endeavor, and when Wolverine found a safe haven for Lynx, she and Nick Fury toasted their mutual friend’s success.When most of the active Avengers roster seemingly perished fighting Onslaught, Natasha tried to rebuild the team by seeking out new recruits (such as ex-Champions Angel and Iceman) and past members, but she ultimately gave up after repeated rejections and shut down the team, closing Avengers Mansion. She kept busy against old enemies and new, including terrorist units called Underground Militia and Freedomslight. She became increasingly obsessed with hunting down former Avengers foes, but while fighting yet another Russian ex-operative, General Tskarov, an encounter with Daredevil, who had revealed himself to be alive shortly before the Avengers’ disappearances, helped her deal with the survivors’ guilt that drove her. Shortly afterward, she approached two members of the new Thunderbolts super-hero team, MACH-1 and Songbird, whom she recognized as Masters of Evil alumni Beetle and Screaming Mimi; rather than attack them as Avengers enemies, she encouraged them to follow the heroic example her supposedly dead teammates had set. She was lured into a trap by the armored Vindiktor, who claimed to be her long-lost brother in possession of their mother’s diary, but he apparently perished before his claims could be verified.When Natasha’s teammates resurfaced alive, the Avengers were reestablished, but Natasha did not return to full-time duty. She joined Nick Fury in a counter-terrorist operation in Latveria which, ironically, forced her to manipulate Wolverine, Captain America, Daredevil and others on Fury’s behalf. As if in atonement, she renewed her ties with Iron Man, helping him against Tuatara and the Espionage Elite; a second reunion proved less encouraging when Daredevil, drugged into insanity by Mysterio (Quentin Beck), fought her during a crisis revolving around a mysterious child he had entrusted to Natasha’s care. Her spirits rose when she and her fellow Champions alumni banded together once more to help X-Force against the death god Pluto. On a government assignment in Rhapastan, however, she confronted a far different legacy of her past: Yelena Belova, the latest graduate of Russia’s Red Room and a young woman desperate to prove herself Natasha’s better as the new Black Widow. Loath to see another manipulated as she had been for so long, Natasha arranged for her successor and herself to temporarily swap identities so that Yelena, as Natasha, could hear how her superiors considered her an expendable pawn. After bringing the Avengers and the Thunderbolts together to overcome Count Nefaria, Natasha supported Daredevil’s short-lived efforts to form a new super-team to capture the Punisher, originally believed to be Nick Fury’s murderer. Despite recruitment endeavors, however, this vigilante group folded shortly after she and her teammate Dagger fought an army of renegade S.H.I.E.L.D. androids; ironically, she soon afterward worked with both Daredevil and Punisher against the European crime syndicate managed by the Brothers Grace. Months later, her pursuit of war criminal Anatoly Krylenko led to a clash with Hawkeye, whose pessimism regarding heroic activities now rivaled her own. While on S.H.I.E.L.D. assignment, she discovered the source of international charges against her to be yet another former lover, her husband Alexi, who had developed an obsession against her and political power with which to pursue it.Shortly after the Scarlet Witch’s insanity seemingly killed Hawkeye and again disbanded the Avengers, Natasha, weary of espionage and adventure, retired to Arizona but was targeted, as were other survivors of the Black Widow Program, by the North Institute on behalf of the corporation Gynacon. Natasha’s investigations led her back to Russia, where she was appalled to learn the previously unimagined extent of her past manipulation, and she discovered the Widows were being hunted because Gynacon, having purchased Russian biotechnology from Red Room’s successor agency 2R, wanted all prior users of the technology dead. After killing Gynacon CEO Ian McMasters, she clashed with operatives of multiple governments to help Sally Anne Carter, a girl Natasha had befriended in her investigations, whom she rescued with help from Daredevil and Yelena Belova. She soon returned the favor for Daredevil by reluctantly working with Elektra Natchios to protect his new wife, Milla Donovan, from the FBI and others, although Yelena proved beyond help when she agreed to be transformed into the new Super-Adaptoid by A.I.M. and Hydra.More battle-hardened than ever, Natasha sided with Iron Man during the so-called “civil war” prompted by the USA’s Superhuman Registration Act, although Captain America and many other longtime friends were on the issue’s opposite side. Following Cap’s apparent assassination, she was unexpectedly confronted by the Winter Soldier, who blamed Cap’s death on Iron Man. Natasha joined Iron Man’s latest Avengers team, but she remained dubious about the reliability of some of her new teammates.", 
            "durability": 3, 
            "education": "Unrevealed; intensive espionage training through Red Room Academy, others", 
            "energy": 3, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "Tales of Suspense #52 (1964)\n", 
            "groupaffiliation": [
                "formerly Thunderbolts", 
                "Avengers", 
                "S.H.I.E.L.D.", 
                "Daredevil's Unnamed Super-Hero Team", 
                "Queen's Vengeance", 
                "Champions of Los Angeles", 
                "Lady Liberators", 
                "FSB", 
                "and K.G.B."
            ], 
            "hair": "Red-auburn (formerly dyed black)\n", 
            "height": 67, 
            "id": "Black_Widow_(Natasha_Romanova)", 
            "identity": "Publicly known", 
            "intelligence": 3, 
            "knownrelatives": "Unnamed parents (presumed deceased); Alexi Shostakov (Red Guardian, estranged husband); Vindiktor (alleged brother, deceased)", 
            "occupation": [
                "Licensed super hero", 
                "intelligence operative", 
                "former school teacher", 
                "fashion designer", 
                "ballerina"
            ], 
            "origin": [
                "Avengers #44 (1967)", 
                "Daredevil #88 (1972)"
            ], 
            "placeofbirth": [
                "Stalingrad", 
                "former U.S.S.R."
            ], 
            "powers": "Government treatments have slowed her aging, augmented her immune system and enhanced her physical durability.", 
            "realname": "Natalia \"Natasha\" Alianovna Romanova", 
            "significantissues": [
                "Prevented HYDRA from obtaining Logan (Wolverine #1, 1997)", 
                "encountered Ben Grimm and Logan (Before the Fantastic Four: Ben Grimm & Logan #1-3, 2000)", 
                "sent by K.G.B. to kill Anton Vanko, met Tony Stark (Tales of Suspense #52, 1964)", 
                "stole Stark's anti-gravity device (Tales of Suspense #53, 1964)", 
                "met Hawkeye, duped him into battling Iron Man (Tales of Suspense #57, 1964)", 
                "received costume and weapons (Tales of Suspense #60, 1964)", 
                "brainwashed by K.G.B., reunited with Hawkeye (Avengers #29-30, 1966)", 
                "discovered husband had become Red Guardian, witnessed his death (Avengers #43-44, 1967)", 
                "abandoned Black Widow identity (Avengers #45, 1967)", 
                "adopted all-black costume (Amazing Spider-Man #86, 1970)", 
                "first met Daredevil (Daredevil #81, 1971)", 
                "moved to San Francisco with Matt (Daredevil #86, 1972)", 
                "past recounted by Ivan (Daredevil #88, 1972)", 
                "joined the Avengers (Avengers #111, 1973)", 
                "broke up with Daredevil (Daredevil #124, 1975)", 
                "founded the Champions (Champions #1, 1975)", 
                "killed by the Hand, resurrected by Stone (Daredevil #187-190, 1982-1983)", 
                "saved from Strucker and the Hand by Captain America and Logan (Uncanny X-Men #268, 1990)", 
                "fought Vindiktor (Shadows & Light #1, 1998)", 
                "met new Black Widow (Black Widow #1-3, 1999)", 
                "traded identities with Yelena Belova (Black Widow #1-3, 2001)"
            ], 
            "speed": 2, 
            "strength": 3, 
            "universe": "Marvel Universe", 
            "weight": 131
        }
    }
}