{
    "add": {
        "doc": {
            "aliases": [
                "The Pendragon", 
                "Gann Josin", 
                "Eobar Garrington"
            ], 
            "citizenship": "U.S.A.", 
            "content": "At first, Dane hoped to use merely his scientific expertise to be a force for good. However, his scientific experiments using magnetism to search for extraterrestrial life inadvertently brought Magneto and Toad back to Earth during a time when the mutant villains were believed lost in space. Magneto immediately began to re-form his Brotherhood, starting by kidnapping Quicksilver and the Scarlet Witch. Whitman donned the costume and weapons of the Black Knight to track Magneto down but was confronted by the Avengers, who assumed him to be his uncle. The Black Knight helped the Avengers get on the right track but parted company with them, annoyed by their distrust.Nathan Garrett was posthumously contacted to join the Masters of Evil organized by the Crimson Cowl (actually, the robot Ultron, who was unaware of the villainous Knight's demise.) Whitman agreed to join the team with the hopes of infiltrating their ranks, and he tried to contact the Avengers before the attack. However, Ultron guessed at Whitman’s treachery, and the Masters intercepted him, beating him and leaving him abandoned. The Black Knight happened upon the discarded Jarvis, who was also abandoned by the Masters after being set-up to appear as if he were the Crimson Cowl. The Black Knight tracked down the Masters of Evil, helping the Avengers escape and overcome their foes. The heroes then parted on better terms, although Whitman still wanted to keep his distance.Returning to America, the Black Knight met Doctor Strange through their mutual contact of Victoria Bentley. The two began working together, once against Tiboro and once, with the Avengers, against Surtur and Ymir.He encountered the Avengers again when they used as pawns by Kang in playing a game with the Grandmaster and his Squadron Sinister. His Ebony Blade was the prize in a contest between Goliath (Clint Barton) and the Whizzer, but by trying to help Goliath, the Black Knight interfered with the game and the Avengers, with his Ebony Blade, were returned to Kang’s future. Thanks to the mystic properties of the sword, the Black Knight was able to transport himself to it, despite the distance of space and time. He helped the heroes escape and confront Kang, who demanded power from the Grandmaster to defeat the Avengers. Ultimately, it was the Black Knight, since he was not an Avenger, who managed to strike Kang down and allow them to return to the present. In gratitude, the Avengers extended an offer of membership, and Whitman accepted, although he opted for reserve status since he resided in England at the time in Garrett Castle.Over time, Whitman began feeling the curse of the Ebony Blade making him grow more violent, more bloodthirsty. When he nearly killed two jewel thieves after a pursuit, he sought to end the curse by destroying the blade. The search brought him to the magical dimension of Polemachus, but he was captured by Arkon and his erstwhile ally, the Enchantress. The Enchantress placed the Black Knight under a spell, keeping him in thrall even when the Avengers, warned of the Knight’s fate by the Scarlet Witch’s dream, came to rescue him. The Enchantress urged Arkon to battle the Avengers in hopes they would be destroyed, but the Black Knight lost his sword during the fight, and it fell into a magical well and was seemingly destroyed. Convinced of the truth, Arkon abandoned the Enchantress and the fight, allowing the Avengers and the Knight to return home.In fact, the blade was not destroyed but was lost in time, appearing in Olympus. Ares discovered it and, allying with the Enchantress who was following the blade, launched an assault upon Olympus. The Black Knight learned of this through the Brazier of Truth, and assembled the Avengers to storm the halls of Olympus. Ultimately, the Avengers were successful in stopping Ares’ rampage, recovering the Ebony Blade, and remanding the Enchantress to Zeus. She soon escaped, however, and sought out the Black Knight to use as her pawn, once more placing him under her spell with a kiss. They traveled to the dimension ruled by Casiolena, and the Enchantress sought revenge against her and the Executioner, who deserted her for Casiolena. The Defenders took refuge at Garrett Castle after rescuing Barbara Norriss from the Nameless One, and inadvertently stumbled into Casiolena’s dimension. The Enchantress transformed Barbara Norriss into the Valkyrie in order to aid her cause, and the Defenders were forced into battle as well. When Casiolena was defeated, the Enchantress and Executioner fled, but not before the witch cast the Black Knight aside, transforming him into stone. During this time, Valkyrie used his winged horse, Aragorn.Doctor Strange took the Black Knight’s body with him to his Sanctum Sanctorum, hoping to someday reverse the curse. Eventually, Strange managed to contact the Black Knight’s spirit, lost in a nameless dimension, but the message was warped by Dormammu to force the Defenders and the Avengers to compete for the Evil Eye, a powerful mystic object that Strange was led to believe would be the Knight’s only salvation. In fact, Dormammu succeeded in using the Eye to nearly destroy the universe before being defeated, and the Eye couldn’t help the Black Knight, as his spirit had traveled to the Twelfth Century during the time of the Crusades.Through a spell cast at the time of Camelot’s demise by Merlin, Whitman’s spirit inhabited the body of his ancestor, Eobar Garrington, also known as the Black Knight. Whitman was thus able to try to track down Modred the Evil, the man who murdered Garrington. Modred had died centuries before but lived on as his spirit survived in the Twelfth Century, throwing events into chaos. Merlin’s spell also brought the Defenders, who helped the Knight confront Modred, his allies, and his armies. Ultimately, Whitman decided to stay in the past, fighting in the Crusades on behalf of King Richard, and the Defenders returned home.The Black Knight tried to settle back into modern-day life, although much had changed in his absence. Victoria Bentley became the caretaker of Garrett Castle, purchasing it herself during Dane's years in the Crusades to prevent the British government from seizing the property for failure to pay taxes. He also took a young Irish orphan, Sean Dolan, under his wing, becoming a guardian and mentor. However, over time, Whitman began experiencing increasing madness and bloodthirstiness. Doctor Strange revealed that the Ebony Blade had been cursed by its original owner, Sir Percy of Scandia, by spilling blood when he was in possession of the blade. Doctor Strange contacted and appealed to Sir Percy's spirit, allowing it to reside in the blade, and thereby removed the curse, warning Whitman not to inflict the sword with any curses of his own. During this time, Valinor had lost his wings and was retired.The Black Knight returned to America, where he took on full active membership again. During this time, he began riding a mechanical \"Atomic Steed\" for his mount. He also developed a romantic crush on his fellow Avenger, the Wasp, but she didn't share Dane's feelings and he was soon forced to abandon his intentions. He did, however, became romantically interested in his admirer, the female  Yellowjacket.Sometime later, his personality seemed to grow more medieval and archaic. When the Avengers' associate, Marrina, underwent her own transformation into a huge savage sea creature resembling the mythical Leviathan, she began sinking several fleets of ships and ravaging the undersea world of Atlantis. The Avengers hunted her down, but ultimately it was her husband, the Sub-Mariner, who took Whitman's Ebony Blade from him and dealt a mortal blow to Marrina. Whitman immediately felt the effects of the blood-curse on the blade, which took the effect of slowly transforming him into a living extension of his Ebony Blade. As such, he began to cut the people and objects he touched and gradually found it harder to move.The Black Knight was forced to leave the Avengers in the company of his teammate Thor, who hoped to find a cure for Whitman's condition in the realm of Asgard. However, at the time Asgard became embroiled in a battle against the Egyptian death god Seth and his army. Ultimately, Thor used the Knight's cursed, blade-like body to kill Seth. Thor then took the Knight’s body back to Earth, placing it in the care  of Doctor Strange. Dane Whitman was restored to normal through the combined efforts of Doctor Strange, his friends Victoria Bentley and Sean Dolan, and the spirit of Sir Percy.The Black Knight soon returned to the Avengers, having abandoned his Ebony Blade in favor of a high-tech laser sword. More determined and driven than before, the Knight grew into one of the Avengers' most prominent members, even serving as unofficial field leader under the Black Widow. His drive in the Avengers led him to become more ruthless than before, even to the point of advocating the assassination of the alien Supreme Intelligence for its role in sparking war between the Kree and Shi'ar alien races. Also, Whitman began neglecting Valinor, his squire Dolan, and his benefactor Victoria Bentley.Sean Dolan later used the Ebony Blade, becoming possessed by it and being transformed into the demonic Bloodwraith, killing Victoria Bentley and stealing Valinor for himself. More poignantly, Whitman and Bentley had just begun to entertain a potential romance before her death. Dane defeated the Bloodwraith, but Dolan escaped, becoming one of Whitman's most bitter foes.During their adventures in other dimensions, Sersi regained her emotional stability and Dane spent some time with a super-team called Ultraforce, even becoming its leader. He and Sersi eventually decided to return to their own Earth, though, and managed to do so after an accidental side trip to the Crusades, during which Dane earned the friendship and enmity of Bennet du Paris, a power-mad knight who survived into modern times as the mutant terrorist Exodus, leader of the Acolytes. On returning to present-day Earth, Dane and Sersi split up. The Avengers were temporarily disbanded at the time, so the Black Knight found a new home and new employment at Oracle Incorporated, joining the company's new super-team, Heroes for Hire. At about the same time, Dane was contacted by the Lady of the Lake, who informed him that he was fated to be the champion of Avalon, the mystical Celtic realm the Black Knight had been allied with during his time in the Twelfth Century. The Lady of the Lake gave the Knight a new magical winged steed and mystical weapons to better battle evil in Avalon's name.The Black Knight continued to battle evil as a member of Heroes for Hire and as an inactive member of the Avengers, until Heroes for Hire’s disbanding. In one of the team’s final missions, they encountered on Mt. Wundagore the humanoid animals created by the High Evolutionary. The Black Knight elected to stay on Wundagore to lead these \"New Men\" as the Knights of Wundagore.", 
            "durability": 5, 
            "education": "Master's degree in physics, incomplete doctoral work", 
            "energy": 4, 
            "eyes": "Brown\n", 
            "fighting": 5, 
            "firstappearance": "Avengers #47 (1967)\n", 
            "groupaffiliation": [
                "MI-13", 
                "formerly Pendragons", 
                "Avengers", 
                "Excalibur", 
                "Knights of Wundagore", 
                "Heroes for Hire", 
                "Queen's Vengeance", 
                "Ultraforce", 
                "champions of Otherworld's Camelot", 
                "King Richard's army", 
                "Defenders associate", 
                "Masters of Evil"
            ], 
            "hair": "Brown\n", 
            "height": 72, 
            "id": "Black_Knight_(Dane_Whitman)", 
            "identity": "Secret", 
            "intelligence": 4, 
            "knownrelatives": "Nathan Garrett (Black Knight, uncle, deceased); Sir Percy of Scandia, Sir Raston, Eobar Garrington; (Black Knights of past eras, ancestors, deceased); Lady Rosamund, Edward, Geoffrey (ancestral relations, wife and sons of Sir Percy, presumed deceased); Dafydd ap Iowerth, Arthur Pendragon, Mordred the Evil, Morgan Le Fay (distant ancestral relations)", 
            "occupation": [
                "Adventurer", 
                "scientist", 
                "former crusader"
            ], 
            "origin": "Avengers #48 (1968)", 
            "placeofbirth": [
                "Gloucester", 
                "Massachusetts"
            ], 
            "powers": "None", 
            "realname": "Dane Whitman", 
            "speed": 2, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 190
        }
    }
}