{
    "aliases": "None", 
    "citizenship": "Attilan", 
    "content": "A month after being awarded his freedom, Black Bolt discovered that his younger brother Maximus had made a pact with emissaries of the Kree. While attempting to stop the Kree ship before it escaped, Bolt used the power of his quasi-sonic voice to knock the ship out of the sky. When the ship crashed to Earth, it landed on the parliament, killing several key members of the Council of Genetics, including his parents. The reverberations of Bolts shout affected Maximus’ sanity and suppressed his nascent mental powers. Despite his guilt and silent protests, Black Bolt was obligated to accept the mantle of leadership of the Inhumans at age twenty.Black Bolt’s first crisis in leadership came when his cousin Triton was held captive by humans. Learning of Triton’s encounter upon his escape, Black Bolt decided that Attilan was in imminent danger of being discovered by humanity. Black Bolt scouted out possible places in which to relocate, and decided upon the remote Himalayan mountains. After the great migration, Black Bolt faced his second great crisis when his now insane brother Maximus unleashed the Trikon, three of the Inhumans’ worker drones who were transformed into energy-beings. The Trikon enabled Maximus to launch a successful coup, establishing his rule over the Inhumans, and sending Black Bolt and the other members of the Royal Family into exile.For the next few years, Black Bolt and his kinsmen wandered Asia, Europe, and finally America, in search of Medusa, Bolt's betrothed mate, who had been separated from the others during the battle with the Trikon. Eventually Black Bolt was reunited with Medusa when Gorgon found her in the company of the Fantastic Four. After leading an attack against the four, Black Bolt returned to Attilan when Crystal announced that his cousin Triton had been taken back by the Seeker. Black Bolt returned to face his brother, who had taken the crown of the Inhumans, and declared himself the new ruler and the future husband of Medusa. But Black Bolt was not amused by his show of power, and tore the crown from his hands, reclaiming his place as the leader of the Inhumans. Though later, once the Fantastic Four found the refuge, and Black Bolt argued with Mister Fantastic, encouraging him to leave peaceably, Maximus sealed the refuge in a Negative Zone barrier after discovering that Inhumans and humans were of the same race.", 
    "durability": 5, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 6, 
    "firstappearance": "Fantastic Four #45 (1965)\n", 
    "groupaffiliation": [
        "Inhumans", 
        "formerly Illuminati"
    ], 
    "hair": "Black\n", 
    "height": 72, 
    "id": "Black_Bolt", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Medusa (wife and first cousin), Ahura (son), Agon (father, deceased), Rynda(mother, deceased), Maximus (brother), Crystal (sister-in-law), Gorgon, Karnak, Triton (cousins)", 
    "occupation": "Ruler of the Inhumans", 
    "placeofbirth": [
        "Attilan", 
        "Atlantic Ocean"
    ], 
    "powers": "Black Bolt has the ability to unleash great destructive power through the use of his voice, but even the slightest whisper will release his power.  Therefore, for the most part, he remains silent.  This \"quasi-sonic\" scream is powered by electron energy that he draws in from the environment.  At maximum the force is equal to that caused by the detonation of a nuclear weapon.  Other possible manifestations of this harnessed electron energy include electron energy blasts, flight, enhanced strength (the \"Master Blow\" being a superhuman punch), ability to survive in space, and the ability to analyze and manipulate matter.  The fork-shaped antenna that Black Bolt has worn upon his brow since childhood enable him to channel his powers in more directed, less destructive ways.  Due to the fear of speaking while sleeping, Black Bolt practices a form of meditation, which may also help to enhance his abilities.", 
    "realname": "Blackagar Boltagon", 
    "significantissues": "Dies in an explosion, fighting Vulcan (War of Kings #6, 2009)", 
    "speed": 5, 
    "strength": 5, 
    "universe": "Marvel_Universe", 
    "weight": 210
}