{
    "aliases": [
        "Daywalker", 
        "Switchblade", 
        "Frank Blade"
    ], 
    "citizenship": [
        "U.S.A.", 
        "formerly UK"
    ], 
    "content": "Frost was driven away before he could slay the child, but Blade's mother died. Orphaned, Blade was raised at Madame Vanity's brothel, his mother's workplace. He knew how his mother had died, but he did not fully understand it until he was nine years old. Walking home one evening, he saw an old man attacked by vampires. Blade threw himself into the melee, courageously driving away the demons. The old man turned out to be Jamal Afari, a great jazz trumpeter and a dangerous foe of the undead. Afari moved into Vanity's and mentored Blade, tutoring him in both music and combat. Blade developed into a human killing machine, specializing in the use of teakwood daggers; but despite Afari's positive influence, Blade fell prey to the local criminal element. He briefly joined the Bloodshadows street gang, claiming leadership after driving out the group's previous head, Cutter. Blade also took Cutter's woman - Glory - for his own; but when the Bloodshadows ran afoul of the vampire Lamia, Glory was converted into one of the undead. Blade slew Lamia and resolved to accept his destiny, focused once more on battling the undead.When the vampire lord Dracula turned Afari into a vampire that Blade was forced to destroy, this intensified his hatred for the undead. Partnered with Azu, Ogun, Musenda and Orji Jones, Blade journeyed to China, where he tricked Dracula into an ambush and they slew the vampire; however, Dracula rose again within the night and gleefully slaughtered Blade's allies. Blade continued his crusade alone for a time, eventually attracting the attention of Quincy Harker, whose passion for destroying the undead nearly equaled Blade's own. Blade initially scorned Harker's methods as too slow, but after an unsuccessful battle with Dracula on board an oceanliner, Blade began to recognize the need for allies. Working with Frank Drake, Rachel van Helsing, Taj Nital and Quincy Harker, Blade tracked Dracula to one of his many lairs and once again plunged a stake deep into the vampire's heart; unfortunately, Dracula soon revived.Months later, the hunt for Deacon Frost took Blade to Boston, where he was astonished to find Harker's team and their mortal enemy Dracula working together against a greater threat, Doctor Sun. Blade spurned this alliance at first, unwilling to work with a vampire, but joined them after realizing how dangerous Sun was. While battling Sun's forces, Blade caught a glimpse of Frost. Once again deserting Harker's band for his own mission, Blade resumed his search for Frost and soon found Hannibal King, a private eye whom Frost had transformed into a vampire. Unwilling to trust each other but united by their hatred of Frost, King and Blade joined forces to pursue Frost, encountering a vampiric doppelganger of Blade in the process. Finally, King and Blade tracked down Frost and seemingly destroyed him in a powerful explosion; but like all too many of Blade's vampire foes, Frost would eventually return.After Quincy Harker's death, his band of vampire hunters began to drift apart. One of them, Rachel van Helsing, was killed by Dracula and turned into a vampire before Wolverine destroyed her. Blade, Drake and King teamed with Doctor Strange to cast a spell called the Montesi Formula, which seemingly wiped out all vampires on Earth. For the first time in his life, Blade lacked a clear purpose. Seeking direction, he formed the Borderline Investigations firm with Drake and King; however, the agency soon fell apart due to financial constraints and uneasy personal relations among the partners. Later, Drake sought Blade's help with a personal crisis. The spirit of Drake's new wife, Marlene McKenna, had been fused with that of Rachel Van Helsing by the demonologist Smirnoff, who had sacrificed hundreds of college students in the cult known as the Belonging to amplify Dracula's power. Blade used Marlene as bait to lure Dracula, who had been revived by the demon Asmodeus. During a terrible confrontation with Dracula, Blade was badly beaten and his mind snapped.Convinced that his allies were standing between him and Dracula's demise, Blade became a threat to everyone around him. Drake found the best mental help money could buy for Blade, who was temporarily housed in an asylum. He recovered, due in part to the aid of Doctor Strange, who mystically transmuted Blade's hatred of vampires into a more generalized distaste for all things occult. Strange did this because Blade and his allies were fated to play a vital role in thwarting the demon mother, Lilith. Blade renewed his partnership with Drake and King as the Nightstalkers, and the trio were soon hired by Lilith herself to attack the Ghost Rider and John Blaze as supposed threats to humanity, a battle Ghost Rider barely survived. Blade threw himself wholeheartedly into their new business, eager to eradicate the occult world. The group immediately drew the attention of the Department of Occult Armaments (D.O.A.), a division of Hydra headed by Belial. Blade's dislike of the supernatural almost led him to sacrifice King to the group, but in the end he put aside his doubts and risked his life to save his friend. The Nightstalkers next aided the Punisher, who had been caught in a mystical war between Shiv and Adam Casim. Blade next found himself in conflict with Morbius, who was desperately seeking a way to end his pseudo-vampiric existence. Their battle attracted the attention of an ancient alchemist named Stonecold and his vampiric ally, Vic Slaughter.Trading one obsession for another had done little to moderate Blade's personality, and he often came dangerously close to harming innocents. Using a page from the cursed Darkhold to become mystically powerful, Blade sought to wipe out all supernatural beings. He fought and slew many of the Midnight Sons, a loose-knit mystical confederation that included the Nightstalkers, and began calling himself Switchblade to further distance himself from his past life. Though much of the damage he caused was erased from existence, it was not erased from Blade's mind. Overwhelmed by guilt, Blade used the mystical knife known as the Edge of Intrados to summon and examine visions of his life. Finally seeing how dangerous it was to be ruled by his obsessions, he felt hopeful about his future for the first time.A battle with the child of Lilith known as Short-Circuit soon followed and the growing rift between King and Blade was seemingly set aside forever, as Blade swore to prevent King from ever losing control of his vampiric self. Unfortunately, the Montesi Formula had begun to weaken. Varnae, the original Lord of Vampires, returned to life and Hydra created a Dracula clone called Bloodstorm. Dracula's wife, Domini, came seeking aid to retrieve her kidnapped son, Janus. While the rest of the Nightstalkers embarked on a plan to track down Bloodstorm, Blade took on the task of finding Janus. His investigation led him to Kennedy Airport where the man behind the kidnapping was boarding a plane headed to New Delhi. Blade's heart was broken when he discovered that his old ally, Taj Nital, had been transformed into a vampire and was now serving Varnae, who had orchestrated the kidnapping. During a massive struggle between Varnae, Bloodstorm and the Nightstalkers, all save Blade were seemingly destroyed. Blade felt extreme guilt over the fact that his only friends were now dead, leaving him to carry on his war alone. He swore to continue the search for Janus, but to date the child has not been located.He soon found a new ally in Bible John Carik, a member of the mystical Cathari sect, guardians of an ancient mystical library. Alongside Carik, Blade battled a strangely reborn Dracula and a false Deacon Frost. He also attempted to forge a normal life for himself outside of vampire hunting. Befriending a woman named Julia Suarez, he rented an apartment from her under the name Frank Blade. He clashed with Marie Laveau, Steppin' Razor and Night Terror while the trio were reviving Varnae once more. Blade's spirit briefly traveled back in time, experiencing the life of 17th-century vampire hunter Jonas Cray. Laveau later sent her agents, the Vampz, to kill Bible John but Blade once more halted her plans. Meanwhile, Carik's visions of Hannibal King and Frank Drake eventually culminated in the revelation that the two men had somehow merged with Bloodstorm to form this new Dracula. Blade and a future version of himself known as Crossbow were instrumental in helping King and Drake return from this state, though Dracula's true soul retained possession of the body they had once shared. Drake has yet to recover from these events.Shortly thereafter, Blade was captured by Silvereye, a S.H.I.E.L.D. division devoted to developing its own cadre of vampire soldiers. The Silvereye division was partially a front for a scheme engineered by Darius Venginian, a vampire who sought to resurrect an ancient vampiric demon known as the Reaper. He also sought to program Blade into becoming a Silvereye pawn, but this plan failed when Blade broke free of his programming. The vampire-hunting twins Mosha and Mikado aided Blade during this adventure and accompanied him when he fled the scene, swearing to have nothing more to do with S.H.I.E.L.D. in the future. Blade's partnership with the twins was brief, and he was alone again when he faced a terrifying breed of multi-stage vampires known as the Tryks. Blade was seduced by their queen, who hoped that their progeny would eventually allow her kind to rule the Earth. Most recently, Blade teamed up with a new group of vampire hunters, thwarting an immense vampire conspiracy threatening the entire planet, led by Dracula himself. Dracula was destroyed once again, though his eventual resurrection seems to be assured.", 
    "durability": 5, 
    "education": "High-school equivalent", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 5, 
    "firstappearance": "Tomb of Dracula Vol. 1 #10 (1973)\n", 
    "groupaffiliation": [
        "Formerly Noah van Helsing's vampire hunters", 
        "Nightstalkers", 
        "Midnight Sons", 
        "the Nine", 
        "Quincy Harker's vampire hunters", 
        "Ogun Strong's vampire hunters", 
        "Bloodshadows gang"
    ], 
    "hair": "Black\n", 
    "height": 74, 
    "id": "Blade_(Eric_Brooks)", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Unnamed mother (deceased)", 
    "occupation": "Vampire hunter", 
    "placeofbirth": [
        "Soho", 
        "London", 
        "England"
    ], 
    "powers": "The enzymes in Blade's blood made him immune to normal vampire bites, uniquely attuned to sensing the supernatural and resistant to aging. Since being bitten by Morbius, Blade has gained many of the traditional powers of the vampire without developing their weaknesses. He has superhuman strength, senses and stamina, plus an accelerated healing factor.", 
    "realname": "Eric Brooks", 
    "speed": 5, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 215
}