{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A.", 
            "content": "The normally gruff and vicious Sabretooth took the young girl under his wing and raised her as his own. He showed her a surprising amount of love considering his background as a murderer and member of Apocalypse's Horsemen. Under his strict but fair tutelage, Blink would become a member of the X-Men.Blink first earned her place on the team by teleporting the team to the moon to fight the Horseman named Death, the first time she had attempted a teleportation of that distance. After that mission, the young mutant gained a great deal of confidence in herself. She devoted her time as an X-Man to preventing other young mutants like herself from being taken by Apocalypse's forces.On one reconnaissance mission alongside her fellow X-Man, Sunfire, Blink discovered the upcoming culling that would take place in Chicago. Outmanned, Blink did the only thing she could. She teleported herself and Sunfire back to the X-Men's secret base. Unfortunately, she led one of Apocalypse's Prelates back with her. The X-Men were able to defeat the mutant named Delgado before he could do any harm, but Blink was chastised for her carelessness.Blink was sorry but she knew the X-Men had to stop the culling. She joined a team of X-Men led by Rogue, including her father figure Sabretooth, to go back to Chicago. When the team arrived to help evacuate the humans of the city, Sabretooth asked her to teleport him to the last known location of Holocaust so he could delay his coming to Chicago. Blink begrudgingly did it. After helping to evacuate Chicago, Blink discovered the beaten body of Sabretooth. He survived his battle with Holocaust, but Blink was enraged. She faced off against Holocaust and teleported him into a vat of acid.With the culling in Chicago averted and Holocaust apparently defeated, Blink teleported the team back to Westchester only to discover Magneto and his son had been taken by Apocalypse and his forces. Blink teleported the team directly into the heart of Apocalypse's Kingdom for their final battle against Apocalypse. It appeared the X-Men were going to win but would die in the subsequent nuclear missile strike launched by the humans in Europe.Before the missiles struck, Blink was taken and deposited in a barren desert. While there she learned she had become displaced in time. She joined five other heroes from different realities and together they formed the Exiles. The mysterious man known as the Timebroker explained to them that in order to return to their home realities they would have to repair chinks in the chain of time. Unlike the other heroes who were told they had realities to return home to, Blink learned that when her mission was finished she would return to the nothingness the Age of Apocalypse had become.Blink was given a Tallus on her wrist that would guide the team in their missions and clue them in to their role in each reality. Their first mission was initially a failure. The team, led by Mimic, made poor choices based on their knowledge of their own home realities and released an insane Charles Xavier from prison. The Exiles' de facto leader, Mimic, placed Blink in charge of the team; her background in the Age of Apocalypse where she had constantly lived in a state of war gave her an edge the others did not possess. She accepted the role, and she and Mimic worked together to guide the team.Mimic spent a great deal of time teaching her about the multiple heroes that existed in other realities but not in her dark timeline. Eventually, the two of them began a relationship.After traveling through many realities, the Exiles encountered a team of reality travelers like themselves named Weapon X. Blink's father figure Sabretooth was the team's leader. The two reunited and were ecstatic to see each other. After discovering their mission in this reality was to murder a young boy, Sabretooth switched sides and joined the Exiles. He would eventually offer to take care of the boy, David Richards, and hopefully prevent the awful future that awaited him. Apparently, this offer was enough to fix the timeline; Blink and her team teleported away, leaving her foster father behind.As the team continued on, it became obvious Mimic was having a very difficult time adjusting to their life. He was sick of constantly fighting different versions of people who were heroes and friends in his happier reality. He broke up with Blink and asked if they could just be friends. Blink was hurt but accepted his decision.On a world controlled by Legacy Virus-tainted Vi-Locks, Blink was infected with a techno-organic virus. It appeared she would die from her infection and become a Vi-Lock herself, but Morph was able to summon the Norse Gods and create a powerful vaccine from their blood. Blink was cured just in time. She teleported into the aircraft piloted by Mimic and saved his life. (He was flying a plane loaded with a nuclear warhead into the Vi-Lock base in an effort to destroy them.) After teleporting out, Mimic let Blink know he had acted like an idiot and he still did love her. Moments later, the Timebroker arrived and informed Blink her reality had been repaired and she could go home. Before anyone could say anything, Blink was gone and Illyana Rasputin had taken her place.Instead of sending her back to the supposedly empty Age of Apocalypse, Blink was reunited with Sabretooth in the reality of David Richards. It is unknown what happened there. Blink has yet to talk about it, but it was apparent things went poorly.After the death of the Exile Sunfire, Blink was returned to the team. The Tallus returned to her wrist and she resumed her leadership role. The team was in disarray and Blink did her best to help. They were forced to fight the Weapon X team of reality-hoppers once again. In a battle with the super alien Hyperion, Blink used her teleportation portal to redirect Hyperion's eyebeams into his own spine, crippling him and giving Gambit the opportunity to finnish the job. The team triumphed and moved on.", 
            "durability": 1, 
            "education": "Grade school (some education with Magneto)", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 1, 
            "firstappearance": "X-Men: Alpha (1995)\n", 
            "groupaffiliation": [
                "Exiles", 
                "formerly Imperial Guard", 
                "X-Men"
            ], 
            "hair": "Magenta\n", 
            "height": 65, 
            "id": "Blink_(Age_of_Apocalypse)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Parents (deceased), Sabretooth (surrogate father)", 
            "occupation": [
                "Adventurer", 
                "freedom fighter"
            ], 
            "origin": "Blink #1-4 (2001)", 
            "placeofbirth": "unrevealed", 
            "powers": "Blink is a mutant able to create teleportation warps. She can use these warps on people or objects and has teleported as far as the moon with great difficulty. Blink will sometimes imbue small javelins with her teleportation powers and throw them at her targets, teleporting them away.", 
            "realname": "Clarice Ferguson", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Earth-295 (Age of Apocalypse)", 
            "weight": 125
        }
    }
}