{
    "aliases": [
        "Frank", 
        "Ahab", 
        "numerous others", 
        "possibly mistaken for Beowulf"
    ], 
    "citizenship": "None", 
    "content": "As per the wishes of these gods, the Exo-Mind created Ulluxyl Kwan Tae Syn as its guardian; the gods needed five such guardians needed to complete the ritual necessary for interdimensional travel. However the Exo-Mind had no interest in the outcome of their goals and sabotaged their ritual. The Bloodgem was hurled across time and space, arriving in the final stages of a collapsing universe. The Bloodgem survived the death of that reality and was released during the subsequent \"Big Bang\" that created the current Earth dimension. The Bloodgem spawned the future Star of Capistan at some point.Billions and billions of years later, the Bloodgem was one of the gems brought to Kree-Lar by scientists investigating the Alpha and Omega Stones, uniting a series of artifacts which also accessed the Hellfire Helix. The gems were linked to form the Lifestone tree, which genetically remade eight representatives to serve as the Chosen Eight of Fate (occasionally referred to as the Guardians of the Galaxy), whose purpose was to maintain peace among and between the inhabited worlds. This group was active for over two hundred years, after which galactic peace collapsed. Efforts to steal the Lifestones caused a warp-drive implosion, creating a fissure in space that shattered many of the Lifestones to the far corners of the galaxy and beyond. Among these were the crystals that would become known as the Godstone (which empowered the Star-God of Other Realm and the Man-Wolf), the Ka Stone (which empowered the Sphinx), the Moongem (which empowered Moonstone and Nefarius while he was Moonstone), the Power Prism (which empowered Doctor Spectrum (Kinji Obatu) and all other 616 Doctor Spectrums), and the gem that empowered the Blue Diamond. Like the Bloodgem, many of the Lifestones have complex origins prior to the creation of the Lifstone Tree.The Bloodgem itself arrived on Earth in 8250 B.C. The utilization of the Bloodgem had allowed it to be located anew by the Exo-Mind, which allegedly decided that it wished to observe the evolution of humanity through disinterested eyes. It required a host whose entire existence revolved around a single purpose; it decided on revenge. The Exo-Mind dispatched Ulluxy'l to Earth and he rapidly created a citadel in a cavern around the Bloodgem. The gem's fiery trip through Earth's atmosphere had drawn the attention of a hunter who directed his subsequent hunts in that direction. Spying a cloaked figure (Ulluxy'l), the hunter followed him into a cavern where he approached an advanced citadel. Though shocked by Ulluxy'l's monstrous appearance, the hunter was granted great power by Ulluxy'l and sent to bring his tribe to the citadel, so they too could gain power. However, the ceremony proved fatal to the hunter's tribe. The hunter, who had survived due to the energies he now possessed, leapt atop the Bloodgem in an effort to stop the process. The Bloodgem exploded, and one geometrically perfect fragment imbedded itself in the savage's sternum, while the rest of the pieces were scattered across the planet. The Bloodgem's fragments each accessed only certain \"wavelengths\" of energy. The hunter had become immortal, and he dedicated himself to exacting revenge upon Ulluky'l, the being whom he held responsible for the deaths of his people. The savage took the name of Ulysses Bloodstone. In time, fragments came into the possession of others, such as Raa of the Hill People (one of the Anachronauts) and the man known as  Merlin Demonspawn (also known as the Magus, the Maha Yogi, and the Mad Merlin).For a hundred centuries, Bloodstone pursued his goal of taking down Ulluxy'l, while Ulluxy'l sought to re-gather the Bloodgem fragments. To keep Bloodstone from reaching him, Ulluxy'l dispatched hordes of extradimensionally born monsters to kill him. Bloodstone triumphed over the creatures sent against him, but only succeeded in locating his arch foe a handful of times. When he lost Ulluxy’l’s trail completely, and was not involved in learning new languages, skills, or knowledge, Bloodstone went into a self-induced suspended animation, sometimes for up to a century at a time.Shortly after his mutation, Bloodstone banished the powerful alien Orrgo. He was present in ancient Egypt, during the rise and fall of the Greek and Roman empires, and during the formation of the British Parliament. He served as a swashbuckling pirate on the high seas, enjoyed the Renaissance, and fought demons as one of the Puritans. He served as a major in the American army during the Revolutionary War, fighting alongside General Wallace Worthington and the Captain America of that period. In the 19th century, he took the name of Ahab and was captain of the Pequod, during which time his pursuit of an incarnation of the Atlantean monster Giganto gave rise to the legend of Moby Dick.By the early 20th century, Bloodstone had acquired a fortune through mercenary work and shrewd investments. Bloodstone served as a biplane pilot during World War I and fought Nosferatu vampires during the 1930's. In 1956, as Frank, he defeated the monstrous ant Grottu and helped form the Monster Hunters, eventually encountering the likes of Gorgilla, the Deviant Kro (who had been unleashing many of the monstrous mutates that plagued the Earth at that time), Skrulls, and the heroes who would become the First Line. Bloodstone also encountered Dracula, the Frankenstein's Monster, and the Living Mummy, among countless others.By the late 20th century, Bloodstone had established bases in six different locations across the globe, each with handpicked operatives. These included Bloodstone Island, Tropic of Cancer, near the Caribbean Ocean; Minibase-6, Harlem, New York; a base near Moscow, Russia; a mansion in Boston, Massachusetts; and at least two others. At some point he married a woman named Elise with whom he fathered a daughter named Elsa, but Ulysses left when she was two years old.In the modern era, after defeating a psychic monster known as the Possessor, Bloodstone followed the Bloodgem's guidance to work in film with director P.D.Q. Werne and actor Brad Carter; the latter accompanied Bloodstone on adventures.The Exo-Mind allegedly came to tire of experiencing life through Bloodstone. It had Ulluxy'l ally himself with the Conspiracy, a group of four others (surgeon Dr. Judan Bardham, the dark sorcerer Kaballa, ecdysiast Bubbles O'Day, and an intelligent dolphin named Atlan) assembled by the Exo-Mind to complete the five beings necessary to channel the Hellfire Helix's full energy into Earth. The Conspiracy was told that they would gain the Helix’s power, while giving the Exo-Mind a new perspective. The Conspiracy assisted Ulluxy&339;l in assembling the remaining Bloodgem fragments, but they betrayed Ulluxy'l, backing the evolved scientist Centurius, who slew Ulluxy’l and replace him in the Conspiracy.When Bloodstone became attracted to reporter Samantha Eden, the Conspiracy dispatched their agent Domino (Dominic Dunsinane) to prevent bloodstone from becoming distracted from his single-minded quest, thus causing the Exo-Mind to lose its hold on him. After battling agents of the Conspiracy, including the Killer Shrike and the monsters Goram and Sharzan, Bloodstone was captured by Kaballa, and the Conspiracy cut the Bloodgem fragment from his chest leaving him for dead while they performed the ceremony to reassemble the fragments and gain their power. However, the Exo-Mind instead absorbed the Conspiracy's life forces, transformed the Bloodgem into a giant form which it inhabited, and rampaged through Manhattan. Clinging to life via residual Bloodgem energy, Bloodstone confronted the crystalline creature and cast his soul into it, disrupting the Hellfire Helix, severing the Exo-Mind's connection to Earth and shattering the Bloodgem, Bloodstone's form collapsed, leaving only a lifeless skeleton.Years later, Baron Helmut Zemo located Bloodstone's skeleton in the Museum of Natural History, and used his sternum as a divining rod to track down the Bloodgem fragments, which he used to try to resurrect his father, Baron Heinrich Zemo. However, the assembled Bloodgem summoned the Exo-Mind, which possessed Heinrich’s form and made plans to take over the Earth. The Bloodgem was shattered and fell into a volcano, banishing the Exo-Mind once again.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "(as Frank) Strange Tales #73 (1960), (as Bloodstone) Marvel Presents #1 (1975)\n", 
    "groupaffiliation": [
        "(Formerly) the Explorers Club", 
        "Monster Hunters", 
        "the crew of the Pequod", 
        "an unnamed Vanir tribe"
    ], 
    "hair": "Blonde\n", 
    "height": 74, 
    "id": "Bloodstone,_Ulysses", 
    "identity": [
        "The general public was unaware of his existence", 
        "or that he was Ahab or Frank"
    ], 
    "intelligence": 1, 
    "knownrelatives": "Elise Bloodstone (widow), Elsa Bloodstone (daughter); possibly other wives and/or children gathered over the millennia", 
    "occupation": [
        "(At time of death) Adventurer", 
        "hunter", 
        "soldier of fortune", 
        "former movie actor", 
        "sailor", 
        "pirate", 
        "whaling ship captain", 
        "major in the army of Colonial America", 
        "hunter/gatherer"
    ], 
    "origin": [
        "Marvel Presents #1-2 (1975)", 
        "Rampaging Hulk #3-4", 
        "and 8 (1977", 
        "1978)", 
        "Captain America #357 (1989)", 
        "Thunderbolts #45-46 (2000-2001)"
    ], 
    "placeofbirth": [
        "Northern Vanaheim (later Scandinavia)", 
        "European continent", 
        "circa 8250 B.C."
    ], 
    "powers": "Bloodstone’s Bloodgem fragment granted him superhuman stamina, agility, senses, and vast regenerative powers, enabling him to regenerate from virtually any injury up to the dispersion of a vital portion of his bodily molecules (some sources claim he could regenerate if a single cell survived). He was immune to aging and conventional diseases and did not require air, food, or water. Removal of the Bloodgem proved to be rapidly fatal.\nBloodstone possessed an invisible \"third eye\" on his forehead, granting him extrasensory perception, enabling him to see human auras (and thus see people in the dark) and mentally access astral planes. He had limited telekinetic powers and could also enter suspended animation.", 
    "realname": "Ulysses Bloodstone", 
    "significantissues": [
        "Battled Orrgo (Defenders #9, 2001)", 
        "Revolutionary War activities (Captain America: Sentinel of Liberty #6-7, 1999)", 
        "joined with Monster Hunters against Kro, history as Ahab revealed (Marvel Universe #4-7, 1998)", 
        "Monster Hunters assisted proto-First Line against Skrulls (Marvel:The Lost Generation #2, 2001)", 
        "defeated the Possessor (Marvel Presents #1-2, 1975)", 
        "directly opposed and slain by Conspiracy, defeated by Exo-Mind (Rampaging Hulk #1-6 and 8, 1977-1978)", 
        "Sternum used in collection of Bloodgem fragments by Baron Zemo (Captain America #357-362, 1989)", 
        "Elsa gained Bloodgem fragment, numerous past adventures of Ulysses Bloodstone recounted (Bloodstone #1-4, 2001-2002)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 225
}