{
    "aliases": "None", 
    "citizenship": "Citizen of the United States", 
    "content": "Later, the Theatre of Pain’s La Lunatica kidnapped Bloodhawk and brought him to the Theatre to torture him with memories of his youth, when he was captured and experimented on before breaking out and killing his captors.  The X-Men eventually broke him out along with their team member Skullfire, whose released powers set Luna free, as well.  Luna later saved Bloodhawk from Controller Thirteen when Bloodhawk’s weakened state kept him from defending himself, and she in turn killed the controller.  Next, Bloodhawk helped the X-Men find Meanstreak’s friend, Jordan Boone.  In the search, he attacked the man-beast Ravage, who they needed information from; before they mutually discovered that they were on the same side.  And together they headed to Valhalla and fought with the genetically engineered Heimdall, before Meanstreak was able to kill him with his friend Boone’s help.  Bloodhawk assisted with the evacuation of the city, before the 2099’s Spider-Man, Punisher, Doom, and Ravage brought the falling city under control.Bloodhawk continued to protect the desert, bombing convoys carrying toxic waste and attacking anyone who would threaten its environment.  Soon, an old friend of Bloodhawk’s, Carson Leibowitz, called him to ask for his help with an Alchemax drilling operation in the Savage Land.  Bloodhawk gladly agreed and traveled with him to Antarctica.  There, he ran into Doom, who had crashed landed in the Savage Land in an escape pod.  Doom had been forced to remove his armor after a fight with a Tyrannosaur, and without his armor, Bloodhawk didn’t recognize him and took him for a poacher.  Bloodhawk brought him to the Village of the Sky to talk with Leibowitz.  Once Doom had convinced them of his identity, Bloodhawk helped him search for his armor, eventually coming in contact with the local swamp tribe and Alchemax’s mercenaries.  Bloodhawk lashed out at the Alchemax thugs, but was shot down, and captured with the rest of his group.  While being questioned by D’Argent, the head of the Alchemax group who had become obsessed with local culture and was pumped full of drugs, Bloodhawk broke free and attacked D’Argent.  But the drugs that powered him made him strong and swift, and he smashed Bloodhawk to the ground.  He then decided to sacrifice Bloodhawk and his allies to the local gods in order to stop the earthquakes that were actually being caused by his drilling machines.  But when another earthquake brought the temple down upon them, Bloodhawk and his friends escaped and Bloodhawk dropped an overloading plasma gun on the drilling machines, destroying them.When a giant, out of control robot threatened the Las Vegas desert and its inhabitants, Bloodhawk flew to stop it.  He attempted to disable it with a static grenade, but it simply swatted him away instead.  Then a woman named Jade Ryutski appeared and explained that the robot was her pet, created by her father, which she named Monstrobot.  With Bloodhawk’s help, Jade dropped onto the back of the giant robot and broke into the cockpit to shut it down.  Before they could dispose of the robot, a car showed up with a pair of lawyers who claimed the robot in the name of the Stark/Fujikawa company.  So Jade signed over all rights to the robot, and then the gathered group watched as it launched itself into space and exploded, absolving her of all responsibility.Bloodhawk later agreed to assist the X-Men’s Krystalin and Meanstreak in breaking into the Theatre of Pain and destroy it to pay them back for torturing him.  In the confusion created by the other X-Men members, the three made their way into the Floodgate, the holding center for the Theatre’s victims, and fought with Brimstone Love and the revived members of Zhao’s third incarnation of the X-Men.  Bloodhawk battled Wingspan, a mutant engineered to be similar to the 20th Century’s Archangel.  With the mutant Sham’s help, Bloodhawk was finally able to gain control and throw Wingspan through the window, into the amphitheater where Xi’an, as Controller X, was using Zhao’s body to orchestrate a massive broadcast of suffering.  Along with the rest of the X-Men, Bloodhawk attacked Brimstone Love, but it was only when Xi’an turned on him and used the Mindfire Machine that Zhao powered, that he was defeated.  Then, with Xi’an shocked back to normal, the X-Men traveled at the behest of Doom to Halo City, a refuge created to house refugees from the Theatre.  Bloodhawk returned instead to his desert home.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Gray (human), Black (transformed)\n", 
    "fighting": 1, 
    "firstappearance": "X-Men (2099) #1\n", 
    "groupaffiliation": [
        "X-Men", 
        "Halo City Protectorate"
    ], 
    "hair": "None (human), None (transformed)\n", 
    "id": "Bloodhawk_(2099)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "None", 
    "placeofbirth": "Unrevealed", 
    "powers": "Bloodhawk is a transmorph, able to turn into a hawk-winged creature with a resistance to environmental poisons/pollutants, razor sharp talons, partial invulnerability, regeneration, and enhanced senses.", 
    "realname": "Lemuel Krug", 
    "significantissues": "X-Men (2099) #1 (intro, gains freedom)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}