{
    "aliases": [
        "Borr", 
        "King Bor", 
        "Lord of Asgard", 
        "The Architect of Asgard"
    ], 
    "citizenship": "Citizen of Asgard", 
    "content": "One fateful day, during a great war between the Asgardians and the Frost Giants, Odin would have his chance to continue his plans for mankind. Bor was among those fighting but left the main battle to pursue a fleeing giant. Bor stumbled into a trap set for him by a powerful sorcerer who turned Bor into snow. Odin came upon his father as the wind was pulling Bor's form apart, but before he was completely gone, Bor asked his son to find a sorcerer strong enough to restore him. He told Odin his spirit would rest in the snow until he was recalled. Odin told the other Asgardians his father had perished and was proclaimed king the same day. Each winter, Odin could swear he would hear the voice of his father calling to him, but more and more Odin would ignore the voice until he could no longer hear it.Much later, it was revealed an adult Loki was the powerful sorcerer who set the trap for Bor. He, aided by the death goddess, Hela, traveled into the past and instigated the battle between the age-old enemies merely so he could be rid of Bor and ensure his place among the royal family of Asgard. Upon his return to the wintry present, Loki used his magic to restore Bor from the snow. However, he also placed a spell on Bor to alter his perception of the world around him. Humans looked like demons. Vehicles appeared to be giant monsters. Confused by his surroundings and distraught by the realization his son was no more, Bor wasted no time in demolishing everything around him he contributed to Odin's death. Jane Foster sent out a call to Donald Blake informing him of the seriousness of the situation, and soon Thor arrived to quell the disaster.Bor had never met his grandson, but it wouldn't have mattered for Loki's enchantment extended to Thor's appearance as well. Bor could sense Odin's power within the form of the demon before him, and he assumed this was the monster responsible for killing his son. Bor would soon have his revenge. Striking with a fury only Bor could possess, Thor would have been killed if not for the Odinforce within his body. Thor tried to reason with Bor, but Loki made sure the two could not communicate verbally either. Thor sensed something was wrong and did not want to kill a fellow Asgardian, so he called for help from the Avengers. Unfortunately for him, it was the new team of Avengers led by the Iron Patriot who answered the call. The Patriot ordered his team to take both combatants down, but none could withstand the combined might of Bor and Thor. Bor didn't want to be overwhelmed by superior numbers so he called upon forces potent enough to tear the very world apart. Thor knew if he was to avert this tragedy, he would have to kill his foe. Bor and Thor squared off one final time and charged each other – each one out for blood. The winner was Thor, but a high price was to be paid.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Journey Into Mystery #97 (1962)\n", 
    "groupaffiliation": "Asgardians", 
    "hair": "Red\n", 
    "id": "Bor", 
    "identity": "Believed fictional by general Earth populace", 
    "intelligence": 1, 
    "knownrelatives": "Buri (Tiwaz, father); Bestla (wife, deceased); Odin, Ve, Vili (sons, deceased); Balder, Hermod, Hoder, Thor, Tyr, Vidar (grandsons); Loki (adopted grandson); Mimir (brother)", 
    "occupation": "Former King of Asgard", 
    "origin": "Journey Into Mystery #97 (1962)", 
    "placeofbirth": "Asgard", 
    "powers": "Like all Asgardians, Bor was extremely long lived and aged at a much slower pace than humans, but was not immortal. He could feel the presence of Odin – were he still alive – in any of the nine worlds. Bor appeared to have near limitless power including superhuman strength, endurance, durability and reflexes He could channel potent energy beams from his eyes, guide lightning to strike a desired target, and Bor could even unleash forces powerful enough to destroy the Earth.", 
    "realname": "Bor", 
    "significantissues": [
        "Odin tells Thor of how he \"killed\" his father in order to become Lord of Asgard (Thor #7, 2008)", 
        "Loki convinces Hela to assist him in traveling to the past so he may trap Bor in the snow (Thor #11, 2009)", 
        "Bor is brought back to the land of the living by Loki in order to fight Thor with the hope of Thor’s banishment once Bor is killed (Thor #600, 2009)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}