{
    "add": {
        "doc": {
            "aliases": [
                "Captain America", 
                "the Black Captain America"
            ], 
            "citizenship": "U.S.A.", 
            "content": "In February of 1942, Isaiah enlisted into the United States Army leaving a pregnant Faith behind. Bradley became a private and was stationed at Camp Cathcart in Mississippi which was ran by a Major Brackett. He was assigned to a squad which included the wealthy Maurice Canfield, the lovable Jefferson \"JJ\" Jamison, naive Jack Harvey, sociopath Damon Larsen, and quiet David Plumb. They were led by World War One veteran Sargent Lucas Evans.Washington attache Homer Tully and German scientist Josef Reinstein met with the Major and requisitioned two battalions of black soldiers for an experiment being performed by the Project: Rebirth (later retroactively renamed Weapon I (One), part of the Weapon Plus Program). This segment of the program was headed up by Colonel Walker Price who, after gathering all of the black troops together, shot and killed Major Brackett in front of them, sent 300 black troops (including Bradley and his squad) away in trucks to begin the experimentation stage, had the rest of the black troops executed (by his aide-de-camp Lieutenant Phillip Merritt), and erased and classified all information about Camp Cathcart.At this point, a death notice was sent to Faith Bradley stating that Isaiah had died in an explosion. Meanwhile, at a secret government location, Isaiah and his unit were being experimented upon by the scientists of Project: Rebirth who were attempting to create super soldiers through the use of experimental drugs and surgeries. After many deaths were incurred from the procedures (including Jefferson Jamison), Bradley and his unit indeed became super-soldiers with increased strength, speed, stamina, and reflexes. Bradley and the other remaining experimental subjects were then shipped off to Europe to fight the Germans.Arriving in Europe, minus Jack Harvey (who died en route to Europe), the squad was sent on a mission to ambush a medical supply caravan in the Black Forest of Germany. Only Bradley, Canfield, and Evans survived the mission. Some months later, while in Sintra, Portugal, the remaining super soldiers were informed they were to be led by Steve Rogers (Captain America). An argument ensued in which Canfield wounded Bradley, killed Evans, and was shot to death by Phillip Merritt. Bradley recovered in a secret U.S.-controlled hospital and was informed that he alone would have to carry out their mission to destroy a German concentration camp in Schwarzbitte where the Germans were performing their own super-soldier experiments due to Rogers' ship being delayed by a monsoon in the Pacific. Bradley then stole and modified a Captain America uniform and shield and began the mission before his superiors could send him. On the mission, he witnessed the cruel experiments of the Holocaust (as well as noticing some similarities to the facilities where he had been experimented on), and he was captured.Bradley was rescued by members of the German anti-Hitler resistance and smuggled home, where he was court-martialed and imprisoned at Leavenworth Federal penitentiary until he received a Presidential pardon. While Isaiah was in prison, the government attempted to use his altered DNA to create another super-soldier. The result was a child named Josiah, Isaiah and Faith's genetic son. Josiah was born to a surrogate mother, who smuggled him out of the government's clutches. Isaiah also suffered mental deterioration due to unstable nature of the procedures he had undergone, and when he left prison, he had the mental capacity of a six year-old and was unable (or perhaps unwilling) to speak.", 
            "durability": 1, 
            "education": "Unrevealed; military training", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "The Truth: Red, White, and Black #1 (2003)\n", 
            "groupaffiliation": "None", 
            "hair": "Black, shaved bald\n", 
            "id": "Bradley,_Isaiah", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Josiah X (son), Elijah Bradley (Patriot, grandson)", 
            "occupation": "Former soldier", 
            "origin": [
                "The Truth: Red", 
                "White", 
                "and Black #1-7"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "Due to an early version of the Super-Soldier Serum, Bradley's body was transformed to the peak of human potential, granting him abilities far beyond the common man, such as a great degree of strength, speed, agility, and endurance.", 
            "realname": "Isaiah Bradley", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}