{
    "add": {
        "doc": {
            "aliases": [
                "Anti-Venom", 
                "Formerly Venom"
            ], 
            "citizenship": "U.S.A. with a criminal record", 
            "content": "When the Beyonder created Battleworld, gathering Earth's heroes and villains together to battle while studying the concept of desire, the crime-fighter known as Spider-Man released the symbiote when his familiar red-and-blue suit was ripped into tatters. Believing he had located an alien clothing generator Spider-Man grabbed the symbiote by mistake, shaped like a little black ball. It instantly slithered over his body, covering him from head to toe. Rather than resembling his red-and-blue costume, it took on the appearance of the garment worn by the new superhuman adventurer on Battleworld Spider-Woman, whom Spider-Man had been admiring. The web-spinner was amazed at the properties of his new suit, but never questioned the mechanisms behind them. For instance, it could mimic any type of clothing whatsoever, making Spider-Man’s need for spare clothing obsolete. It also contained a \"dimensional aperture\" where he could place his camera, spare change, and other items without adding to the bulk of the costume. The costume was also equipped with its own web-shooter and seemingly contained an unlimited supply of webbing.Spider-Man unwittingly donned the costume, which immediately made itself apparent. He brought it to the tower at Our Lady of Saints Church gambling the intense sound of its bells would destroy it. Spider-Man lost the gamble, and he succumbed to the bells before the costume did. However, the empathic parasite had preyed upon the emotions of Spider-Man long enough to learn how to feel, and in feeling, to act. Sacrificing itself, the alien costume saved Spider-Man, who assumed it then crawled away to die. Actually, the symbiote, weak and dying, slithered down into the church where Eddie Brock kneeled in prayer at the altar. Raised a Catholic, he begged forgiveness for the suicide he was contemplating.Brock had been a successful columnist for the newly revived Daily Globe until he began writing a series of articles about the \"Sin-Eater murders\". A bogus offender had confessed to Brock about committing the murders. While protecting the \"murderer's\" identity under the First Amendment, Brock wrote a series of stories in the Globe detailing his dialogue with the supposed killer, until mounting pressure from the authorities forced him to write an exclusive revealing the murderer's name. Although that edition of the paper sold out immediately, Spider-Man soon revealed the true identity of the Sin-Eater to be Detective Stan Carter, making Brock a laughingstock among his fellow journalists. Fired from the Daily Globe, he was forced to write venomous drivel for scandal newspapers. Brock's wife left him, and his future appeared to be over. Brock blamed his predicament on Spider-Man.Soon after, Brock began an intense physical workout program hoping to reduce the stress his life had become. However, such physical exertions only increased his violent obsession with Spider-Man. Although his body had been honed to near-perfection, Brock's mind was reduced to an all-consuming vessel of hatred. It was this fierce emotion that attracted the empathic parasite. In order to survive, the alien costume had to feed off the nearest and greatest source of emotion. The symbiote joined mentally and physically with Brock, whose emotions overwhelmed the already confused alien. The dominant thought on both their minds was that of Spider-Man. But Brock's sheer hatred for the crime fighter twisted the symbiote’s feelings to a similar extent. In effect, Brock's emotions drove the symbiote insane, just as their bonding may have driven Brock over the edge. Brock soon discovered that the costume gave him all the powers of Spider-Man, and more. It also added bulk to his already large frame and increased his strength to superhuman levels. Calling himself \"Venom,\" Brock directed the costume to sprout a hideous grin and plotted his revenge. Through the costume, Venom learned a great deal about Spider-Man, including his secret identity.A young guard who had just been assigned to the Vault was fooled into thinking that Venom was a fallen colleague and released the gate mechanism, which imprisoned the criminal. Venom killed the naïve guard and escaped to New York City, where he once again confronted Spider-Man. This time Spider-Man used psychological warfare upon Venom, by taunting the alien symbiote to return to him. The alien, torn by its love-hate relationship for Spider-Man, tried to leave Brock and to re-establish its link with its original owner. But the trauma of trying to detach itself from Brock's nervous system was too much to bear. The alien costume and Eddie Brock were both knocked unconscious and were subsequently returned to the Vault, where they were incarcerated. Since then, Venom has gone through many changes. After years of combating, Venom reached an understanding with Spider-Man.After dealing a truce with Spider-Man and relocating to San Francisco, Venom was recruited via an ultimatum by the government to be a special operations counter-terrorist agent. Venom agreed, but one stipulation of the deal did not sit too well with him. A bomb was planted in his chest to assure complete and utter obedience. After a few missions, Venom became tired of the situation and had the symbiote perform surgery on him and extracted the bomb. A brouhaha ensued wherein the end result was Eddie Brock lying unconscious and the symbiote \"dead,\" only to return later on and re-join with Eddie. Thus Venom was whole again and looking to square things with Spider-Man once again. He had lost his memory and no longer knew the secret identity of Spider-Man, but knew that a deep seated hatred resided within him for the Web-Head.Shortly after the reunion, Venom joined the Sinister Six for a brief period in order to get at Spider-Man. After being scorned by the group, he hunted down certain members of the team for revenge (including Electro, Sandman, and Kraven). Later Eddie Brock approached his ex-wife Anne Weying, and at the thought of having the symbiote back in her life, she jumped out of her apartment window and killed herself. Venom blamed Spider-Man, whom he had a skirmish with right before Anne died. Thus the hatred for the old Web-Head was fueled anew.After an extended period of inactivity, Venom resurfaced with cancer, and the only thing keeping him alive was the symbiote, who did not want him anymore. After seeing a spiritual movie, Eddie decided to sell his symbiote off in an auction, swearing off his life of vigilantism. The winner of the auction was the gang lord Don Fortunato. He gave the symbiote to his son, Angelo, in hopes that Angelo would finally make a name for himself. The symbiote eventually left Angelo to die in mid-air. The symbiote passed on to the Scorpion Mac Gargan. Brock was discovered after making an attempt to kill himself, and was hospitalized.For others who have used the alias \"Venom\", please see Venom (disambiguation).", 
            "durability": 5, 
            "education": "College educated (journalism major)", 
            "energy": 3, 
            "eyes": "Blue\n", 
            "fighting": 4, 
            "firstappearance": "Amazing Spider-man #299 (cameo, 1988), Amazing Spider-man #300 (full, 1988)\n", 
            "groupaffiliation": [
                "None", 
                "formerly Sinister Six"
            ], 
            "hair": "Reddish blond\n", 
            "height": 75, 
            "id": "Brock,_Eddie", 
            "identity": "Known to legal authorities", 
            "intelligence": 4, 
            "knownrelatives": "Carl Brock (father), Jamie Brock (mother), Anne Weying (She-Venom, ex-wife, deceased)", 
            "occupation": [
                "Vigilante", 
                "former journalist for the Daily Globe", 
                "and government operative"
            ], 
            "origin": [
                "Secret Wars #8 (as the Symbiote", 
                "1984)", 
                "Amazing Spider-Man #258 (as Venom", 
                "1988)", 
                "Amazing Spider-Man #300 (as Brock", 
                "1988)", 
                "Amazing Spider-Man #569 (as Anti-Venom", 
                "2008)"
            ], 
            "placeofbirth": [
                "New York City", 
                "New York"
            ], 
            "powers": "Previously, the alien costume, which had grafted itself to the nervous system of Eddie Brock, somehow absorbed the powers of Spider-Man during its brief symbiotic relationship with him. These powers were transferred to Brock, so long as he wore the costume. At his peak, Brock had conditioned himself to lift (press) almost 700 lbs before he came into contact with the costume. Now, in his cancer-ridden body, he possesses minimal strength. Once he merged with the costume, in his prime he was able to lift (press) almost 11 tons. The alien costume also replicated Spider-Man's ability to cling to walls by controlling the flux of inter-atomic attraction between molecular boundary layers.\nAs Venom, Brock could also shoot strands of the alien's substance in the form of webbing at high pressure up to a distance of 70 feet. The alien's substance seems to be composed of tough, flexible fibers of organic polymers, which regenerate swiftly after shedding. The strands have extraordinary adhesive properties, which diminish rapidly once they abandon their living source. After about three hours, with no source to nourish them, the strands dry up like dead skin and dissolve into a powder. The strands possess a tensile strength of 125 pounds per square millimeter of cross section. Venom also possessed an extrasensory ability similar to Spider-Man's spider-sense. This response is not as complicated as Spider-Man's inherent sense since the alien costume can detect danger from every direction and conduct Brock in plenty of time. It is not as efficient as Spider-Man's spider-sense because it takes longer to communicate the danger, and Brock's reflexes are not as fast as Spider-Man’s, even though they are enhanced by the alien costume.\nWhen distributed at a typical thickness over Brock's body, the symbiote was capable of absorbing bullets from small-arms weapons firing conventional ammunition. The symbiote is however particularly vulnerable to both sonic and heat-based attacks.\n\nAlso the symbiote has the power to blend in with the background.", 
            "realname": "Edward Charles Brock", 
            "speed": 3, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 260
        }
    }
}