{
    "aliases": [
        "Houngan Supreme", 
        "Lord of the Loa", 
        "He-Who-Has-Died-Twice", 
        "Voodoo Lord", 
        "Master of All Reptiles", 
        "the Voudoun", 
        "and the Spirit World"
    ], 
    "citizenship": "Haiti", 
    "content": "In the modern era, Jericho Drumm grew up in an environment immersed in the occult. While his brother Daniel embraced the local Voodoo (or Voudoun) legends, Jericho rejected this as superstitious nonsense. He eventually journeyed to the U.S.A. and became a prosperous psychologist. Twelve years after leaving Haiti, he was summoned back home to see his dying brother, who had been struck down by a Zobop (a false god) claiming to be Damballah, the Snake Spirit of Voodoo lore; in reality, this Damballah was a man possessed by the demon spawn of the Elder God Set, also named Damballah. Daniel asked his brother to study under Papa Jambo as he had done and become the new Brother Voodoo, but Jericho gave in to his rage and confronted the Zobop, who nearly killed him. Papa Jambo then tutored Jericho in the ancient ways of their people, culminating in a ritual which summoned forth the Loa (or spirit) of his brother Daniel and bound it to Jericho. Confident that he had found a truly worthy heir in Jericho, Papa Jambo allowed himself to die. Jericho then confronted the false Damballah and his Council Supreme, a union of leaders of dark cults across the globe. Jericho defeated him, tearing off the wangal (amulet) that gave him his powers, causing the villain to be killed by his own serpents. The Zobop's former servant Bambu swore allegiance to Jericho, recognizing that he was truly Lord of the Loa.Brother Voodoo and Bambu took up residence in a mansion near Louisiana's French Quarter. Jericho was soon called back to Haiti to battle Baron Samedi, who had worked with Advanced Idea Mechanics (A.I.M.) to create pseudo-zombies called Zuvembies. The majority of the Zuvembies were innocent men and women, stolen in the dead of night while paying respects to their loved ones in local cemeteries. Unlike true zombies, Zuvembies were not actually dead. A device created by Samedi and A.I.M. drained their minds but not their souls. Samedi hoped to use the device on Brother Voodoo himself, making him the vanguard of the Zuvembi forces. Jericho, however, summoned a lizard that chewed through the device's power cable. Voodoo made short work of Samedi and restored the Zuvembies to their natural state.Soon after, Voodoo saved the life of Loralee Tate, the daughter of New Orleans chief of detectives Samuel Tate. Loralee had been targeted by worshippers of the Black Rooster, but Jericho's attempts to protect her drew the wrath of her father, who temporarily issued an arrest warrant for the hero. With the aid of local priestess Mama Limbo, Brother Voodoo tracked down the now-missing girl and rescued her from the group's leader, the Black Talon. A houngan named Dramabu later revived Papa Jambo, using him as a zombie servant in a failed bid to destroy Brother Voodoo.Jericho's activities began to attract the notice of other heroes, and he soon found himself aiding them whenever voodoo entered their lives. Trailing a malevolent Loa named Moondog, Jericho visited New York City and helped Spider-Man halt the attempted slaying of young actress Gail Paris. Brother Voodoo then traveled to Brazil to help vampire hunter Frank Drake overcome a trap laid for him by Dracula. Drake, who had been suffering through a prolonged period of self-doubt, drew inspiration from Jericho and rededicated himself to hunting Dracula after their encounter. Months later, Jericho aided the Werewolf (Jack Russell) and his empathic ally Topaz against the evil machinations of Doctor Glitternight. Jericho was able to ease Russell's tortured existence by temporarily sharing his brother Daniel's spirit with the werewolf. While Daniel inhabited Russell's body, Russell could control the Werewolf's transformations and actions. After a harrowing battle with a zombie horde, the Werewolf entered the so-called Black Egg, which housed Glitternight's power. Within the Egg, Daniel lived once more, and physically assisted the Werewolf in defeating their mutual enemy. In the end, Daniel returned to his spirit state and once more occupied a spot within his brother's soul.Aided by the Thing, Jericho later uncovered a plot to kidnap prominent members of the black community. Entering a small African nation bordering Uganda, Jericho encountered the Voodoo priest W'Sulli, who had enslaved a vampire and transformed it into a form of zombie. W'Sulli was working with Dr. Kinji Obatu, who sought revenge against those who had wronged him. Jericho and the Thing defeated Obatu and W'Sulli, rescuing several notable celebrities, including the Black Panther. Jericho later tried to increase his own power through his enemy Damballah's wangal, and was possessed by the Set-spawn Damballah, but Dr. Strange freed Jericho and re-imprisoned the demon within the wangal. When the Grandmaster challenged Death to a Contest of Champions, Brother Voodoo found himself a part of the proceedings. He joined the hero Moon Knight against the Grand Bois, a terrorist who had been raising zombies in Haiti. Brother Voodoo was later ambushed in Haiti by agents of Doctor Friday, who used the Zhambi Concombre potion to place Jericho in a mindless, tractable, zombie-like state, intending to use him as a pawn. Jericho escaped and fought off the drug with the help of Moon Knight, and the two brought down Friday and his alliance with mobster Brutale.Earth's Sorcerer Supreme Dr. Strange secured Jericho's aid when Marie Laveau sought to revive the world's vampires; during this time, Bambu sacrificed his life to save Morganna Blessing, and his spirit played an unwilling role in resurrecting the vampire Varnae. Following this, Loralee spurned a desperately lonely Jericho, who had Daniel's spirit possess her so that she would love him. Finally overcome with guilt, Jericho removed Daniel, and Loralee left him. Seeking to regain his focus, Jericho wrote a book, Do You Voodoo, I Do!, and went on a tour promoting it, sometimes resorting to publicity stunts such as hiring an actress to play his alleged partner, \"Sister Voodoo\" (not to mention her son, \"Voodoo Chile\").For a time, Jericho abandoned the Brother Voodoo identity because he had \"given up on brotherhood.\" Jericho investigated the zombie Nathaniel \"Nat\" Mare, whom Ellery Snow was using to avenge Mare's decades-old murder. Jericho also worked with Dracula's daughter, Lilith, helping her control her raging bloodlust while hunting vampires and other undead beings. The duo fought alongside the Ghost Rider against the Scarecrow. Back in New Orleans, Jericho united with the vampire hunter Blade to defeat an alliance between Marie Laveau and Deacon Frost, and Jericho turned the true Damballah against Laveau.", 
    "durability": 4, 
    "education": "M.D. in Psychology, extensive voodoo training", 
    "energy": 7, 
    "eyes": "Brown\n", 
    "fighting": 4, 
    "firstappearance": "Strange Tales #169 (1973)\n", 
    "groupaffiliation": "Formerly Heroes for Hire", 
    "hair": "Brown and white\n", 
    "height": 72, 
    "id": "Brother_Voodoo_(Jericho_Drumm)", 
    "identity": "Publicly known", 
    "intelligence": 5, 
    "knownrelatives": "Daniel (brother, deceased); Collette (niece)", 
    "occupation": [
        "Houngan", 
        "psychologist"
    ], 
    "placeofbirth": [
        "Port-au-Prince", 
        "Haiti"
    ], 
    "powers": "By tapping the power of the Loa, Brother Voodoo can create smoke, usually accompanied by voodoo drums; he can control but not create flame, to which he is immune. He can command living things, with lesser control over people and greatest control over animals such as snakes, dogs, birds, frogs and alligators; even plants will obey him to their limited ability. He can summon the spirit of his brother Daniel, boosting his own physical strength. He can also send Daniel forth to possess and control other bodies.", 
    "realname": "Jericho Drumm", 
    "speed": 3, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 220
}