{
    "aliases": [
        "The Galactic Warrior", 
        "\"Loverbug\""
    ], 
    "citizenship": "Kaliklak", 
    "content": "Back home in the Microverse via the Pit, Bug traveled to Spartak. When Baron Karza's fleet attacked, Bug made a daring move causing an explosion launched Bug into hyperspace, where he crash landed on his home planet. Feared dead, Bug survived and discovered his old gang had been corrupted by his father, Wartstaff. Reunited with his lover, Jasmine, they ejected Wartstaff and launched a surprise attack against the colonial governor at the Central Nest. Bug was victorious, but his father was shot down. Unbeknownst to Bug, Rann had become one with the Enigma Force (the power behind the Microverse) and defeated Baron Karza. Bug and Jasmine returned to Homeworld for the victory celebration.Bug and the Micronauts traveled again to Earth, pursued by Argon's mercenaries. The evil Dr. Nemesis shrank Bug, Marionette and Acroyear back to the Microverse, where they aided the rebellion against Argon. The Baron physically emerged from the husk of Argon, where he had been incubating. Rann returned to Homeworld, but was powerless to defeat Baron Karza; the team fled in Rann's new ship, the Bioship, now joined by Huntarr, a living weapon. The Baron began a wave of genocide against all his enemies. While Rann meditated with Fireflyte to convince the manifestations of the Enigma Force to aid them, Bug journeyed to Prisonworld seeking allies. Frustrated by Rann's seclusion while seeking transcendence, his lover Mari began a brief affair with Bug. The team ventured to Kaliklak for help, where the planet was under attack by battle-beetles. With Jasmine's sister, Treefern, Bug ushered in the hatching of a new queen, Lyca. Though indebted, Kaliklak could offer no aid, a war against the beetles being their first priority. Bug and his team joined forces with the X-Men to aid Baron Karza against the Entity, an evil psychic manifestation of Professor X threatening the Microverse; Baron Karza eventually lost his arsenals and his armies to the Entity. On Homeworld, Baron Karza executed all save those he transformed into monstrous Unmen in the Body Banks. When he faced the Enigma Force, Baron Karza chose mortality over power and immortality, since the latter would strip him of his desire for conquest. Thus, he was unable to withstand the combined might of the heroic team's final assault upon him.With Baron Karza slain and Homeworld in ruins, the team set out upon new voyages of peace into the Microverse. On the Endeavor II, with reconstructed versions of their roboids, Bug, Rann, Acroyear, Huntarr and Mari sought rest on the planet Fiame. A warpdrive malfunction sent them far beyond the known portion of the Microverse, where they discovered a Child of the Makers, a huge alien lifeform which mutated Huntarr further. Using an egg from the Child to power the ship, they encountered a friendly intelligent race called the Children of the Dreaming Star. Mari reunited with Rann, leaving Bug despondent until he met the alien shapeshifter Solitaire, who assumed a pleasing form as an Insectivorid Marionette. The two fell in love but, feeling out of place, they left for Kaliklak. However, after imagining a series of assaults on his allies, Bug flew back to them. The team discovered they were dying of radiation poisoning released by the Child of the Makers, but the alien egg hatched a creature that mutated Huntarr so he could rebuild his friends' bodies. When Devil, Homeworld's sole survivor, became distorted while trying to transport across the Microverse, the team decided to return to Homeworld. They learned Baron Karza's slaughter of Homeworld tore a wound into the planet's sentient Worldmind, causing it to go mad, spreading its pain across the Microverse and corrupting the Enigma Force. While Rann retired for a contemplative life, the egg's hatchling evolved into a being called Scion who aided the team's return to Homeworld. Bug and the other Micronauts ultimately sacrificed themselves, their bodies and spirits re-seeding Homeworld with life and ending the pain of the maddened Worldmind, though he was saddened that Solitaire had refused to join him.However, this was not the end of Bug. A reborn Baron joined the mad titan Thanos in a plot to destroy all \"subatomic\" realms. Restored in the process, Bug, Rann, and Mari teamed with Earth's X-Men against the villains, and in the ensuing struggle all \"sub-atomic\" realms were merged into a single reality. Soon after, Bug, Rann, and Mari helped Earth's Cable, Domino, and Garrison Kane rescue Copycat from Psycho-Man. Joined by Dexam, a cybernetic victim of the Body Banks, Bug opposed Baron Zebek - a new tyrant from Aegyptus patterning himself after Baron Karza - in Tropica's city Antica. Baron Zebek was defeated with the aid of Alpha Flight, having arrived from Earth via the Prometheus Pit. Following the Negative Zone's Annihilus in jaunts through Earth space and time, Bug witnessed many key moments in the early years of the Heroic Age. Calling themselves the Microns, Bug, Rann, and Mari also helped Captain Marvel (Genis-Vell) search for Drax in the Microverse. They discovered Dexam had betrayed them to Visalia of K'ai, and later fought Psycho-Man and Captain Marvel's evil twin, the alternate future clone Fredd.", 
    "durability": 3, 
    "education": "Personal training by a master thief", 
    "energy": 4, 
    "eyes": "Yellow\n", 
    "fighting": 4, 
    "firstappearance": "Micronauts #1 (1978)\n", 
    "groupaffiliation": [
        "Guardians of the Galaxy", 
        "formerly Microns", 
        "Micronauts"
    ], 
    "hair": "Dark green\n", 
    "height": 0, 
    "id": "Bug", 
    "identity": "No dual identity", 
    "intelligence": 3, 
    "knownrelatives": "Wartstaff (father, deceased), Queen Esmera (mother, deceased)", 
    "occupation": [
        "Adventurer", 
        "master thief"
    ], 
    "origin": "None", 
    "placeofbirth": [
        "Planet Kaliklak", 
        "Microverse"
    ], 
    "powers": "Bug can cling to walls and has exceptional agility. He has extraordinary sight, with enhanced\nperipheral vision gained by wearing his helmet. His antennae enable communication with others bearing antennae, and provide heightened sensory awareness with a limited degree of danger sense.", 
    "realname": "Unpronounceable by humans", 
    "significantissues": "See the OHotMU Online Bibliography", 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 163
}