{
    "add": {
        "doc": {
            "aliases": "Benjamin Poindexter", 
            "citizenship": "U.S.A.", 
            "content": "Once, he was captured and interrogated in a highly secured U.S. prison, and he related many details about his early life, such as the time his brother set fire to their home in an attempt to kill their father. However, much of this information is suspect, as Bullseye then escaped, taunting his interrogators that much of what he said was false-- especially the fact that it was not his brother who set fire to the house, it was himself. Bullseye proceeded to set fire to the prison, where his father was also held, and he left his father to die once more. (In a previous account of his childhood, he painted a bullseye on the forehead of his abusive father when he was passed out from drinking and shot him.)According to Bullseye himself, he grew bored and annoyed pitching a no-hitter, so, for the last pitch of the game, he threw the ball at the batter, killing him. Instead, Bullseye found his true calling as a special operative of the United States National Security Agency and, from there, a freelance assassin-- a perfect career for someone who got so much pleasure from killing his enemies. He created his signature modus operandi of using thrown weapons during one of his first outings as a soldier-- a guerilla fighter got the drop on him, and Bullseye’s weapon failed to shoot. He threw the gun instead, killing his assailant with his bayonet.His early endeavors included time in Africa and Nicaragua, coming into conflict with the Punisher, and working alongside fellow mercenary Deadpool.Bullseye first came to notoriety with a series of extortion attempts and murder in New York City, publicizing his antics by agreeing to an interview with The Daily Bugle. Bullseye fought and defeated Daredevil’s attempt to stop him, although the hero soon tracked him down and prevented Bullseye's extortion schemes.Bullseye was then hired to murder the lawyer Matt Murdock, Daredevil's secret identity, but was defeated by Daredevil. In his own mind, Bullseye believed his formidable reputation was ruined, and he swore vengeance, fighting Daredevil at any opportunity in a personal vendetta that led him to hold a TV studio hostage, to kidnap the Black Widow, or simply by tracking him down. Each time, he was captured and given over to the police by Daredevil. At one point, Bullseye was declared insane due to a brain tumor, and he began hallucinating, seeing random people were actually Daredevil, and tried killing them all. The true Daredevil managed to defeat him, and the tumor was removed.At one point, Daredevil left New York for a prolonged period, and Bullseye put on the Daredevil costume himself. He gleefully played the part of a hero while robbing the rich and giving to the poor. However, never a man quite sane, Bullseye began to believe himself to be the true Daredevil, and Matt Murdock adopted the Bullseye’s costume to confront him. Murdock won, and the defeat allowed Bullseye to return to his senses (relatively speaking, of course.)Bullseye performed several jobs for the Kingpin while also pursuing several other mercenary contacts. One such contract brought him into conflict with the Punisher on behalf of Rosalie Carbone. Hired by Mysterio to kidnap a baby from Saint Maggie’s Church, Bullseye killed Karen Page, further earning the vengeance of Daredevil. When the news of Daredevil’s secret identity leaked to the media, Bullseye hoped to capitalize on the information and kill Daredevil both for his own satisfaction and to help the Kingpin’s struggling criminal empire. He targeted Murdock and his new girlfriend, Millie Donovan, but Daredevil snapped, beating Bullseye to a pulp and carving a bullseye pattern onto his forehead with a rock. Bullseye has a compulsive need to study his targets' histories, abilities, and relationships before engaging them. As a result, he can anticipate his opponent's every move. This compulsion however, often crosses from the professional into the personal, such as Bullseye's obsession with Elektra.", 
            "durability": 2, 
            "education": "Unrevealed (education beyond high school unlikely)", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "Daredevil #131 (1976)\n", 
            "groupaffiliation": [
                "Formerly Avengers (Osborn's team)", 
                "Thunderbolts", 
                "allied with Eric Slaughter's and the Kingpin's criminal organizations", 
                "as well as the Kingpin's rival former agents"
            ], 
            "hair": "Blonde\n", 
            "height": 72, 
            "id": "Bullseye", 
            "identity": "Secret", 
            "intelligence": 2, 
            "knownrelatives": "Unnamed father (deceased) and mother", 
            "occupation": [
                "Government operative", 
                "former freelance assassin", 
                "professional thief", 
                "Major League Baseball pitcher", 
                "mercenary", 
                "extortionist"
            ], 
            "origin": "Bullseye: Greatest Hits #1", 
            "placeofbirth": "Unrevealed", 
            "powers": "None", 
            "realname": "Lester (last name unrevealed)", 
            "significantissues": [
                "Fought and killed Elektra (Daredevil  #181,1982)", 
                "Killed Karen Page (Daredevil #5, 1999)"
            ], 
            "speed": 2, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 175
        }
    }
}