{
    "aliases": [
        "Formerly Soldier X", 
        "Nathan Winters", 
        "Nathan Dayspring Askani'Son"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Cable formed the mercenary group the Wild Pack, later the Six Pack, and took missions from Tolliver, secretly Tyler, which often put them in conflict with Stryfe and his Mutant Liberation Front. Cable made occasional trips back to Earth-4935, at one point returning with a space station he named Graymalkin, after the address of Xavier's mansion. Returning to Earth-4935, Cable discovered that Sam Guthrie, the New Mutant Cannonball, existed into the 23rd century. Cable believed Sam was an immortal mutant, and returned to the present to guide Sam's ascension. With the aid of his mercenary ally and sometime lover Domino, Cable reorganized the New Mutants into the strike team X-Force. Later, Cable's former Six Pack teammate Kane was critically injured in a failed attempt to oppose Stryfe. To save his life, Cable transported Kane to Earth-4935, where he was saved and stayed with the Clan Chosen to recuperate, while Cable returned to the present. During his absence, Stryfe had made an attempt on Xavier's life and sought to frame Cable for the deed. Believing himself the true son of Cyclops, Stryfe kidnapped Cyclops and Jean. Cable came to their rescue, but during the struggle both he and Stryfe fell into a temporal rift. Displaced far into the future, scientists of that time saved Cable's life by using Stryfe's brainwaves. Cable and Kane later returned to the present, but upon arrival Cable discovered that Graymalkin had been destroyed, preventing him from returning home. Stryfe's mind eventually took control of Cable's body, but after being confronted with the truth of his existence he relinquished that control.", 
    "durability": 6, 
    "education": "Extensive Askani training, Law Diploma", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 7, 
    "firstappearance": "(As Nathan Summers) Uncanny X-Men #201 (1986); (as Cable) New Mutants #87 (1990)\n", 
    "groupaffiliation": [
        "Formerly X-Men", 
        "Secret Avengers", 
        "X-Force", 
        "Underground", 
        "The Twelve", 
        "New Mutants", 
        "Six Pack", 
        "Clan Chosen", 
        "Clan Askani"
    ], 
    "hair": "White (formerly Brown)\n", 
    "height": 80, 
    "id": "Cable", 
    "identity": "Secret", 
    "intelligence": 7, 
    "knownrelatives": "Philip Summers (great-grandfather), Deborah Summers (great-grandmother), Christopher Summers (Corsair, grandfather, deceased), Katherine Anne Summers (grandmother, deceased), Scott Summers (Cyclops/Slym Dayspring, father), Madelyne Pryor-Summers (mother, deceased), Jean Grey-Summers (Phoenix/Redd Dayspring, stepmother), Alexander Summers (Havok, uncle), Gabriel Summers (Vulcan, uncle), Adam-X (X-Treme, alleged uncle), John Grey (step-great-grandfather, deceased), Elaine Grey (step-great-grandmother, deceased), Sara Bailey (step-aunt, deceased), Gailyn Bailey (step-cousin), Joey Bailey (step-cousin), Aliya Jenskot (wife, deceased), Hope (sister-in-law), Tyler Dayspring (Genesis, son, deceased), Stryfe (clone, deceased), Rachel Grey (Marvel Girl, alternate universe half-sister), Nathan Grey (X-Man, alternate universe half-brother), numerous alternate Earth relations", 
    "occupation": [
        "Adventurer", 
        "former mercenary", 
        "government agent", 
        "freedom fighter"
    ], 
    "origin": [
        "X-Factor #67 (1991)", 
        "Cable #7-8 (1994)", 
        "Adventures of Cyclops & Phoenix #1-4 (1994)", 
        "Askani'Son #1-4 (1996)"
    ], 
    "placeofbirth": [
        "Salem Center", 
        "Westchester County", 
        "New York"
    ], 
    "powers": "Cable possesses vast psychic power, most often manifested in the forms of telepathy and telekinesis.  His telepathy has proven great enough in power and scope as to allow him to read thoughts across vast distances, and even interface with multiple minds, simultaneously.  While the full limits of his mental abilities in this area have yet to be disclosed, Cable has also demonstrated the ability to project bolts or blasts of mental energy that are capable of easily killing or rendering unconscious another Human being.  These bolts do not do physical damage.  Cable has also demonstrated mastery of astral projection, and is able to remain on his own plane of existence, or to traverse into any of the so-called \"Astral Planes\", very much like Professor X.  \nTelekinetically, Cable is capable of very fine control over objects; he can disassemble complex devices explosively (separating every last component, such as screws, nuts, circuit boards, etc.), and just as quickly and easily assemble complex devices.  This also has enabled him to even attain awareness and control over objects as small as individual electrons in an atom.  For instance, Cable could detect if a seal was hermetic, or not, by checking for the presence of penetrating oxygen molecules.  He could even detect and discern individual oxygen molecules, and determine the atomic weight of molecules, by the amount of atoms present. Cable has also demonstrated the ability to alter molecular and atomic structures in such substances as his own techno-organic components (though this may be a function of telekinesis, as opposed to a discreet superhuman power).   \nOn larger levels, Cable can levitate great weights, into the tons, but his upper limit has remained undisclosed.  This is possible that he doesn’t know his own limits, but it is unlikely, due to his intense commitment to training; more likely, Cable chooses not to disclose the full extent of his abilities, as he knows this is data that could be utilized against him, by opponents or even former allies.  Cable has also been seen creating protective force fields around himself and others through the use of his telekinetic powers.  The upper limits of this ability remain unknown, but it is believed that he could probably protect himself from harm at the ground zero detonation of a 1 kiloton nuclear warhead (4.18 terajoules of energy from the heat, concussion and radiation effects).  It is possible that this may not be his upper limit, and may also be an indicator of the limits of his ability to lift large weights telekinetically.  Cable has also displayed such control over the fields as to shape them precisely, even to conform very closely to his body’s form.  There does not appear to be any correlation between field strength and the thickness of the telekinetic fields.  Originally, Cable was telekinetically preoccupied by using his power to inhibit the progression of his body’s techno-organic virus throughout his body, and this was a process that required constant attention.  With the solution to this problem through his merger with a techno-organic embryo, however, this function is no longer necessary, leaving him totally free to concentrate his telekinetic powers on other things.  \nHe has displayed the ability to control the minds and even voluntary and involuntary bodily functions of sentient beings (such as other Humans) \nCable has proven very difficulty to psychically assail, as he is very well skilled in shielding his own mind from mental-attacks (such as attempts to read, control or harm his own mind), and has been sufficient to protect himself from other psychics on the level of Phoenix (Jean Grey), Professor X and Marvel Girl (Rachel Grey).\nMuch of Cable’s body has been infiltrated and altered by the techno-organic virus, which has taken the form of cybernetics and bionics, meaning he is a cyborg.  The primary infection resides in Cable’s left side.  As a consequence of his telekinetic guidance and his ability to control his own physical substance, Cable’s entire body has been heavily fortified, down to the cellular level, rendering superhuman strength to an unknown degree, as well as a superhuman level of resistance to physical harm.  While he was injured in combat with the Hulk, the injuries were not nearly as severe as they should’ve been, especially in light of the fact that he was suffering from the effects of his techno-organic virus getting out of control.  His entire skeletal structure has been replaced by porous, marrow-filled organic metalloid bone replacements that do not interfere with the creation of erythrocytes (red blood cells).  \nCable possesses superhuman physical endurance, just as he does superhuman levels of mental endurance.  He is capable of exerting himself at peak levels (fighting full-out, sprinting, etc.) for several hours, before fatigue begins to visibly impair his performance.  He is also capable of going extended periods of time without sleep, being fully capable of fully resting with not much over an hour of sleep.  However, whenever both possible and feasible, Cable still chooses to sleep for hours at a time (approximately 6 – 8), in order to dream.  This high endurance has had other effects on his body, making even his soft tissues extremely durable, and more than up to the task of rendering him virtually immune to conventional firearms and conventional firearm munitions.  \nHis entire CNS (Central Nervous System) has been augmented by chemical changes down to the atomic level and by biocomputer enhancement, rendering his reaction time far above what is possible for a Human being.  In spite of his great size and impressive build, Cable is literally fast enough to evade high-powered bullets in-flight (after they have been fired), and even has the ability to visually track rounds after they’ve been fired (though they are not easy to see, except through his cybernetic eye).  This great speed is also visible in superhuman levels of dexterity and agility, including manual and pedal dexterity.  Spotting the speedster Super-Saber running at superhuman speed, Cable was actually able to physically attack and stop him.  Super-Saber, himself, was fast enough to create “sonic booms” by snapping his fingers, and also had superhumanly high reaction time.  However, in spite of his obviously great speed, he is still not as fast as other paranormals like Spider-Man and Daredevil.\nAmong his many cybernetic functions, Cable possesses a cybernetic left eye.  This eye permits Cable to see deep into the EM (Electro-Magnetic) spectrum, and far deeper than any known 20th – 21st century technologies are capable of.  It is also possible that through this eye, Cable is able to see the deployment of psionic energies, as well as the less exotic spectra of electromagnetic energies.\nHis left arm is completely mechanical, and while Cable is ambidextrous, is his stronger arm, probably capable of allowing him to curl and deadlift several tons, without assistance from his right arm.  His right arm is also cybernetic, but far less so.\nThrough a combination of his telekinetic abilities, and his ability to rearrange the atomic structures of matter (including his own techno-organic matter), Cable is able to rapidly repair any damaged components within his body.  However, if there is widespread damage, this may not be possible, as he may be unable to muster the energy to affect these repairs.  When he was attacked by Magneto, and virtually every component in the left side of his body was damaged or destroyed, Cable was left unable to repair enough systems to save his own life, and required outside assistance.  It is through these abilities that the physical appearance of his cybernetic components has changed, over the passage of time, as well.  At times, they have been articulated, smooth artificial limbs, while at others they have been observed to grow razor-sharp blades on command, as well as retract them.  Cable is also able to rapidly redesign and improve his cybernetic and bionic components, thus.  On-the-spot improvisations has allowed him to create a variety of microcomputers in his totally mechanized left arm that do such things as allow him to physically interface with exterior computers, uplink/download to computers he has hidden across the world and in space (such as those he had on Graymalkin), and even permit cellular communications and high-speed, broadband, wireless Internet access.\n\nCable possesses an intellect that may be on par with that of Reed Richards, which may be superhuman.  He is also in possession of an education provided by the Clan Askani, which is far in advance of 20th – 21st century Earth-616 conventional education, especially in the sciences.", 
    "realname": "Nathan Christopher Charles Summers", 
    "significantissues": [
        "Wife killed, son captured (Cable #1, 1993)", 
        "first returned to present (Cable #-1, 1997)", 
        "first met Wolverine (Wolverine/Cable: Guts and Glory, 1999)", 
        "reorganized New Mutants into X-Force (New Mutants #100/X-Force #1, 1991)", 
        "rescued Cyclops & Jean from Stryfe (X-Force #18, 1993)", 
        "reunited with father (Cable #8, 1994)", 
        "gathered as one of the Twelve, vs Apocalypse (Cable #74-75, 1999-2000)", 
        "seemingly destroyed Apocalypse in present (X-Men: Search For Cyclops #4, 2001)", 
        "formed Underground, vs Weapon X (Weapon X #6-13, 2003)", 
        "sought to save world, vs S.H.I.E.L.D., X-Men & Silver Surfer, lobotomized, merged with TO embryo, powers restored (Cable & Deadpool #7-12, 2004-2005)", 
        "reformed X-Force, vs Skornn, essence scattered (X-Force #1-6, 2004-2005)", 
        "essence collected & restored (Cable & Deadpool #15-18, 2005)"
    ], 
    "speed": 5, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 350
}