{
    "add": {
        "doc": {
            "aliases": [
                "Power Man", 
                "Mark Lucas", 
                "Hero for Hire", 
                "Ace of Spades", 
                "others"
            ], 
            "citizenship": [
                "U.S.A.", 
                "criminal record", 
                "later acquitted"
            ], 
            "content": "In prison, Lucas was consumed by rage over Stryker's betrayal and his father's supposed death, engaging in frequent brawls and escape attempts. Eventually transferred to Seagate Prison off the coast of Georgia, he became the favorite target of sadistic guard Albert \"Billy Bob\" Rackham, whose brutality ultimately led to a demotion that he blamed on Lucas. Later, research scientist Dr. Noah Burstein recruited Lucas as a volunteer for experimental cell regeneration based on a variant of the Super-Soldier process he had previously used to empower Warhawk. Burstein immersed Lucas in an electrical field conducted by an organic chemical compound; when he left Lucas unattended, Rackham misused the experiment's controls, hoping to maim or kill Lucas. Lucas's treatment was accelerated past its intent, inducing body-wide enhancement that gave him superhuman strength and durability. He used his new power to escape Seagate and made his way back to New York, where a chance encounter with criminals inspired him to use his new powers for profit.Adopting the alias Luke Cage and donning a distinctive costume, he launched a career as a Hero for Hire, helping anyone who could meet his price. He soon established an office in Times Square's Gem Theater, where he befriended film student D.W. Griffith. Burstein, aware of his friend's innocence, also relocated to New York and opened a medical clinic, assisted by Dr. Claire Temple, whom Cage began dating. Although Cage would have been content to battle strictly conventional criminals, he soon learned that New York was hardly the place to do so. Stryker himself had become a Maggia agent as Diamondback and died battling Cage. Subsequent opponents included Gideon Mace, an embittered veteran seeking a U.S. takeover who would become a frequent foe; Chemistro (Curtis Carr), whose Alchemy Gun would be a weapon later used by others, including his own brother after Curtis reformed; and Discus, Stiletto, Shades, and Commanche, all criminals with ties to Cage's prison days who would face him repeatedly over the years.Although Cage seemed to have little in common with most of New York's other superhumans, an ill-conceived attempt to collect a fee from a reneging Doctor Doom led him to befriend the Fantastic Four. He was subsequently hired by Daily Bugle publisher J. Jonah Jameson to capture Spider-Man, the wisecracking adventurer who doubled as Jameson's personal demon, but Cage came to sympathize with Spider-Man and forcibly returned Jameson's deposit, earning a place on the publisher's lengthy list of superhuman personas non grata. Cage also befriended Jessica Jones, a.k.a. Jewel, a young woman whose super-strength and unconventional style matched his own. During a mission in which Orville Smythe duped him into stealing an experimental starsuit from Stark International, Cage followed the example of his new peers and took the codename of Power Man.Shortly afterward, Cage began associating with the loose-knit super-team known as the Defenders, alongside whom he fought the super-strong Wrecking Crew and the racist subversives known as the Sons of the Serpent. When the Thing temporarily lost his superhuman powers, Cage was hired to replace him in the Fantastic Four, but his tenure proved brief after the Puppet Master took control of him to fight his new teammates. Meanwhile, Cage continued in solo action against an odd assortment of villains, including the maddened professional wrestler X the Marvel, the uninspired Maggia agent Mister Fish, mobsters Dontrell \"Cockroach\" Hamilton and Ray \"Piranha\" Jones, the racist Wildfire, the vengeance-seeking Mangler and Spear (whose brother had died under Dr. Burstein's treatment), rival crimelords Baron and Big Brother, the obsessive Goldbug, and Zzzax the Living Dynamo.Called to assist the Defenders against the Plantman, Cage began to complain that his participation in their group was interfering with his paying work. Wealthy Defenders member Nighthawk solved this problem by placing Cage on retainer, giving Luke a steady paycheck for his Defenders activities. For some time thereafter, Cage served as a core member of the Defenders alongside the likes of Doctor Strange, the Hulk, Brunnhilde the Valkyrie, Nighthawk and the Red Guardian (Dr. Tania Belinskya). Together, they defeated minor threats including the Eel and the Porcupine, and major menaces such as the Headmen, Nebulon, Egghead's Emissaries Of Evil and the Red Rajah; but Cage felt out of place in the often-bizarre exploits of the Defenders and eventually resigned. He believed he was unsuited to teamwork, little realizing how wrong he would be proven months later.Cage and Iron Fist achieved great success with Heroes for Hire, earning an international reputation and fighting a wide variety of criminals, including the genius Nightshade, the international crimelord Montenegro, Sabretooth and the Constrictor, Warhawk, and the druglord Goldeneye. They had several struggles involving the nations of Halwan and Murkatesh, including incarnations of Scimitar and the Black Tiger. They occasionally worked alongside fellow street-level heroes such as Spider-Man, Daredevil and Moon Knight, but rarely participated in the larger-scale crises that occupied the likes of the FF and the Avengers; however, their adventures took occasional turns toward the extraterrestrial or the extra-dimensional, areas which held little appeal for the down-to-earth Cage. Their partnership's downfall began when the mysterious government agency S.M.I.L.E. manipulated Cage and Iron Fist into the employment of Consolidated Conglomerates, Inc.; during their first CCI assignment, Iron Fist contracted radiation poisoning. Cage took him to K'un-Lun for treatment. While there, Iron Fist was, unknown to Cage, replaced by a doppelganger of the plantlike H'ylthri race, K'un-Lun's ancient enemies. Soon after their return to the outside world, the doppelganger was destroyed, pummeled by the alien Super-Skrull, as a result of a bizarre scheme engineered by Iron Fist's archenemy, Master Khan. Cage was blamed for the apparent murder of Iron Fist.A fugitive again, Cage broke contact with his New York friends and relocated to Chicago; but, with Hogarth's help, he was cleared of criminal charges when the real Iron Fist turned up alive. Wanting a new start, Cage abandoned his Power Man guise and began operating out of Chicago as the plainclothes Luke Cage, Hero for Hire; he made arrangements with the Chicago Spectator for exclusive reports of his adventures and frequently worked with detective Dakota North. He soon attracted the interest of the refined assassin Hardcore, an employee of Cruz Bushmaster, son of the very villain whose defeat had cleared Cage's name the first time. Cage learned that Cruz, following in his father's extortion footsteps, had abducted Noah Burstein's wife Emma to force the scientist to re-create the process that had empowered Cage, regardless of how many test subjects suffered in the process. Cruz underwent the procedure himself, but the elder Bushmaster drained the power from his son, reversing his near-catatonia and declaring himself the Power Master; however, Cage teamed with Iron Fist to thwart their plans, freeing the Bursteins while the Bushmasters apparently perished.While Cage tried to locate his surviving family members with the aid of Dakota North, his brother kept moving his father around to keep Cage away from them. James, Jr. was eventually recruited by the criminal Corporation, whose power-enhancing scientist Doctor Karl Malus mutated him into the superhuman Coldfire. As Coldfire, James, Jr. hoped to be a match for his super-powerful brother, whom he regarded as a threat, and he used his hatred of Cage as a focus for his energy powers. Though James, Jr. worked with the Corporation quite willingly, Malus had James, Sr. held hostage as extra insurance of Coldfire's cooperation. When Cage learned the Corporation was apparently holding his family, he invaded their headquarters and battled Coldfire; however, the brothers ultimately joined forces to rescue their father from Malus, and Coldfire apparently sacrificed himself to destroy the Corporation's headquarters.A few months later, Cage investigated the murder of Harmony Young and fought her killer, the demon Darklove, alongside Ghost Rider. Not long afterward, the mystic Doctor Druid recruited Cage to serve in his Secret Defenders against the sorcerer Malachi. Cage returned to New York and, deciding his heart was no longer in superheroics, became co-owner of the Gem Theater with his friend D.W. Griffith. Even an invitation from Iron Fist to join a new and expanded Heroes for Hire failed to interest him; yet when the would-be world conqueror called the Master tried to recruit Cage as a spy within Iron Fist's team, destroying Cage's theater in the process, a curious Cage played along. Cage joined Heroes for Hire and served with them for some time while reporting to the Master. Cage himself even began to sympathize with the more benevolent aspects of the Master's goals, and the Master and Cage seemed to become genuinely fond of each other; but in the end, Cage could neither betray his best friend Iron Fist nor reconcile himself to the tremendous loss of life the Master's plans of conquest would entail, and he ultimately helped Heroes for Hire destroy the Master of the World's plans. Cage remained with the group thereafter, and dated a fellow member, the She-Hulk. When the Stark-Fujikawa corporation bought out Heroes for Hire, Cage and Ant-Man were fired because of their prison records, and the rest of the team quit in protest.After a one-night stand with a drunken Jessica Jones, now a private investigator, Cage's life was briefly thrown into disarray by Jones's reaction to the fling; but the two made peace while working as bodyguards for Matt Murdock, whose public denial of his Daredevil costumed identity cost him a bit of Cage's respect. Shortly afterward, Cage extended emotional support to Jones when she was forced to revisit past abuses by the villainous Purple Man, and Cage's feelings for her grew. When Jones revealed that she was pregnant from their tryst, she and Cage moved in together. Soon afterward, Jones became a superhuman consultant with the Daily Bugle, where Jameson's ire at Cage has by no means dwindled over the years. Cage was recently recruited into a new incarnation of the Avengers, New York's premiere super-team, and he and Jessica had daughter and got married.", 
            "durability": 5, 
            "education": "High school dropout; self-educated in many areas", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 4, 
            "firstappearance": "Hero for Hire #1 (1972)\n", 
            "groupaffiliation": [
                "Avengers", 
                "Thunderbolts", 
                "formerly Daredevil's Unnamed Super-Hero Team", 
                "Secret Defenders", 
                "Heroes for Hire", 
                "Nightwing Restorations", 
                "Fantastic Four", 
                "Defenders", 
                "Bloods"
            ], 
            "hair": "Black\n", 
            "height": 72, 
            "id": "Cage,_Luke", 
            "identity": "Publicly known", 
            "intelligence": 2, 
            "knownrelatives": "Jessica Jones (wife), Danielle Cage (daughter), James Leonard Lucas (father), Esther (mother, deceased), James Jr. (Coldfire, brother)", 
            "occupation": [
                "Adventurer", 
                "bar owner", 
                "bodyguard", 
                "mercenary", 
                "formerly theater owner", 
                "private investigator", 
                "various odd jobs"
            ], 
            "origin": "Hero for Hire #1 (1972)", 
            "placeofbirth": "New York City", 
            "powers": "Cage is superhumanly strong, able to lift/press approximately 25 tons and punch through barriers as thick as four-inch steel plate. His skin is steel-hard and his muscles and bone tissue super-dense; he can withstand conventional handgun fire at a range of four feet and cannot be cut by the sharpest of blades, although in the event of required surgery his skin can be lacerated by an overpowered medical laser. He can withstand up to one-ton impacts or blasts of 150 pounds of TNT without serious injury, and is impervious to temperature extremes and electrical shocks. His recovery time from injury or trauma is usually one-third that of an ordinary human.", 
            "realname": "Carl Lucas; legally changed to Luke Cage", 
            "significantissues": [
                "Joined Avengers (New Avengers #2, 2005)", 
                "married Jessica Jones (New Avengers Annual #1, 2006)"
            ], 
            "speed": 2, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": 425
        }
    }
}