{
    "add": {
        "doc": {
            "aliases": [
                "Pestilence", 
                "Death", 
                "Hellhound"
            ], 
            "citizenship": "U.S.A. (presumed)", 
            "content": "When Callisto captured the X-Man Angel and brought the Morlocks into conflict with the X-Men, Pryde was infected by the Morlock named Plague and found by Caliban. Caring for her, Caliban realized he could not cure her and panicked over what to do. Pryde promised to remain with him forever if he helped her and the X-Men. Unsure of what to do sought, Caliban decided to seek help from Callisto; however, Callisto refused to allow the X-Men to leave, and only after she was defeated by Storm in ritual combat were the X-Men free to go. Storm offered the Morlocks a home and sanctuary with the X-Men, but Caliban, speaking for the group, declined the offer. When Pryde failed to make good on her promise, Callisto ordered her capture and attempted to force her to marry Caliban. However, Caliban realized Pryde did not truly love him and released her from her promise. When the sorcerer Kulan Gath’s warped of reality in Manhattan, transforming it to resemble his native era (circa 10, 000 B.C.), Caliban was merged with the X-Men’s founder Charles Xavier and forced to serve as Kulan Gath’s familiar.Soon after, the Morlocks came under attack from the Marauders, who began slaughtering the community. Injured in the massacre, Caliban was saved by his fellow Morlock Leech, and together the pair were rescued from the Marauders by the combined forces of Power Pack and the original X-Factor. Caliban subsequently took up residence at X-Factor’s headquarters, briefly leaving to accompany the surviving Morlocks back underground before returning to join X-Factor in opposing the anti-mutant organization the Right. After a battle against the Horsemen of Apocalypse, Caliban became increasingly frustrated with his passive power’s inability to grant him the revenge he sought. When X-Factor subsequently encountered Apocalypse, Caliban swore to serve him as his Hellhound in exchange for power enough to exact revenge. Apocalypse genetically altered Caliban to increase his size and strength. After Caliban proved his worth against the likes of Archangel, Sabretooth, and Cable’s New Mutants, Apocalypse granted Caliban a place in his Horsemen as Death. With the Horsemen, Caliban opposed the X-Men but was defeated, unaware that the Apocalypse he and his fellow Horsemen served proved to be Mister Sinister in disguise.Separated from the influence of Apocalypse, Caliban’s intelligence began diminishing. He kidnapped the young X-Man Jubilee, holding her hostage in exchange for Sabretooth, who was being rehabilitated by Xavier. Pryde, now Shadowcat, accompanied Sabretooth into the Morlock tunnels. There, she was left to die by the villain after they encountered a giant subterranean squid. After rescuing Pryde, Caliban faced Sabretooth in a brief yet ferocious fight, which resulted in his face being scarred and he fled. Later, Caliban was hunted by the Dark Riders, Apocalypse’s replacements for the Horsemen. Saved by Cable, Domino, and Storm, Caliban helped them to track the Riders back to their base in Egypt and confront their new leader, Genesis. As his intelligence continued to degrade and he began reverting to his original, non-violent personality, Caliban was recruited by Cable into X-Force. With that team, Caliban faced opponents such as the Mimic, Barrachus the Kalinator, Sabretooth, Holocaust, the Externals, S.H.I.E.L.D., Mr. Sinister, an other-worldly foursome, the alien android Pulse, Mojo, and even Asgardian rock trolls and goblins. For a brief time, Caliban and X-Force fell under the control of Sebastian Shaw, Black King of the Hellfire Club, and were mentally coerced into attacking Cable himself.Caliban eventually began to suffer crippling seizures that seemingly had no cause. After aiding Cable against an assault on the Xavier Institute by Bastion’s Operation: Zero Tolerance forces, Caliban was taken by Ozymandias, the immortal indentured servant of Apocalypse, who revealed that the seizures were a result of Caliban’s past alteration. Returned to Apocalypse, Caliban was reshaped into the Horseman Pestilence. At Apocalypse’s behest, Caliban successfully captured both Cable and his alternate reality (Earth-295) counterpart Nate Grey. Caliban and the Horsemen were defeated during battle with X-Men when they were teleported away by Mikhail Rasputin. Subsequently, Caliban tracked down Cyclops, who had merged with Apocalypse and who was struggling to keep the eternal mutant’s essence in check. Apocalypse’s psyche became dominant, and released Caliban from his service. By that time, Caliban had once more begun reverting to his original naïve self, and his intelligence faded until he possessed only a simple animal-like mind.Caliban was subsequently captured by the anti-mutant research facility the Watchtower, which sought to train him as a means to ferret out the mutant-devouring Skornn. Caliban was liberated by the combined efforts of Cable, X-Force, Wolverine, Deadpool, and the Mutant Liberation Front, and he subsequently rejoined X-Force to help oppose the Skornn. After the advent of \"M-Day\", Caliban was one of the few mutants who regained his powers. Since then, he has joined the mutant refugee camp that have come to be known as the 198. During the Civil War, Caliban helped to organize the assault in the X-Mansion, with his teammates of the X-Force(Domino and Shatterstar), to free the 198 from the grounds.", 
            "durability": 5, 
            "education": "Unrevealed", 
            "energy": 2, 
            "eyes": "Black pupils, no apparent irises, yellow sclera\n", 
            "fighting": 3, 
            "firstappearance": "(As Caliban) Uncanny X-Men #148 (1981); (as Hellhound) X-Factor #24 (1988); (as Death) Uncanny X-Men #294 (1992); (as Pestilence) Cable #73 (1999)\n", 
            "groupaffiliation": [
                "Formerly X-Force", 
                "198", 
                "Morlocks", 
                "Watchtower", 
                "Horsemen of Apocalypse", 
                "X-Factor"
            ], 
            "hair": "None\n", 
            "height": 0, 
            "id": "Caliban", 
            "identity": "Secret", 
            "intelligence": 2, 
            "knownrelatives": "None", 
            "occupation": [
                "Adventurer", 
                "former terrorist", 
                "scavenger"
            ], 
            "origin": "Unrevealed", 
            "placeofbirth": "Unrevealed", 
            "powers": "Caliban is able to psionically sense the presence of other mutants within a 25 mile radius of himself. Originally, Caliban was able to increase his strength to superhuman levels and absorb fear-generated psionic energy from fear radiated by others, turning it against them when his adrenalin levels rose. Apocalypse’s genetic manipulation enhanced his strength, speed, stamina, durability, agility, and reflexes to superhuman levels, and allowed him to use his fear-casting powers at any time. Apocalypse subsequently altered Caliban’s powers to allow him to generate a psychoactive virus that attacks from within on the highest planes of the psyche. Having lived for many years underground, Caliban’s eyes were sensitive to even the smallest amount of light, but recently that seems to no longer be the case.", 
            "realname": "Unrevealed", 
            "significantissues": [
                "First encountered X-Men & Spider-Woman/Jessica Drew (Uncanny X-Men #148, 1981)", 
                "cared for ailing Kitty Pryde (Uncanny X-Men #169-170, 1983)", 
                "almost married Pryde (Uncanny X-Men #179, 1984)", 
                "merged with Xavier by Kulan Gath (Uncanny X-Men #190-191, 1985)", 
                "saved from Marauders by Power Pack & X-Factor (Power Pack #27/X-Factor #11, 1986)", 
                "joined X-Factor (X-Factor #17, 1987)", 
                "betrayed X-Factor, joined Apocalypse (X-Factor #24, 1988)", 
                "transformed by Apocalypse (X-Factor #50, 1990)", 
                "vs Archangel (X-Factor #53, 1990)", 
                "vs Sabretooth (New Mutants #90-91, 1990)", 
                "joined Apocalypse’s Horsemen as Death, vs X-Men (Uncanny X-Men #294/X-Factor #84/X-Force #16, 1992)", 
                "rematch with Sabretooth (Uncanny X-Men Annual #18, 1994)", 
                "with Cable, Domino & Storm, vs Dark Riders (Cable #17-19, 1994)", 
                "joined X-Force (Cable #21/X-Force #44, 1995)", 
                "began suffering seizures (X-Force #65, 1997)", 
                "returned to Apocalypse (X-Force #70/Cable #53, 1997/1998)", 
                "transformed into Pestilence, vs X-Force, captured Cable (Cable #73-74, 1999)", 
                "captured X-Man (X-Man #59-60, 2000)", 
                "released from Apocalypse’s servitude (X-Men: The Search For Cyclops #3, 2001)", 
                "rejoined X-Force, vs Skornn (X-Force #4-6, 2005)", 
                "killed by the Reavers (New X-Men #45, 2007)", 
                "revived by Eli Bard with the Technarch transmode virus (X-Force vol.3 #11, 2009)", 
                "died again (X-Force #24, 2010)"
            ], 
            "speed": 5, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 275
        }
    }
}