{
    "aliases": [
        "Guardian of Eternity", 
        "The Avenging Angel", 
        "The Hero That Could Be You"
    ], 
    "citizenship": "Not applicable", 
    "content": "A million years ago, a time traveler named Prince Wayfinder defended Earth from an invasion by evil Whirldemons. Using the cosmic power of the enigmatic Sword in the Star, Wayfinder opened an one-dimensional/temporal portal, created the Microverse to provide a new home for his people and bound the demons, preventing their entry into the Microverse. The Sword in the Star bonded with Prince Wayfinder, transforming itself into the Enigma Force with Wayfinder as its guardian. In times of distress, the Enigma Force manifests the Uni-Power, which selects a host, surrounding them with a field of energy which transforms them into the costumed Captain Universe, and imparts to them some of the knowledge they will need to yield their powers. The Uni-Power occasionally communicates with the host personally in cases where the host needs guidance, or when the Uni-Power has a specific agenda.The first known human to yield the Uni-Power was Gilbert Wiles, who became Captain Universe to help stop a plane hijacking. When the crises was over, Wiles lost the power, but was so overwhelmed by the experience that he devoted himself to studying the Uni-Power, hoping to regain it. The next known host was astronaut Ray Coffin, who had entered the Microverse through the Prometheus Pit, a portal on Earth leading to that dimension. The Time Traveler requested Coffin’s aid against the evil Baron, a Microverse tyrant who sought to conquer both dimensions, and bestowed the Captain Universe power upon him. Coffin drove the Baron from Earth, and the Prometheus Pit was sealed. Coffin then lost his powers.When the Microverse was imperiled by a merging with Earth-616’s dimension caused by the reawakened Whirldemons, Wayfinders descendent Arcturus Rann and Earth’s sorcerer supreme Dr. Strange found Wayfinder’s tomb, and the Sword in the Star empowered them both to become a merged Captain Universe. They used the Uni-Power to halt Earth’s merging with the Microverse, and were restored to their own bodies when the crises ended. When a crazed military officer named Jamie Custer attempted to launch a nuclear missile, the Uni-Power transformed Bruce Banner (Hulk) into Captain Universe. Banner’s other self, the Hulk, manifested itself as a separate entity, and its natural enmity to Banner led to a struggle between the two, but Banner finally destroyed the missile and neutralized the fallout. When the Uni-Power left Banner, he and Hulk remerged with each other.An unidentified female Captain Universe was among the heroes of Earth assembled by the Grandmaster to serve as potential participants in his game against Death, but she was not selected. Later, young student Delayne Masters became Captain Universe to save his teacher from a schoolyard bully named Willie Johnson. Although the Uni-Power left Delayne before he had beaten Willie, Delayne had gained enough confidence from the experience that he was able to defeat Willie on his own. The Uni-Power once transformed physics professor Evan Swann into Captain Universe to halt the Quantum Mechanic, an extraterrestrial who believed that the law of probability was a flaw in reality that should be corrected by breaking the Earth down into subatomic particles, Swann destroyed the Quantum Mechanic to save the Earth.Another Captain Universe was a toddler named Eddie Price, chosen to end the threat of the demons Gart and Rath. Later, time-traveling members of the Guardians of the Galaxy visited the modern era, and they attempted an attack upon the Badoon, hoping to prevent the Badoon invasion of their own timeline. To prevent this, the Uni-Power transformed a Badoon named L’Matto into Captain Universe to defeat the Guardians. The Guardians’ absent leader Major Victory came to aid them alongside Dr. Strange, and Dr. Strange forced the Uni-Power to depart L’Matto so that the Guardians could escape back to their own time.An unusual Captain Universe was Roland Taylor, a schizophrenic writer. The Uni-Power healed his mind, but he found himself pursued by Division U, a scientific team trying to analyze the Uni-Power, whose ranks included Steve Coffin, angered to find another person with his one-time powers. The Uni-Power was also pursued by the Enigma Hunters, extraterrestrials from the Microverse who sought its powers for themselves. When the Uni-Power tried to leave Taylor, his schizophrenic side reasserted itself, forcing the Uni-Power to remain. The Uni-Power eventually departed from Taylor through unrevealed circumstances.It first returned to Bruce Banner, this time possessing him and the Hulk as a single entity. They sought out Gilbert Wiles, who was still researching the Uni-Power, and he attempted to assist it, but agents of A.I.M. made an attempt on the Uni-Power, and while the empowered Hulk fought them, an invisible A.I.M. agent killed Wiles’ business partner, David Garrett. To help clear Gilbert’s name, the Uni-Power joined with Matthew Murdock, alias Daredevil, who had taken Wiles as his client. Bonding with the Uni-Power enhanced Daredevil’s superhuman senses to such a degree that he could barely function, but he also regained his eyesight as a result. Murdock proved Wiles’ innocence in court, and suggested that the Uni-Power attempt to study A.I.M.’s findings on its situation, hoping it might shed light on the power fluctuations.", 
    "durability": 7, 
    "education": "Not applicable", 
    "energy": 7, 
    "eyes": "variable\n", 
    "fighting": 7, 
    "firstappearance": "Micronauts #8 (1979)\n", 
    "groupaffiliation": "unknown", 
    "hair": "variable\n", 
    "height": 0, 
    "id": "Captain_Universe", 
    "identity": "Secret", 
    "intelligence": 7, 
    "knownrelatives": "None", 
    "occupation": "unknown", 
    "placeofbirth": "Not applicable", 
    "powers": "Although Captain Universe's power level varies from host to host; some of the Captain's powers include energy manipulation, molecular manipulation, enhanced senses and \"Uni-Vision\". Increases the host's powers and physical capabilities, and grants protection against extreme conditions.", 
    "realname": "Variable, in the past has included: Captain Ray Coffin, Doctor Strange, Professor Swann, Commander Arcturus Rann, a member of the Badoon race, X-23, Daredevil, the Hulk, the Invisible Woman, Gladiator, Krosakis, the Silver Surfer, Spider-Man, Gabriel Vargas", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe"
}