{
    "aliases": [
        "Bee", 
        "Black Bishop", 
        "Britanic", 
        "Captain Britain-616", 
        "Captain Wakanda", 
        "Custodian", 
        "Fast Buck", 
        "Jungle Man", 
        "Lionheart of Avalon"
    ], 
    "citizenship": "U.K.", 
    "content": "Brian publicly debuted fighting the crimelord Vixen’s minions in London, though some, such as Chief Inspector Dai Thomas of Scotland Yard, were not glad to see him; he also battled Hurricane (Albert Potter; another villain empowered by the Nethergods), and faced Doctor Synne near Braddock Manor. Brian learned Synne was Mastermind’s pawn, and the truth about his parents’ deaths; he confronted the machine, apparently switching it off, though in fact the computer simply faked its demise. Brian teamed with Captain America, Nick Fury, and Lance Hunter, Director of S.T.R.I.K.E. (Special Tactical Reserve for International Key Emergencies), Britain’s equivalent to S.H.I.E.L.D., to battle the Red Skull; early on in this skirmish Mastermind used holograms to fake Braddock Manor’s destruction in a bomb strike. While battling Lord Hawk, a former colleague of his father who used a robotic hawk built for him by Brian in his campaign against modern society, Brian was badly injured. While his body lay dying in a S.T.R.I.K.E. medical facility, Merlyn and Roma brought his spirit to them, and after testing him again, replaced his quarterstaff with the Star Sceptre. Brian returned to his healed body and slipped out of the S.T.R.I.K.E. base. Following this he battled foes such as the mercenary biker Highwayman, deposed tyrant the Manipulator (Basil Crushstone), aliens beneath Scotland’s Loch Ness and their mechanical monster, the hellspawned Black Baron, Doctor Claw and his mutations, and the assassin Slaymaster.Brian visited America on a student exchange program, rooming with Peter Parker (Spider-Man), alongside whom he faced the assassin Arcade and the lycanthropic Litter; towards the end of this stay homesickness and stress saw him temporarily drinking more than was wise. After a brief trip home, Brian returned to the States to complete his studies, and there joined other heroes congratulating the newly pardoned Hulk, as well as fighting against the shapeshifting Dire Wraiths. Eventually Brian left America, but mid-flight realized the plane was under attack by the Nethergods, seeking to kill him; hoping to spare his fellow passengers, temporarily driven mad by psychic assault, and with King Arthur’s spirit trying to protect and direct him, Brian leapt from the craft. He had a vision of washing ashore on an island with a trio of standing stones (where Arthur’s body was held captive by Netherworld forces), then he came to, amnesiac, on the shores of the U.K. For months Brian lived as hermit in Cornwall, until Merlyn sent the Black Knight to find him. With his memories partially restored Brian and the Knight, allied with Vortigen the Proud Walker, battled Modred the Evil. Both Knight and Britain were snatched out of time to join the Grandmaster’s contest of champions, where Captain Britain fought against the Arabian Knight, but they were soon returned to resume their quest. At the entrance to Otherworld Brian was slain by the spectral White Rider, and his corpse claimed by Mandrac, Nethergod Lord of the Slain and the Rider’s master, though Merlyn and the Knight swiftly recovered it. Merlyn reunited Captain Britain’s departed spirit with his body, resurrecting him. While the hero healed, Merlyn restored his remaining memories, and informed him of the Nethergod’s involvement with his early foes. Now recalling Arthur’s location, the Knight, Britain, and the elf Jackdaw, were sent to awaken the King. Succeeding in this quest, Arthur then sent Brian and Jackdaw magically away through the dimensions, stating Brian had a destiny to fulfill elsewhere.As the pair slipped between realities, Merlyn took the opportunity to upgrade his champion, transforming his costume to enhance his strength and incorporate the powers of flight and forcefield previously part of his sceptre. The pair arrived on Earth-238, immediately encountering Mad Jim Jaspers and his Crazy Gang. Soon coming to realize he was not on his native Earth, learning that this world once had a Captain U.K. Brian found himself fighting the Junkheap that Walked Like a Man, and encountered the highly evolved Algernon the Rat. Tracking the source of these latter two artificially evolved beings, Brian met Saturnyne and her Avant Guard, representatives of the Dimensional Development Court. Initially the Avant Guard devolved Brian into a apelike primate, but after being restored (and further enhanced) by the same substance which had been used to evolve Algernon, Brian made his peace with Saturnyne's crew, helping them battle the Status Crew, this England's anti-superhuman police. He aided Saturnyne in her mission to evolve this reality up to minimum standards, but after they believed they had succeeded, Jaspers unleashed his mental powers, plunging the world into an insane maelstrom. The authorities reactivated their hero killing cybiote, the Fury, which slew Jackdaw; Saturnyne fled, abandoning Captain Britain, whose arm the Fury broke without even trying. Brian gained a brief reprieve when Jaspers picked him up in a flying teacup and explained how he had engineered the destruction of every other superhuman on this planet, before dropping the shell-shocked hero in a superhero graveyard, where he found Captain U.K.’s empty grave. There the Fury caught up with him, and incinerated him on the spot.Merlyn and Roma retrieved his remains - a rag, bone and hank of hair - and rebuilt him, moving his powers from his costume to his body and enhancing his senses, before returning him to his own world, Earth-616. Needing to touch base with something familiar after so long away, Brian returned to the site of the bombed Braddock Manor, discovering it was intact, and learning of Mastermind's ruse. Soon after Brian had switched off and repaired the computer, he was contacted by Betsy. He learned she had been recruited by S.T.R.I.K.E. Psi Division, but that Vixen was now secretly in charge of the organization and had sent Slaymaster to kill the telepaths before they could expose her takeover. Brian fought and defeated Slaymaster in central London, and the surviving psis moved into Braddock Manor. Brian next fought alongside his old ally, Captain America, against the insane wizard Modred the Mystic (not to be confused with his Otherworld foe, Modred the Evil); then he was kidnapped by the Special Executive, a team of interdimensional mercenaries, who had been hired by Saturnyne to bring him to an alternate Earth as a defense witness at her trial, where she was accused of causing the chaos wave engulfing Earth-238 – there Brian met two more of his interdimensional counterparts, Captain England and Captain Albion. Brian was outraged when prosecutor Lord Mandragon destroyed Earth-238 to prevent the infection spreading (and destroy the evidence which could clear Saturnyne). To prevent Saturnyne’s execution, he and the Executive battled their way out the court and fled to Earth-616, and the residents of Braddock Manor increased once more.Moments after entering the Manor, Captain U.K., sole surviving hero of 238, turned up on the doorstep, to inform them that the Jaspers of 616 was about to launch his own campaign of hero genocide. At first Brian refused to believe things would repeat the course of 238, but then the Fury, which had survived the destruction of its dimension and tracked down Brian to 616, attacked. It slew some of the Executive before being temporarily immobilized in a cave in; the Executive left for other realities, while Brian and his remaining allies fled into London. Jaspers took control of the country with incredible speed, his powers hastening things along, and used Vixen’s S.T.R.I.K.E. to round up the country’s superhuman population into concentration camps. Horrified at the fascist state his country had become, Brian went to confront the architect of the madness; as he reached Downing Street, Jaspers unleashed his Warp, twisting reality into an Escheresque nightmare. Brian’s experiences over the years, carefully orchestrated by Merlyn to strengthen his mind and body, allowed him to stay sane under Jaspers’ bombardment, but he was no match for his opponent powerwise, though he struggled valiantly on for as long as he could. Then the Fury arrived, beating him to a pulp, and would have killed him again, except that Jaspers caught its attention; it had been unable to attack its creator, something which had always irritated it, but this counterpart was not the same man. The Fury slew Jaspers after a prolonged battle; the battered Captain Britain tried to destroy the weakened cybiote, but it was only the intervention of Captain U.K. that finally did the deed. The two heroes and Saturnyne, who was also present, were then whisked off to Otherworld by Roma, to attend Merlyn’s funeral, as he had apparently been killed while observing the conflict, and there Brian met many of his fellow Corps members for the first time. He and Captain U.K. then returned to Earth-616.Six months passed after the abatement of the Jaspers’ Warp, and the country returned to relative normality. Brian encountered the vulpine mutant Meggan, fighting her until Micky Scott, a bystander and friend of Meggan, died in the crossfire. Guilt ridden, Captain Britain threw himself into doing good deeds, then after Micky’s funeral, approached the Scott family to apologize for Micky’s death. They forgave him, recognizing it was an accident, and he was reunited with Meggan too, learning she was not a monster, and was equally grief stricken over Micky. Brian offered to let Meggan stay at the Manor, and help her find her family, whom she had been separated from during Jaspers' purges, but then they were attacked by armoured opponents who appeared out of the air; the subsequent battle destroyed the Scott’s flat. Another attack occurred at Braddock Manor a few days later, but the newly returned Betsy repelled it with her strengthened psi powers. Later, in the space of a few hours Brian faced the 616 version of the Crazy Gang; Slaymaster and the Vixen; Sidney Crumb, a tramp who had been infected by the Fury and turned into a monster; and Gatecrasher’s Technet, an interdimensional mercenary outfit similar to the Executive. They had been hired to retrieve Kaptain Briton, Brian’s counterpart from Earth-794, who had fled to 616 to escape his insane lover, the tyrant Sat-Yr-9. Brian fought Briton in Braddock Manor, but lost, and was mistakenly taken to 794; repulsed by the psychotic leader and her regime, he convinced the Technet to take him home. He returned to find Briton slain by Betsy. That night he learned from Mastermind that his father was from Otherworld, and R.C.X. came to Braddock Manor to ask for refuge in housing the Warpies, children transformed by the Jaspers’ Warp; after a fight with the Cherubim team of Warpies, during which Meggan learned of her transformative powers and took on an appearance designed to attract Brian, R.C.X. moved in at the insistence of Betsy. For a couple of days Brian put up with sharing his home with government covert ops and hundreds of mutated children, drinking to cope, before learning that his brother Jamie had been taken captive in Africa. With Meggan he traveled to Mbangawi to free him, only to learn that Jamie had become a slaver and murderer, and deserved his punishment. Unwilling to return home, Brian and Meggan traveled the world for several weeks, visiting Bali, the Himalayas and Egypt, and romance blossomed between them, before ending up in Russia where they fought the witch woman Baba Yaga. They were then snatched through time to help Gatecrasher in fourteenth century Peru, then returned home to Braddock Manor, where Brian witnessed Betsy in a Captain Britain costume; angered that R.C.X. had convinced his sister to replace him, Brian decided to quit. He used Incan gold to buy a lighthouse, and he and Meggan moved in; they spent nearly half a year there, during which time Brian didn’t wear his costume, learning as his powers grew that it had been a largely unnecessary crutch. His retirement ended when Betsy was attacked and blinded by Slaymaster; Brian felt her pain, flew to her aid and killed Slaymaster. Realising he could not deny his responsibility, he took up the mantle of Captain Britain once more. A few months later he settled his long-standing differences with Dai Thomas, when the policeman turned to him for aid in capturing a superhuman killer murdering Glaswegian mobsters. Through undisclosed circumstances he and Captain U.K. later briefly traveled to the interdimensional port of Maruthea, and got involved in a bar room brawl.Some time later Brian learned Betsy had been kidnapped from Switzerland by Mojo, and turned into the spineless one’s latest act, when he witnessed her as “Psylocke” on “Wildways”, a television show. Though it took months, Brian tracked Betsy down to New York to rescue her, but was telepathically subdued, then transformed into a teenage boy. Doug Ramsey helped him regain his own mind and fight back, even with his powers depleted by his transformation, buying Doug time to break Betsy’s conditioning; Brian was returned to normal as soon as their foes were vanquished. A few months later Brian returned to New York with Meggan to check up on how Betsy was doing living with the X-Men, and fought Horde alongside them. Not long afterwards Brian heard that Betsy had been killed in Dallas, unaware that Roma had in fact been manipulating events to make this appear to be the case, as part of a long term plan to force Captain Britain and Meggan to join a carefully selected team of heroes which included some of the surviving X-Men. Distraught, Brian drowned his sorrows, verbally abusing Meggan when she tried to console him, before drinking himself into a stupor. He was awoken by Nightcrawler throwing him into the sea; the mutant then informed him that Meggan had come to Muir Island for help, only to be kidnapped by the Technet along with Shadowcat of the X-Men. Sobering up, Brian aided Nightcrawler and the others in overcoming both the Technet and extradimensional Warwolves, who had been hunting Phoenix (Rachel Summers) for Mojo, and afterwards, the five heroes formed Excalibur to carry on the X-Men’s dream. Knowing he was powerful enough to normally function without a team, and to ensure he would stay with one, Roma secretly inflicted Brian with a “blunder jinx”, which hampered his efficiency when acting solo.The new team worked closely with Dai Thomas, helping track down the escaped Warwolves, and Brian renewed his friendship with old flame Courtney Ross, confiding in her his doubts about being in a team and in his relationship with Meggan. His new teammates moved into the Lighthouse, and soon confronted him on his drinking habits – though initially annoyed, he recognised that he was beginning to develop a tendency to turn to the bottle when stressed, and decided to give up alcohol before it became a problem. Arcade then kidnapped Courtney Ross, and lured Excalibur into trap, where they were confronted by the Crazy Gang. Tweedledope used a device to switch their bodies and minds round – Brian ended up in Tweedledope’s body briefly. After escaping Brian was briefly seduced by Courtney (actually her counterpart and murderer, Sat-Yr-9, who used his doubts and her own powers of influence to do so). The team followed Phoenix to New York to find it in the grip of a demonic \"inferno,\" and Brian was transformed by a possessed Meggan. His costume was destroyed by Shadowcat using her Soul Sword, freeing him of this control; however Brian later found during rest of stay that his powers were fluctuating. Returned to U.K., he fought Hauptmann Englande, another counterpart of his (this time from a Nazi reality), and his Lightning Squad; Brian’s powers returned in full mid-fight now that he was home. He briefly adopted a costume outwardly identical to his damaged one, but lacking Merlin’s micro-circuitry. Arcade attacked Excalibur again during this period, sending the robotic Loonies to overpower Excalibur; he trapped Brian in a virtual world where he was confronted by temptations to drink, but this fell flat as Arcade had failed to realize alcohol was not the demon he thought it was for Brian. Later Excalibur worked alongside the X-Babies to defeat Mojo’s Agent, battled the Demon Druid, and Brian was briefly impersonated by the mutant Mastermind (Jason Wyngarde). Meanwhile interdimensional negotiations saw a prisoner exchange arranged, with Lightning Squad and their cohorts being returned to their own reality, but treachery on the Nazi side saw the entire Excalibur team thrown through the timelines. Their first stop was Earth-1193, a world of magic, where Brian picked up the costume of Captain Marshall; then on through a panoply of worlds, where Brian encountered a villainous Jamie secretly controlled by Brian’s own brother back on 616; his Corps counterpart Crusader X on a world where Britain still ruled the Americas; and the Lord High Justicer, his analogue on a polluted world where he was the law. Their trip came to an end on Otherworld, where Saturnyne (now based there at Roma’s command) sought to arrest Phoenix; Excalibur fought several members of the Corps to prevent this.Finally returned to Earth-616 the team immediately faced Galactus; Brian was then reunited with his old ally Black Knight to fight Morgan Le Fay’s agent Dreadknight, then the extradimensional ninja known as the Nth Man, and confidence tricksters Cooter and Bash. Alongside Power Pack he fought Nightmare, then he battled a possessed Meggan, and was hypnotised by Mesmero to battle Fenris. Excalibur and Brian barely had a moment to rest, as further battles ensured; they fought the Shi’ar Imperial Guard alongside the Starjammers, and with Thor battled the Wrecking Crew and pursued Juggernaut into another dimension. Brian was temporarily merged with his Nazi counterpart Hauptmann Englande, fought against the She-Hulk and alongside Plasmer, with the Black Knight and Captain Kerosene against the Sleepers, alongside Silver Sable’s Outlaws, took on Arnim Zola, in Limbo battled Doctor Doom alongside the Avengers' western branch, and once more took on the Warwolves.Meggan was again possessed, this time apparently by the Changeling's ghost. In trying to exorcise her, Brian and Excalibur seemingly discovered Merlin alive and well and encountered Jackdaw’s ghost – though much of this was later proven to be a deception. Excalibur later aided W.H.O. against a reanimated Air-Walker android. The Technet targeted them, but were easily overpowered; abandoning Gatecrasher and Yap, the remaining mercenaries moved in with Excalibur. A stressful and overcrowded week wore down Brian’s temper, and his growing jealousy of Nightcrawler’s obvious interest in Meggan led to a confrontation, where Brian broke Kurt’s leg. He was snatched from 616 by the Corps for this crime, and put on trial on Otherworld for this and other transgressions against their code, with Captain U.K. as his defense council and Hauptmann Englande as his prosecutor. Refusing to recognize the Corps’ authority, he was sentenced to death, and battle ensued, swiftly ended by Roma’s decree that Brian was to be released without charge. Before she departed, Captain U.K. explained to Brian that the Corps members’ abilities were powered by the matrix between dimensions. Brian confronted Roma, who admitted to him her manipulations and removed her blunder jinx. Returned to Earth, Brian made peace with Nightcrawler, and with new allies adding their might to Excalibur, they faced Necrom, the foe the team had been created to fight; the original team members physically merged to undo the damage Necrom had done to the multiverse, then Phoenix defeated him.Later the temporal assassin Sidestep pitted Brian against Cyclops during the American Revolutionary War, then back in his own time, Brian fought Arcade alongside Spider-Man, and took on the Crazy Gang in a bizarre Wonderland. Betsy returned home for a visit, but at a reunion of Excalibur’s friends, Sat-Yr-9 revealed that she had infiltrated their circle in the guise of the murdered Courtney, when her agents and Jamie Braddock attacked and took them captive; Sat-Yr-9 attempted to brainwash Brian to serve her, but when she ordered him to kill Meggan, he resisted. Sat-Yr-9 fled, but Brian vowed to track her down and avenge Courtney. Next, Excalibur worked alongside the X-Men against the Asgardian Troll Associates, then Brian visited Wakanda, where he fought Icon in the guise of “Jungle Man” and “Captain Wakanda”. Taking a break, Brian proposed to Meggan, only for them to be captured by the Cherubim on behalf of  R.C.X., who tried to forcibly recruit Excalibur’s members; when Brian subsequently refused to comply, he was beaten to a pulp, and would have died had Roma not intervened and healed him. Phoenix, who had been absent since shortly after the Necrom battle, rejoined the team after they dealt with R.C.X., and after they briefly assisted the extra-dimensional Khaos against Ghath, the team traveled to the future to overthrow the Sentinels who ruled Rachel’s timeline. However on the return trip Brian was lost in the timestream; Meggan acted as his anchor while Brian spent an indefinable amount of time being buffeted from future to past. He was drawn to Phoenix, a temporal anomaly, and eventually with the aid of Daytripper (Amanda Sefton), swapped places with her, returning to the present; however his experiences had changed him, and he took the new identity of Britanic.Initially cold and distant, unable to distinguish memories of the past from memories of the future, Brian’s love for Meggan remained constant; as time passed his old personality gradually returned. The team faced the likes of Stryfe’s lethal legacy, the Phalanx, and Brian and Betsy entered the comatose mind of Jamie to try and see if they could reach the loving brother they once knew. Excalibur faced the evil sorcerer Gravemoss, visited Genosha where they began to get the first inklings of the villainy of rogue covert ops group Black Air, then fought X-Man (Nate Grey) at Muir Island, their new base. One last prophetic dream warned Brian of a dystopian future forming, shortly before Shinobi Shaw prompted him to infiltrate the Inner Circle of the London Branch of the Hellfire Club, claiming his father’s title of Black Bishop, and learning of the Club's alliance with Black Air and plans to take over the U.K. To face them, Brian resumed his identity as Captain Britain, and battled the body thief Mountjoy, helping to end the threat and thwart the terrible future he had foreseen.Subsequently, Excalibur battled the Mutant Liberation Front when they attacked Muir Island. Brian renewed his proposal to Meggan, seconds before he was kidnapped by the Dragons of the Crimson Dawn, who planned to use his energies to open a rift between the Earth and their realm; instead, with the aid of Meggan, he absorbed the power of the rift, closing it, but at the cost of his own powers. No longer Captain Britain, Brian took a sabbatical from Excalibur to figure out what he wanted to do with his life now. He returned a few months later, confidant in one thing; that he loved Meggan. Soon after they were married on Otherworld by Roma. Brian returned to scientific research, working out of Darkmoor, until the arrival of Captain U.K., pursued by armored warriors. Together with Meggan, Psylocke and the Black Knight, Brian accompanied Captain U.K. to Otherworld, where they rescued Roma from Mastermind and an army of Warpies. During this adventure Brian encountered a hologram of his father which alleged his parents had deliberately had Mastermind kill them, and then renewed Brian’s powers. He took up the Sword of Might, returned the Warpies to human form, and ascended the throne of Otherworld. Some time later, he collected his sister’s body after she was slain by Vargas. Learning of Morgan le Fay’s latest plot against England, to reverse his mystical connection to the Matrix by attacking him in Otherworld with god-killer weapons, so that injury to him would cause destruction in Britain, he passed his mantle on to a new 616 Captain Britain, Kelsey Leigh, before Morgan could take him captive; without his connection, Morgan could not use him against his home, and Kelsey proved her worth by defeating Morgan.", 
    "durability": 7, 
    "education": "PhD in Physics from Thames University", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 7, 
    "firstappearance": "(as Captain Britain) Captain Britain #1 (1976); (as Britannic) Excalibur #75 (1994); (as Black Bishop) Excalibur #97 (1996)\n", 
    "groupaffiliation": [
        "MI-13", 
        "formerly Excalibur", 
        "the Corps", 
        "agents of Merlin", 
        "champions of Otherworld's Camelot", 
        "Pendragons", 
        "Hellfire Club"
    ], 
    "hair": "Blond\n", 
    "height": 78, 
    "id": "Captain_Britain", 
    "identity": "Known to U.K. authorities", 
    "intelligence": 7, 
    "knownrelatives": "Sir James Braddock (father, deceased), Lady Elizabeth Braddock (mother, deceased), James \"Jamie\" Jr. (brother), Elizabeth \"Betsy\" (Psylocke, sister), Meggan Braddock (wife), William (father-in-law), unidentified mother-in-law", 
    "occupation": [
        "Adventurer", 
        "ruler of Otherworld", 
        "scientist", 
        "former student"
    ], 
    "origin": "Captain Britain #1-2 (1976)", 
    "placeofbirth": [
        "Braddock Manor", 
        "England"
    ], 
    "powers": "Brian is superhumanly strong, able to lift 90 tons, and possesses enhanced reflexes, stamina and senses (sufficient to pierce holograms, but not on a par with Wolverine). He can also fly up to 770 mph for prolonged periods. He derives his energies from the friction between dimensions, focused in a matrix centered on the U.K., and formerly needed his costume to focus his powers and provide a battery when outside the U.K.; however he may have alleviated this weakness when he briefly severed his mystic connection to the U.K. to empower Kelsey Leigh. As Britannic, he had prophetic visions, tied to memories of experiencing all history while lost in the timeline. He is apparently immune to his sister's psionic powers, though not his elder brother's reality warping abilities.", 
    "realname": "Brian Braddock", 
    "significantissues": [
        "With Captain America, vs Red Skull (Captain Britain #16-27, 1977)", 
        "with Spider-Man, vs Arcade (Marvel Team-Up #65-66, 1978)", 
        "Otherworld saga (Hulk Comic #1, 3-30, 42-55 & 57-60, 1979-80)", 
        "traveled to Earth-238, killed by Fury (Marvel Superheroes #377-384, 386-388, 1981-1982)", 
        "revived by Merlyn & Roma, reunited with Betsy, met Captain U.K., vs 616 Jaspers & Fury (Daredevils #1-11/Mighty World of Marvel #7-13, 1983-1984)", 
        "first met Meggan (Mighty World of Marvel #13-14, 1984)", 
        "with Captain America, vs Modred (Captain America #305-306, 1985)", 
        "killed Slaymaster (Captain Britain #13, 1986)", 
        "co-founded Excalibur (Excalibur: The Sword is Drawn, 1988)", 
        "possessed by Lancelot Pendragon, vs Dai Thomas (Knights of Pendragon #4-5, 1990)", 
        "with Excalibur, vs Thor & Juggernaut (Thor #427-429, 1990-1991)", 
        "proposed to Meggan (Excalibur #61, 1993)", 
        "lost in timestream, returned as Britannic (Excalibur #68 & 75, 1993 & 1994)", 
        "briefly joined London Hellfire Club (Excalibur #96-100, 1996)", 
        "with Excalibur, vs Dragons of Crimson Dawn, lost powers (Excalibur #110, 1997)", 
        "married Meggan (Excalibur #125, 1998)", 
        "with Excalibur, saved Otherworld from Mastermind, crowned king (Excalibur: Sword of Power #1-4, 2001)", 
        "empowered Kelsey Leigh as new Captain Britain (Avengers #80, 2004)", 
        "sent by Roma to undo Scarlet Witch's reality warp, lost Meggan (Uncanny X-Men #462-465, 2005)", 
        "formed new Excalibur (New Excalibur #5, 2006)", 
        "joined MI-13 (Captain Britain and MI-13 #1, 2008)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 257
}