{
    "add": {
        "doc": {
            "aliases": [
                "Nomad", 
                "The Captain", 
                "Steven Grant Rogers", 
                "Roger Stevens", 
                "Yeoman America", 
                "Cap", 
                "The Sentinel of Liberty", 
                "Star-Spangled Avenger", 
                "also has impersonated Crossbones"
            ], 
            "citizenship": "U.S.A.", 
            "content": "Rogers was assigned to serve as an who served both as a counter-intelligence agent and a symbolic US hero to counter Nazi Germany's propaganda successes head by the Red Skull (Johann Shmidt). Wearing a costume based on his own design modeled after the American flag, Steve was given a triangular bulletproof shield, a personal sidearm and the codename Captain America, the Sentinel of Liberty. He was also provided a cover identity as a clumsy infantry private at Camp Lehigh in Virginia. His first opponents included the Red Skull himself and Nazi attempts to duplicate Erskine’s serum with their own super soldiers. During a mission to the African nation of Wakanda, “Cap” befriended the nation’s ruler T’Chaka and obtained a sample of the rare metal Vibranium. Subsequent experiments with this metal produced a uniquely indestructible Vibranium-steel alloy disc, which proved impossible to duplicate. The disc was given to Cap as his new shield.In the closing days of World War II in early 1945, Cap broke through Nazi troops for his final wartime confrontation with the Red Skull, who was seemingly slain by bombing debris (but lived on in suspended animation). Days later, Cap and Bucky arrived in England too late to prevent brilliant Nazi scientist Baron Zemo from obtaining and launching an experimental drone plane armed explosive device on it. Rogers and Barnes reached the plane, but when Bucky tried to defuse the bomb, it exploded in mid-air. Rogers was hurled into the freezing waters of the North Atlantic. The US government presumed both were dead. However, Bucky was secretly retrieved by Soviet operatives, while Cap was recovered by Nazi agent Lyle Dekker, who hoped to exchange bodies with him. Cap escaped Dekker’s base by air, but was shot down and fell back into the ocean. Due to the Super-Soldier serum Captain America survived, entering a state of suspended animation and eventually freezing in solid ice.Years later, a team of super-heroes called the Avengers discovered Rogers' frozen body in the North Atlantic, where he had been preserved since 1945. Once revived, Rogers was devastated by Bucky’s supposed death and the loss of everything once familiar to him. The Avengers were attacked by Namor’s ally, the extraterrestrial Vuk the D’bari, who transformed the heroes into stone. Cap confronted the alien, making him their ally, and helped the restored Avengers defeat Cap’s former teammate from the Invaders, Namor. After that adventure, Captain America was invited to join the Avengers as their first recruit. Cap formed close friendships with his teammates Thor, Iron Man (Tony Stark), Giant-Man (Hank Pym), the Wasp, and the Avengers’ butler Edwin Jarvis.Cap’s revival, reported worldwide, brought the long-retired Baron Zemo out of seclusion. Enraged that his enemy still lived, Zemo organized several superhuman criminals as the Masters of Evil and set them against the Avengers, the first of many such battles with various incarnations of the Masters. Soon afterward, Cap and the Avengers repelled an invasion by the time-traveling menace Kang the Conqueror, clashed with Kang’s alternate version of himself from the future, Immortus, and encountered the heroic team of mutants, the X-Men, during an investigation of the extraterrestrial Lucifer. Zemo had his Masters launch a final assault on the Avengers. While the other Avengers defeated the Masters, Cap stormed Zemo’s South American stronghold, where Zemo accidentally killed himself by triggering an avalanche in battle with Cap.Returning to New York, Cap learned the other Avengers were taking leaves of absence from the team and had already recruited repentant outlaws including the archer Hawkeye (Clint Barton), mutant speedster Quicksilver and his sister the probability-altering Scarlet Witch as their replacements. Unperturbed by the new trio’s earlier crimes, Cap became fulltime Avengers leader as the only remaining senior member. His leadership helped quell public skepticism about the new roster, nicknamed “Cap’s Kooky Quartet.” Cap became a mentor to the trio, assisting Quicksilver and the Witch’s assimilation in the US and bearing the brunt of Hawkeye’s youthful rebellion.After several shared adventures, Cap and Sharon fell in love, but when she rejected his marriage proposal, Cap decided to give up crimefighting and revealed his true identity to the public. He soon recanted his decision to retire and returned to action. Cap again clashed with the Red Skull, who had revived the Fourth Sleeper to wreak havoc. With Sharon’s help, Cap deactivated the robot, and forced the Skull to flee.Meanwhile Rick Jones, the young friend of the Hulk, pursued Captain America to become his partner, and Cap allowed the youth to accompany him into battle against the terrorists of Hydra, then led by Madame Hydra. When Hydra later abducted Rick, Cap rescued his new sidekick. During that mission, regretting his decision to make his identity public, Cap made himself appear to be shot down, leaving a realistic Steve Rogers mask to convince the world the Rogers identity had been false to protect his privacy. In addition, Cap and Rick ran afoul of old Avengers foe the shape-changing Space Phantom, who as part of his own plot removed the world’s knowledge of Cap’s secret identity.The Red Skull continued to toy with Captain America’s life, using the Cosmic Cube to switch bodies with the hero. The Skull in Cap’s body alienated Rick into quitting his sidekick role, while Rogers in the Skull’s body was sent to Exile Island, where he was attacked (by those thinking he was the Skull) and befriended by adventurer Sam Wilson. Wilson, formerly criminal “Snap” Wilson, had undergone personality alteration by the Skull, and was planted so as to eventually become Cap’s partner, setting the stage for a potential future betrayal. As the costumed Falcon, accompanied by his trained bird Redwing, Wilson helped Cap confront the Skull, who returned his foe and himself to their rightful bodies so as to better savor a triumph. Before the Skull could destroy the pair, however, AIM avenged the Skull’s earlier betrayal by robbing the Cube of its power. The Skull escaped yet again.Back home, with Earth safe from the Skrulls, Cap and the Falcon battled gangsters and the Red Skull’s Fifth Sleeper robot unleashed in Las Vegas. The surrogate Captain America and Bucky (Jack Monroe) of the 1950s were freed after being driven mad by faulty Super-Soldier treatments and placed in suspended animation for decades. Cap and Falcon defeated the madmen. The Viper (Jordan Dixon), teamed with Eel (Edward Lavell) and Cobra (Klaus Voorhees) to battle Cap and Falcon as the Serpent Squad, and variations on this serpent-themed group would plague Cap repeatedly. Baron Zemo’s son Helmut surfaced, heir to Heinrich’s barony, genius, and above all his hatred of Captain America. When Falcon intervened in a grudge match between Hemut and Cap, the younger Zemo seemingly perished in a vat of his father’s chemical “Adhesive X.”On the home front, Captain America was disheartened to discover the Secret Empire, an underground organization tied to a high-ranking US government official. Cap and other heroes protected the White House against the Empire’s assault, but Cap was left deeply shaken by the affair. Standing beside past and future versions of the Avengers, Cap battled to save humanity from the Time-Keepers, extraterrestrial beings from the “End of Time.” He returned from the battle victorious, but with no memories of his journey outside of the bounds of time. After he and the Avengers joined the powerful alien Kree soldier, Captain Mar-Vell, against the cosmic menace Thanos, Cap and Sharon accompanied the rocky hero, the Thing, to 31st century (a possible future designated Earth- 691). With the heroes known as the Guardians of the Galaxy, they helped battle against the Earth’s conquerors from the alien Badoon race.In a subsequent battle, the Red Skull revealed his role in Falcon’s origin, giving Cap’s partner his own identity crisis. Despite learning of his partner’s checkered past, Cap stayed by his side and accompanied Falcon to court, where his partner faced charges for the crimes of his earlier self. Though placed on parole, Falcon was able to continue fighting crime at Cap’s side.Captain America continued his incredible war against injustice across the globe. He partnered with Captain Britain (Brian Braddock in Great Britain against the Red Skull’s terrorism against London, prevented the Royalist Forces of America from driving the USA insane with their Madbomb, and formed an uncomfortable alliance with Doom against yet another of the Skull’s schemes; the Skull was revealed to be bankrolling worldwide chaos caused by the mutated creatures of former Nazi scientist Arnim Zola. During a period Captain America suffered from amnesia of his early memories, a new threat arose with hypnotist Dr. Faustus’ National Force, whose puppet leader, the Grand Director, was actually the 1950s Captain America Faustus had brainwashed. Sharon Carter infiltrated the Force but was seemingly brainwashed and burned to death. In fact, Sharon faked her death and went under deep cover for SHIELD.Before Rogers could settle down with Ms. Rosenthal, Cap, multiple Avengers and many other heroes were transported to an artificial planet called Battleworld and pitted against Dr. Doom’s super-villain army by the near-omnipotent being called the Beyonder. As loyalties changed throughout the conflict, Cap battled his wartime comrade Logan, now the X-Man Wolverine. Briefly seizing the Beyonder’s power, Doom wrought havoc, even breaking Cap’s shield, but Doom was defeated and Cap used Battleworld’s unique properties to re-form his beloved weapon through sheer will. The heroes and villains were returned back to Earth.Meanwhile, the Red Skull began aging rapidly as the effects of his suspended animation faded, and was determined to die in battle with his oldest enemy. Though Cap was poisoned and tricked to belive Bernie and the Falcon were killed, overwhelming grief and pending death could force Cap to kill the Skull, who thus died of old age rather than in the battle he craved. Cap was soon restored by the Avengers, but none knew Zola had cloned Cap, and transferred the consciousness of the dying Skull into the new body. The Skull allowed Cap to believe he was dead while he remained behind the scenes for months.\nLater, Cap looked on with pride as his teammate Hawkeye became leader of a separate Avengers branch on the West Coast, and both teams joined Earth’s other heroes in repelling the alien Dire Wraiths’ long-planned all-out invasion. Following clashes with the teleporting criminal mercenary Sidewinder’s Serpent Society, and the radical anti-nationalist Flag-Smasher, Cap confronted the Beyonder, manifested on Earth in human form to gain an understanding of human desires. Cap was dealt a personal blow when Bernie left New York to attend law school, ending their relationship.Cap next investigated the villain-killing vigilante, the Scourge of the Underworld. The Scourge that Cap captured was himself killed by another, for several Scourges were active in a vigilante program designed by the Angel (Thomas Halloway) but co-opted by the still supposedly dead Red Skull. Another Skull project, the extremist group ULTIMATUM, surfaced with Flag-Smasher as its apparent leader. While battling the terrorists, Cap was forced to shoot an ULTIMATUM agent in order to rescue hostages; despite his victory, he was sickened at having been forced to kill an opponent for the first time since World War II. He was also unsettled by his subsequent losing skirmish with super-strong, glory-hungry rival adventurer Super-Patriot (John Walker).With a Vibranium shield from the Black Panther, Rogers continued his adventures with his fellow travelers. Alongside the Avengers; while battling the Egyptian death god Seth’s forces, he briefly wielded Thor’s hammer, proving his worthiness among only a few privileged to lift the enchanted weapon. When the eastern Avengers roster disbanded soon afterward, Cap led a team of one-time members in halting the High Evolutionary’s worldwide experimentation, then joined D-Man and Battlestar in an assault on ULTIMATUM. D-Man seemingly perished at the organization’s Arctic base, but Cap had little time to grieve as demons overran New York during what was called the “Inferno Crisis”. Cap was allied with various heroes during the fray as a new team of Avengers, while the mutant X-Men ended the unholy invasion. After the Inferno Crisis ended, he and a maddened John Walker were manipulated into battle by the Red Skull, his survival finally revealed. With the Skull’s involvement exposed, the CSA offered Steve the return of his former identity; though Rogers initially declined. He was encouraged to accept by Walker, who subsequently wore a version of the Captain uniform as the USAgent and joined the West Coast Avengers, wielding Cap’s Vibranium shield.While Cap led a reorganization of the Avengers, he became romantically involved with ex-Serpent Society member Diamondback (Rachel Leighton), although their relationship was strained by her continued loyalties to some of her former criminal cohorts.Hostilities flared between the interstellar Kree and Shi’ar Empires, and their conflict destabilized Earth’s sun. Cap led the Avengers in protecting Earth’s interests and following a series of space adventures that set them against both the Shi’ar Imperial Guard and the Kree Starforce, the Avengers learned all parties had been manipulated by the Kree’s Supreme Intelligence in an effort to advance the Kree race’s evolution via the near-annihilation of the Kree empire. After allegedly 98% of the Kree Empire’s population were killed, Iron Man and other Avengers attempted to kill the Supreme Intelligence despite the protests of Cap, who felt the Earth team had no right to execute an extraterrestrial ruler; although the Intelligence secretly survived, Cap was disturbed by his teammates’ willingness to kill and he took another leave of absence from the team just as D-Man turned up alive.Back on Earth, Cap’s adventures continued as he was turned into a werewolf for a time, and was attacked by an evil “doppelganger” version of himself, a harbinger of the cosmic “Infinity War” waged against Earth’s superhumans by the tyrannical Magus, an aspect of the artificially constructed man, Adam Warlock.In the wake of his many crises, Cap received the hardest blow yet when he learned that, due to his long years of adrenaline-boosting action, his body had finally overtaxed the Super-Soldier serum’s ability to replenish his augmented physique, threatening paralysis. Knowing further exertion would worsen his condition but unwilling to retire, Cap slowed his deterioration by using various accessories in place of physical feats, eventually taking novice heroes Free Spirit and Jack Flag as apprentices. When his health finally collapsed, Cap used armor provided by Iron Man to overcome paralysis, but his condition continued to deteriorate. Cap, finally resigned to his fate, prepared to succumb to death; but he vanished, and his friends found only his armor.Although the world believed him dead, Cap had been abducted and cured by Sharon Carter, finally learning she was still alive. She was reluctantly allied with the Red Skull, who believed Cap was the only person able to defeat their mutual enemy Hate-Monger, a Hitler clone who had assimilated the Cosmic Cube’s power and changed the world into one the Skull could never rule. Cap prevented both Hate-Monger and the Skull from using the Cube’s power, while Sharon’s romantic feelings for Cap returned.When the psionic entity Onslaught threatened the world, Cap and several other heroes seemingly died defeating him. Cap was again reborn, however, as were his friends, on a new Earth in a pocket dimension subconsciously created by Franklin Richards, son of Mr. Fantastic and Invisible Woman. Whether via his own subconscious or not, Cap received a new life with a wife and son, only for it to be exposed as a deception born from the imaginary history Franklin created for him. Counter-Earth also presented him with a readymade nemesis, a duplicate Red Skull, whom he fought with the help of teenage Rikki Barnes, dubbed Bucky. Eventually, Cap and the other Onslaught survivors regained their true memories and returned to Earth, leaving their legend to inspire the remaining heroes on Franklin’s world, which was preserved as Counter-Earth.Earth’s reality was not restored for long as Cap led nearly the entire Avengers roster against the ancient sorceress Morgan Le Fay, who changed reality into a medieval world where the Avengers were her warriors, but Cap broke her spell and helped his teammates do the same. They were quickly controlled again by Helmut Zemo, who in Cap’s absence had reorganized the Masters of Evil into a supposed team of heroes, the Thunderbolts. Fortunately, most of the Thunderbolts rebelled against Zemo’s scheme, freeing the Avengers, and eventually finding redemption under Hawkeye’s leadership. During a battle with Hydra, Cap’s indestructible shield was lost in the Atlantic Ocean, and he initially used a duplicate of his triangular wartime shield as a replacement. After defeating the shape-changing alien Skrull called the Sensational Hydra, who had impersonated him to incite panic in the public, Cap obtained a new energy shield. Cap and Iron Man were again at odds when Iron Man used telepathic technology to remove the world’s memories of his true identity, as the Space Phantom had done for Cap years ago, which Cap considered unconscionably intrusive.Following yet another bout with the Red Skull and his reacquired Cosmic Cube, Cap recovered his original shield. The Avengers and all of Earth faced a series of crises when Kang the Conqueror launched a global assault unequaled by any of his earlier efforts, causing worldwide chaos made worse by competing menaces such as the master of gravity, Graviton, and the giant creature Orrgo. Millions perished, but the Avengers and their allies ultimately routed Kang’s forces, and Cap himself struck down Kang in single combat.While fighting terrorists in the US, Cap was again forced to take a life to save others, killing terrorist leader al-Tariq. Hoping to discourage counterattacks on the USA, Cap unmasked before the world to give an individual face to al-Tariq’s death.When the Avengers helped contain the toxic Red Zone disaster that killed hundreds of Americans, Cap traced the Zone’s creation to US Secretary of Defense Dell Rusk, actually the disguised Red Skull, having infiltrated the government once more. Although his imposture was exposed, another of the Skull’s projects lived on in a new government-backed team of proactive Invaders, with USAgent as field leader. Disgusted by the needless violence of the group’s international activities, Cap was all the more discouraged when Namor joined USAgent’s efforts.Drawn into more government conspiracies while helping Falcon, Cap encountered his latest Super-Soldier imitator, the Anti-Cap, whom Cap tried but failed to save from further government manipulation. He also grew alienated from Sharon Carter over her involvement with the anti-mutant Project: Contingency. When Thor’s home dimension was threatened by Ragnarok, Cap and Iron Man accompanied him to battle Asgard’s enemies, but Thor ultimately returned them to Earth rather than risk their lives, and he seemingly perished soon afterward. Back on Earth, when a supposedly reformed and no longer disfigured Zemo regained leadership of the Thunderbolts, Cap’s distrust of Zemo helped spark a brutal Avengers-Thunderbolts clash during which Zemo was hideously scarred anew while shielding Captain America.One of the Avengers’ darkest days arose when Scarlet Witch, insane after years of struggling with her powers, undermined various teammates via her powers, even drawing Cap into an apparent romantic interlude with her, then altered reality itself to send duplicates of the Avengers’ many enemies against them, ending in the apparent deaths of Hawkeye, Vision and others.\nFollowing a string of discouraging events for Cap, the apparent murders of both the Red Skull and Nomad were traced to the Winter Soldier, revealed as Bucky. Although Cap broke through Bucky’s brainwashing via the Cosmic Cube, his World War II partner fled. Cap felt more optimistic after he and several other super heroes helped contain a mass breakout of superhuman criminals at the Raft prison; Cap and Iron Man formalized this group as a new Avengers roster, partnering with new Avenger teammates Spider-Man and Wolverine, but the government and SHIELD (now run by the ruthless Maria Hill) distrusted their team.", 
            "durability": 3, 
            "education": "High school graduate; one year of art school; military basic training; private tutoring in hand-to-hand combat, gymnastics, military strategy, piloting, demolition, and other disciplines", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "(Captain America) Captain America Comics #1 (1941); (Nomad) Captain America #180 (1974); (Captain) Captain America #337 (1988)\n", 
            "groupaffiliation": [
                "Secret Avengers", 
                "formerly the Avengers", 
                "Invaders", 
                "Captain's Unnamed Superhero Team", 
                "Redeemers", 
                "formerly partner of Bucky", 
                "Rick Jones", 
                "Falcon", 
                "Demolition Man and Nomad (Jack Monroe)"
            ], 
            "hair": "Blond\n", 
            "height": 74, 
            "id": "Captain_America", 
            "identity": "Publicly known", 
            "intelligence": 4, 
            "knownrelatives": "Joseph and Sarah Rogers (parents, deceased), unidentified grandfather (presumed deceased), Steven Rogers (Captain America, 18th century ancestor, presumed deceased)", 
            "occupation": [
                "Adventurer", 
                "formerly WPA artist", 
                "soldier", 
                "police officer", 
                "teacher", 
                "freelance illustrator", 
                "special S.H.I.E.L.D. operative"
            ], 
            "origin": [
                "Captain America Comics #1 (1941)", 
                "Tales of Suspense #63 (1965)", 
                "Captain America #109 (1969)", 
                "Captain America #255 (1981)", 
                "Adventures of Captain America #1-2 (1991)"
            ], 
            "placeofbirth": [
                "New York", 
                "New York"
            ], 
            "powers": "Captain America represented the pinnacle of human physical perfection. He experienced a time when he was augmented to superhuman levels, but generally performed just below superhuman levels for most of his career. Captain America had a very high intelligence as well as agility, strength, speed, endurance, and reaction time superior to any Olympic athlete who ever competed. The Super-Soldier formula that he had metabolized had enhanced all of his bodily functions to the peak of human efficiency. Most notably, his body eliminates the excessive build-up of fatigue-producing poisons in his muscles, granting him phenomenal endurance.", 
            "realname": "Steven \"Steve\" Rogers", 
            "significantissues": "See OHOTMU Bibliography", 
            "speed": 3, 
            "strength": 3, 
            "universe": "Marvel Universe", 
            "weight": 220
        }
    }
}