{
    "add": {
        "doc": {
            "aliases": "Dr. Walter Lawson", 
            "citizenship": "Kree Empire (disavowed)", 
            "content": "Mar-Vell was a white-skinned minority of the blue-skinned Kree empire, but despite discrimination and prejudice, Mar-Vell became a renowned soldier and an acclaimed hero for his victories in battle against the Kree's enemies, notably the Skrulls.Mar-Vell continued to observe humanity, in both his secret and costumed identity, growing increasingly sympathetic for Earth and its inhabitants. His initial adventures were typically extensions of Yon-Rogg’s attempts to kill, discredit, or otherwise destroy him, such as the time Yon-Rogg manipulated Ronan the Accuser to fight Mar-Vell by framing Captain Marvel as a traitor. Mar-Vell also had to navigate the romantic triangle between him and Una and the aggressive attention of his co-worker at the air base, Carol Danvers. These situations came to a head when Una overheard one of Yon-Rogg’s plans to kill Mar-Vell, and she was captured by his agents when she tried to warn him. Although Mar-Vell’s execution failed with the arrival of the Aakon aliens, she was shot in the battle and died in Mar-Vell’s arms as he tried to rescue her.However, as soon as Captain Marvel left to return to Earth, he instead found himself in the extradimensional realm known as the Negative Zone. The Supreme Intelligence then mentally lured the Earth youth Rick Jones to an abandoned Kree base on Earth in order to bid him to wear the \"Nega-Bands.\" By slamming the bands together, Jones and Captain Marvel shared a telepathic link as well as, more importantly, switch places between Earth’s universe and the Negative Zone. In no time at all, Captain Marvel was called out by Yon-Rogg, who was holding Carol Danvers as a hostage. In a last-ditch effort to destroy his rival, Yon-Rogg battled the hero, but Captain Marvel rescued Carol and Yon-Rogg was killed in an explosion as they escaped. (The exposure to Yon-Rogg’s weapon, the Psyche-Magnetron, transformed Carol into Ms. Marvel.)Captain Marvel and Rick Jones continued shared adventures for many months. At one point, Mar-Vell happened upon the idea to use Mister Fantastic’s doorway into the Negative Zone to release Rick and allowing the two to share an existence in the Earth dimension simultaneously. Shortly afterward, both Rick and Marvel were swept up in the intergalactic Kree-Skrull War alongside the Avengers, where Rick encountered the Supreme Intelligence. The Intelligence released the latent psionic potential in Jones’ mind in order to help stop the war, striking all soldiers motionless and teleporting Jones’ allies to the Kree homeworld, among other fantastic feats. Rick was left very near death, and Captain Marvel sacrificed part of his lifeforce to save Jones, “merging atoms” with him so that they could become linked as in their previous relationship.After many more months and many more adventures, Rick Jones’ body could no longer contain both his own lifeforce and that of Mar-Vell, and he collapsed. His girlfriend Lou Ann Savannah took him to her uncle, who used special photonic energy to revive him, and Jones and Captain Marvel could continue to switch places. In fact, Captain Marvel now found he could absorb solar energy and redirect it to fire energy bolts or to exhibit superhuman strength.When Captain Marvel became involved against the plans of the alien nihilist Thanos, he was contacted by Eon, a guardian entity of the universe who commissioned Captain Marvel as the next \"Protector of the Universe.\" He also granted him a special “cosmic awareness.” With a newfound title and purpose, he became the primary force against defeating Thanos. In fact, it was his new cosmic awareness that allowed Captain Marvel and the Avengers to defeat the mad Titan, since it gave him insight into Thanos’ use of the Cosmic Cube. Thanos became convinced that he had drained the Cube of its power and discarded it, allowing Captain Marvel to grab the Cube and restore reality to a time before Thanos had gained control over the universe.In a direct conflict with Captain Marvel, Zarek and the Lunatic Legion would have nearly succeeded in bringing him down if it were not for Marvel’s increased powers when merged with Rick Jones. Captain Marvel returned to the Kree homeworld to inform the Supreme Intelligence of the plot, but, surprisingly, the Intelligence revealed its true motives-- that it had known of Zarek’s plan and, in fact, had secretly been a driving force behind nearly all of Captain Marvel’s history. The Supreme Intelligence had long known the Kree had reached an evolutionary dead-end, and its only hope as a species was to integrate other genetically compatible races with its own so as to revitalize the Kree's stagnant development. He had specifically chosen Mar-Vell due to his genetic make-up and had also chosen Rick Jones specifically because of the latent psychic potential he housed. It further arranged to have them both \"bond\" by means of the Kree Nega-Bands, a process that was repeated or replicated throughout their history, because the Intelligence knew he couldn’t add Jones' brain to its collective organism directly until it was tempered by contact with a Kree brain such as Mar-Vell's. Using the unique Kree-bred flower called the Millennium Bloom, the Supreme Intelligence then proceeded to try to absorb both Jones' and Mar-Vell's brains, using their bodies as receptacles for its own consciousness in a direct assault against Earth. However, the heroes resisted and managed to escape, and Captain Marvel abandoned the Kree empire permanently.While back on Earth, Mar-Vell wandered independently for a time. He worked at an observatory, became involved with the Defenders for a day, and again teamed up with the Avengers against Thanos. Thanos’ corruption of his home, the moon Titan, pitted the Eternals against the world-computer ISAAC, and Captain Marvel helped the Eternals restore order. During this time, he fell in love with the Eternal’s Elysius, and they began a relationship that spanned both Titan and Earth and many shared adventures.Ultimately, Captain Marvel’s earlier exposure to the nerve gas proved cancerous, and the cancer turned malignant. Mar-Vell spent his last days on Titan, the moon of Saturn, surrounded by Elysius and his friends Mentor and Starfox. Many of his allies came to visit him while on his deathbed including the Thing, Spider-Man, Drax the Destroyer, and an ambassador of the Skrull empire (the greatest enemies of the Kree Empire) who awarded Mar-Vell with the Skrull medal of valor and stated that Captain Marvel was considered to be the greatest single enemy the Skrull Empire had ever known. He was also granted a posthumous honorary membership in the Avengers, and a monument was erected in his memory on Titan.His heroic legacy continued first with his son, Genis-Vell, conceived by Elysius who impregnated herself with Mar-Vell's cloned DNA, and later Phyla-Vell, a daughter from an alternate reality whose history became folded into reality after a time warp. Monica Rambeau has also used the alias of Captain Marvel, and Hulkling of the Young Avengers has since been revealed to be the son of Captain Marvel and Princess Annelle of the Skrull Empire.When Tony Stark, Hank Pym, and Reed Richards began construction on a prison within the Negative Zone, their activities caused a wrinkle in space-time. Encountering the wrinkle in the past, Captain Marvel touched it and was transported through time to the Negative Zone in the present day. Initially unsure of how to approach the situation, the heroes revealed Mar-Vell's history to him but also offered him a place in this new future as a warden for their prison, at least until, as the Sentry implicated, Mar-Vell would return to his past. Shaken by the experience and realization of his own fate, Mar-Vell nevertheless took up the Nega Bands once more to serve as Captain Marvel.Unfortunately, this individual turned out to be a Skrull sleeper agent programmed to believe he was the real Captain Marvel. He was sent to destroy Thunderbolts Mountian, but his programming had so completely overtaken his original personality that he killed the Skrull agents who were sent to terminate him and destroyed several Skrull ships, ending his own life in the process. He did the original Mar-Vell proud as he gave his life to defend Earth during the Skrulls' Secret Invasion.", 
            "durability": 7, 
            "education": "Kree military training", 
            "energy": 7, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "Marvel Super-Heroes #12\n", 
            "groupaffiliation": [
                "honorary member of the Avengers", 
                "(formerly) Kree military", 
                "(after death) Legion of the Unliving"
            ], 
            "hair": "Blonde, originally white\n", 
            "height": 74, 
            "id": "Captain_Marvel_(Mar-Vell)", 
            "identity": "No dual identity", 
            "intelligence": 6, 
            "knownrelatives": "Genis-Vell (son, deceased), Phyla-Vell (daughter), Hulkling (Dorrek VIII, son)", 
            "occupation": [
                "Protector of the Universe", 
                "(Formerly) Captain in the Kree space fleet", 
                "adventurer", 
                "astoronomer's assistant"
            ], 
            "origin": [
                "Marvel Super-Heroes #12", 
                "Captain Marvel #16 (1969)"
            ], 
            "placeofbirth": [
                "City of Rad-Nam", 
                "Kree-Lar", 
                "Planet Hala", 
                "Kree Galaxy"
            ], 
            "powers": "Mar-Vell possesses the ability to metabolize solar energy and convert it for a variety of uses, including superhuman strength, the projection of photon energy blasts, and flight. These powers would wane when he was deprived of starlight. Mar-Vell also possessed Cosmic Awareness, which could increase his intellect, granting him limited precognitive powers and the ability to ascertain an opponent's weakness. At one point he also possessed the ability to teleport and cast illusions.", 
            "realname": "Mar-Vell", 
            "speed": 7, 
            "strength": 6, 
            "universe": "Marvel Universe", 
            "weight": 240
        }
    }
}