{
    "add": {
        "doc": {
            "aliases": "Sister Sara", 
            "citizenship": "Unrevealed", 
            "content": "Caretaker was badly wounded and dying because of an assault on his home led by Daniel Ketch – a former Ghost Rider now servant of the rogue angel, Zadkiel. Caretaker managed to defeat three of Ketch's allies, Doghead, the Orb, and Death Ninja, before the vampire known as Blackout struck the fatal blow. Ketch began to destroy the contents of Caretaker's home as Blackout confronted Blaze. Caretaker, in the meantime, told Sara she was about to enter a life that he never meant for her to have. She desperately wanted to get him to a hospital, but Caretaker knew his time on Earth was done, so he urged her to get to the tunnels under his house and save what she could before Danny destroyed it all. Distraught over losing the family she never knew she had, Sara did as she was told and found a library of books within the tunnels. One touch was all it took, and the knowledge contained within the books flooded Sara's mind. She became the new Caretaker, librarian and guardian to everything dealing with the Spirits of Vengeance.Blaze found his half-brother, Ketch, who fled to Tibet, and Sara insisted on tagging along now that she was ready to embrace her new role in life. Blaze agreed because Sara had the answers he was looking for, and the two chased Daniel down. In Tibet, Blaze and Sara arrived too late to save a Ghost Rider named Nima from being killed at the hands of Ketch, but Blaze had the chance to confront his family only to wind up on the losing end of the battle. Blaze sank into a depression despite Sara's best efforts to snap him out of it, and even the arrival of two more Ghost Riders, Molek and Bai Gu Jing, didn't help at all. The group eventually journeyed to Japan to seek another of their kind, but all they found was a frightened man stripped of his powers by Daniel Ketch. Yoshio Kannabe, now a former Spirit of Vengeance, would be no use to them. However, Molek knew of a place in the Congo where two more Ghost Riders were waiting. Baron Skullfire and his lover, Marinette Bwa Chech, were ready to join Sara and her allies in the war against Zadkiel.Sara and Molek had a heart-to-heart talk before the final battle, and he told her she was an amazing woman to take everything in stride even though her burden was thrust upon her so suddenly. Sara and Molek seemed to have a connection, and she stood at his side when Ketch and the Black Host arrived, but when the dust settled, Sara was one of the only survivors of the conflict. Ketch had successfully drained the other Ghost Riders of their powers, and Zadkiel had won his war with Heaven. Afterwards, Blaze and Ketch went their separate ways, leaving Sara alone. She journeyed back home to her convent in Kansas, but she walked into a horrific scene. It appeared as if all the nuns inside were brutally slaughtered by an unknown assailant. Mother Superior, head of the convent, was left barely breathing and she explained what had happened in Sara's absence. After Sara buried the bodies, she decided to avenge her fallen sisters and seek out their murderer – the Deacon.However, she was visited by Spirits of Vengeance from the future who gave her hope by informing her the war with Zadkiel wasn't truly over. Sara sought out Johnny Blaze, and found him in battle with a demon called the Skin-Bender. At first, she didn't recognize him, claiming the Ghost Rider was free of Blaze's presence, but that was not the case. Blaze wanted no part in a rematch with Zadkiel until Sara reminded him the souls of his children reside in Heaven. Fearing what Zadkiel might do to them, Blaze rode away with Sara, ready to dish out vengeance.", 
            "durability": 1, 
            "education": "Unrevealed, but Sara has all the accumulated knowledge of the past six thousand years concerning everything involving the Spirits of Vengeance and possibly more", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Ghost Rider #26 (2008)\n", 
            "groupaffiliation": "Formerly part of The Sacred Heart Convent for the Sisters of the Holy Sepulcher", 
            "hair": "Auburn\n", 
            "id": "Caretaker_(Sara)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Caretaker (grandfather, deceased), unidentified parents (deceased)", 
            "occupation": [
                "Librarian and guardian of untold secrets", 
                "formerly a nun"
            ], 
            "origin": "Ghost Rider #27 (2008)", 
            "placeofbirth": "Unrevealed", 
            "powers": "None (as Sister Sara); Sara is a gateway to Heaven (as Caretaker)", 
            "realname": "Sara (Last name unrevealed)", 
            "significantissues": [
                "Became the new Caretaker after her grandfather died (Ghost Rider #27, 2008)", 
                "Accompanied Blaze on a dangerous journey to oppose both Daniel Ketch and the servants of Zadkiel (Ghost Rider #29-32, 2009)", 
                "shown her true power and got revenge on the murderer who killed her entire convent (Ghost Riders: Heaven’s On Fire #5-6, 2010)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}