{
    "add": {
        "doc": {
            "aliases": "Old man", 
            "citizenship": "Blood", 
            "content": "Also opposing the demon Zarathos were mysterious beings of power by the name of the Spirits of Vengeance, who sought to guard humanity against the dark times Zarathos would bring. The two sides battled over the Medallion of Power, which many of the Blood shifting allegiance to Zarathos. They would come to be known as the Fallen. The Spirits sacrificed themselves causing Zarathos defeat, the Blood became the protectors of the Medallion, which contained the fallen Spirits power. The Blood understood that it contained too much power for anyone user to possess. The Caretaker shattered the Medallion into into four separate pieces. The four quarters were to be given to two human families, with a lineage of one male and one female in each family inheriting a quarter. Two of these fragments were passed on through generations and unwilling inherited by Michael Badilino and his sister. The other two were intended for Johnny Blaze and his sister, Barbara Ketch. They had another brother by the name of Daniel Ketch who received a quarter of the Medallion instead of Barbara. The Caretaker assumed the role of protector of those families.Caretaker has taken up residence in the Cypress Hills Cometary, which is also a prison for the People of the Dust, they were tramped underneath the property by him and the other Blood. The People of the Dust will remain there as long as the Caretaker's power existed. Later Caretaker introduced himself to Ghost Rider and Blaze to warn them of the coming of the police. Not long after that the Sorcerer Supreme, Doctor Strange appeared to warn them of the coming of the demon queen Lilith and hoard of demons known as the Lilin.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Ghost Rider #25 (1990)\n", 
            "groupaffiliation": "None", 
            "hair": "White\n", 
            "height": 75, 
            "id": "Caretaker_(Unrevealed)", 
            "identity": "Unrevealed", 
            "intelligence": 1, 
            "knownrelatives": "Sara (granddaughter)", 
            "occupation": "Guardian of the family line connected to the Medallion of Power", 
            "origin": "Unknown", 
            "placeofbirth": "Unrevealed", 
            "powers": "Caretaker as one of the Blood, is apparently immune or highly resistant to aging and conventional disease. He possesses some degree of superhuman strength (enhanced human). When needed, he can call on an inner reserve of power, sufficient to physically overpower both Ghost Rider and Vengeance simultaneously. He may only be able to do this do to his connections to the Medallion of Power. In addition, he can extinguish the power of the Medallion within its users, transferring them back to human form instantly.", 
            "realname": "Unrevealed", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 200
        }
    }
}