{
    "add": {
        "doc": {
            "aliases": "Barrington", 
            "citizenship": "Ireland with an international criminal record", 
            "content": "Meanwhile, Sean became an Interpol agent and was assigned to a top-secret mission that required him to stay out of contact with his family for a considerable time. As he left on his mission, Sean was unaware that Maeve was in her first month of pregnancy, and their daughter, Theresa, was born during his absence. While visiting relatives in Armagh, Northern Ireland, Maeve and Theresa were caught in a terrorist bombing. Maeve was killed, but the authorities could find no trace of Theresa and assumed she was also dead. Those who knew about Theresa sought to keep her existence from Sean to spare him further grief; however, Tom had been present at the scene of the explosion and secretly saved Theresa. When Sean returned and learned of Maeve’s death, he blamed Tom for not protecting her and lashed out with his mutant power, causing Tom to fall and break his leg. Bitter, Tom resolved to conceal the truth about Sean’s daughter and raised Theresa as his own. Tom sent Theresa to boarding school at age 12 to shield her from his criminal activities. Three years later, Tom was captured in an undercover operation led by Sean and was jailed for five years.Subsequently reunited with Marko, now the super-criminal Juggernaut, Tom suggested they form a criminal partnership. One of their earliest employers was the Shi’ar alien Eric the Red, who bade them destroy the X-Men, whom Sean had recently joined as Banshee. Tom’s hatred of his cousin and the Juggernaut’s longstanding feud with the X-Men’s founder, his step-brother Charles Xavier, spurred them to accept the job. The pair ambushed the X-Men at Cassidy Keep, which Sean had recently inherited, but were defeated with the aid of the Keep’s resident leprechauns. After Theresa’s mutant nature manifested during adolescence, Tom trained her to aid him in his criminal activities as the costumed Siryn, clashing with the X-Men and Spider-Woman.However, Theresa’s heart was never in a life of crime, and while briefly in the custody of legal authorities Tom exonerated her and wrote a letter to Sean explaining who she was, after which father and daughter were joyfully reunited. Subsequently, Tom sought to capture the psychic Madame Web to aid in his criminal endeavors. He sent Juggernaut to capture her, but Juggernaut was defeated by Spider-Man after the web-slinger trapped him in a 40 foot deep foundation of wet cement. Later, when his partner-in-crime presented him with the Ruby of Cyttorak as a gift, Tom gained half the Juggernaut’s power. This brought them into conflict with Spider-Man and the X-Men, but Tom ultimately lost this newfound power and they escaped.Later, Tom struck a deal with businesswoman Arianna Jankos, who sought help in opposing a hostile takeover of her company in exchange for locating a dimensionally-displaced Juggernaut. After the Juggernaut was returned, the pair interrupted the takeover meeting and took all present as hostages, including millionaire mutants Gideon and Sunspot. The mutant strike team X-Force intervened, but Tom set off explosives in the building. X-Force’s leader, Cable, subsequently shot Tom, causing him to fall. However, he was saved by Deadpool, whose employer, arms dealer Tolliver, had Tom taken to a genetic engineering research facility outside Angôuleme, France where the injured portions of Tom’s body were grafted with an experimental wood-like substance. The substance acted like a genetic virus that hindered his entire cellular structure, transforming an increased amount of his body. To help save Tom’s life, Juggernaut sought out Genetech, the company that pioneered the grafting process. To avoid Juggernaut’s usual mass destruction, the hero Thunderstrike got Juggernaut the information he required.After the Juggernaut forced his release from the research facility, Tom rejoined his old partner-in-crime on the hunt for Tolliver’s will, bringing them into conflict with Deadpool. Soon after, Juggernaut agreed to turn Tom over to the authorities in exchange for Tom receiving treatment to cure his condition. Learning of his cousin’s state, Sean arranged for geneticist Doctor Killebrew to treat him in prison. Freed by the Juggernaut, Tom captured Killebrew and learned that samples of Deadpool’s regenerating cells could cure him. Sending soldiers to obtain such a sample, Tom was caught unawares when Banshee and Siryn aided Deadpool against them. Still, one of the soldiers managed to return with Deadpool’s left hand, and, after amputating his own, Tom had Killebrew replace it with Deadpool’s. The cure initially worked; however, the new cells began taking over Tom’s entire body, endangering his life once more. After a confrontation with Deadpool, Banshee and Siryn, Juggernaut forced Killebrew to stabilize Tom’s condition, after which Banshee flew him to hospital.The virus soon began spreading once more, finally mutating Tom’s entire body into a plant-like state with vast new powers. Apparently, the virus had been engineered from spores of the sentient island creature Krakoa, whose residual psyche subsequently compelled Tom to capture most of Banshee’s students in Generation X and imprison them underwater in an organic bio-transport at Krakoa’s original location. In the ensuing clash, Tom was sliced apart by the razor-sharp claws of Banshee’s student Penance.  He survived, and after briefly asserting control of the virus to appear human once more, he sought the X-Men’s help twice: first to save Juggernaut’s life after his power was stolen by the Cult of Chejo-Do, and again to prevent Juggernaut from unwittingly destroying another dimension.Tom next menaced Banshee and Generation X anew alongside Juggernaut and Mondo. Following a failed assault on the X-Man Cyclops at the behest of the anti-mutant ex-soldier Ulysses, Tom succumbed to the virus once more and transformed back into a plant-like creature. Returning to Cassidy Keep, Tom captured the castle’s inhabitants and began draining their life force. Hoping to help his friend, Juggernaut contacted the X-Men for assistance but Tom captured them as well. With the help of their newest member, the pheromone-generating Stacy X, the X-Men freed themselves and the Juggernaut, and together they defeated Tom, who apparently drowned.", 
            "durability": 7, 
            "education": "Oxford University", 
            "energy": 7, 
            "eyes": "Blue\n", 
            "fighting": 7, 
            "firstappearance": "(In shadow) X-Men #99 (1976); (fully) X-Men #101 (1976)\n", 
            "groupaffiliation": [
                "Formerly Brotherhood Of Mutants", 
                "former partner of Juggernaut"
            ], 
            "hair": "(originally) Black; (currently) None\n", 
            "height": 0, 
            "id": "Cassidy,_Black_Tom", 
            "identity": "Publicly known", 
            "intelligence": 6, 
            "knownrelatives": "Sean Cassidy (Banshee, cousin, deceased), Maeve Rourke Cassidy (cousin by marriage, deceased), Theresa Rourke Cassidy (Siryn, first cousin once removed), Liam Cassidy (ancestor, deceased)", 
            "occupation": [
                "Terrorist", 
                "former criminal", 
                "mercenary"
            ], 
            "origin": [
                "X-Force #31 (1994)", 
                "Classic X-Men #16 (1987)"
            ], 
            "placeofbirth": [
                "Dublin", 
                "Ireland"
            ], 
            "powers": "Black Tom Cassidy originally generated blasts of concussive force or heat by using wood as the focus for his power; typically a wooden shillelagh. Following genetic engineering, Cassidy could channel the energy he generated directly through the parts of his body that were grafted to a wood-like substance. Since his transformation into a plant-like being, Cassidy can grow to immense size, thus gaining superhuman strength, and can regenerate damaged or destroyed body parts with great speed. He can also mentally control all plant life within his vicinity, and can distribute his consciousness amongst plants he controls. Cassidy can drain the life force of organic beings.", 
            "realname": "Thomas “Tom” Samuel Eamon Cassidy", 
            "significantissues": [
                "Alongside Juggernaut, first opposed X-Men (X-Men #101-103, 1976-1977)", 
                "alongside Juggernaut & Siryn, vs X-Men & Spider-Woman/Jessica Drew (Spider-Woman #37-38, 1981)", 
                "sent Juggernaut to capture Madame Web, watched Juggernaut defeated by Spider-Man (Amazing Spider-Man #229-230, 1982)", 
                "briefly possessed Juggernaut's powers (Marvel Team-Up #150, 1984)", 
                "alongside Juggernaut, vs X-Force & Spider-Man, bombed World Trade Center, shot by Cable, delivered to Tolliver, sent for treatment (X-Force #1-3/Spider-Man #16/X-Force #4-5, 1991)", 
                "Juggernaut obtained information on Tom's condition from Genetech (Thunderstrike #2, 1993)", 
                "released from treatment, alongside Juggernaut, vs Deadpool (Deadpool: The Circle Chase #1-2, 1993)", 
                "reunited with Theresa, imprisoned (X-Force #31, 1994)", 
                "alongside Juggernaut, vs Deadpool, Banshee & Siryn, condition stabilized by Killebrew (Deadpool #1-4, 1994)", 
                "transformed into plant-like form, captured Generation X, menaced Banshee, opposed by Penance (Generation X #23-25, 1997)", 
                "alongside X-Men, helped restore Juggernaut's power (Uncanny X-Men #361, 1998)", 
                "alongside X-Men, prevented Juggernaut from destroying alternate dimension (X-Men #88/Uncanny X-Men #369, 1999)", 
                "alongside Juggernaut & Mondo, vs Generation X (Generation X #60-61, 2000)", 
                "alongside Juggernaut, vs Cyclops (Cyclops #1-2, 2001)", 
                "fully transformed into plant-like form, vs Juggernaut & X-Men (Uncanny X-Men #410-412, 2002)", 
                "joined Exodus' Brotherhood, vs X-Men, pulled into black hole (X-Men #161-164, 2004-2005)"
            ], 
            "speed": 6, 
            "strength": 7, 
            "universe": "Marvel Universe", 
            "weight": 200
        }
    }
}