{
    "aliases": "Unrevealed", 
    "citizenship": "Presumably a citizen of the British protectorate of Hong Kong", 
    "content": "Sir Denis Nayland Smith, an agent of the British intelligence agency MI-6, asked his ally, the martial arts master Shang-Chi, to go to Hong Kong to stop Cat's operations and to recover certain documents from him that had been stolen from British intelligence. Smith warned Shang-Chi that the life of a British counterpart was in danger from Cat. Shang-Chi accepted the mission.However, Smith was unaware both that Cat had left the employ of the Communist Chinese and that the British counteragent, a woman named Juliette, had fallen in love with Cat. Juliette told Shang-Chi where to find the documents but said she wanted to stay in Hong Kong with Cat. Shen Kuei, however, wrongly believed that Juliette had betrayed him to Shang-Chi and that Shang-Chi had been sent to assassinate him. Enraged, Cat intended to kill them both. Shang-Chi obtained the paper that Smith wanted, only to be told by the man he took them from that they were not stolen from the British after all. Believing him, the disillusioned Shang-Chi threw the papers away. However, the papers did indeed belong to British intelligence and described the activities of Shang-Chi's father, Fu Manchu, a major threat to the world's security. Cat and Shang-Chi, both consummate masters of the martial arts, battled each other until Juliette, to stop the fight, plunged a knife into shoulder. Horror struck and guilt-ridden, Cat broke off the fight and went to Juliette, begging her forgiveness. He threw a knife to Shang-Chi, giving him the opportunity to kill him. But Shang-Chi spared Cat's life and returned to London.Shen Kuei and the master criminal Kogar became partners to obtain the plans for a neutron bomb. But then the partnership ended, and Shen Kuei, again working for the Communist Chinese, acquired the plans for them. The relationship between Juliette and Shen Kuei had ended: she felt his love for her had lessened, and she believed his current work for the Communist Chinese was \"evil\" although she did not know exactly what he was doing for them. Finally, Shen Kuei had taken a new lover, the mercenary Pavane; Juliette herself fell in love with another mercenary, Skull-Crusher. Juliette decided to help Kogar hijack the barrels containing microdots with the bomb plans from Shen Kuei's men. However, Kogar tricked her into leaving a barrel containing explosives which killed Shen Kuei's brother, the owner of the Jade Peacock, a Hong Kong nightclub.Eventually, Cat and Shang-Chi both arrived at Kogar's secret base. There Cat accused Kogar of treachery and demanded a trial by combat. Kogar chose Shang-Chi, who had just infiltrated Kogar's organization, to act as his champion. Hence Cat and Shang-Chi again met in combat, but during the fight, Cat learned that it was Kogar, not Shang-Chi, who was responsible for his brother's death, and broke off the duel. Shang-Chi destroyed the plans for the neutron bomb, and he and Cat joined forces to destroy Kogar's base with explosives.", 
    "durability": 2, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 6, 
    "firstappearance": "Master of Kung-Fu #38 (1976)\n", 
    "groupaffiliation": [
        "Leader of his own band of operatives", 
        "sometimes ally of Shang-Chi"
    ], 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Cat_(Shen_Kuei)", 
    "identity": "Known to intelligence agencies and in the Hong Kong underworld", 
    "intelligence": 2, 
    "knownrelatives": "Brother (name unrevealed, deceased)", 
    "occupation": "Freelance espionage operative", 
    "placeofbirth": [
        "Unrevealed", 
        "presumably on Hong Kong"
    ], 
    "powers": "None", 
    "realname": "Shen Kuei", 
    "speed": 3, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 155
}