{
    "aliases": "None", 
    "citizenship": "Citizen of the United States", 
    "content": "Cerebra stayed behind at their temporary base at Hoover Dam while the rest of the X-Men faced the Theatre of Pain and Alchemax’s Valhalla, with its genetically engineered heroes.  But she joined them when they hunted down Mama Hurricane, a mutant savior from the time of the Great Purge, and briefly fought against her Freakshow.  The X-Men later answered a call from Krystalin, who Xi’an had sent away to meet Victor Ten Eagles, and Cerebra faced Zhao’s X-Men, known as the Chosen, along with her team.  She was also captured with many of them and set free once Xi’an had destroyed Zhao within Xi’an’s own mind, unleashing his repressed criminal personality.  When Xi’an left with Skullfire to find the Driver and the mutant paradise, Avalon, Cerebra stayed back and used her medical knowledge to try and undo the damage Zhao did to his X-Men when he artificially accelerated their growth.  Since their genetic enhancement made them physically unstable, Cerebra was forced to cryogenically freeze the remaining members to try and heal them.  Cerebra had discovered a way to reverse the cellular decay in Zhao’s X-Men and she was ready to reverse the process when Xi’an appeared and stole the X-Men and Zhao’s comatose body away for the Theatre of Pain.  Xi’an also left a time bomb behind, next to an unconscious Cerebra, but she awoke and evacuated Skullfire and Luna in time to avoid being blown apart.In order to rescue Xi’an from the Theatre, Cerebra led Skullfire and Luna to Broken Haiku’s bar for information.  She learned that she had to pass through the Floodgate, the Theatre’s gathering place for its victims, to find Xi’an.  Together with the other two X-Men, Cerebra snuck into the Floodgate, disguised as outcasts looking for the Floodgate’s assistance.  But the three were quickly recognized and only Junkpile’s appearance, as a S.H.I.E.L.D. officer, distracted the guards.  Cerebra quickly took advantage of their distraction and made her way into the Theatre’s interior, colliding with the mutants Quiver and Sham along the way.  After leaving them, Cerebra confronted Xi’an, then known as Controller X, but he knocked her out when she attacked him.  She was forced to watch as Xi’an orchestrated a massive broadcast of suffering from a mass of victims.  But when Xi’an turned the Mindfire Machine on Brimstone Love in order to gain control of the Theatre, Cerebra disabled the machine to stop the broadcast, which allowed Brimstone Love to teleport away.  Before Xi’an could hurt her for letting him get away, Lunatica used her powers to bring out his repressed memories, which shocked him out of his meglomanical state.  While Xi’an was apologizing to Cerebra for what he had done, President Doom appeared and announced that he had built Halo City to contain the Floodgate’s refugees, and was putting the X-Men in charge of security.While the rest of the X-Men settled into their jobs in the Protectorate, Cerebra counseled Xi’an to take a break from the healing he was pushing himself to do to as retribution.  She later headed to the hospital when it was destroyed by the Graverobber’s Undead.  Along with the other X-Men, Cerebra fought the Undead until a revived Serpentina killed Skullfire, and they disappeared with his body.  As her psionic powers were useless against someone who was already dead, Cerebra armed herself with a gun filled with neural scatter shot, and so she was prepared when she faced two of the Undead later.  She injured one of the two, Embers, and they both escaped.  It was only later that the Graverobber revealed that he wanted Zail Hadded, Cerebra’s father, the infamous red market czar, or he would use Skullfire to destroy the city through its power reactor, the Spark.  Graverobber explained that Zail had used him as a group of genetically engineered superhumans he created to clean up toxic waste where normal humans would be killed.  But Zail put the degens in danger, and many died.  And while Cerebra disagreed with her father’s experiments, she refused to hand him over.  Then, in a fight with the Undead, which Morphine Somers saved Cerebra from the super strong Russian by killing him, Somers agreed to turn Zail over to the Graverobber in exchange for the city’s safety.  But Somers tricked the Graverobber and attached a bomb to Zail, which put Zail in the hospital and killed the Graverobber, breaking his hold on his revived minions.  The X-Men were finally able to put Serpentina to rest.  And it was later discovered that Skullfire was never actually dead, as he was slowly evolving into a being of pure light, that had no use for a physical body.Later, the techno-anarchist, Billy Zedd, approached Cerebra and flipped a coin at her, transporting her to meet President Doom.  Doom explained that, according to his calculations, a mutant messiah was going to appear soon, and as Cerebra was the only responsible member of the X-Men, he wanted her to lead a team called X-Nation to ensure that the messiah would be properly taught.  Doom also showed her the hidden transportation devices hidden beneath the city, and gave her the key.  Cerebra later saved the young mutants Nostromo and Clarion from a group known as the Wild Boys, and led them to the Xavier Shelter.  Cerebra then briefly left the X-Men to become the leader of X-Nation.", 
    "durability": 1, 
    "education": "Some medical training from her father.", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "X-Men (2099) #1\n", 
    "groupaffiliation": [
        "X-Men", 
        "former leader of X-Nation", 
        "Halo City Protectorate", 
        "Stark-Fujijkawa 2099"
    ], 
    "hair": "Black\n", 
    "id": "Cerebra_(2099)", 
    "identity": "Publicly Known", 
    "intelligence": 1, 
    "knownrelatives": "Zail Haddad (father)", 
    "occupation": "None", 
    "placeofbirth": "Unrevealed", 
    "powers": "Cerebra is telepathic mutant, able to sense nearby mutants and connect with their minds enough to know if they continue to live.  She is also able to take over another person's nervous system and either paralyze them or render them unconscious.", 
    "realname": "Shakti Haddad", 
    "significantissues": "X-Men (2099) #1 (intro), X-Men (2099) #30 (made leader of X-Nation)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}