{
    "add": {
        "doc": {
            "aliases": [
                "None", 
                "for a time", 
                "Citizen V’s body was secretly used by Baron Helmut Zemo’s consciousness"
            ], 
            "citizenship": "U.K.", 
            "content": "Due to the underground nature of the Battalion, the activities of Citizen V remained unknown to the world at large. At one point, Watkins was hospitalized after being wounded in the line of duty and was placed in a coma. During this time, Baron Zemo embarked on a plan to lead his team of Masters of Evil in masquerading as heroes to earn the trust of the world's governments. Zemo took the identity of Citizen V, claiming to be the grandson of the original hero. Eventually, however, Zemo revealed the truth during his attempt to take over the world, and he abandoned the identity.The V-Battalion hoped to take revenge on Zemo's appropriation of the Citizen V title. With Watkins still in a coma, they contacted Dallas Riordan and convinced her to take on the role. Eventually, Riordan became fed up with the Battalion's demands on her, and she abandoned the role as well. The Battalion hoped to reinstate Watkins and were surprised to find him recuperated. In fact, unknown to the Battalion, Zemo had managed to take over the mind of Watkins. (Zemo was believed to have died at the hands of Scourge, but in fact, Zemo survived due to a failsafe device engineered by his robotic associate Techno, a failsafe which transferred Zemo's consciousness to a computer at the moment of his death. Techno, out of a perverse sense of humor, then transferred Zemo's consciousness into Watkins' comatose body.)Zemo pretended to be the revived Watkins and assumed Watkins's former role as the leading agent of the V-Battalion, a role which brought him into contact with various members of the Avengers and the Thunderbolts, his former Masters of Evil. For a time, Zemo, as Citizen V, was offered leadership over the Redeemers, team of super-agents organized by the Commission on Superhuman Activities (the same organization that was manipulated to make Scourge).Shortly afterward, the Redeemers were confronted by the Thunderbolt's archenemy, Graviton, who proceeded to slaughter the heroes before attempting to reshape the world in his own image. Zemo escaped and decided to reactivate his former Thunderbolt teammates, who managed to fight Graviton to a standstill and revealed that the aliens known as the P'Tah were using Graviton's energies to open a portal to the P'Tah's dimension. The Thunderbolts fought back the P'Tah invasion, but it took Graviton's dying effort to cause the portal to implode, sending himself and the P'Tah back. At the same time, the V-Battalion tried to teleport Zemo out of the area. The combination of energies interfered with Zemo's presence in Watkins' mind. Watkins was teleported away, and Zemo's presence was shunted to the mechanical systems of the Fixer.Watkins resumed his role as Citizen V, later working with the Thunderbolts for the first time when he asked their members Hawkeye and Songbird to help the V-Battalion. The Battalion's ship, which was powered by an engine of alien technology, began distorting, threatening to suck the Earth into the null space of a white hole. The Thunderbolts ultimately plugged the void and shunted the alien ship from Earth, and in the process Baron Zemo and other Thunderbolts, believed lost in the battle with the P'Tah, were returned to Earth. Watkins hoped to bring Zemo to justice, but Zemo pointed out that he was already legally dead, and Watkins was forced to part company.", 
            "durability": 2, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 5, 
            "firstappearance": "Thunderbolts #45\n", 
            "groupaffiliation": "V-Battalion", 
            "hair": "Brown\n", 
            "id": "Citizen_V_(John_Watkins_III)", 
            "identity": "Secret", 
            "intelligence": 2, 
            "knownrelatives": "John Watkins (Citizen V, grandfather, deceased); John Watkins, Jr. (Citizen V, father, deceased); Paulette Brazee (Citizen V, mother, deceased)", 
            "occupation": "Adventurer", 
            "placeofbirth": "Unrevealed", 
            "powers": "None", 
            "realname": "John Watkins III", 
            "speed": 2, 
            "strength": 2, 
            "universe": "Marvel Universe"
        }
    }
}