{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Princess of the Dark Dimension", 
            "content": "Dormammu had long sought to conquer Earth and, as a result, often confronted Earth’s defender,Doctor Strange. When Doctor Strange journeyed into the Dark Dimension to continue his battle against Dormammu, he was aided by Clea, and the two quickly fell in love. On subsequent battles, Clea continued to help Doctor Strange, and their infatuation grew.Umar first gained control of the Dark Dimension when Dormammu was trapped in a pocket dimension after a battle with Doctor Strange and Eternity itself. Seeking revenge against Strange, Umar used Clea as a hostage. Doctor Strange rescued her, but his mentor the Ancient One convinced him that Clea would only be safe if she were sent to another pocket dimension. The couple agreed, even though they believed they might never see each other again. However, the dimension proved to be the same one that Dormammu was exiled to. Dormammu began to set plans in motion for his escape, but Doctor Strange thwarted his plans and rescued Clea in the process.Doctor Strange returned to Earth with Clea, and she lived with him in his Sanctum Sanctorum, becoming his lover and disciple. Over the years, she grew in her mystical potential and became nearly his equal in mystical aptitude. She joined him on many of his adventures, even as a member of his team, the Defenders, when the team helped defeat Dormammu from invading Earth on several occasions.Eventually, Clea left Earth to return to the Dark Dimension, in part because she believed that Doctor Strange’s heart belonged to Morgana Blessing. Umar had once again seized the throne from Dormammu, who was believed dead when his essence was scattered across several dimensions. Clea was determined to help the forces of rebellion in their attempt to overthrow her. Clea and Doctor Strange sought out Prince Orini, the true heir to the original ruler, Olnar, and Strange learned the truth of Clea’s birthright. Clea and Umar battled one-on-one, with Clea emerging triumphant and claiming rulership of the Dark Dimension. Umar and Orini, who remained loyal to her, were exiled to a pocket dimension. A short time into her reign, she and Doctor Strange were married in the Dark Dimension.When Dormammu reappeared, he won control over the Dark Dimension once again, forcing Clea to return to Earth once more. However, she grew uncomfortable in their relationship. Stronger and more capable, she no longer needed Doctor Strange as a mentor, and their relationship suffered.  Clea returned to the Dark Dimension and her role as leader of the resistance against him and his sister.", 
            "durability": 2, 
            "education": "Extensive studies of sorcery under Doctor Strange", 
            "energy": 4, 
            "eyes": "Blue\n", 
            "fighting": 2, 
            "firstappearance": "Strange Tales #126 (1964)\n", 
            "groupaffiliation": "Formerly Defenders", 
            "hair": "White\n", 
            "height": 0, 
            "id": "Clea", 
            "identity": "Publicly known in the Dark Dimension (the general populace of Earth does not know that Clea is an extradimensional or believe that she is a true sorceress)", 
            "intelligence": 4, 
            "knownrelatives": "Doctor Stephen Strange (husband), Umar (mother), Orini (father), Dormammu (uncle), Olnar (grandfather, deceased), Sinifer (grandmother), Victor Strange (brother-in-law)", 
            "occupation": [
                "Rebel", 
                "sorceress", 
                "former ruler of the Dark Dimension", 
                "disciple of Doctor Strange"
            ], 
            "origin": "Doctor Strange #8-9 (1975)", 
            "placeofbirth": "The Dark Dimension", 
            "powers": "Clea is the Sorceress Supreme of the Dark Dimension, possessing vast magical powers. She has exhibited such abilities as forming and throwing magical bolts of energy, conjuring objects and energies, teleporting, telekinesis, controlling others’ minds, and casting illusions. Presumably, she is capable of replicating any spell performed by her former mentor, Doctor Strange.  As she is descended from the Faltine race of beings, it is suggested that can generate her own mystical energy like Umar and Dormammu and draw upon it to fuel her magic. She also possesses greater strength and body density than that of a normal Earth human. Her age is indeterminate, having lived for centuries but having the form and demeanor of a twenty year-old woman, and the rate at which she ages is unknown.", 
            "realname": "Clea", 
            "significantissues": [
                "Became ruler of the Dark Dimension (Doctor Strange #71-74, 1985)", 
                "married Doctor Strange (Doctor Strange #3, 1989)", 
                "helped battle the Order (The Order #4-6, 2002)"
            ], 
            "speed": 7, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 190
        }
    }
}