{
    "aliases": [
        "Kasper Cole", 
        "White Tiger", 
        "Black Panther"
    ], 
    "citizenship": "U.S.A.", 
    "content": "When Kasper's commanding officer, Sal Anthony, asked him to run an errand, his crew inexplicably got jumped at an undercover drug bust, an obvious set-up. For ruining the bust, Kasper found himself with a temporary suspension. During his suspension, Kasper stole a costume of the Black Panther from Sergeant Tork, his boss and a former ally of the original Panther. Kasper, using the costume, then raided an accounting session between the 66 Bridges gang and a group of corrupt police officers. Kasper discovered the 66 Bridges gang had grew to become a large organized crime syndicate, including ties with political and private figures. Sal Anthony was one of those on the 66 Bridges' take. Kapser dedicated himself to taking down Anthony and the Bridges, balancing his aggressive pursuit while supporting his mother and his pregnant girlfriend.At the time, T'Challa, the true Black Panther, had disappeared. The appearance of a new Panther aroused the interest of Hunter, the White Wolf, adopted brother and rival of the Black Panther and chieftain of the outlawed Hatut Zeraze tribe, the Wakanda secret police. Hunter offered Kasper counsel in his new heroic role, although Kasper refused. Hunter nevertheless began to actively pursue Kasper as his new protégé, and Kasper soon discovered T'Challa alive and hiding in Brooklyn. T'Challa refused to answer any of Kasper's questions, including the question of whether T'Challa had set up Kasper to succeed him.Kaspar discovered the leader of the 66 Bridges to be the man known as Kibuka, although he could never approach him or discover his true identity. During this time, Sal Anthony captured and killed Sergeant Tork, believing him to be the Black Panther. In grief and anger over his friend's death, Kasper felt driven to a desperate maneuver-- to offer to join Anthony's crooked crew. Anthony set Kasper up to take a fall, but Kasper turned the tables on Anthony with the help of T'Challa and Hunter and the Hatut Zeraze. He had discovered Anthony's secrets that forced the Captain to join the 66 Bridges, and in the final showdown, Kasper put his own life on the line. Ultimately, Internal Affairs, who had earlier hoped that Kasper would help them, was forced to move in before they were ready. Anthony was disciplined and demoted, becoming Kasper's new supervisor in the narcotics division.In the course of further clashes against the 66 Bridges gang, Kasper was forced to realize that the best he could hope to be was merely a normal man posing as the Black Panther. Determined to become more than that, he confronted T'Challa, the true Black Panther, and demanded the ancient Wakandan Rite of Ascension, the end of which would allow Kasper to partake of the heart-shaped herb, the source of the Black Panther's superhuman powers. Although disinclined, the T'Challa agreed, warning that Kasper would have to confront the Wakanda chieftain in the final test. In fact, the villain Killmonger, who once usurped T'Challa's position as chieftain, managed to revive from a death-like state and resume his post as chieftain. It was Killmonger who Kasper confronted and was unable to defeat.Instead, Killmonger offered Kasper a deal. Killmonger offered Kasper a genetically-modified version of the herb to match Kasper's non-Wakanda physiology and the position of \"White Tiger,\" an acolyte of the Panther Cult under Killmonger's service. Killmonger further offered to help Kasper get information regarding Sergeant Anthony's son, who was kidnapped by the 66 Bridges gang to keep Anthony on their payroll. Kasper agreed, and Killmonger, for his part, gained a servant who would owe him a favor as well as the opportunity to annoy T'Challa and to one-up the White Wolf.Knowing that if Killmonger would find Anthony's son first, he would be inexorably indebted to him, Kasper used his new herb-enhanced abilities to track down the boy on his own. He managed to find the boy first, finding him with T'Challa. T'Challa had been watching Kasper from day one, surreptitiously helping him as best he could to pass this unique ascension. He also revealed that Kasper had direct African lineage, a fact that would help the Wakanda tribal council accept him as a true White Tiger.Kasper continued to use the White Tiger identity while living with his mother and girlfriend and working for the NYPD. He was always on the search for a big break, one that would allow him a promotion, and a raise, to help support his family; however, most such cases would require him to work as the White Tiger and deny his police identity to claim responsibility for the arrest.The payoff for the 66 Bridge's network of crooked contacts was carried by the legendary \"Money Train\" subway, which Rhodes managed to derail. The derailment, however, sparked a running gun battle beneath the streets of the Mog as both police and street gangs competed to be the first to reach the crash site. One of the police officers was Kasper Cole, who investigated as the White Tiger. The derailment also brought the former freelance spy Junta, and they both found themselves embroiled in the battle between police and gang warlords. James Rhodes got the drop on both of them but wound up helping them escape the cops, who eventually managed to take control of the situation.", 
    "durability": 3, 
    "education": "College graduate, Police Academy", 
    "energy": 3, 
    "eyes": "Brown\n", 
    "fighting": 4, 
    "firstappearance": "Black Panther #50 (2002)\n", 
    "groupaffiliation": [
        "The Crew", 
        "Acolytes of the Panther Cult", 
        "NYPD"
    ], 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Cole,_Kasper", 
    "identity": "Secret", 
    "intelligence": 3, 
    "knownrelatives": "Jonathan Peyton “Black Jack” Cole (Kibuka, father, deceased), Ruth Cole (mother), Gwen (fiancée), Nigel Blaque (Triage, half-brother), unborn son", 
    "occupation": "Police officer", 
    "placeofbirth": [
        "Harlem", 
        "New York City", 
        "New York"
    ], 
    "powers": "In becoming the White Tiger, Kasper’s physiology was enhanced due to a special variant of a mystical heart-shaped herb. Kasper's agility, speed, and reflexes have been enhanced, and his senses have been sharpened to a superhuman level. Unfortunately, Kasper has yet to learn to cope with the overwhelming sensations his enhanced senses give him, which often leads him into fits of vomiting or crippling over-stimulation.", 
    "realname": "Kevin Cole", 
    "speed": 2, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 195
}