{
    "aliases": [
        "Peter Rasputin", 
        "formerly Peter Nicholas", 
        "the Proletarian"
    ], 
    "citizenship": [
        "U.S.A. (naturalized)", 
        "formerly Russian"
    ], 
    "content": "When the X-Men visited the prehistoric Savage Land in Antarctica, Colossus saved some native women from a dinosaur. In return, the two surviving women, Nereel and Shakani, bade him join in a ritual to honor their fallen friend. Said ritual involved the creation of a new life, and though Piotr was initially reluctant, the two women persisted until he surrendered himself to their affections. Later, the X-Men were captured by the assassin Arcade, who brainwashed Colossus into believing he was the Proletarian, workers' hero of communist Russia, and turned him against his teammates. Colossus overcame this conditioning, and the X-Men soon faced the reality-manipulating mutant Proteus, who proved to be vulnerable to metal. Seizing upon this weakness, Colossus plunged his metal fists into the heart of Proteus' energy form, seemingly destroying him and taking Colossus' innocence along with him. Soon after, the X-Men recruited young mutant Kitty Pryde. Despite their initial shyness, a romance blossomed between her and Colossus. Later, Arcade's assistant Miss Locke kidnapped the X-Men's loved ones, including Illyana, to coerce the team into rescuing Arcade from the despotic Doctor Doom. The X-Men rescued them, and Illyana remained with her brother at Xavier's mansion. Eventually, Illyana was trapped in the demon-filled realm Limbo by its then-master, Belasco. She remained his captive for many years, though only moments had elapsed on Earth, and returned as the adolescent sorceress Magik.After a failed demonic invasion of New York, Illyana regressed in age. Colossus believed she would be safer away from the X-Men and sent her home to Russia while he returned to Australia with the team. Weary of seemingly endless battles, the X-Men entered the Siege Perilous, a mystic gateway that judged all who entered it and sent them to new lives. Colossus emerged virtually amnesiac, establishing a new identity as Peter Nicholas, a building superintendent who became a renowned artist. While in this identity, he would encounter the Morlock ex-leader Callisto, whose appearance was altered into that of a beautiful woman by the skin-controlling Morlock, Masque. His idyllic existence ended when he was possessed by the psychic Shadow King and sent to kill Xavier. He was freed when Xavier erased the Peter Nicholas persona, restoring Colossus' true self, and he rejoined the X-Men. Soon after, the X-Men were pulled into a dimensional void where Colossus was reunited with Mikhail. The X-Men returned to Earth, bringing Mikhail with them; however, Mikhail's sanity had suffered due to his long years of isolation and he snapped, leading the Morlocks in an apparent mass suicide. Unknown to Colossus, Mikhail had actually teleported the Morlocks to an alternate dimension known as \"the Hill.\"Meanwhile, the Russian government invaded the Rasputin home, killing Colossus' parents and capturing Illyana, whom they sought to genetically accelerate to combat the threat of the mutant Soul Skinner. She was soon rescued by Colossus and came to live with him in America. Eventually, Illyana fell victim to the mutant-killing Legacy Virus, and a disillusioned Colossus abandoned Xavier's dream, joining Magneto's disciples, the Acolytes. Peter would care for the mindwiped Magneto after Professor X avenged Wolverine's injuries at the master of magnetism's hands. After the destruction of Magneto's orbital base Avalon, at the hands of Holocaust, a mutant from a reality where Apocalypse was master of most of the world, Colossus would be reunited with Callisto, who he had feelings from while suffering from amnesia under the influence of the Siege Perilous. Later on, Piotr searched for Kitty, then a member of the British super-team Excalibur. When he found Kitty kissing her then-boyfriend Pete Wisdom, Colossus nearly beat Wisdom to death in a jealous rage. Excalibur took responsibility for Colossus, and he came to accept his role with the team, serving as a valued member until they disbanded, after which Colossus rejoined the X-Men. When Xavier temporarily disbanded the X-Men in an effort to flush out an alien impostor, Colossus and his teammate Marrow set off on vacation, but were instead teleported to the Hill. There, Colossus freed Mikhail from the corrupting influence of a sentient energy being and took him back to Earth. Soon after, during a clash between the X-Men and the forces of Apocalypse, Mikhail used his powers to teleport Apocalypse's Horsemen to parts unknown.Soon after, Colossus became involved in a mystery involving the deaths of several of his cousins, all of whom (like himself) were descended from the “doom of Old Russia”, Grigory Rasputin. After going back home to protect what was left of his family, Colossus was able to locate his cousin and uncle.  They all brought to light the problems with the family and insanity only to later find out that Grigory was attempting to return through his descendants. Grigory had been part of a master plan that was centuries in the working. Grigory and Mr. Sinister had been working towards the return of Apocalypse and the destruction of humanity. Believing this Colossus found that Mister Sinister had teamed with his brother Mikhail to hasten the process.Colossus and Mikhail began to fight with each other over who would be the last Rasputin left to inherit Grigory's soul.  Ultimately, Mikhail sought to protect Colossus by exiling himself to ensure Grigori could never return.", 
    "durability": 7, 
    "education": "College level courses taken at Xavier's School for Gifted Youngsters, no degree", 
    "energy": 5, 
    "eyes": "Blue, (transformed) Silver\n", 
    "fighting": 5, 
    "firstappearance": "Giant Sized X-Men #1 (1975)\n", 
    "groupaffiliation": [
        "X-Men", 
        "formerly Excalibur", 
        "Acolytes"
    ], 
    "hair": "Black\n", 
    "height": 78, 
    "id": "Colossus_(Piotr_Rasputin)", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Grigory Efimovich Rasputin (great-grandfather, deceased), Elena (great-grandmother, deceased), Ivan Rasputin (great-grand uncle, deceased), Grigory Rasputin (grandfather, deceased), Nikolai Rasputin (father, deceased), Alexandra Rasputina (mother, deceased), Vladimir Rasputin (uncle, deceased), unidentified aunt & uncle (deceased), Illyana Nikolievna Rasputina (Magik, sister, deceased), Mikhail Rasputin (brother), Peter Jr. (son), Larissa Mishchenko (cousin, deceased), Konstantin (cousin, deceased), Klara (cousin, deceased), Dimitriy (cousin, deceased)", 
    "occupation": [
        "Adventurer", 
        "former artist", 
        "superintendent", 
        "student", 
        "farmer"
    ], 
    "origin": "X-Men #122 (1979)", 
    "placeofbirth": [
        "Ust-Ordynski Collective", 
        "near Lake Baikal", 
        "Siberia", 
        "Russia"
    ], 
    "powers": "Colossus can transform his body tissue into an organic, steel-like substance that grants him superhuman strength enabling him to lift/press up to 75 tons and makes him impervious to most injury. His armored form can withstand ballistic penetration as well as temperature extremes from 70º above absolute zero (-390º F) to approximately 9000º F. Colossus cannot become partially or selectively armored; his body is either entirely converted, or not at all. Even his eyes become steel-like.\nThrough an act of will, Colossus can transform virtually instantaneously into his armored state, and can remain in that form for an as yet undetermined amount of time. Once in his armored form, Colossus remains so until he consciously wills himself back to normal. If he is rendered unconscious, however, he spontaneously reverts to his normal form. In his armored state, Colossus retains his normal human mobility, though his endurance and speed are enhanced. He does not need to breathe while transformed, but it is believed that he could not survive for long in a vacuum.", 
    "realname": "Piotr Nikolaievitch Rasputin", 
    "significantissues": [
        "Fathered child with Nereel (Classic X-Men #21, 1988)", 
        "briefly became Proletarian (X-Men #123-124, 1979)", 
        "began relationship with Kitty Pryde (Uncanny X-Men #174, 1983)", 
        "reunited with Nereel, first met son (Uncanny X-Men Annual #12, 1988)", 
        "entered Siege Perilous, returned as Peter Nicholas (Uncanny X-Men #251, 259, 1989-1990)", 
        "briefly possessed by Shadow King, vs Xavier, memory restored, rejoined X-Men (Uncanny X-Men #277-279/X-Factor #70/X-Men #1, 1991)", 
        "sister died, rebelled against X-Men, joined Acolytes (Uncanny X-Men #303-304, 1993)", 
        "joined Excalibur (Excalibur #92, 1995)", 
        "returned to X-Men (Excalibur #125/Uncanny X-Men #360/X-Men #80, 1998)", 
        "sacrificed life to release Legacy Virus cure (Uncanny X-Men #390, 2001)", 
        "restored to life, reunited with Kitty, rejoined X-Men (Astonishing X-Men #4-6, 2004)", 
        "began investigation into family member's deaths (X-Men: Colossus - Bloodline #1, 2005)"
    ], 
    "speed": 4, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 250
}