{
    "aliases": [
        "Formerly Crimson Commando", 
        "Cyborg", 
        "Cyborg X", 
        "\"Psychotic Transformer\"", 
        "\"Destructive Shape-Changing Psychopath\""
    ], 
    "citizenship": "U.S.A", 
    "content": "Bohannan, Super Sabre, and Stonewall returned to America. When they arrived home they were disturbed by the criminal acts of people who thought they were \"above the law\". Finally deciding to do something they came out of retirement and would kidnap criminals and hunt them for sport. Later they accidentally captured Storm and realized that she was not a criminal. Faced with this dilemma they decided to hunt down Storm in order to keep their whereabouts a secret. Storm was also captured with another prison while they were hunted. Priscilla Morrison, who was in fact their actual target. Morrison betrayed Storm, but before she could kill Storm the Commando was able to kill her. Storm and the Commando then fought in combat, which she won. After she won she demanded that Commando and Stonewall turn themselves in. Distraught because they thought Super Sabre was dead, they complied and turned themselves in.", 
    "durability": 1, 
    "education": "Unknown", 
    "energy": 1, 
    "eyes": "White (no visible irises)\n", 
    "fighting": 1, 
    "firstappearance": "Uncanny X-Men #215\n", 
    "groupaffiliation": [
        "Project: Wideawake", 
        "formerly Freedom Force", 
        "former partner of Stonewall", 
        "Super Sabre", 
        "and Yankee Clipper", 
        "turned into cyborg by Care Labs"
    ], 
    "hair": "White\n", 
    "height": 73, 
    "id": "Commando_(Frank_Bohannan)", 
    "identity": "Known to the U.S. Government", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": [
        "Government Operative", 
        "formerly vigilante", 
        "adventurer", 
        "otherwise unknown"
    ], 
    "origin": "Uncanny X-Men #215-216", 
    "placeofbirth": "An undisclosed location in Massachusetts", 
    "powers": "Commando is a mutant whose power has permitted him in his prime to achieve virtually the peak of human physical perfection with minimum training. He has retained much of his physical prowess over the decades. He has superhumanly acute senses, enabling him to clearly see people and objects moving at superhuman speed. Since being rebuilt as a cyborg by Care Labs, the Commando has bionic legs which grant him superhuman running and leaping ability. He has a bionic right arm which serves as a machine gun and has a cybernetic left eye whose capabilities are unknown. Also thanks to his cybernetic enhances he now has superhuman strength and durability, the ability to track and lock onto individuals more precisely using biorhythms, and various other computerized senses. His cybernetic limbs can also elongate and morph to an unknown degree. His various cybernetic limbs could become projectile weapons, his legs could merge together to create a rocket type propulsion system. He also could extend various tentacles which could be used as weapons, or used to grab, hold, or push things. His new cybernetic form also allowed him to self-repair to an unknown limit.", 
    "realname": "Frank Bohannan", 
    "significantissues": "Uncanny X-Men #215-216", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 235
}