{
    "aliases": "Mister Buda", 
    "citizenship": "Unrevealed", 
    "content": "In recent years, as \"Mister Buda\", he sent Captain America on a temporal journey to experience America in its totality. He later pulled Rogers from time alongside his post-World War II Captain America successors: William Naslund (the former Spirit of '76), Jeff Mace (the former Patriot), and \"Steve Rogers\" (Captain America of the 1950's). By doing so, the Contemplator diverged reality-8206, in which the android Adam II had conquered the world. Dying of cancer in the modern era, Mace sought to regain past glory as Captain America; the four Captains narrowly defeated Adam II, with Mace striking the final blow and accepting his mortality as the Contemplator returned them to their own times.While the Contemplator returned to meditation, an imposter (apparently a Skrull mimicking his psychic powers) briefly joined multiple Elders against Galactus, then allied with the savage Reptyl, who devoured him. His astral self animating his partially remaining head, the imposter engineered vengeance on Reptyl and sought to conquer the Kree Empire, only to be driven mad by the alien Cotati. While investigating stories of an imposter, the true Contemplator encountered Earth heroes Quasar, Makkari and Her while summoning fellow Elder the Caregiver to save the cosmic fetus Origin from wounds inflicted by the monstrous Soul-Eater.  The Contemplator then guided Quasar into the Dimension of Manifestations to investigate Eternity itself, comatose due to a Cosmic Cube-empowered Magus' assault; while there, he advised Quasar on how to overcome the abstract Anomaly, embodiment of all things like no other thing.Seemingly allied with K'un-Lun's Steel Serpent, the Contemplator manipulated a newly revived and directionless Iron Fist in studying and reassembling the fragmented Anomaly Gem (no relation to the Anomaly), which resurrected the Serpent, who then usurped Iron Fist's power. Iron Fist ultimately defeated the Serpent, reclaimed his full power and re-achieved peace with himself - the Contemplator's goal all along. Most recently, the Contemplator visited the planet Godthab Omega, drawn there by the reality-altering Glorian, and witnessed the subsequent arrival of the Annihilation Wave.Contemplator was in need of a unique champion to defeat the universal threat known as the Awareness, a being that devoured consciousness as just as Galactus devours worlds. So he assembled the Deadpool Corps, a team of “motor mouth mercenaries” from across the multi-verse to do his bidding. However, he was met with opposition from his fellow Elders, Grandmaster and the Champion both of which thought the Deadpool Corps was incompetent and very unstable for a task of this magnitude. Contemplator’s decision was supported by the Gardener who saw the Deadpool Corps' mental instability as an asset rather than a liability, considering that their opponent targeted the intellect of others. The Deadpool Corps would prove the Contemplator to be right, after they thwarted the Awareness’ schemes to deprive the universe of its consciousness. The Corps members were rewarded with a ring each that would allow them to call upon an Elder to assist them in their time of need. However, each ring could only be used once.", 
    "durability": 1, 
    "education": "Extensively self taught", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Marvel Treasury Special: Captain America's Bicentennial Battles (1976)\n", 
    "groupaffiliation": "Elders of the Universe", 
    "hair": "Bald\n", 
    "height": 60, 
    "id": "Contemplator", 
    "identity": [
        "Existence unknown to Earth's general populace", 
        "his true name is known to celestial beings and others he has met."
    ], 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": [
        "Philosopher", 
        "teacher", 
        "investigator of reality"
    ], 
    "origin": "Official Handbook of the Marvel Universe: Deluxe Edition #3 (1986)", 
    "placeofbirth": "Unspecified location in the Coalsack Nebula", 
    "powers": "The Contemplator is immune to aging and conventional disease, and can allegedly regenerate from injury.  He has complete mastery over his physical form and extensive understanding of the fundamental forces of the universe itself.  His vast mental powers include telekinesis, precognition, astral projection, teleportation and telepathy, though he favors less rudimentary mental disciplines.  He can convert into energy, traveling the universe at warp speed and penetrating virtually any barrier.", 
    "realname": "Tath Ki", 
    "significantissues": [
        "Sent Captain America on journey through America's past & future (Marvel Treasury Special: Captain America's Bicentennial Battles, 1976)", 
        "sent four Captain America's to defeat Adam II of reality-8206 (Captain America Annual #6, 1982)", 
        "assisted Origin, aided Quasar in finding Eternity (Quasar #37, 1992)", 
        "sent Iron Fist on Anomaly Gem quest (Marvel Comics Presents #125-132, 1993)", 
        "communed with Iron Fist (Spider-Man Unlimited #13, 1996)", 
        "led Iron Fist to restore Steel Serpent & ultimately regain full power & harmony (Iron Fist #1-2, 1996)", 
        "summoned to Godthab Omega by Glorian (Annihilation: Ronan #3, 2006)", 
        "imposter joined Elders of the Universe in plot to assassinate Galactus, Elders cast into black hole but imposter escaped, Galactus sent Silver Surfer to find him (Silver Surfer #3 & 7-10, 1987 & 1988)", 
        "imposter allied with Reptyl vs Silver Surfer & Nova, devoured by Reptyl after defeat (Silver Surfer #12, 1988)", 
        "portion of imposter's head seen floating in space (Silver Surfer #13, 1988)", 
        "imposter initiated alliance with Clumsy Foulup to gain vengeance on Reptyl (Silver Surfer #20, 1989)", 
        "imposter's alliance with Obliterator revealed (Silver Surfer #21, 1989)", 
        "imposter manipulated Foulup into alliance with Kree against Reptyl & Skrulls (Silver Surfer #25-27, 1989)", 
        "imposter guided Foulup to stab Reptyl (Silver Surfer #29, 1989)", 
        "Foulup welcomed as hero to Kree, imposter plotted takeover of Supreme Intelligence, Kree leader Nenora exposed as Skrull (Silver Surfer #30, 1989)", 
        "imposter took over Supreme Intelligence in plot to rule Kree Empire, seemingly destroyed by Cotati (Silver Surfer #31, 1989)", 
        "imposter investigated Origin, stole one of Quasar's Quantum Bands, power went out of control, right arm amputated by Quasar to save his life, exposed as Skrull by Judicator who took him away to find original & try imposter in accordance with cosmic law (Quasar #47-48, 1993)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 100
}