{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A.", 
            "content": "Christopher and his wife were subsequently teleported aboard the Shi'ar starship and taken to the Shi'ar Imperial Throneworld of Chandilar. There, Christopher was separated from his wife and imprisoned. He soon broke free and discovered the mad Shi'ar Emperor D'ken attempting to rape Katherine Anne. D'ken responded to the interruption by murdering Summers' wife before his eyes, and then ordered Summers to be sent to the Slave Pits of Alsibar where criminals and political prisoners were incarcerated.In the Pits, Summers met four aliens who had been imprisoned for various crimes against the Shi'ar Empire - a Saurid named Ch’od, a Lupin named Cr+eee, a Mephitisoid whom Summers nicknamed Hepzibah (as her true name was unpronouncable by most not of her own species), and a Shi'ar cyborg named Raza - and together they escaped and stole a starship. Naming their vessel the Starjammer, and themselves the Starjammers, the group began engaging in acts of piracy against Shi'ar vessels, thus taking vengeance on the Shi'ar but taking care not to harm innocent passengers in the process. The Starjammers quickly came to be regarded as outlaws by the Shi'ar Empire.The Starjammers first met the team of superhuman Earth mutants known as the X-Men when the two groups joined forces on a world in the Shi'ar Galaxy to battle the Imperial Guard, the super-powered soldiers who served the ruling Shi'ar emperor or empress - at this time, D'ken. One of the X-Men, the cosmic being known as the Phoenix who had assumed the form of the X-Man Jean Grey, used her telepathic powers to probe Corsair's mind and learned that he was the father of Scott Summers, who had become the X-Man known as Cyclops. At Corsair's request, Phoenix kept his true identity a secret from Cyclops, but both Cyclops and his brother Alex, who had become the X-Man named Havok, eventually learned who Corsair really was.Since the Starjammers aided her against the machinations of her brother D'ken, the Shi'ar Princess Lilandra, once she was named Empress in D'ken's stead, put an unofficial end to the Shi'ar Empire's opposition to the Starjammers. However, it would not be long before they would become outlaws once more following a coup d'etat by Lilandra's sister Deathbird who then seized the throne. Herself branded a rebel, Lilandra came to join the Starjammers in their fight against Deathbird's tyrannical reign. Eventually, Lilandra and the Starjammers' opposition to Deathbird's rule sparked rebellions across the Empire, and following an attempted takeover of the Empire by the shape-shifting alien Skrulls, Lilandra settled matters with Deathbird, discovering her sister did not want the throne anymore.The Starjammers subsequently aided Lilandra during the war with the alien Kree Empire, clashed with the Earth team of super-beings known as the Avengers, and were hired by Lilandra to capture the Shi'ar traitor named Cerise. Eventually, the Starjammers would come to blows with the Shi'ar Empire once more after discovering the poor treatment of the conquered Kree. The Starjammers allied themselves with a group of neutral worlds calling themselves The Clench who provided the pirates with a navigator named Keeyah. During one of the Starjammers' rescue missions, they discovered a vessel belonging to the alien Uncreated, a race of militaristic atheists who intended to destroy any culture that practiced a form of religion, including the Shi'ar. Seeing the Shi'ar as the lesser of two evils, Corsair chose to stop the Uncreated which earned the Starjammers Lilandra's thanks and a pardon for their crimes.Corsair sought to retire, but soon after the Starjammers were captured by the being known as the Collector. Together with the feral X-Man Wolverine, the Starjammers managed to escape both the Collector and the cosmic world-devourer known as Galactus. The Starjammers would later aid the Shi'ar in fending off the threat of Galactus, and subsequently helped Lilandra and Xavier during their efforts to free Earth from its sentence as an intergalactic prison planet.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "X-Men #104 (1977)\n", 
            "groupaffiliation": [
                "Starjammers (leader)", 
                "formerly N.A.S.A", 
                "U.S.A.F."
            ], 
            "hair": "Brown\n", 
            "height": 75, 
            "id": "Corsair", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Philip Summers (father), Deborah Summers (mother), Katherine Anne Summers (wife, deceased), Hepzibah (mate), Scott Summers (Cyclops, son), Alexander Summers (Havok, son), Gabriel Summers (Vulcan, son), Madelyne Pryor-Summers (daughter-in-law, deceased), Jean Grey-Summers (Phoenix, daughter-in-law), Nathan Christopher Summers (Cable, grandson), Stryfe (clone grandson, deceased), Tyler Dayspring (Genesis, great-grandson, deceased), Rachel Grey (Marvel Girl, alternate timeline granddaughter)", 
            "occupation": [
                "Pirate", 
                "former pilot"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "None", 
            "realname": "Christopher Summers", 
            "significantissues": "Killed by Vulcan (Uncanny X-Men #486, 2007)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 175
        }
    }
}