{
    "add": {
        "doc": {
            "aliases": "Kalorion", 
            "citizenship": [
                "Egolix-7", 
                "formerly an unidentified dimension"
            ], 
            "content": "While searching through the lifeless hulk he fell into a dark hole. There he found his greatest dream the Zalkor. The large obese creature asked him for skrimblatt. Beta-Metaphysic Skrimblatt, which was a large leaf like substance that the creature fed off to survive. Milos had scoured the ancient tomes, he knew the legend well. Abyss was ready and willing to transact the traditional bargain. The Skriimblatt was just out of reach, waiting for someone to bring it to the near omnipotent but immobile behemoth. Centuries past this service had been performed by Zalgodian High Priest, now long dead.Abyss bargained with Zalkor for the skrimblatt, he would give it the behemoth only if he allowed Abyss to become his Kalorion. The Zalkor warned him of what he was requesting. In order to receive the power of the Kalorion, Abyss would have to relinquish his soul. The deal was made and so was born Count Abyss, a cosmic being with nearly godlike powers. On that day those two diverse creatures bonded in a fashion no one will probably understand, a union of master and slave, with each thinking the other subservient.Together they ruled the universe, in their particular reality. Nothing in their dimension could stand against them. World after world fell into submission, galaxy after galaxy paid homage to its new tyrant. Despite or maybe because of the loss of his soul to the Zalkor, Count Abyss proved to be an exceptionally vicious and merciless despot. Nearly anything Abyss requested the Zalkor granted it. There was very little that his magic could not accomplish. Count Abyss is only omnipotent within his own dimension, which is the Zalkor's sphere of reality. The Zalkor's might faded the further he or his agent ventured from their actuality.With his entire universe conquered there remained no challenge for Abyss. No satisfaction could be gained from food, woman, drink or anything else. The emptiness of his life became apparent. He started to crave the lost of his soul, which was something that the Zalkor would not grant him, without him surrendering his power. He sought other means to regain his soul. Through his research he stumbled upon the Infinity Gems. Of course only one of the six gems fascinated him. It was the Soul Gem. He traced it whereabouts to the forehead of Adam Warlock. He tried to brute demonic strength to achieve his prize, but that failed. He devised a plan to have Warlock fall in love with Maya the last member of the Egolan's royal family. Abyss enslaved the two of them through a century old love potion. Soon after his spell was cast Maya was abducted from Monster Island. Abyss attempted to trade her for the Soul Gem. Warlock refused to trade the gem for the girl.", 
            "durability": 1, 
            "education": "Extra dimensional equivalently of scientific doctorate.", 
            "energy": 1, 
            "eyes": "White (formerly brown)\n", 
            "fighting": 1, 
            "firstappearance": "Warlock an the Infinity Watch #14 (1993)\n", 
            "groupaffiliation": "None", 
            "hair": "None (formerly black)\n", 
            "height": 76, 
            "id": "Count_Abyss", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "None", 
            "occupation": [
                "Currently unrevealed", 
                "former dictator", 
                "Kalorion", 
                "research scientist"
            ], 
            "origin": "Warlock and the Infinity Watch #31 (1994)", 
            "placeofbirth": "Unidentified dimension", 
            "powers": "His powers are whatever he wishes them to be. He is an omnipotent being. Nearly anything Abyss requested the Zalkor granted it. There was very little that his magic could not accomplish. Count Abyss is only omnipotent within his own dimension, which is the the Zalkor's sphere of reality. His power gradually fades should either one of them leave their dimension.", 
            "realname": "Milos Abyss", 
            "significantissues": "Official Handbook Bibliography", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 300
        }
    }
}