{
    "aliases": "None", 
    "citizenship": "Unrevealed with international criminal record", 
    "content": "The sudden appearance of the latest Crimson Cowl was shrouded in mystery. Her first strike was as leader to a brand-new Masters of Evil during a time when many of the world's heroes were missing after sacrificing themselves to stop Onslaught. Working for a New York crime lord, the new Masters hit a couple of targets, each time stopped by the intervention of the Thunderbolts and the Black Widow (Natasha Romanova). The Crimson Cowl would always teleport her team to safety before their defeat.The Crimson Cowl later extended offers of membership in the Masters of Evil to the members of the Thunderbolts after the team had been outed as members of previous incarnations of the team. The Cowl revealed that she had created a team that ran much more like a business, with special amenities for the members at their headquarters. The Thunderbolts refused, opting to continue their new career as heroes. They tried to apprehend the Masters when the villains broke into a federal depository, but failed. The Thunderbolts only escaped with help from the hero Hawkeye who arrived dressed as Dreadknight.The Cowl was unmasked as Dallas Riordan, the Thunderbolt's former mayoral liaison to New York, and remanded to custody. In reality, however, Riordan was actually a prisoner of the Cowl, as she had tried to infiltrate the group under the guise of Citizen V, and the Crimson Cowl switched places with her just before her defeat. Riordan later escaped prison with the help of the V-Battalion to continue as their agent. Soon after, however, Riordan and the V-Battalion came into conflict with the Thunderbolts caught in the middle, and the Cowl sent her cloak to teleport and kidnap Riordan. She was kept a prisoner as the Cowl hoped to foster conflict between the Battalion and the ‘Bolts. Instead, Riordan eventually escaped, and the two women battled at the Cowl’s Symkarian villa. Riordan barely escaped, falling from a great height and losing the use of her legs.The Crimson Cowl later appeared with a new group of Masters of Evil, recruiting former member Cardinal by promising to destroy Hawkeye, whom the Cowl blamed for the death of Cardinal's daughter, Meteorite. In fact, the Cowl formed the team as part of her search for the fabled legacy of criminal industrialist Justin Hammer— a legacy that promised to be a weapon of great influence and power. This legacy was also being sought after by Mentallo, who helped Hawkeye and other criminals, including the Plantman, escape prison for this purpose. Hammer's legacy was a biological toxin that had been ingested by every single villain who had ever worked for him. The Plantman was the carrier. Hawkeye, actually working undercover on behalf of SHIELD, defeated the villains with the help of Songbird. Hawkeye, Songbird, and Plantman continued their search so that Hammer’s “weapon” would not fall in the wrong hands. Hawkeye, Songbird, and SHIELD tracked the legacy to Symkaria, where they encountered the Crimson Cowl and the Masters of Evil.The search ended with Hammer's daughter, Justine, who turned out to be the Crimson Cowl. Justine revealed that she adopted the Cowl identity as a way of proving herself to her father, who wanted his daughter to prove herself worthy of the family fortune before joining him among the industrious elite. Having already secured her own relatively smaller fortune through her own ruthless and shady business practices, Justine was finally making her bid for the kind of power brokerage that her father dealt in-- superhuman power.Hawkeye convinced several members of the Masters of Evil to side with him and Songbird against Crimson Cowl and their former allies, pointing out the dangers of Hammer’s super-weapon, which would either blackmail or kill them. Hoping to throw off suspicion, Hawkeye made the villains reinvent their costumed identities, thus creating a new team of Thunderbolts. When the Thunderbolts finally confronted the Crimson Cowl, the Plantman, now Blackheath, was captured and experimented upon to reveal the secrets of the bio-toxin. Instead, Blackheath chose to release an antidote for the toxin into the atmosphere and appeared to die in the attempt. In the final battle between the Masters of Evil and the Thunderbolts, the Crimson Cowl’s cloak was destroyed by Skein and Justine Hammer was taken into SHIELD custody.", 
    "durability": 2, 
    "education": "Unrevealed", 
    "energy": 3, 
    "eyes": "Blue\n", 
    "fighting": 4, 
    "firstappearance": "Thunderbolts vol. 1 #3 (1997)\n", 
    "groupaffiliation": [
        "Masters of Evil", 
        "Hammer Industries"
    ], 
    "hair": "Black with white streaks\n", 
    "height": 71, 
    "id": "Crimson_Cowl_(Justine_Hammer)", 
    "identity": "Known to the authorities", 
    "intelligence": 4, 
    "knownrelatives": "Justin Hammer (father, deceased)", 
    "occupation": [
        "Criminal mastermind", 
        "heiress"
    ], 
    "origin": "Thunderbolts vol. 1 #67 & 69 (2002)", 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Justine Hammer", 
    "significantissues": [
        "Expanded Masters of Evil team, took over Mount Charteris, (Thunderbolts #25 & 33, 1999)", 
        "captured Thunderbolts, forced to flee with Masters after intervention of police & Hawkeye, (Thunderbolts #18 & 20, 1998)", 
        "captured Citizen V/Dallas Riordan, schemes discovered by Thunderbolts, (Thunderbolts #24, 1999)", 
        "used worldwide network of weather modulators to create destructive weather, escaped while most of her Masters were defeated & captured by Thunderbolts, left Cowl-costumed Riordan behind to be arrested as the supposed Crimson Cowl, (Thunderbolts #25, 1999)", 
        "secretly imprisoned Riordan in hopes of sparking conflict between Thunderbolts & V-Battalion, engaged in single combat with escaping Riordan, (Thunderbolts #40 & 42, 2000)", 
        "exposed as Justine Hammer, defeated & captured Sable & Thunderbolts alongside her Masters, (Thunderbolts #67,  2002)", 
        "defeated & captured by Thunderbolts, cloak destroyed by Skein and toxin neutralized by Blackheath, taken into custody, (Thunderbolts #67, 69 & 73, 2002)", 
        "assisted in Raft escape attempt (Civil War Front Line #9, 2006)"
    ], 
    "speed": 7, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 161
}