{
    "aliases": [
        "Crys", 
        "Exquisite Elemental"
    ], 
    "citizenship": "Attilan", 
    "content": "When Crystal's sister Medusa disappeared, Crystal and other Inhuman royalty searched the globe for her, ultimately finding her and returning to Attilan with the aid of the Fantastic Four. Along the way, a passionate romance blossomed between Crystal and the Human Torch. Though they were at first kept apart by her Inhuman family, and later a Negative Zone barrier that Maximus created around Attilan. But after Black Bolt used his powerful voice to destroy the barrier, the Inhuman's Council of Elders soon made the decision to split up the royal family while the city was being rebuilt. Then Crystal and her cousins left their sanctuary, with Black Bolt's agreement. Crystal was finally free to pursue Johnny, and with Black Bolt's approval, she rejoined him. Together with the Fantastic Four, she helped fight the newly escaped Blastaar, and continued to assist them, though she was usually restrained from active participation by an overly concerned Johnny Storm. Eventually, when the Invisible Girl gave birth to her first child, Crystal made herself a Fantastic Four uniform and announced that she would be her replacement. Skeptical, Mister Fantastic agreed to think about it, but after stopping the newest series of attacks from the criminal, Wizard, Crystal earned her place on the Marvel Universe's first family. Crystal was later captured by Maximus, using a controlled Lockjaw, after he had retaken the Inhuman throne. But Black Bolt once again used his destructive voice to free them and send Maximus scurrying to a hidden rocket. Crystal first had to leave the Fantastic Four when Black Bolt injured himself in a radiation experiment, and he needed her to use her powers to vibrate his heart until Gorgon could return with medicine. Crystal was finally forced to leave the team when she passed out and Reed discovered that Earth's pollutants were slowly killing her. Johnny took it badly, but Reed stopped him before he could jump into Lockjaw's teleportation field.En route to Attilan, Crystal rescued and tended the wounded Quicksilver. A whirlwind romance ensued, and by the time Quicksilver had recovered, they were engaged. Crystal and Quicksilver were married and settled down in Attilan, the first-ever Inhuman marriage to a non-Inhuman. At first, Crystal and Pietro were very happy together, especially after Crystal gave birth to their daughter Luna; but serious tensions arose. Pietro wanted to expose Luna to the Terrigan Mists rather than have her remain an ordinary girl, but Crystal forbade it. Quicksilver immersed himself in his role as commander of the Inhuman militia, while a lonely and bored Crystal had an affair with a real estate salesman Norm Webster. When Pietro found out, he went mad and fled Attilan. Crystal rejoined the Fantastic Four, trying unsuccessfully to rekindle her old romance with Johnny.", 
    "durability": 1, 
    "education": "Royal tutors of Attilan", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #45 (1965)\n", 
    "groupaffiliation": [
        "Inhumans (Royal Family)", 
        "formerly Fantastic Four", 
        "Avengers", 
        "Queen's Vengeance", 
        "Dark Riders"
    ], 
    "hair": "Red\n", 
    "height": 66, 
    "id": "Crystal", 
    "identity": "Public", 
    "intelligence": 1, 
    "knownrelatives": "Quelin (father), Ambur (mother), Medusa (sister), Gorgon, Karnak, Triton  (cousins), Black Bolt (cousin, brother-in-law), Pietro Maximoff (Quicksilver) (estranged husband), Luna (daughter), Ahura (nephew), extensive extended family", 
    "occupation": [
        "Mother", 
        "adventuress"
    ], 
    "placeofbirth": "Attilan", 
    "powers": "Crystal can animate and manipulate the four basic \"elemental\" substances: earth, air, fire, and water, either individually or in various combinations. She is also in superior physical condition due to her Inhuman physiology, though she is abnormally vulnerable to pollutants.", 
    "realname": "Crystallia Amaquelin Maximoff", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 110
}