{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A. (Earth-295)", 
            "content": "After five years of being experimented on, Christopher Summers managed to escape from the breeding pens, much To Sinister's chagrin. He ordered his recapture but told Alex and Scott to remain behind, which made Scott suspicious of the nature of this mission. After the search team's emergency beacon was picked up, Cyclops and Havok went to investigate in the Ghost Lands where they encountered their long-lost father for the first time in years. Chris told them the story of how they became separated which was enough to convince Havok that he was telling the truth, but Cyclops wasn't as easily swayed to allow him back into his life so easily. During a battle between some scavengers, Sinister came and rescued the Summers family. Unfortunately, Christopher's Brood egg that was inside of him had hatched and he attacked Sinister. Before he could do any damage, Christopher's consciousness became dominant and he begged Scott to kill him, and Scott reluctantly complied. This act caused a further rift to appear in the relationship between Scott and Alex.Cyclops soon learned that Apocalypse's Horseman, Death, was trying to cause a mutiny and seize power for himself. Cyclops knew he had to make a stand and helped Blink free her captured teammates and release Sunfire from his prisoner. Blink teleported Cyclops and then her teammates to safety as Sunfire incinerated Death. It was around this time that Sinister had created X-Man using both Scott and Jean as genetic templates, who were both unaware of this development. Sinister planned to use this mutant to overthrow Apocalypse as ruler. On one occasion, Cyclops came into contact with X-Man and tried to help him escape from the pens. However, the rash mutant  refused his help and escaped the pens by himself. Both were unaware of their relationship to each other or that they were secretly been watched by Sinister himself. Cyclops also became increasingly concerned by Sinister's sudden disappearances. He broke into his lab and discovered the place had been thrashed. Cyclops realized that Sinister had abandoned them and betrayed Apocalypse.Cyclops continued to rescue people from the breeding pens. Unfortunately people began to suspect that something was amiss. They questioned a young mutant named Lorna Dane who had witnessed the previous nights escape. Unfortunately, Lorna had a fragile mind and thought she had witnessed Magneto rescuing the prisoners. Alex ordered that she be interrogated by the Beast but Cyclops stopped the torture and ordered her release back to the pens. That night. Cyclops, in disguise, broke into the pens and rescued Lorna but his activities were detected by Northstar and Aurora. With his face hidden by the darkness, Cyclops attacked the two twins and made his getaway. Meeting a member of the underground at the Hudson River. Cyclops gave Lorna over to them. However, his face was no longer in disguise and his activities were been monitored by Havok from a distance. Jean Grey had returned to Sinister's lab in an attempt to locate him, but she was captured by Havok and sent to the Beast. Cyclops was stunned to see Jean again and when he refused Havok's order to kill her, Havok revealed that he knew Cyclops had been helping the prisoners escape from the pens. Cyclops was then captured and, along with Jean, was tortured by the Beast. However Jean used her psychic powers to remove Cyclops' visor and Scott released a concussive blast on the Beast, rendering him unconscious.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Unrevealed\n", 
            "fighting": 1, 
            "firstappearance": "Tales from the Age of Apocalypse: Sinister Bloodlines (1995)\n", 
            "groupaffiliation": "Sinister's elite mutant force", 
            "hair": "Brown\n", 
            "height": 75, 
            "id": "Cyclops_(Age_of_Apocalypse)", 
            "identity": "Known to the general public", 
            "intelligence": 1, 
            "knownrelatives": "Christopher Summers (father, deceased), Katherine Summers (mother, deceased), Sinister (surrogate father), Alex Summers (Havok, brother, deceased), Nate Grey (X-Man, \"son\")", 
            "occupation": "Commander of Sinister's elite mutant force", 
            "origin": "Unrevealed", 
            "placeofbirth": [
                "Anchorage", 
                "Alaska"
            ], 
            "powers": "Cyclops has the mutant ability to generate concussive blasts from his eyes. He can do this by absorbing ambient energy from his environment and into his body cells which store this energy. Cyclops can release this energy by simply opening his eyes and, as a result, control the amount of damage he does. The wider his eyes are opened, the more damage the concussive blasts can do. However due to a head injury, Cyclops is unable to shut off his powers at will and must wear a ruby quartz visor to block the beams.", 
            "realname": "Scott Summers", 
            "significantissues": [
                "Meets his real father (Tales from the Age of Apocalypse: Sinister Bloodlines, 1995)", 
                "helps the X-Men defeat Apocalypse's Horseman Death (Tales from the Age of Apocalypse: By the Light, 1995)", 
                "rescues Lorna Dane from the breeding pens, Alex discovers that Cyclops is a traitor (Factor X #2, 1995)", 
                "reunited with Jean Grey and captured by Alex (Factor X #3, 1995)", 
                "Jean and Scott encounter X-Man (X-Man #4, 1995)", 
                "Cyclops and Jean rescue the prisoners from the breeding pens, Alex and Scott fight each other (Factor X #4, 1995)", 
                "killed by Alex (X-Men: Omega, 1995)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Age of Apocalypse", 
            "weight": 195
        }
    }
}