{
    "aliases": [
        "\"Slim\"", 
        "formerly Slym Dayspring", 
        "Mutate #007", 
        "Erik the Red"
    ], 
    "citizenship": "U.S.A.", 
    "content": "With their parents presumed dead, the authorities separated the two boys. Alex was adopted, but Scott remained comatose in a hospital for a year. On recovering, he was placed in an orphanage in Omaha, Nebraska that was secretly controlled by his future enemy, the evil geneticist Mister Sinister.As a teenager, Scott came into the foster care of Jack Winters, a mutant criminal known as the Jack O'Diamonds. After Scott began to suffer from severe headaches he was sent to a specialist who discovered that lenses made of ruby quartz corrected the problem. Soon after, Scott's mutant power first erupted from his eyes as an uncontrollable blast of optic force. The blast demolished a crane, causing it to drop its payload toward a terrified crowd. Scott saved lives by obliterating the object with another blast, but the bystanders believed that he had tried to kill them and rallied into an angry mob. Scott fled, escaping on a freight train.Winters sought to use Scott's newfound talent in his crimes, and physically abused the young boy when he initially refused. However, Scott's display of power had attracted the attention of the mutant telepath Professor Charles Xavier, who teamed up with F.B.I. agent Fred Duncan in their mutual attempt to find Scott. Scott was rescued from Winters' clutches and was enlisted by Xavier as the first member of the X-Men, a team of young mutants who trained to use their powers in the fight for human/mutant equality.As Cyclops, Scott became deputy leader of the X-Men. While he was a skilled tactician, his social skills were lacking. Scott had fallen in love with his teammate Jean Grey, but his reserved demeanor prevented him from expressing his feelings for her for years. When Xavier's other original recruits left the fold following an encounter with the sentient island-being Krakoa, Cyclops stayed on as deputy leader of the new team.When the real Jean emerged from suspended animation, Scott abandoned his wife and son and rejoined the other original X-Men in establishing a new team, X-Factor. During a demonic invasion of New York City, X-Factor and the X-Men fought against a super-powered and insane Madelyne. The invasion was thwarted after Madelyne perished in combat with Jean.Following Professor X's arrest for crimes committed as the evil psionic entity Onslaught, Scott assumed the role of leadership of the X-Men once more. Soon after, the government sponsored mutant-hunting operation known as \"Zero Tolerance\" took effect, and the villainous Bastion captured the X-Men. In his attempt to destroy mutantkind, Bastion placed a nanotech bomb inside Scott's body. The X-Men escaped, and the mutant doctor named Cecilia Reyes saved Scott's life. Scott and his wife soon took a leave of absence from the X-Men for a period of recuperation.Investigating rumors he was alive, the pair found him in the birthplace of Apocalypse in Akkaba, Egypt, struggling to reassert his mind over the villain's psyche. Ultimately, Jean was able to physically rip Apocalypse's essence from Scott's body using her mental powers, and Cable destroyed it with his own powers.Following the outing of Professor X as a mutant to the world, his school was rechristened the Xavier Institute of Higher Learning and opened its doors to the mutant population at large, training and educating dozens of young new students to help them cope with their burgeoning abilities. After the death of his wife, Scott assumed the position of co-headmaster of the School alongside his new love, Emma.", 
    "durability": 4, 
    "education": "College degree from Professor Xavier's School for Gifted Youngsters, post-graduate courses", 
    "energy": 7, 
    "eyes": "Brown, glowing red when using powers\n", 
    "fighting": 5, 
    "firstappearance": "X-Men #1 (1963)\n", 
    "groupaffiliation": [
        "X-Men", 
        "formerly Twelve", 
        "X-Factor/X-Terminators"
    ], 
    "hair": "Brown\n", 
    "height": 75, 
    "id": "Cyclops", 
    "identity": "Publicly known", 
    "intelligence": 5, 
    "knownrelatives": "Philip Summers (grandfather), Deborah Summers (grandmother), Christopher Summers (Corsair, father, deceased), Katherine Anne Summers (mother, deceased), Alexander Summers (Havok, brother), Gabriel Summers (Vulcan, brother), Jack Winters (Jack O'Diamonds, former foster father), Jean Grey-Summers (Phoenix, wife), Madelyne Pryor-Summers (ex-wife, deceased), Nathan Christopher Summers (Cable, son), John Grey (father-in-law, deceased), Elaine Grey (mother-in-law, deceased), Sarah Grey-Bailey (sister-in-law, deceased), Aliya Jenskot (daughter-in-law, deceased), Tyler Dayspring (Genesis, grandson, deceased), Stryfe (clone son, deceased)", 
    "occupation": [
        "Co-headmaster of Xavier Institute for Higher Learning", 
        "adventurer", 
        "former student", 
        "former radio announcer"
    ], 
    "origin": [
        "Uncanny X-Men #156 (1982)", 
        "Classic X-Men #41-42 (1989)", 
        "X-Men #39-42 (1967-1968)"
    ], 
    "placeofbirth": [
        "Anchorage", 
        "Alaska"
    ], 
    "powers": "Cyclops possesses the mutant ability to project a beam of heatless ruby-colored concussive force from his eyes, which act as inter-dimensional apertures between this universe and another. Cyclops' body constantly absorbs ambient energy, such as sunlight, from his environment into his body's cells that allows him to open the apertures. Cyclops' mind generates a psionic field that is attuned to the forces that maintain the apertures. Because this field envelops his body, it automatically shunts the other-dimensional particles back into their point of origin when they collide with his body. Thus, his body is protected from the effects of the particles, and even the thin membranes of his eyelids are sufficient to block the emission of energy. The synthetic ruby quartz crystal used to fashion the lenses of Cyclops' eyewear is resonant to his minds' psionic field and is similarly protected.\nThe width of Cyclops' optic blast is focused by his mind's psionic field with the same autonomic function that regulated his original eyes' ability to focus. As Cyclops focuses, the size of the apertures change and thus act as a valve to control the flow of particles and the beam's relative power. The height of Cyclops's eye-blast is controlled by his visor's adjustable slit. The beam's effective range is approximately 2,000 feet.\n\nDue to a head injury, Cyclops is unable to shut off his optic blasts at will and must therefore wear ruby quartz lenses to block the beams.", 
    "realname": "Scott Summers", 
    "significantissues": [
        "First joined X-Men (X-Men #1, 1963)", 
        "appointed deputy leader (X-Men #7, 1964)", 
        "began romance with Jean Grey (X-Men #32, 1967)", 
        "trained new X-Men (X-Men #94, 1975)", 
        "believed Jean dead, left X-Men (X-Men #138, 1980)", 
        "reunited with father (Uncanny X-Men #154, 1982)", 
        "married Madelyne (Uncanny X-Men #175, 1983)", 
        "Nathan born (Uncanny X-Men #201, 1986)", 
        "founded X-Factor (X-Factor #1, 1986)", 
        "Nathan taken to future (X-Factor #68, 1991)", 
        "married Jean (X-Men #30, 1994)", 
        "raised Nathan in future (Adventures of Cyclops and Phoenix #1-4, 1994)", 
        "merged with Apocalypse (Uncanny X-Men #377/X-Men #97, 2000)", 
        "freed from Apocalypse (X-Men: The Search For Cyclops #1-4, 2000-2001)", 
        "began psychic affair with Emma (New X-Men #128, 2002)", 
        "became co-headmaster of School (Astonishing X-Men #1, 2004)"
    ], 
    "speed": 4, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 195
}