{
    "aliases": "Lady Light", 
    "citizenship": "U.S.A.", 
    "content": "The two vigilantes have specialized in combating drug-dealers and helping runaway children.  For all the work that Cloak and Dagger have done to help reform addicts and topple dealers, they realize that drug abuse is an evil greater than they can ever hope to conquer. The duo have often teamed with Spider-Man. Unlike Cloak, Dagger enjoys adventuring and has often run into trouble without him. She has even served as a member of the New Warriors and as a part of Daredevil's Unnamed Super-Hero Team. Because of Cloak's anti-social behavior, Dagger has often been his only link to humanity. Dagger has protected Cloak from being manipulated by various enemies including the Darkling, Nightmare, and Mister Jip. A short time ago Cloak and Dagger were manipulated by the Pride into tracking down their six runaway children. The heroes found the Runaways and learned the truth about the Pride. Promising to help the children, the Pride found them instead and wiped their memories of the whole event.", 
    "durability": 1, 
    "education": "High school dropout", 
    "energy": 5, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "Spectacular Spider-Man Vol. 2 #64 (1982)\n", 
    "groupaffiliation": [
        "Partner of Cloak", 
        "formerly X-Men", 
        "X-Men (Osborn's team)", 
        "Secret Avengers", 
        "Brides of Set", 
        "Eurocirque", 
        "Daredevil's Unnamed Super-Hero Team", 
        "New Warriors", 
        "Secret Defenders"
    ], 
    "hair": "Blond\n", 
    "height": 65, 
    "id": "Dagger", 
    "identity": "Secret", 
    "intelligence": 3, 
    "knownrelatives": "Melissa Bowen (mother), \"Lord of Light\" (father), Phillip Carlisle (stepfather, deceased), Father Michael Bowen (uncle, deceased)", 
    "occupation": "Vigilante", 
    "powers": "Dagger can generate and throw \"light daggers\" which stun targets by forcing them to confront the darkness in their own souls. Her light can also cure drug addictions in some people, as a side affect of that painfully enlightening experience. Additionally, her light can alleviate Cloak's thirst for light and warmth.", 
    "realname": "Tandy Bowen", 
    "speed": 2, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 115
}