{
    "aliases": "None", 
    "citizenship": "Dual citizenship in Belarus and Russia", 
    "content": "After Phobos’s plan to drain the mutants’ powers to grant himself artificial mental abilities was discovered by the Red Guardian (Tania Belinsky), Darkstar was dispatched to the United States alongside her lover the Crimson Dynamo (Yuri Petrovich), the Titanium Man and the Griffin, assigned to capture perceived defectors the Black Widow, the Commissar and Yuri’s father Ivan. Opposed by the Widow’s teammates in the Champions, Darkstar ultimately turned on the Dynamo after the truth about his father was revealed. She later deserted to the United States with the aid of the Widow’s friend Nick Fury, joining the Champions. Alongside them, Darkstar faced such threats as the alien Warlord Kaa, the Stilt-Man, the Stranger, the Possessor, Swarm, M.O.D.O.K., Magneto, Sentinels and the Vanisher. Laynia’s teammate Iceman fell passionately in love with her, but it was a largely one-sided, unrequited relationship; as Darkstar told a bitterly disappointed Drake when the Champions disbanded, she liked him but had no romantic interest in him. After the Champions broke up, Laynia returned home.Darkstar partnered with Vanguard and a new Crimson Dynamo (Dmitri Bukharin) to investigate a strange, ovoid object on the Moon. There they encountered Iron Man and Jack of Hearts, ultimately teaming with them in opposing an attempted invasion of Earth by the alien Rigellians. Later, the trio was tricked by former Russian military General Nikolai Kutzov into believing that the U.S. was set to launch a pre-emptive nuclear strike against Russia, bringing them into conflict with Spider-Man and the Hulk. They later encountered the Silver Surfer during his worldwide search for the Hulk before being dispatched to investigate the mysterious Forbidden Zone, where they were reunited with Phobos, unaware of his earlier deception. Phobos convinced the trio to join him in opposing Belinsky and her ally, the Presence. On learning of Phobos’s earlier deception, and discovering that the Presence was their father, Darkstar and Vanguard turned against Phobos and defeated him with the aid of the Hulk. Darkstar next became a pawn in a contest of champions between the alien Grandmaster and Death herself. Selected as a member of the Grandmaster’s champions, Darkstar was teamed with American crimefighter Daredevil and the Australian mystic Talisman in opposing Death’s champions Sunfire, the Invisible Girl and Iron Fist. Later, after twice aiding the Galadorian Spaceknights Rom and Starshine against the alien Dire Wraiths, Darkstar and her partners Vanguard, Ursa Major and Gremlin worked with Crimson Dynamo to bring Magneto to justice for his crimes against Russia. A miscommunication pitted them against the Avengers, who also sought to bring Magneto to trial, and the X-Men, who were harboring Magneto at the time.Darkstar later embarked on a diplomatic tour of the U.S., where she and the Black Widow were targeted by Tania Belinsky, now known as Starlight, as potential mates for a mentally-unstable Presence. Belinsky was quickly convinced to abandon this mad scheme. Later, Darkstar, Vanguard and Ursa Major became disillusioned with their government’s policies, and they sought to defect to America. In an effort to reclaim their “lost property”, the Russian government dispatched another team of operatives, the Supreme Soviets, to return the defectors home. Disguised as the Avengers, the Supreme Soviets attacked and nearly killed Darkstar and her allies. The comatose minds of Darkstar, Vanguard, and Ursa Major then subconsciously merged into a giant bear-like Darkforce construct dubbed the “Great Beast” and attempted to kill the Supreme Soviets. After Captain America convinced them to call off their attack, the trio regained consciousness and remained in America to recuperate from their injuries while the U.S. Government sought to obtain political asylum for them. These diplomatic efforts ultimately failed, and the trio was deported back to Russia. Sent to a research facility, Darkstar and her comrades were rescued by the mutant Blind Faith and his team of Exiles, whom they joined in opposing the cyborg assassin Firefox. On a subsequent mission with the Exiles, Darkstar and Blind Faith encountered the immensely powerful psychic Soul Skinner who had taken over the small Russian town of Neftelensk. With the help of the X-Men, the Soul Skinner was defeated. Later, after the Exiles became Siberforce, Darkstar’s team witnessed an attack on Earth’s moon by the intergalactic Starblasters, who were searching for the mysterious power source known as the Starbrand. Investigating, Darkstar and her brother joined the cosmic Avenger Quasar and other space-faring heroes in opposing the Starblasters. During the battle, Vanguard was killed by Threkker, who in turn was killed by a vengeful Darkstar. Returning to Earth, Darkstar was convinced by the Presence to seek retribution against Quasar, and together they attacked and seemingly destroyed him; however, Quasar had merely used his quantum energy powers to fake his own death.Soon after, Darkstar was captured by ex-K.G.B. General Tskarov, who sought to use her power in his plot to undermine businesses along America’s east coast. Darkstar was rescued by Tskarov’s other pawns, Ursa Major and a resurrected Vanguard, and the trio teamed with Daredevil and the Black Widow to halt Tskarov’s plan. Subsequently, Darkstar was one of several Russian heroes recruited into the government-sponsored Winter Guard team, who soon found themselves defending their country against an invasion by the army of the Chinese would-be conqueror the Mandarin. After joining Earth’s heroes in opposing the alien Kree’s efforts to transform Earth into a prison planet, Darkstar and the Winter Guard became unwitting pawns in the Presence’s attempt to convert Russia’s citizens into a new, nuclear form of life. Opposed by the Avengers, those converted were ultimately restored by Starlight in exchange for Thor’s sparing the Presence’s life. Later, Darkstar sought the X-Men’s assistance in capturing the renegade Russian mutant scientist the Black Death.Following the establishment of the X-Corporation, a global mutant search and rescue unit, Darkstar joined the organization’s European contingent based in Paris, France. On the team’s first mission opposing the threat of the bacterial consciousness Weapon XII, Darkstar fell under the creature’s sway and, as a result, became an extension of the creature itself. She was shot and apparently killed by the mercenary Fantomex, later revealed to be Weapon XIII, and was subsequently buried in the Pére LaChaise Cemetery in Paris.", 
    "durability": 3, 
    "education": "Military training; KGB intelligence training", 
    "energy": 5, 
    "eyes": "Brown\n", 
    "fighting": 4, 
    "firstappearance": "Champions #7 (1976)\n", 
    "groupaffiliation": [
        "Formerly X-Corporation", 
        "Winter Guard", 
        "People's Protectorate", 
        "Siberforce", 
        "Champions (of Los Angeles)", 
        "Soviet Super-Soldiers"
    ], 
    "hair": "Blonde\n", 
    "height": 0, 
    "id": "Darkstar_(Laynia_Petrovna)", 
    "identity": "Known to Russian government officials", 
    "intelligence": 2, 
    "knownrelatives": "Nicolai Krylenko (Vanguard, brother); Sergei Krylov (Presence, father), Marya Karlova (mother, deceased)", 
    "occupation": [
        "Adventurer", 
        "former government agent"
    ], 
    "origin": "Incredible Hulk #259 (1981)", 
    "placeofbirth": [
        "Minsk", 
        "Byelorussia"
    ], 
    "powers": "Darkstar was connected to her extradimensional Darkforce energy source by means of her consciousness being split between her physical body and a Darkforce representation of same, both symbiotically linked. Darkstar could thus utilize the Darkforce for various purposes. Most often, she projected it as simple mentally-controlled solid objects such as pincers, rings, columns and spheres, or as beams of solid force. If Darkstar were rendered unconscious, any Darkforce objects she constructed would dissipate. Darkstar could transport herself and up to three others by opening a portal into the Darkforce dimension and traveling through it. Because crossing through the Darkforce dimension disoriented her sense of direction, and the light of Earth blinded her for several seconds upon reemergence, traveling in this manner was risky. Darkstar could fly by generating a virtually invisible portal into the Darkforce dimension along the contours of her body without passing through it, then balancing the attractive force of the dimension against that of Earth’s gravity.", 
    "realname": "Laynia Sergeievne Petrovna (Krylova)", 
    "significantissues": [
        "With Griffin, Titanium Man & Crimson Dynamo, vs Champions (Champions #7, 1976)", 
        "defected, joined Champions, vs Warlord Kaa (Champions #10-11, 1976)", 
        "with Champions, vs Stranger & Kamo Tharn (Champions #12-13, 1976-1977)", 
        "with Champions, vs Swarm (Champions #14-15, 1977)", 
        "with Champions & Iron Man, vs MODOK (Iron Man Annual #4, 1977)", 
        "with Champions, vs Magneto, possessed by Doctor Doom, freed (Super-Villain Team-Up #14/Champions #16, 1977)", 
        "with Champions, vs Sentinels & Vanisher (Champions #17, 1977)", 
        "Champions disbanded, returned home (Spectacular Spider-Man #17, 1978)", 
        "with Soviet Super-Soldiers, vs Iron Man & Jack of Hearts, joined them & New Men vs Rigellians (Iron Man #109-111, 1978)", 
        "with Soviet Super-Soldiers, duped by Kutzov, vs Spider-Man & Hulk (Marvel Team-Up Annual #2, 1979)", 
        "with Soviet Super-Soldiers, encountered Silver Surfer (Incredible Hulk #250, 1980)", 
        "with Soviet Super-Soldiers, vs Hulk, Presence & Red Guardian, betrayed by Phobos, learned Presence was father (Incredible Hulk #258-259, 1981)", 
        "took part in \"contest of champions\" (Marvel Super-Hero Contest of Champions #1-3, 1982)", 
        "with Soviet Super-Soldiers, vs Rom & Starshine, joined them & Gremlin vs Dire Wraiths (Rom #45-46, 1983)", 
        "with Soviet Super-Soldiers, joined Rom & Earth's heroes vs Dire Wraiths (Rom #65, 1985)", 
        "with Soviet Super-Soldiers, sought to capture Magneto, vs Avengers & X-Men (X-Men vs The Avengers #1 & 3, 1987)", 
        "with Black Widow, vs Starlight (Marvel Comics Presents #70, 1991)", 
        "with Soviet Super-Soldiers, sought political asylum from Captain America, vs Supreme Soviets, merged to form Great Beast, restored (Captain America #352-353, 1989)", 
        "joined Exiles, vs Firefox (Soviet Super Soldiers #1, 1992)", 
        "with Father Garnoff, possessed by Soul Skinner, freed by X-Men (X-Men #17-19, 1992)", 
        "with Vanguard, Quasar & others, vs Starblasters, seemingly killed Threkker (Starblast #1-4/Quasar #54-56, 1994)", 
        "with Presence, vs Quasar (Quasar #60, 1994)", 
        "captured by General Tskarov, rescued by Ursa Major, Vanguard, Daredevil & Black Widow (Daredevil #369-370, 1997)", 
        "with Winter Guard, vs Mandarin's forces (Iron Man #9-10, 1998)", 
        "with Winter Guard & Earth's heroes, vs Kree & Ronan (Maximum Security #3, 2001)", 
        "with Winter Guard, became pawn of Presence, vs Avengers, freed by Starlight (Avengers #42-44, 2001)", 
        "with X-Men, vs Black Death (X-Men Unlimited #28, 2003)", 
        "joined X-Corporation, vs Weapon XII, killed by Fantomex (New X-Men #128-130, 2002)", 
        "funeral held (New X-Men #131, 2002)", 
        "return (X-Force vol.3 #21, 2009)"
    ], 
    "speed": 3, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 125
}