{
    "aliases": [
        "Blue", 
        "D.H.", 
        "Death's Head II", 
        "Hood", 
        "Outlaw"
    ], 
    "citizenship": "None", 
    "content": "Death's Head time-jumped to the planet Lionheart, 3442 A.D., a world where artificial sentients were forbidden, where he spent twelve months under the alias Hood leading an outlaw band of cyborgs and robots, the Merry Men. Shortly after the replicated organic Tuck joined the outlaws, the Merry Men were slain by the mutant Major Oak; Necker, who had caught up with Death's Head, stunned Oak before he could kill Death's Head. They returned to 2020 to find A.I.M. decimated by Charnel, who had now fled back in time to destroy A.I.M. at an earlier point, intending to wipe out this timeline altogether. Pursuing him to the modern day Earth-616, Death's Head, Tuck and Necker allied themselves with another group of time-travelers, the Avengers from the devastated future timeline Charnel was destined to create. Charnel arrived seconds later, slaying most of the Avengers before Death's Head used two time devices to send Charnel simultaneously into both future and past, ripping him apart. Deciding to stay in the present day, Tuck and Death's Head stole a truck and headed into Manhattan.Before long, they encountered the Avengers, Fantastic Four, Hulk, Vorin of the Shadow Riders, Rick Jones and Black Axe. Death's Head was summoned to the alternate future of Earth-9939 — in which Charnel had conquered Earth — to meet his \"brothers\", Death Wreck and Death Metal. Unfortunately, Death Metal, designed by Necker as a replacement for Death's Head, was sympathetic to Charnel's cause, informing him that Death's Head's actions had negated this timeline and that a temporal wave would soon wipe it out. Before Charnel could travel back in time to prevent this, the three cyborg brothers united to destroy him, with Ghost Rider's Penance Stare having caused Death Metal to switch sides.During a mission to Matricca Scorpio to locate a cure for the Perfection virus for Lady Anula of Lionheart, one of Death's Head personalities, Die-Cut, freed himself from the Minion body and recreated his physical form. Death's Head and Die-Cut worked together for the mission, then parted ways. Later, hired by the people of Numeropolis to reclaim an intelligent gun stolen from them by Tigon Liger, one of Mys-Tech's dimension-hopping Warheads, Death's Head and Tuck battled Liger's Kether Troop while they were trying to steal the powerful Sapphire Lotus. Though the pair failed to retrieve the gun, they did escape with the Lotus. Returning to Earth-616, Death's Head and Tuck found the Lotus' energies drawing numerous superhumans to them, including the X-Men and Wrathchilde. Empowered by the Lotus, and alongside a possessed Tuck, Wrathchilde fought a series of battles with the X-Men and Death's Head, until defeated with the aid of Phaedra, who also sent Tuck home through the dimensions to recover. Realizing home meant Lionheart, a concerned Death's Head swiftly followed, but was detoured to Un-Earth, a voodoo copy of Earth created by Mys-Tech, where he fought both demonic doppelgangers and Kether Troop. As Mys-Tech used Un-Earth to unleash unparalleled carnage across the globe, many of Earth's heroes rallied to stop them; most died, but the survivors, including Death's Head, used the Un-Earth to take time back a day to restore normality. Trying once more to reach Lionheart, a disorientated Death's Head instead ended up in the pocket realm of Inner Space, battling Mys-Tech and the Anti-Being — the collective evil of the Mys-Tech Techno-Wizards' millennia of malevolence — with the assistance of Dark Angel (Shevaun Haldane). Finally reaching Lionheart, he was reunited with Tuck and battled Major Oak and the technological wizard Methinx.Death's Head returned to 2020 A.D., seeking to discover whom Necker had killed to procure his organic components. The Light Brigade, dedicated to preventing paradox, stopped him from interfering in his own creation, and sent him back to Earth-616, to seek answers from Necker in that time zone. Though briefly diverted from his mission twice to fight alongside Killpower and other Earth heroes against the demonic gestalt known as the Battletide, Death's Head finally located Necker's mother, Stealth of the armored mercenary Requiem Sharks, whom he convinced to assist him. They found Necker having ensconced herself in present-day A.I.M., working on yet another Minion cyborg; unfortunately, the human component of this Minion proved to be the past half of the time-split Charnel, who used A.I.M. technology to reunite his scattered parts and threaten the world anew. Working together, Necker, the Sharks, Tuck and Death's Head just barely destroyed Charnel before he grew too powerful to stop. Subsequently, Death's Head fought the Metamorph alongside Motormouth and Killpower; the Lemurians of Earth-313 hired him to capture the Knights of Pendragon; and the Time Guardian recruited him to join the Dark Guard and prevent Mys-Tech from spreading their influence across the universe. On an alternate future Mars colony circa 2026 A.D., Tuck and Death's Head fought android duplicates created by the Alkemist, then—learning Major Oak had decimated their cyborg allies back on Lionheart with technology supplied by Noon and General Cicatrice — they tracked the latter pair down to exact revenge, aided once more by Phaedra. Death's Head was snatched through time by Chronozone, who tried to dupe him into destroying humanity in the past, then later was transported to the interdimensional time port Maruthea by the Time Lord known as the Doctor to assist his Freelance Peacekeeping predecessor against the robot Hob. Time traveling once more, he stopped off in 2099 A.D. to hunt down a man called Burgen. Death's Head has also been seen amongst the many Avengers gathered for the interdimensional, transtemporal Destiny War, apparently indicating that he or a dimensional counterpart will someday join the Avengers, though in which reality remains to be seen.", 
    "durability": 6, 
    "education": "No formal education, but has assimilated knowledge equivalent to several doctorates", 
    "energy": 6, 
    "eyes": "(Right, mechanical) Blue; (left, organic) Yellow\n", 
    "fighting": 7, 
    "firstappearance": "Death's Head II #1 (1992)\n", 
    "groupaffiliation": [
        "Formerly Dark Guard", 
        "Merry Men", 
        "A.I.M."
    ], 
    "hair": "None; has red wiring resembling hair.\n", 
    "height": 84, 
    "id": "Death%27s_Head_(Minion)", 
    "identity": "No dual identity", 
    "intelligence": 3, 
    "knownrelatives": "Dr. Evelyn Necker (creator, \"mother\"), Death Wreck (\"brother\"), Death Metal (\"brother\")", 
    "occupation": [
        "Adventurer", 
        "Bounty Hunter"
    ], 
    "origin": "Death's Head II #1 (1992)", 
    "placeofbirth": [
        "A.I.M. Central", 
        "2020 A.D.", 
        "Earth-8410"
    ], 
    "powers": "Death's Head possesses superhuman sight, hearing and smell, and can communicate with other cyborgs and computers via radio wave. He is programmed with timeline predictions for every planet known to A.I.M. at the time of his creation. He can communicate with other cyborgs via radiowave. His speed, agility, endurance and strength are all superhuman. He is composed of organic components laser-woven into an armature frame of military grade titanium alloy. His armored exterior is a layered composite shell of augmented molybdenum, averaging three centimeters in thickness, capable of withstanding a forty second focused burst from a 6KW meson cutter with minimal effect. The skull armor face plate, however, is composed of 5 mm machined duralinium with a chrome veneer. His body is highly regenerative, regrowing even severed limbs in seconds. His musculature was fabricated from a synthetic muscle/malleable steel mix, and secured to all anchor points by cold laser surgery. All internal jointing, replicated and replacement organs have been fully shielded against corrosion, remote influencing, electromagnetic flux and gravitational inconsistency, and temporal displacement trauma. An equivalent level of superhuman endurance is provided by a non-standard fusion reactor mounted in the thorax cavity. \nHis right arm is composed of liquid metal molybdenum, able to shift configuration into a variety of forms, from hand to blade to high-yield plasma-fusion blaster. Its deadliest form is the Cranial Disruption Syphon, which allows him to download the mind of an opponent. He contains in excess of 106 personalities within his computerized brain, giving him access to a wealth of knowledge and experience, and allowing him to analyze and countermeasure enemy attacks (updating tactics, overriding force fields, etc). However, during psychic attack or other periods of weakness he has sometimes lost control to a number of these personalities.", 
    "realname": "Minion", 
    "speed": 3, 
    "strength": 6, 
    "universe": [
        "Earth-8410", 
        "Marvel Universe and many others"
    ], 
    "weight": 400
}