{
    "aliases": [
        "Mistress Death", 
        "formerly the Unknown", 
        "Death Ryder", 
        "Marcia Lang", 
        "the Little Man", 
        "X-8-8", 
        "Carlos Muerte", 
        "allegedly Mister Death", 
        "Madame La Morte"
    ], 
    "citizenship": "Inapplicable", 
    "content": "During the times that Death has manifested itself on the physical plane, it often takes the form of a skeletal female; however, the body Death chooses to manifest as can be in any form or size.Death's motives and modus operandi are hard to fathom. It works in some kind of partnership with Galactus, a being who survived the destruction of the previous universe, and also provides some measure of power for Death-gods like Hela and demons like Mephisto, who are allowed to rule in her name over extradimensional realms inhabited by the souls of the dead.Death seems to be always seeking out new conquests and may manipulate mortals with or without their knowledge in order to gain them. Death once attempted to destroy the vampire lord Dracula through human pawns because Dracula was depriving it of conquests by creating vampires who were neither truly alive nor truly dead. Death failed on that occasions, but Dracula eventually fell victim to permanent destruction.Although Death ordinarily seems content to maintain a balance in the universe between its power and Eternity's Death will seize opportunities that arise to achieve dominance over Eternity. Death once appeared to the mad Titan Thanos in the form of a woman with whom he fell so much in love that he was willing to destroy the universe in order to please her. Indeed, nearly all of Thanos' activities from that point on involved his desire to win Death's favor. When Thanos possessed virtual omnipotence by means of the Infinity Gauntlet, however, Death, for reasons of its own, turned its back on him. Thanos himself has yet to fathom Death's motives for this relationship.Death has on occasion taken the role of gamesman, having once played a tournament of champions with the Elder to the Universe called the Grandmaster, the end result of which proved the Grandmaster and fellow Elders immune to Death's power.At one point, Death was \"killed\" by the Beyonder, who later \"recreated\" it. The implications of this on Death's nature are still a mystery.Later, Death appeared to the Phoenix Force, claiming it to be the product of power of all life yet unborn, and thus somewhat an agent of Death and abstract entity the likes of Eternity and Death. Death helped to convince the Force to leave its then-current avatar, Rachel Summers.Death has seemed to take a fascination with the mercenary known as Deadpool, appearing to him on several occasions in the context of a somewhat romantic nature. Again, the implications of this are still a mystery, even to Deadpool.", 
    "durability": 7, 
    "education": "Inapplicable", 
    "energy": 7, 
    "eyes": "Variable; (as Mistress Death) Black\n", 
    "fighting": 6, 
    "firstappearance": "(pre-modern) Human Torch Comics #5A (1941); (modern) Captain Marvel #26 (1973)\n", 
    "groupaffiliation": "none", 
    "hair": "Variable; (as Mistress Death) Black\n", 
    "height": 0, 
    "id": "Death_(embodiment)", 
    "identity": "Inapplicable", 
    "intelligence": 7, 
    "knownrelatives": "Infinity and Eternity (sisters), Oblivion and Galactus (brothers), Rot (offspring, apparently destroyed)", 
    "occupation": [
        "Abstract entity", 
        "personification of death"
    ], 
    "origin": "Captain Marvel #28 (1973)", 
    "placeofbirth": "Inapplicable", 
    "powers": "None", 
    "realname": "Inapplicable", 
    "significantissues": [
        "Surveyed surface/underwater war, consorted with Hitler (Human Torch Comics #5A, 1941)", 
        "exulted over nuclear explosions (Strange Tales #27, 1954)", 
        "eradicated Paul Kendricks from existence (Strange Tales #3, 1951)", 
        "pursued Dennis Ames (Strange Tales #5, 1951)", 
        "as Carlos Muerte, confronted Dracula (Dracula Lives #9, 1974)", 
        "tormented John Kowalski during World War II (War is Hell #9-15, 1974-1975)", 
        "romanced by Thanos (Captain Marvel #26-28, 30-31 & 33, 1973-1974)", 
        "romanced Deadpool (Deadpool/Death 1998 Annual, 1998)", 
        "raced Ghost Rider/Johnny Blaze (Ghost Rider #35, 1979)", 
        "met Phoenix Force after its physical form's \"death\" (Classic X-Men #43, 1990)", 
        "claimed Captain Mar-Vell (Marvel Graphic Novel #1, 1982)", 
        "played \"contest of champions\" against Grandmaster for life of Collector (Marvel Super-Hero Contest of Champions #1-3, 1982)", 
        "slain by Beyonder, restored by sacrifice of Dave (Secret Wars II #6, 1985)", 
        "power stolen by Grandmaster, restored by Avengers (West Coast Avengers Annual #2/Avengers Annual #16, 1987)", 
        "resurrected Thanos (Silver Surfer #34, 1990)", 
        "rejected Thanos as suitor (Thanos Quest #1-2, 1991)", 
        "revealed to have hidden from Walker in Marlo Chandler (Captain Marvel #17-18, 2001)", 
        "with aid of Thanos & Avengers, repelled the Rot (Avengers: Celestial Quest #2-8, 2001-2002)", 
        "met Thanos at Omega Core (Thanos #7, 2004)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 139
}