{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Inapplicable", 
            "content": "In more recent  years, Deathurge appeared as a little more than a minion of Maelstrom. When Maelstrom’s lieutenants were captured after securing an experiment deriving from the Terrigen Mists, Maelstrom ordered Deathurge to slay them all. He soon revived the lieutenants by way of cloned bodies. In a similar way, when Maelstrom lost his powers due to accidental exposure to the experimental Mists, he cried out for Deathurge to kill him, and Maelstrom was revived in a cloned body as well.  A second time, when Maelstrom was defeated by the Avengers and the Eternals of Olympus, Deathurge once again killed his “master” at his own request, and he was again revived in a cloned body. However, Deathurge predicted that Maelstrom would die again and, next time, would not be able to use his next clone, Enraged, Maelstrom dismissed Deathurge.Deathurge appeared next to Quasar when the hero investigated the Eternals of Uranus. Quasar was also feeling extreme angst over his recent appointment as Protector of the Universe, allowing Deathurge to battle him, sensing that Quasar was calling out to him. Quasar nonetheless forced Deathurge to flee, but the entity warned Quasar of a time when he would beg Deathurge to kill him, and he would refuse.True to Deathurge’ earlier prediction, Maelstrom had been unable to revive his clone, but his physical death allowed Maelstrom to eventually take on the cosmic role of Anomaly. As Anomaly, Maelstrom also became an agent of Oblivion. Maelstrom bade Deathurge to eliminate the race of Watchers, who may interfere with his plan to collapse all of existence into oblivion, and Deathurge somehow managed to prompt a thought to the Watchers, that their mere existence violated their oath of non-interference in the worlds they watched.  This “thought virus” threatened all Watchers, who would appear to die upon contemplating it, until Quasar managed to come up with a counter argument that stopped the plague and also resuscitated the dead Watchers.Maelstrom later forcibly took Quasar’s Quantum Bands by cutting off his hands, leaving the hero to die, and Deathurge fulfilled his promise by refusing to aid Quasar in his last moments. He was chased off by Ghost Rider. Maelstrom and Deathurge finally tried to reduce all of existence to oblivion by collapsing the universe into a massive black hole. By this time, however, Quasar was revived and used as a champion by Oblivion’s counterpart, Infinity, and Quasar managed to send Maelstrom into the black hole instead.Perhaps the most curious aspect of Deathurge was the strange bond he shared with Craig Hollis, Mister Immortal, of Earth. As a newborn infant, Craig witnessed Deathurge carrying the spirit of his mother away, as she had died in childbirth. Deathurge promised his mother that he would look after the child, and young Craig had “D’urge” as a playmate while growing up, although most thought he was playing with an invisible friend. This lasted until the time Craig’s first true childhood friend, Terri O’Doughan, and Craig became lovers. Deathurge came to collect Terri’s soul, but an enraged Craig was left behind.More recently, Maelstrom once again wanted to end existence, this time ending all things, even oblivion itself. Deathurge confronted Maelstrom, but Maelstrom continued unabated. At the same time, the Great Lakes Avengers were undergoing several crises, not the least of which was the death of their member Monkey Joe. Craig, as Mister Immortal, caught Deathurge as he came to collect the soul of Monkey Joe. (As Deathurge appeared to Monkey Joe in the form of a squirrel, Craig had Deathurge at the advantage.) Deathurge revealed Craig’s immortality stemmed from him being the final step in human evolution, a man who evolved past death itself, and Deathruge’s appearances was meant to help Craig process this.", 
            "durability": 1, 
            "education": "Inapplicable", 
            "energy": 1, 
            "eyes": "None\n", 
            "fighting": 1, 
            "firstappearance": "Marvel Two-In-One #71\n", 
            "groupaffiliation": "Former agent of Maelstrom", 
            "hair": "None\n", 
            "height": 0, 
            "id": "Deathurge", 
            "identity": "His existence is not known to the world-at-large", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": [
                "Harbinger", 
                "angel of death"
            ], 
            "origin": [
                "Quasar #2", 
                ""
            ], 
            "placeofbirth": "Inapplicable", 
            "powers": "As an immaterial cosmic force, Deathurge can appear material or intangible. He can survive extreme temperatures and the rigors of space. His body is composed of an unknown material or energy, which he claims is the “midnight in all mortal souls,” and he can pull weapons from his body composed of the same material. He can also form skis of this material in order to travel at interstellar speed. As an agent of death, Deathurge can sense the imminent death of another, will guide his or her spirit to the afterlife, and appears in a recognizable form similar to the deceased's own species.", 
            "realname": "Deathurge", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": "Variable\n"
        }
    }
}