{
    "aliases": [
        "The God Eater", 
        "Demogorge", 
        "Ra", 
        "Ammon Ra"
    ], 
    "citizenship": [
        "Heliopolis", 
        "formerly Hermopolis"
    ], 
    "content": "Atum arose from within Gaea fully formed and in full possession of his powers. Wielding the powers of the sun itself, Atum attacked and began to slay the elder gods, who at this time degenerated themselves into demons. As he killed them, he absorbed their essences, becoming the Demogorge. Eventually, Demogorge slew and absorbed all the demons, save for Chthon and Set, who escaped into other dimensions and tricked Demogorge into destroying lifeless replicas of themselves. Content that he had accomplished his mission, Demogorge reverted to Atum and flew upward where he merged with the sun itself.Millions of years ago Gaea summoned Atum from the sun to combat the demon Set, who, determined to massacre all mammals to ensure dinosaur supremacy, had merged several enormous dinosaurs into a physical form for himself. Atum severed Set's head with a single bolt of power and absorbed the demon's power, transforming into Demogorge. Set, not deceased, began a long battle lasting months and lying waste to the Earth around them. Ironically, the dinosaurs were rendered extinct due to the battle,, and Demogorge eventually emerged victorious, driving the defeated Set into another dimension. Demogorge reverted to Atum, and was severely damaged by the battle. Atum returned to the sun, but would never again be able to come to Earth unless he was aided by other sentient beings.Gaea, along with Demiurge and/or Atum, later produced the succeeding generations of gods. Atum eventually took the aspect of Ra, the primordial sun good worshipped in Ancient Egypt. As Ammon Ra, he ruled the Ogdoad, the first incarnation of Egyptian gods. While myth states that the Ogdoad spawned Ra, it is suspected that they were in fact spawned by Ra. As his first creations, they may have been imperfect and aged more rapidly than the virtually immortal Ra, their senior appearance causing this misconception. The Ogdoad eventually perished, and Ra started anew, siring the first of the Ennead, the next generation of Egyptian gods, including Shu & Tefnut. Ammon Ra was eventually succeeded as ruler of the Ennead by Shu, though he sometimes still represented them at meetings of the Council of Godheads, such as when they met to discuss the Celestials circa 1000 AD.In recent years, a union of Death Gods sought to merge their realms and powers, and the union of this dark power summoned the Demogorge anew. Demogorge consumed them all and prepared to devour the rest of Earth's gods. A union of heroic gods from various pantheons convinced Demogorge that it was not time for the curent pantheons to die, and he restored the fallen gods and returned to the sun as Atum. When Set again menaced Earth, the Asgardian thunder god, Thor, forced the reluctant Atum to become Demogorge. Thought consumed, Thor somehow asserted dominance over Demogorge to defeat Set, after which Atum disgorged the noble Thor.At some point, Chthon somehow bound some of Demogorge's power into a Darkhold page, which was read in recent years by the vampire hunter Blade in a misguided effort to destroy all things magic. The Darkhold Redeemers' Louise Hastings sacrificed part of her own soul to Chthon to reverse the spell and restore Blade.", 
    "durability": 1, 
    "education": "Approximately 1 billion years life experience", 
    "energy": 1, 
    "eyes": "White (variable)\n", 
    "fighting": 1, 
    "firstappearance": "(Mentioned) Strange Tales #70 (1959); (full) Thor Annual #10 (1982)\n", 
    "groupaffiliation": [
        "Ennead", 
        "God Squad", 
        "formerly Ogdoad"
    ], 
    "hair": "None\n", 
    "height": 120, 
    "id": "Demogorge", 
    "identity": "True nature unknown the general public", 
    "intelligence": 1, 
    "knownrelatives": "Gaea (mother); Demiurge (father); Chthon, Set, Belathauzer, Y'Garon (uncles); Ogdoad (uncertain relationship); Ennead (offspring); Thor (half-brother); related to most of Earthly god pantheons, many others", 
    "occupation": [
        "God and demon slayer", 
        "sun & fertility god", 
        "former ruler of the Ogdoad and Ennead"
    ], 
    "origin": "Thor Annual #10 (1982)", 
    "placeofbirth": "Subterran caverns deep within caverns", 
    "powers": "Atum is immensely powerful; he is believed to have atleast as powerful than other godheads, such as Odin, Zeus and Vishnu, including vastly superhuman strength, stamina, durability and the ability to fly faster-than-light and manipulate massive amounts of solar energy (usually the heat or light); he can survive the heat and pressure within a star.", 
    "realname": "Atum", 
    "significantissues": [
        "Official Handbook Bibliography", 
        "joined God Squad to kill Skrull pantheon, travelled with them through Dreamtime, seemingly killed by Sl'gur't (Incredible Hercules #117-120, 2008)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 3700
}