{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Unidentified planet", 
            "content": "On an unidentified world, a holy man stood near a sacrificial fire pit as his followers awaited the offering to their god, Kronnitt. Loatia Sterixian, Desak’s daughter, was to be sacrificed when a ghostly female image appeared before the masses, presenting Desak a choice. Offering him the Amulet of Power, enabling Desak to save Loatia’s life and protect his people from a furious god, he refused thinking it was an honor to participate in the sacrifice. Loatia was cast into the fire pit, and the Spirit insisted Desak made a grave mistake. That night as Desak was arguing with his wife over the loss of their child, an unsatisfied Kronitt decided to destroy their world. Helplessly watching as his people were slaughtered, Desak was approached again by the Spirit of the Jewel, a name he gave her, and accepted the amulet. He was given power equal to the gods, altered his misguided views, and Desak, Destroyer of gods was born. After his transformation, he promised all who dare try to control the fates of men would fall before him. Thor, Hercules and Beta Ray Bill traveled hundreds of galaxies away to intercept Desak before he could let loose his wrath upon Olympus, arriving on a strange world just as Desak was about to eradicate two more benevolent beings called Tae and Pennsu. Once these cruel gods attempted to destroy the people who worshiped them, Thor realized he was helping the wrong side, and together with Desak, they saved the planet and eliminated Tae and Pennsu. Desak noticed something noble in Thor and decided to let him live, but told him he would be watching. Desak next slaughtered many of the Dark Gods; but their prince, Perrikus, escaped with Adva.Desak returned when Thor inherited the power from his deceased father, Odin, becoming Lord of Asgard. Odin recently separated Thor from his mortal counterpart, Jake Olsen, but the Enchantress possessed a magic mirror, allowing Olsen to become Thor by sharing a portion of his power; with one on Earth and the other in Asgard, neither man was complete, and both were functioning in a weakened state. Following his battle with the dark Gods, Desak met Zarrko the Tomorrow Man, who showed him a glimpse into the future where Thor would subjugate mankind to his rule. Traveling to Earth, Desak encountered Thor and the Grey Gargoyle, who had recently defeated Thor Girl and stolen her hammer. He easily defeated the Gargoyle before setting his sights on Thor, and in the midst of battle, the Spirit of the Jewel appeared to Desak, enforcing his belief that he was doing right by killing Thor. Thor returned to Earth and took back the power Olsen borrowed, making him more powerful than ever, but Desak shrugged off even the fiercest blows by absorbing every bit of Odin Force thrown at him. Thor was defeated and about to be beheaded, but Thialfi, loyal friend and advisor to Thor, arrived on Earth with the Executioner (Skurge)'s axe and placed it in the hands of his king. Succumbing to the evil within the enchanted weapon, Thor buried the weapon into Desak’s chest, seemingly killing him. The Spirit of the Jewel took his body, giving him time to heal.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Orange\n", 
            "fighting": 1, 
            "firstappearance": "Thor Annual (2001)\n", 
            "groupaffiliation": "Minion of the Spirit of the Jewel", 
            "hair": "Reddish-blond\n", 
            "height": 78, 
            "id": "Desak", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Almonnas (wife), Loatia (daughter, deceased)", 
            "occupation": "Destroyer of Gods", 
            "origin": [
                "Thor Annual (2001)", 
                "Thor #79 (2004)"
            ], 
            "placeofbirth": "Unidentified alien planet", 
            "powers": "Desak possessed god-like strength, endurance and his stone-like skin provided him with an extremely high resistance to injury. Desak had the ability to fly, teleport, shoot energy beams from his eyes, and survive indefinitely in the void of space. He could sense all aspects of godliness, including immortality in an individual, and he was given power equal to any god. With his Amulet of Power, he could also absorb their life force into the gem, adding the defeated god's power to his own. It had not been revealed to what limit the amount of power Desak could attain; however, Desak destroyed whole populations of gods single-handedly.", 
            "realname": "Desak Sterixian", 
            "significantissues": [
                "Origin and first battle between Desak and Thor (Thor Annual 2001)", 
                "Desak on Earth, opposed Thor but was killed with the Executioner’s axe (Thor #48-50, 2002)", 
                "Desak resurrected, faced Thor once more and became one with the Destroyer armor, but was ultimately killed again (Thor #75-79, 2004)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 450
        }
    }
}