{
    "aliases": "Snapdragon", 
    "citizenship": "United States of America", 
    "content": "Years later Rachel would join one of Taskmaster’s academies to receive training in order to find a purpose in her life. There she met Anaconda for the first time and eventually learned that one of the instructors was Brock Rumlow.After her training was complete Rachel took the name Diamondback and was contacted by Sidewinder to join the Serpent Society. Her first mission as part of the group was to track down and kill MODOK. During this mission she fought and was instantly smitten by Captain America.The Serpent Society was hired to steal items for Llyra and Ghaur. During this mission Mr. Jip caused Diamondback and the X-Men’s Dazzler’s bodies to switch with each other. While teaming with the X-Men to get her body back, Rachel took the opportunity to steal the item Llyra and Ghaur desired.During her next encounter with Captain America she betrayed the Serpent Society and led Captain America to their headquarters. Diamondback and Captain America attempted to save the members of the Society who had sided with Sidewinder. Diamondback abandoned the Serpent Society once the battle was over.Diamondback and Captain America began to develop a relationship and eventually went on their first date. Asp, Black Mamba, and Anaconda acted behind the scenes to ensure that the date would go by uneventfully.After learning of Diamondback’s involvement with Captain America, the Serpent Society’s new leader, King Cobra placed Diamondback on trial by the Serpent Society fearing she would reveal the Societies secrets to Captain America. Diamondback was found guilty and sentenced to death. Black Mamba and Asp contacted Sidewinder, who rescued Diamondback. King Cobra retaliated by capturing Asp and Black Mamba. Diamondback then hired Paladin to help her free her friends. With Captain America, Paladin and Diamondback freed Asp and Black Mamba, and the five combined to defeat the Serpent Society.Fearing retaliation from members of the Serpent Society, Diamondback, Asp and Black Mamba formed the mercenary group B.A.D Girls, Inc.. The remaining Serpent Society members captured Diamondback but MODAM intervened, kidnapping Anaconda and the B.A.D. Girls for Superia’s army of Femizons. While on Superia’s cruse ship, Diamondback was attacked and nearly killed by her old enemy Snapdragon. Traumatized, Diamondback decided to quit adventuring as soon as possible. Captain America and Paladin came to their rescue and the B.A.D. Girls Inc helped them defeat Superia.When Black Mamba pulled the image of Diamondback’s greatest fear (Snapdragon) from her, Diamondback quit the group. Diamondback tracked down Snapdragon in hopes to confront and overcome her fear of Snapdragon. During the fight between the two, Diamondback killed Snapdragon. Soon after this B.A.D. Girls Inc. lost their immediate goals and the group eventually dissolved.Diamondback was infected with mind-control nanoprobes and sent to steal information from the V-Battalion. During this conflict Citizen V (Baron Zemo (Helmut)) fried the nanoprobes in such a way that her central nervous system was severely damaged causing her to be paralyzed.", 
    "durability": 3, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 4, 
    "firstappearance": "(As Diamondback) Captain America #310 (1985); (as Snapdragon) Captain America #440 (1995)\n", 
    "groupaffiliation": [
        "Formerly B.A.D. Girls", 
        "Inc.", 
        "Secret Avengers", 
        "Savage Crims (gang)", 
        "Femizons", 
        "Serpent Society"
    ], 
    "hair": "Brown, currently Magenta (dyed)\n", 
    "height": 0, 
    "id": "Diamondback_(Rachel_Leighton)", 
    "identity": "Known to the authorities", 
    "intelligence": 2, 
    "knownrelatives": "Mrs. Leighton (mother), William \"Willy\" Leighton (brother, deceased), Richard \"Ricky\" Leighton (brother, deceased), Danny Leighton  (Cutthroat, brother)", 
    "occupation": [
        "Adventurer", 
        "former criminal", 
        "mercenary", 
        "boutique clerk"
    ], 
    "origin": "Captain America #400 (1992)", 
    "placeofbirth": [
        "Austin", 
        "Texas"
    ], 
    "powers": "None", 
    "realname": "Rachel Leighton", 
    "significantissues": [
        "Vs M.O.D.O.K., Porcupine & Captain America (Captain America #310, 1985)", 
        "kidnapped by Crossbones (Captain America #400, 1992)", 
        "formed B.A.D. Girls Inc. with Asp & Black Mamba (Captain America #385, 1991)", 
        "placed on trial by Serpent Society (Captain America #380-382, 1990-1991)", 
        "shown to be student of Taskmaster (Captain America #403, 1992)", 
        "B.A.D. Girls Inc. hired by Cable to recover hard drive (Cable & Deadpool #20-23, 2005)"
    ], 
    "speed": 2, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 142
}