{
    "aliases": "Victor Von Doom", 
    "citizenship": "Latveria", 
    "content": "Some time later when the alien Tyros, formerly known as Terrax, was killed due to his own body exploding in a burst of cosmic energy, Doctor Doom was thought to have perished in the explosion as well. It was found out, however, that Doom transferred his consciousness into one of the witnesses present at the event due to the abilities given to him by the alien race, the Ovoids. After Doom’s body was destroyed, the Doombots, back in his home of Latveria, believed their master dead, but did not want his legacy to die with him. They took the boy, Kristoff, and put the memories of Doctor Doom, in chronological order, into his mind thereby programming him to act as if he was the actual Victor von Doom. Kristoff, however, believed he was the true Doctor Doom and ordered the programming to be stopped once he learned about the partnership between Doom and the Sub-Mariner and their plan to steal the Fantastic Four’s headquarters, the Baxter Building. Kristoff, now clad in a slightly different version of the armor worn by Doom, wanted to put that plan in motion again, but without involving Namor, so he used Doctor Doom’s superior technology to send the Baxter Building into space after he trapped the Fantastic Four inside. If not for the Invisible Woman and her ability to create force fields, the team would have surely been killed after Kristoff blew the building up. Unfortunately for Kristoff, the Fantastic Four invaded Latveria and defeated him only to learn that their foe was that of a small, brainwashed child. Kristoff, set on his belief that he was the real Victor von Doom, alleged that one of his enemies put his consciousness into the body of a child. The Fantastic Four took the imposter back to New York in hopes of returning him to normal.Kristoff was imprisoned in the new headquarters of the Fantastic Four, which was rebuilt by Damage Control, Four Freedoms Plaza until a being called the Beyonder created a new body for the true Victor von Doom and had his consciousness return to it. Shortly after that, Doctor Doom sent one of his robots to kidnap the son of Reed and Sue Richards, Franklin Richards, so he could use the child’s powers to battle Mephisto. Kristoff then used the robot to escape his prison and return to Latveria where he could assume the identity of Doctor Doom once again. While the real Victor von Doom was bargaining with Mephisto for the soul of his mother, Cynthia von Doom, Kristoff confronted him. The two faced off and when the real Doctor Doom admitted that he was having misgivings about Franklin Richards ability to defeat Mephisto, his Doombots interpreted that as a weakness and decided that he could not be the real Doctor Doom. They turned on him and forced him to leave Latveria, leaving Kristoff to rule once more. Kristoff continued to believe that he was Doctor Doom and that the actual Doctor Doom was the imposter that imprisoned his mind in the body of a child. While the real Doctor Doom plotted to get back his throne, Kristoff was determined to remain in power.", 
    "durability": 1, 
    "education": "Kristoff possesses all of the advanced scientific as well as mystical knowledge of the true Doctor Doom, but not his scientific genius", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #247 (1982, as Kristoff), Fantastic Four #278 (1985, as Doctor Doom)\n", 
    "groupaffiliation": "None", 
    "hair": "Brown\n", 
    "height": 0, 
    "id": "Doctor_Doom_(Kristoff_Vernard)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "unnamed mother (deceased), Mister Fantastic (alleged half-brother), Valeria Richards (alleged niece)", 
    "occupation": [
        "Former monarch", 
        "would-be conqueror"
    ], 
    "origin": "Fantastic Four #247", 
    "placeofbirth": [
        "Doomstadt", 
        "Latveria"
    ], 
    "powers": "None known except that he may possess the ability, like the original Doctor Doom, to psionically exchange his consciousness with another person", 
    "realname": "Kristoff Vernard", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 103
}