{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "England", 
            "content": "When Count Otto von Doom’s assassins tried to kill Virginia Dare in the court of the Queen, Dr. Strange discovered Virginia’s shape-shifting ability and agreed with her and her Indian protector, Rojhaz, to keep it a secret. The Queen’s servant, Peter Parquagh later came to Strange and delivered a message that he must meet with the Queen, while nearly being bitten by a venomous spider that Strange’s old friend, Sir Richard Reed, gave to him. But before Strange could visit the Queen, she was dead, killed by another one of Doom’s plots. He and his wife, Clea, continued to care for Virginia, who had grown deathly sick after her transformation. The girl soon recovered, though the new King, James of Scotland, was not as kind as his predecessor, and Strange hid Virginia from him and consulted with Fury, who still felt loyal to the Crown of England. Strange warned him in his astral form, but Fury would not listen.Strange’s next astral stop was Doomstadt, where he spoke with the old man, Donal, and promised him that there would soon be a group sent to rescue him and his treasure: the staff of Thor. Strange then brought his facts to Fury and Carlos Javier, advising them that Donal was trapped in Latveria, along with Sir Richard Reed and his crew, and their only chance to save the entire universe was to invade Latveria and free them. After Javier used his powers to discover that Strange believed he was telling the truth, the two agreed and with Strange left in England, Fury, Javier, and his group of witchbreed set out in a flying ship, powered by Jean Grey; flying off to Latveria and the Castle of Count Otto von Doom.As he watched the group leave, Dr. Strange collapsed to the ground and his spirit flew to Earth’s Moon where he spoke with Uatu The Watcher of worlds. He explained to Strange that his kind had watched the universe since it’s beginning, and that he, Uatu, was a very young Watcher, watching a very young Earth. Uatu revealed that a person sent back in time to 1602 had caused the strange weather conditions, and had rebirthed heroes that weren’t meant to exist for more than 300 years, before their time. The only solution was to return the traveler back to his home time, but he revealed this to Strange and made him promise not to reveal it as long as he lived.", 
            "durability": 3, 
            "education": "Unrevealed", 
            "energy": 7, 
            "eyes": "Brown\n", 
            "fighting": 4, 
            "firstappearance": "Marvel 1602 #1\n", 
            "groupaffiliation": "Former physician to the Queen", 
            "hair": "Black with gray stripes at his temples\n", 
            "id": "Doctor_Strange_(1602)", 
            "identity": "No dual identity", 
            "intelligence": 7, 
            "knownrelatives": "Clea Strange (wife)", 
            "occupation": "Former physician to the Queen", 
            "placeofbirth": "England", 
            "powers": "Dr. Strange is a master of the mystic arts, able to travel via prophetic, and project his astral image anywhere in the world.", 
            "realname": "Doctor Stephen Strange", 
            "significantissues": "Marvel 1602 #1 (intro), Marvel 1602 #7 (death)", 
            "speed": 3, 
            "strength": 3, 
            "universe": "Marvel 1602 (Earth-311)"
        }
    }
}