{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "USA", 
            "content": "After college, Lester worked as an investigative reporter for various tabloids, but later switched careers to become a rock music critic, and then a musician, all to impress Beverly who had nonetheless forgotten all about him. Then, Verde arranged to \"expose\" the band he was in with charges of decadence. However, in an elaborate mock fight that grew out of control, Verde's left hand was severed by a prop guillotine. Underneath the prop bells, Verde's sanity snapped, and he decided to become a supervillain.Verde somehow acquired a superb physique, mastery of sonic and genetic engineering, and an elaborate headquarters and other scientific resources. Verde succeeded in creating vaguely humanoid beings called \"Neezers\" from genetically-engineered animals.Calling himself Doctor Bong, Verde captured Beverly and her companion, Howard the Duck. Verde held them prisoner in his castle, demanding Beverly marry him or else he would kill Howard. Beverly reluctantly agreed but Verde still subjected Howard to a hideous experiment that transformed the waterfowl into a human. Bong then forced a passing ship's captain to marry Beverly and him. Howard escaped and eventually regained his normal form, returning to attempt rescue. Instead, it was Beverly who had since used her time in the castle to create five infant clones of Lester, naming them the \"Bong Quintuplets.\" Beverly played to Doctor Bong's self-aggrandizing attitude, threatening to besmirch his reputation by revealing him a negligent father. Bong took custody of the children and sent Beverly and Howard away.Later, the Doctor was dismayed when he discovered his sons' love for animated cartoons. He developed \"Bong-Vision,\" a means to reshape the cartoons (and other televised programming) into realistic three-dimensional realities. Coincidentally, She-Hulk and other citizens became trapped in these deadly realities, and She-Hulk worked her way through to confront Bong directly. She rescued the innocent victims and escaped the alternate realities, but Doctor Bong remained trapped within them when the Bong-Vision system was turned off.Doctor Bong reappeared months later, having switched careers again. This time he set himself up as a psychologist (apparently to win the affections of a woman named Barbara.) He treated Deadpool, encouraging him to engage in gratuitous battle against Wolverine as therapy. Bong called off the battle, though, when Deadpool seemed to reach a breakthrough.Once again, his unrequited love prompted him to set his sights on Beverly Switzler. He formed his own dotcom company, Globally Branded Content (or GBC.com), and hired Beverly to be a supervisor for a genetically-engineered boy band singer, TJ. Howard the Duck, suspicious and more than a little upset, uncovered the truth of Doctor Bong's involvement, but Bong would rather have revenge. He caused GBC.com's laboratories to explode, effecting his escape and unexpectedly leaving Howard trapped in the body of a giant humanoid mouse.Unsatisfied that his revenge wasn't complete, Doctor Bong manipulated Howard and Beverly first by trying to link them to the terrorist Osama el-Braka and then by setting them up against Detective Suzi, weilder of the Amulet of Pazuzu. In the final confrontation, Howard accidentally took on the Amulet of Pazuzu himself, turning him into a bloodthirsty female warrior. Doctor Bong managed to escape the brouhaha, and Beverly helped Howard return to normal.", 
            "durability": 1, 
            "education": "Advanced degree in journalism, genetics, and psychology", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Howard the Duck #15 (1977)\n", 
            "hair": "Reddish blonde\n", 
            "height": 74, 
            "id": "Doctor_Bong", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Bong Quintuplets (cloned offspring); Unnamed ex-wife; Mrs. Verde (mother)", 
            "occupation": [
                "Genetic engineer", 
                "psychologist", 
                "(formerly) reporter/rock music critic", 
                "rock musician"
            ], 
            "origin": "Howard the Duck #16 (1977)", 
            "placeofbirth": "Unrevealed", 
            "powers": "None", 
            "realname": "Lester Verde", 
            "significantissues": [
                "Created Bong-Vision, defeated by She-Hulk (She-Hulk #5)", 
                "\"Treated\" Deadpool (Deadpool #26-27)", 
                "Sought revenge through GBC.com, Osama el-Braka, and the Amulet of Pazuzu (Howard the Duck #1-3, 2002)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 225
        }
    }
}