{
    "aliases": "Otto the Handsome", 
    "citizenship": "Latveria", 
    "content": "Queen Elizabeth I ruled England at the time, and she had recently sent her spymaster Nicholas Fury to retrieve a secret, Templar treasure from an old man and his cart. Doom lusted after the treasure, as he did with anything that promised power, and he sent his own people after the treasure. He also sent an assassin after the queen, as well as the young English woman, born in the American colonies, named Virginia Dare. Though the assassin which sent after Virginia Dare failed, the mechanized toy, which he sent to the queen’s court used a vial of aqua regia to poison the queen and anyone around her. But it was his paramour, Natasha, called the most dangerous woman in England by her blind friend, who was most effective and captured the old man’s treasure, the old man, and the blind man who was often called a devil.Doom imprisoned the blind man and the old man, but foolishly confused the treasure for a shiny bauble that the old man used to distract him from the true treasure: the old, wooden staff of the Thunder God, Thor. Doom turned to Reed to uncover the secrets of the sphere, but only learned that electricity might activate it. Soon, however, Carlos Javier and his band of witchbreed attacked Doom’s castle, seeking to steal back the staff. Doom’s men halted their attack until Captain Benjamin of the Fantastick rocked against his stone, prison walls, freeing the old man who used the staff to turn himself into Thor. Once the Thunder God had brought a massive storm, Javier’s student, Robert, used the moisture in the air to stop Doom’s cannons. The battle ended shortly afterwards, with the four from the Fantastick having broken free due to their Captain’s efforts, and faced off against Doom. Without knowing more about the sphere, Doom used a bolt of Thor’s lightning to try and power it, but it exploded instead, scarring him severely and seemingly killing him. The band of heroes soon left him smoking on top of his own castle, and flew off to fix the rift in the universe.", 
    "durability": 4, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Marvel 1602 #3\n", 
    "groupaffiliation": "None", 
    "hair": "Blonde\n", 
    "id": "Doom,_Otto_von_(Earth-311)", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Ruler of 17th Century Latveria", 
    "placeofbirth": "Latveria", 
    "powers": "None", 
    "realname": "Count Otto von Doom", 
    "significantissues": "Marvel 1602 #3 (intro), Marvel 1602 #6 (scarring)", 
    "speed": 3, 
    "strength": 3, 
    "universe": "Marvel 1602 (Earth-311)"
}