{
    "add": {
        "doc": {
            "aliases": "The Lady Dorma", 
            "citizenship": "Atlantean", 
            "content": "Namor soon kidnapped the Fantastic Four’s Invisible Girl, and refused to explain himself to his people, but the three other members of the Fantastic Four soon came after him to reclaim their kidnapped friend. Left alone with Krang and Susan in the command craft, the assembled Atlanteans were puzzled by Namor’s interest in the surface woman. But when Susan implored Krang to stop them before either side was hurt, Krang realized that Namor kidnapped her as more than just a hostage. Realizing that Namor loved the human woman instead of her, Dorma went mad and smashed out one of the vehicle’s windows to drown Susan. But Susan leapt out, and was pulled out of the water by Namor and the Thing. Namor quickly returned to his command craft and ordered Dorma, Krang, and his troops out so that he could move faster towards the surface world to save his love. Both Dorma and Krang protested, and Dorma even tried to use her own royal heritage as leverage, but Namor callously ejected the Atlanteans and went off to save the life of Susan Storm. Though when Namor returned to Atlantis, he found that Dorma, Krang, and the rest of his people had deserted him for his betrayal of them.After the Atlanteans realized they could never turn their back on their prince, Dorma returned with them and rededicated herself to becoming Namor’s queen. But soon the warlord, Attuma, believing himself to be the prophesied conqueror of Atlantis, waged war on Atlantis. Namor fought his troops bravely and effectively, but when he tossed aside Dorma as she declared her love, she betrayed him to Attuma by arranging an unguarded wall for him to break through. Attuma’s troops soon turned the tide of battle against Namor, and in a fit of guilt, Dorma traveled to the surface world to ask for the help of the Fantastic Four. The group agreed in the best interest of the entire world, and secretly helped Namor defeat Attuma. Beaten, Attuma surrendered, and Namor banished him and his troops from Atlantis and rebuilt his empire to guard against further invasion. Though due to his princely pride, Dorma decided not to reveal the Fantastic Four’s part in his victory, and he forgave her her betrayal, knowing what it was to do foolish things for love.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Motion Pictures Funnies Weekly #1 (1939); (Marvel) Marvel Comics #1 (1939)\n", 
            "groupaffiliation": "None", 
            "hair": "Red\n", 
            "height": 70, 
            "id": "Dorma", 
            "identity": "Publicly Known", 
            "intelligence": 1, 
            "knownrelatives": "Namor (cousin/husband), Wathan (father, presumed deceased), Wa-Korr (grabdfather), presumed deceased); Aquaria Nautica Neptunia (Namora), Arkus, Beemer, Bobo, Byrrah (deceased), Byrrahna, Daka, Dara (deceased), Fen, (deceased), Immamu (deceased), Korra (presumed deceased), Namita, Namorita (deceased), Seth, Thakorr (deceased), Zarina (cousins)", 
            "occupation": "Aristocrat", 
            "placeofbirth": "Atlantis", 
            "powers": "None", 
            "realname": "Dorma", 
            "significantissues": "Fantastic Four Annual #1 (intro)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 185
        }
    }
}