{
    "aliases": [
        "The Dread One", 
        "Eater of Souls", 
        "Lord of Chaos", 
        "Lord of Darkness", 
        "the Great Enigma", 
        "Flyx"
    ], 
    "citizenship": [
        "Faltine Dimension", 
        "Dark Dimension"
    ], 
    "content": "Little is known of Dormammu’s early rule, and since denizens of the Dark Dimension have millennia-long lifespans within a universe whose time passage may not match Earth’s anyway, it is almost impossible to guess how long those activities lasted. He warred with several extradimensional rulers and allied with others, forming a pact with Odin of Asgard and even joining the embodiment of Eternity to banish the occult juggernaut called Zom within a netherworldly amphora. He apparently observed the Earth dimension for several millennia, supposedly even manipulating the creation of the demon Satannish in Earth’s ancient pre-history; he often clashed with Agamotto, the extradimensional entity who appointed himself that universe’s first Sorcerer Supreme, and his disciple, an unnamed tentacled alien. The immensely powerful amulet called the Eye of Agamotto was wielded against Dormammu, as was the mysterious Staff of One, but Dormammu rarely if ever met true defeat, and in time he ascended the ranks of those mystic beings whose patronage was beseeched by mortal sorcerers.When Umar went mad after bearing a daughter to Orini, now in millennia-old adulthood, Dormammu used trickery to banish her to a pocket universe, becoming sole ruler of the Dark Dimension and continuing his conquests. Orini became Dormammu’s most devoted disciple and raised his daughter Clea in the Dread One’s service.Finally, prompted by events that remain unrevealed, Dormammu targeted the Earth dimension for conquest in 1666, causing London’s Great Fire and using the life-force of its victims to link the two dimensions via Stonehenge. However, Dormammu suffered his first defeat when forced back to the Dark Dimension by the Mystic, Earth’s Sorcerer Supreme. In 1692, Dormammu also clashed with Salem exorcist Hiram Shaw, who vied for the Sorcerer Supreme title, and other earthly foes came and went over the centuries, but the Mystic, later called the Ancient One, became his true obsession; indeed, the Ancient One’s influence spread throughout the multiverse, protecting other realms from Dormammu’s grasp. Unable to penetrate the mystic barriers erected by his foe to protect the Earth dimension, Dormammu occasionally acted through earthly pawns over the centuries, as when, in 1888, he was involved in creating Jack the Ripper, perhaps in cooperation with mastermind Fu Manchu, via a mystic parasite later called the Zaniac.In recent years, Mordo, evidently displeased with his progress as Dormammu’s servant, sought sacrifices for a mysterious entity, the Great Enigma. His efforts won the attention of Doctor Strange and the heroic Spider-Man, and Mordo fled through a portal, only to arrive before the Enigma, none other than Dormammu himself, who had perhaps used the alias to test his hapless catspaw. But Strange’s opposition intrigued Dormammu, who wondered if the Ancient One’s power was at last faltering if only his successor stood against Mordo.Shortly afterward, Dormammu sent a ghostly messenger to the Ancient One to announce a renewed intention to conquer the Earth dimension. When Strange traveled to the Dark Dimension in response, Dormammu, surprised that even this challenge did not rouse the Ancient One to action, sent supernatural servitors to bedevil the newcomer. When Strange bested all comers, Dormammu met him in mystic combat, but Strange proved more powerful than anticipated. As he drew upon the Dark Dimension’s energies, Dormammu inadvertently weakened the barrier containing the Mindless Ones and withdrew to force them back. Not wishing Dormammu’s subjects to suffer, Strange lent his mystic might to Dormammu, successfully re-sealing the juggernauts. Indebted to Strange for his help, Dormammu felt compelled to end the fight, and Strange made him vow never to threaten the Earth dimension again. Enraged by this turn, Dormammu swore vengeance against Strange, a grudge which even outweighed his hatred of the Ancient One.Dormammu soon found a loophole to his vow by granting Mordo more power than ever before, for Strange’s murder by a third party would negate the pact. Mordo and his minions hounded Strange across the world for weeks until finally abducting the Ancient One as a bargaining chip to lure Strange to the Dark Dimension. But Mordo’s boasting wearied Dormammu, who brought all three Earth sorcerers with him\nto a neutral realm where, in his own fit of bravado, he summoned the Lords of the Netherworlds, his peers in dimensional domination, to watch him overcome Strange in hand-to-hand combat. However, when Strange seemed to gain the upper hand, Mordo struck him a mystic blow from behind, outraging Dormammu’s sense of honor. Banishing Mordo for his troubles, Dormammu faced Strange in a rematch, but fell to his foe’s greater familiarity with physical combat. Before the gathered Lords, Strange forced Dormammu’s vow to menace Earth no further even by proxy, cementing the Dread One’s humiliation. However, Dormammu struck a parting blow by extradimensionally banishing Clea, and then manipulating fellow Nether-Lord Tazza into attacking the sorcerer.Driven to mad fury by their grudge, Dormammu, for reasons unclear, dared to challenge the almighty Eternity himself. Even Dormammu’s power was\nno match for the universal embodiment, who dismissed his foe to the mysterious Realm Unknown, the very dimension where, ironically, Clea now languished. Rallying the demonic Dykkors, banished there by the Ancient One long ago, Dormammu sent wraithlike beings to drain power from the searching Strange, whom he imprisoned. Clea, however, escaped to Earth and mystically influenced Umar, ruling the Dark Dimension in her brother’s absence, to free Strange. The sorcerer confronted his nemesis at the very gateway to Earth he meant to enter, only for Dormammu to be paralyzed by the force of his own vow to leave Earth untouched.Months later, having reclaimed the Dark Dimension, Dormammu sought a new loophole by possessing the earthborn Strange himself, but met defeat at the hands of Strange and his new allies, the Defenders. Thinking to make Strange’s own friends his catspaws, he then allied with the Asgardian god Loki, Odin’s foster son, to manipulate the Defenders into obtaining the talisman called the Evil Eye, whose power he hoped to use to merge the Earth dimension and his own. However, Loki was uninterested in sharing power and manipulated the Avengers into also seeking the Eye, sparking the so-called Avengers/Defenders War. When the two teams discovered the plot, they confronted both menaces and, at the prodding of the mutant Scarlet Witch, the Evil Eye absorbed Dormammu as energy and redirected it at Loki, driving the god from the scene. But a spark of Dormammu’s consciousness remained, and with Umar’s help, he was reborn on Earth itself. Having thus cheated his vow, and doubtless buoyed by the Ancient One’s recent death in battle with the monstrous demon Shuma-Gorath, Dormammu was nonetheless betrayed by Umar and banished by Strange, now Sorcerer Supreme, and the earth-spirit Gaea. A subsequent gambit, pitting Strange against the demonic Ghost Rider and the ghostly Bounty Hunter, met no better success.As a new tack, Dormammu allied with Doctor Doom to channel the power of the mysterious mystic confluence called the Bend Sinister, with Doom’s pawn Lucius Dilby attempting to use Strange as a human sacrifice. However, Spider-Man disrupted the ritual, freeing Strange but leaving Dormammu no worse off than before. Perhaps reminded of Mordo’s defeat years earlier by Strange and Spider-Man, after ritually maintaining universal balance in a chess match with Odin, Dormammu subtly directed Mordo to time-travel to 1943, where Mordo’s grandfather Viscount Krowler, his death still months away, absorbed that era’s the power of that era’s Mordo. Krowler’s Dark Cabal then prepared to grant Dormammu access to Earth by channeling the terror and hatred provoked by Nazi bombings of England. Fortunately, Strange followed Mordo into the past and won the help of Nick Fury and the Howling Commandos; Dormammu was given little time to jog his memory regarding the Commandos when Strange and Fury disrupted the ceremony, scattering Dormammu’s mystic essence throughout time and space.Undaunted, Dormammu returned to the Dark Dimension, luring Strange by unleashing the Mindless Ones upon Earth, then trapping him in helpless symbiosis with Clea. Perhaps in nostalgia, he invited Umar to share his reign once more, then banished her anew when she predictably turned against him. Dormammu’s invasion of the Earth dimension met unlikely resistance from Baron Mordo, at last weary of\nDormammu’s abuses and hoping to claim Earth for himself. As Strange and Clea freed themselves, Umar, with Mordo as her champion, forced Dormammu into a compromise, promising him his own dimension to begin anew but neglecting to mention it was that of the Mindless Ones, who were as eager to assault Dormammu in their domain as they had been in his. Umar claimed rulership of the Dark Dimension, with Mordo as consort, but soon Dormammu, in the guise of the Faltine\nFlyx, lured Clea into gathering mystic allies among the Lords of the Netherworlds to depose her mother. This freed Dormammu to reclaim his realm, becoming more powerful than ever before. Strange, although greatly weakened after losing much of his own power by renouncing the Principalities who patroned him, confronted him alongside a new team of Secret Defenders. Giddy with power, Dormammu gloated that humanity’s own evil nature, demonstrated by the horrors of the very\nwartime era in which he had fought Strange and Fury, proved its need for his rule, then contemptuously dismissed his enemies and, soon afterward, allowed Strange and the human-alien hybrid Darkhawk to seal a breach between the Dark Dimension and Earth’s technological Cyberspace, indulgences he doubtless regretted later.When the Guardians of the Galaxy, heroic adventurers from the 31st century of Earth-691, traveled to the modern era of Strange’s Earth-616, Dormammu, on a whim, followed them back to their home era and attacked their Drydock headquarters, demanding the presence of Doctor Strange, himself known as the Ancient One in the Guardians’ era. The future Strange and his disciple, the alien Krugarr, rose to the challenge, but neither Krugarr, the Guardians, nor their associates the Galactic Guardians could prevent Dormammu combining his own power with that of his future counterpart, from slaying Strange at last. However, careless from his victory, Dormammu allowed himself to be overwhelmed when the Guardians unpredictably teleported him throughout their ship and attacked him in succession with non-mystic powers unfamiliar to him, forcing him to return to his home time and realm.Dormammu launched his most ambitious scheme yet in a war against the demons and death-gods that governed Hell itself, through which he planned to reach Earth. With Satannish as his lieutenant, he captured two-fifths of his targeted regions but was driven out by the united power of his adversaries, rallied by the heroine Hellcat. Dormammu’s own realm suffered attack by the vastly powerful Archenemy, whom even the Mindless Ones could not overwhelm, forcing his own alliance with Mephisto and dozens of other demonic rulers of the so-called Splinter Realms before the creature was finally destroyed by the sorceress Magik (Amanda Sefton), but not without severe damage to all realms involved.", 
    "durability": 7, 
    "education": "Inapplicable", 
    "energy": 7, 
    "eyes": "Yellow (green in human form)\n", 
    "fighting": 6, 
    "firstappearance": "Strange Tales #126 (1964)\n", 
    "groupaffiliation": [
        "Lords of the Splinter Realms", 
        "Lords of the Netherworlds", 
        "allied with Umar", 
        "Loki", 
        "Doctor Doom", 
        "Underchild", 
        "others"
    ], 
    "hair": "None (black in human form)\n", 
    "height": 0, 
    "id": "Dormammu", 
    "identity": "No dual identity", 
    "intelligence": 7, 
    "knownrelatives": "Sinifer (parent/genitor), Umar (sister), Clea (niece), Doctor Strange (nephew-in-law), Satannish (alleged offspring)", 
    "occupation": [
        "Despot", 
        "conqueror"
    ], 
    "origin": [
        "Doctor Strange #71 (1985)", 
        "Doctor Strange: Sorcerer Supreme #22-23 (1990)"
    ], 
    "placeofbirth": "Faltine Dimension", 
    "powers": "Composed of pure mystical energy, Dormammu possesses more raw power than even the most skilled sorcerer, although he is frequently undone by his own impatience; his power can reach even greater levels via worship by others. Among his many abilities are matter transmutation, interdimensional teleportation, size and shape alteration, element control, telepathy, creation of artificial beings, and empowerment of others. Dormammu can call upon the mystic energies of the entire Dark Dimension, as well as his own innate power, and he commands its vast resources while its ruler; however, his abilities are somewhat limited when physically present in another universe, unless he can directly tap its energy via symbiosis or rebirth. Like that of various other entities, Dormammu’s innate power can be partially invoked by the spells of individual sorcerers, including Doctor Strange himself.", 
    "realname": "Dormammu", 
    "significantissues": [
        "At Stonehenge, vs the Mystic (Doctor Strange: Sorcerer Supreme #23, 1990)", 
        "vs Hiram Shaw (X-Men: The Hellfire Club #1, 2000)", 
        "encountered Captain America & Red Skull (Captain America/Nick Fury: The Otherworld War, 2001)", 
        "denied power to Baron Mordo (Untold Tales of Spider-Man: Strange Encounter, 1998)", 
        "first fought Doctor Strange (Strange Tales #126-127, 1964)", 
        "empowered Baron Mordo against Doctor Strange, watched as Mordo spent weeks tracking Strange, defeated by Strange (Strange Tales #130-141, 1965-1966)", 
        "seemingly destroyed by Eternity (Strange Tales #146, 1966)", 
        "allied with Loki to obtain Evil Eye, vs Avengers & Defenders (Avengers #115-118/Defenders #8-10, 1973)", 
        "reborn within Earth's core, defeated by Doctor Strange & Gaea (Doctor Strange #6-9, 1975)", 
        "maintained balance of order and chaos via chess match with Odin (Thor Annual #9, 1981)", 
        "traveled to 1943 to possess Viscount Krowler, defeated by Doctor Strange & others (Doctor Strange #50-51, 1981-1982)", 
        "possessed Doctor Strange's body, driven out by Topaz (Doctor Strange: Sorcerer Supreme #1-2, 1988-1989)", 
        "posed as Flyx, deceived Clea, manipulated her into deposing Umar, reclaimed Dark Dimension, vs Secret Defenders (Doctor Strange: Sorcerer Supreme Annual #2/Doctor Strange: Sorcerer Supreme #48-50, 1992/1992-1993)", 
        "traveled to 31st century, vs Guardians of the Galaxy (Guardians of the Galaxy #34-37, 1993)", 
        "waged war against Mephisto & others (Hellcat #1-3, 2000)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": "Variable\n"
}