{
    "aliases": [
        "Count Dracula", 
        "the Devil", 
        "Dr. Vlad", 
        "Dragon", 
        "Drake", 
        "Justin Drake", 
        "Father Death", 
        "the Impaler", 
        "Kaziglu Bey/Impaler Prince", 
        "Prince of Darkness", 
        "Vladimir Tepesch", 
        "and Lord of the Damned", 
        "Undead", 
        "and Vampires"
    ], 
    "citizenship": "Formerly Transylvania and Wallachia", 
    "content": "Dracula was born in A.D. 1430; in 1444 he accompanied his father and Radu to Turkey to discuss peace, but they were ambushed, and the sons were held prisoner by Sultan Murad II to force Vlad the Elder to favor Turkey. After five years of torture, Radu had died, and Vlad the Elder and Mircea were killed by Vlad's advisors, led by John Hunyadi, for supporting Turkey. At 18, Vlad escaped and returned home, taking the title of voivode (prince) of Wallachia, but fled after a year, fearing his father's killers. Returning in 1451, Vlad threw himself at the mercy of Hunyadi, who trained him in war. Following through with a prearranged marriage, Vlad wedded Zofia, whom he despised.After a year, his obligations fulfilled, Vlad ousted Zofia and their infant daughter, Lilith. Again becoming prince of Wallachia, Vlad married his beloved Maria, sired Vlad Tepulus, ordered the impalement of all involved in his father's death, slew the Teutonic Knight Frank von Frankenstein, and ordered a massed assault on Turkey. Receiving deceptive \"visions\" from Varnae in 1459, Vlad Dracula was defeated in battle, but the warlord Turac had him spared, hoping to use him to seize control of Transylvania. Dracula was taken to the Gypsy Lianda, secretly a vampire, who used her \"healing powers\" on him. Dracula revived, but realized his powers moments too late to save Maria from assault and murder by Turac, though Turac soon fell before him. Dracula passed Varnae's test by destroying the false vampire-lord Nimrod, and, after Varnae resurrected him from destruction by a group of priests, Dracula became the Lord of Vampires by consuming the blood of Varnae, who then destroyed himself.Dracula initially slaughtered many Gypsies, blaming them for his transformation. Dracula then reclaimed his Castle and slew the vampire Bordia, learning of the Montesi Formula. He sent the thief Murgo to steal the Darkhold from the Vatican, but the book was stolen by the sorcerer Cagliostro, beginning their long feud. Transforming several women into his Brides, Dracula avenged himself on Murad II. After fighting off an assassin in 1471, Dracula abdicated his rule, though he remained in his castle for over a century. Eventually he was forced to slay Vlad Tepulus, who had been raised by Gypsies who had taught him to hate and to kill his father. In the 16th century, Dracula encountered Esteban De Ablo and twice battled Puritan adventurer Solomon Kane; a man named Durenyi stole Dracula's diary, which revealed his weaknesses and would eventually be read by 19th-century writer Bram Stoker. Dracula left his Castle near Snagov, moving to one near Burgo Pass, which he would keep for four centuries.Also in that century, Dracula vampirized the wife of Count Vryslaw, who maintained her on animal and then human blood for twenty years before ending their existence; using his Children of Judas vampire cult to vampirize the wife of Abraham van Helsing, renewing his ancestral feud; vampirized Lyza Strang after her betrayal following his assistance in making Otto von Bismarck leader of the German States; fell in love with Anabelle St. John, using his Legion of the Damned vampires in 1862 to assist the Confederate army in exchange for her returning to Transylvania with him; occupied Vienna via his vampire-legions before being driven off by the Golden Angel; vampirized pirate Captain Cutlass; dated the royal Maria Kroner in 1879; and was destroyed by an American Marshal with silver buckshot. Though he was later resurrected, minute silver particles temporarily weakened Dracula, causing him to age rapidly when he went without blood. In 1890, Dracula fought Jonathan Harker, Abraham van Helsing, John Seward, and others, escaping death by turning into mist. Dracula was later staked by van Helsing, but revived with the unwitting aid of Frankenstein's monster in 1898.In the early 20th century, Dracula battled a manifestation of Death, vampirized John Falsworth (Baron Blood), slew Jon Harker, defeated mobster Nick Diablo in Rome, met Marianne Cutlass (daughter of the pirate captain), battled the Frenchman in Marsailles, and encountered the demonic Devil's Heart in North Carolina. During World War II, Dracula opposed the Nazis as they destroyed his Gypsy servants; he destroyed Hauptmann Rudolph Kris after he usurped Castle Dracula, and at least once worked with the Howling Commandos. In the latter 20th century, Dracula's exploits were more frequently recorded, and his many adventures included vampirizing Tartoff on whose family he had preyed for generations; seeking the powers of the demons Ypsilloth and Ryg beneath Tarrington's Jenning Mill; fighting Father Vergilius Flotsky in Brass Monkey, New Mexico; observing the destruction of the Immortal Nine's Pool of Blood; battling the young Blade and his vampire hunters in China; solving the mystery of Mortus the Death Man who sought vengeance on the Broadway Project for her father's death; failing to control vampirized CIA pilot Roberta Christianson, and failing to claim the powerful Yazdi Gem from Augustus Ebers. Eventually the vampire-hunter the Scotsman staked Dracula and knocked him into his own Pit of Death. Despite his body's destruction, Dracula's spirit sent his agent Comte St. Germaine to obtain the Amulet of Zarathos in a failed effort to resurrect him.A few years later, Dracula's descendant Frank Drake inherited Castle Dracula, but his witless friend Clifton Graves removed the Scotsman's stake, restoring Dracula. Drake joined a band of Vampire-Hunters that continually pursued and sometimes even temporarily destroyed Dracula, who traveled to America and then back and across Europe, encountering the likes of Duncan Corley's restless corpse, the Werewolf  Jack Russell, the Elderspawn Y'Garon and Elianne Turac (the life-extended daughter of the Turkish warlord), and making a new Castle Dracula from Castle Dunwick, usurped from Sheila Witter. Somehow entering the Vatican despite great agony, Dracula slew Giuseppe Montesi, but not before Montesi had sent a copy of the Formula to Quincy Harker.A disembodied brain who needed human blood to survive and sought vampire servants to obtain it for him, Doctor Sun drained Dracula's power and had him destroyed; but to stop Sun, the vampire-hunters used Aurora Rabinowitz's virgin tears to revive Dracula, who helped Blade temporarily destroy Dr. Sun. Dracula then infiltrated Anton Lupeski's Church of Satan, posing as the devil and seeking to sire a human son. Lupeski saw through the farce but hoped to control the child, and he presided over Dracula's wedding to Domini and the mystic ceremony through which Dracula fathered Janus. Lupeski attempted to kill Dracula, but inadvertently slew Janus instead, and Dracula crushed his skull. Domini magically revived Janus, who merged with the Golden Angel and fought Dracula repeatedly. As punishment for bringing Janus into the world, Mephisto (as Satan) stripped Dracula of his powers, though he became amused and restored them when Dracula became so desperate that he prayed to God for help. Dracula reclaimed the title of Vampire-Lord from the usurper Torgo, but was soon after skewered by a silver spoke in a battle with Quincy Harker, who also perished, destroying the most recent Castle Dracula in the process.Sometime later, a demon named Asmodeus orchestrated Dracula's resurrection. Confused over the absence of Dracula's remains from his castle (where they lay when Asmodeus last observed the Earth), Asmodeus located the vampire's soul, then replaced the soul and the restored remains at the site of his previous death, again skewered by Quincy Harker's silver spoke. Dracula was revived by Professor Gregor Smirnoff, accessing the power of Asmodeus. Through Smirnoff, Dracula tapped the psychic power of 666 students associated with the Belonging cult. He was opposed by Frank Drake, Blade, Katinka, and Inspector Judiah Golem. After being wounded by his enemies, Dracula was eventually overcome by the spirits of the dead passing though him and he exploded.A later explosion apparently merged Frank Drake and vampire Hannibal King into a new, monstrous Dracula who fought Blade, but the real Dracula's spirit eventually possessed this monster, displacing Drake and King and restoring all three to their original forms. Dracula created an artificial companion in Raynee, but Spider-Man and Dr. Strange drove him from her. Dracula was then infected with a vampire-destroying virus by Charles Seward (descendant of John), which made it impossible to consume human blood, but also turned out to be lethal and highly infectious to humans. Dracula ultimately cured himself by drinking Seward's blood, which had been used in developing the virus. Dracula encountered the mutants of Generation X, then was forced to work with Elsa Bloodstone, whose father he had fought in the past, to oppose the Nosferatu vampires, who sought to infect other \"purebred\" vampires with an Ebola-like virus, making them immortal blood donors.", 
    "durability": 7, 
    "education": "Tutored by finest instructors of the 15th century; extensively self-taught", 
    "energy": 7, 
    "eyes": "Red\n", 
    "fighting": 7, 
    "firstappearance": "Suspense #7 (1951)\n", 
    "groupaffiliation": [
        "Lord of Vampires", 
        "former member of the Legion of the Unliving", 
        "sometimes uses vampire and humans pawns", 
        "e.g.", 
        "Brides of Dracula", 
        "Children of the Night", 
        "Darkholders", 
        "Legions of the Damned", 
        "Legion of Doom", 
        "Order of the Dragon", 
        "and others"
    ], 
    "hair": "Black\n", 
    "height": 77, 
    "id": "Dracula", 
    "identity": "True nature disbelieved by general public", 
    "intelligence": 7, 
    "knownrelatives": "Vlad Dracul (Vlad the Elder, father, deceased); Mircea, Radu the Handsome (brothers, deceased); Prince Basarab the Great (ancestor), Prince Mircea the Old (grandfather), Stephen Bathory (cousin); Zofia, Maria (wives, deceased); Domini (wife, separated); Vlad Tepulus (deceased), Janus Tepes (sons); Lilith (daughter), Frank Drake (descendant by Tepulus)", 
    "occupation": [
        "Lord of Vampires", 
        "former prince of Transylvania and Wallachia"
    ], 
    "placeofbirth": [
        "Schassburg", 
        "Transylvania (now Sighisoara", 
        "Romania)"
    ], 
    "powers": "Dracula possesses far greater powers than most vampires. He has superhuman strength, speed, stamina, agility, and reflexes, and is immune to aging, conventional disease, and most forms of injury. He ignores most assaults and regenerates damaged tissue rapidly; however, he must drink blood regularly to survive, and is vulnerable to silver, garlic, sunlight, a wooden stake through the heart, and religious symbols (whose threat is related to the strength of faith of their wielder, provided said religion existed during his human life) and other magic items, such as the Bloodgem. Certain spells, such as the Montesi Formula, can destroy Dracula; however, in all circumstances of apparent destruction, Dracula has been revived by some means. If Dracula fatally drains a victim, that person will arise in three days as a vampire. Dracula can control others with a glance or by drinking their blood; command animals such as rats, bats, and wolves; command other vampires (with limited exceptions); transform into a bat (normal or human size), wolf, or mist (partially or fully); and summon thunderstorms. Dracula does not cast reflections, and he usually cannot enter a house without being invited. His powers have sometimes been greatly amplified and his weaknesses circumvented by magical sources, such as spells of the Darkholders.", 
    "realname": "Vlad Tepes Dracula", 
    "significantissues": "Apocalypse vs. Dracula #1-4", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 220
}