{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "None", 
            "content": "Diablo immediately ordered Dragon Man to destroy his enemies, the Fantastic Four, starting with the Thing, who had witnessed his animation. The Dragon Man dutifully attacked Ben, and later, the rest of the Fantastic Four. He used his fire breath on the Human Torch, who absorbed it, but was forced to fly into the upper atmosphere to release the pent up heat before he melted everything around him. To save her brother, the Invisible Girl pinned his wings and the Dragon Man fell to the earth. She sensed that Dragon Man was not malicious, however, and tried to comfort him. He responded to her touch by reaching out to stroke her hair, but Diablo returned and gassed the three members of the Fantastic Four with a freezing potion.Along with his creator, Professor Gilbert, Dragon Man and Diablo faced the Fantastic Four minutes later at the edge of Dead Man’s Lake. But before Diablo could throw another freezing pellet at the four, Dragon Man lashed out with his tail and knocked the pellet out of Diablo’s hand, accidentally freezing the lake instead. Dragon Man then chased Diablo across the frozen lake until they fell through, into the bitter-cold waters. The Thing tried to follow but found that the lake had caves underneath that created a vicious undertow and they gave Diablo and the Dragon Man up as lost. But his creator stayed behind at State U to hold a vigil over the lake in case Dragon Man ever returned, so that he could undo the wrong that had been done in his creation.", 
            "durability": 1, 
            "education": "None", 
            "energy": 1, 
            "eyes": "Black\n", 
            "fighting": 1, 
            "firstappearance": "Fantastic Four #35\n", 
            "groupaffiliation": "Frequent servant to Diablo", 
            "hair": "None\n", 
            "id": "Dragon_Man", 
            "identity": "Publicly Known", 
            "intelligence": 1, 
            "knownrelatives": "Professor Gilbert (creator)", 
            "occupation": "None", 
            "origin": "Fantastic Four #35", 
            "placeofbirth": "A State University Lab", 
            "powers": "None", 
            "realname": "Dragon Man", 
            "significantissues": "Fantastic Four #35 (intro/creation)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}