{
    "aliases": "The Destroyer", 
    "citizenship": [
        "Honorary citizen of Titan", 
        "U.S.A.", 
        "legally deceased"
    ], 
    "content": "Years later, Drax was resurrected to once again battle Thanos (also recently resurrected). Drax's resurrection was not perfect, however; his brain remained damaged from his previous death. After Thanos was defeated a second time, Drax became a member of the Infinity Watch and guardian of the Power Gem.Adam Warlock, leader of the Watch, shut off Drax's hunger to kill Thanos when he had the Infinity Gauntlet. However Moondragon accidentally caused some of his memories to resurface, and returned to him his insane hunger to kill Thanos.Drax partially regained his intelligence when he and his daughter Moondragon petitioned Kronos, the being who had resurrected Arthur Douglas as Drax, to restore his mind and heal the severe injuries Moondragon had suffered. Moondragon gave up some of her mental prowess and Drax gave up some of his bulk to heal one another. The recovery took time, and Drax was for a while still dim-witted (but nowhere near as badly as he was before), undergoing tutoring by his daughter. Drax was taken to the Microverse where he was mistaken for the Hulk and helped the Microns overthrow the Psycho-Man and Fredd, an evil clone of Captain Marvel. Drax decided to remain there and help the Microns rebuild the Microverse's government.Drax battled the Champion for control of a planet that Champion had taken over. Drax lost the battle, but the Champion was later defeated by She-Hulk.Recently, as a detainee aboard a galactic prison transport, Drax crashed on Earth and escaped imprisonment, along with the other inmates. He regained his intelligence and fought the other inmates when they threatened the local townsfolk and the 10 year old girl named Cammi, who befriended him. Drax and Cammi were then taken to an intergalactic prison known as the KylnAfter an unknown amount of time the being known as Annihilus attacked Kyln. Having survived, Drax and Cammi team-up with Nova. During their time together Drax teaches Nova how to better harness the Nova Force and how to kill. Eventually Drax and Cammi join Nova's United Front and oppose Annihilus. During a crucial battle Drax is once more confronted by Thanos, who is trying to save Galactus. However, before Thanos could free Galactus, Drax managed to punch a hole through the Mad Titan's chest, killing him. Realizing his mistake he uses the power of the Silver Surfer to save Galactus. Once freed Galactus teleported both Drax and Moondragon to an undisclosed location. From there Drax vanished.Sometime after the war with Annihilus, the Phalanx managed to take over Kree Space and infect many worlds. Now trapped within Kree Space, Drax was hunted by a Phalanx infected Nova and Gamora. During the chase Nova was able to capture Drax and he was then infected with the techno-organic virus, becoming a Phalanx Select. Now working for the Phalanx he was recently given the assignment to hunt down and capture or kill Nova, who escaped from the Phalanx's grasp. Following Nova into a wormhole, Nova, Gamora, and Drax are now stranded in an unknown quadrant of space.After the events of the Annihilation Conquest, Drax agreed to join a group of cosmic heroes to form a proactive line of defense against potential treats to the Universe. The group was led by Jason of Spartoi’s son Peter Quill, also known as the Star-Lord. After many failed attempts of coming up with a name, Rocket Raccoon suggested that they take the name of Guardians of the Galaxy. The team used Knowhere as their base of operation. Knowhere is located inside the decapitated head of an unidentified Celestial that was floating on the very edge of the universe.", 
    "durability": 7, 
    "education": "High school graduate", 
    "energy": 2, 
    "eyes": "Red; (as Arthur Douglas) blue\n", 
    "fighting": 6, 
    "firstappearance": "Iron Man #55 (1973)\n", 
    "groupaffiliation": [
        "Guardians of the Galaxy: formerly the Phalanx", 
        "United Front", 
        "Microns", 
        "Infinity Watch", 
        "Legion of the Unliving"
    ], 
    "hair": "None; (as Arthur Douglas) brown\n", 
    "height": 76, 
    "id": "Drax_the_Destroyer", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Yvette Steckley Douglas (wife, deceased), Heather Douglas (Moondragon, daughter), Pamela Douglas (Sundragon, niece)", 
    "occupation": [
        "Agent of Kronos", 
        "former jazz musician and real estate agent"
    ], 
    "origin": "Captain Marvel #32 (1974)", 
    "placeofbirth": [
        "Burbank", 
        "California"
    ], 
    "powers": "Drax possesses a variety of super-human powers that utilize the cosmic energy bestowed upon his artificially created form by Kronos and Mentor, including superhuman strength and durability.\nThe Destroyer's body, while inhabited by Drax's spirit, is nearly invulnerable to all forms of physical injury. It is not known how great a force is necessary to injure him. His artificially created body could exist indefinitely in the vacuum of outer space, and he could survive for an unknown length without air, food, or water.\nDrax can fly by harnessing cosmic energy as a propulsion source. The maximum rate of speed that Drax could attain is not known, but he could make interplanetary journeys in a matter of weeks. It is unknown if he has retained this ability in his current form.\n\nDrax can also harness his cosmic energy and project it through his arms as concussive blasts. The maximum amount of force Drax can project is not known; he can, however, project enough energy to shatter large, ferrous meteors. It is unknown if he has retained this ability in his current form.", 
    "realname": "Arthur Sampson Douglas", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 4, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 680
}