{
    "aliases": [
        "Nu-Xandar", 
        "The Living Planet"
    ], 
    "citizenship": "Inapplicable", 
    "content": "Ego’s first plot involved an interstellar conquest, which only led him to a confrontation with Thor, the God of Thunder, and the Recorder. Fleeing Ego, the Rigellians attempted to colonize Earth. Opposed by Thor, they explained their dilemma to him. Thor journeyed into the Black Galaxy to meet Ego. Ego, fascinated to meet a being from outside his space, engaged Thor in battle so that it could test its \"anti-body\" creations. Thor ravaged Ego’s surface with severe storms that caused the massive entity to be stunned. After Ego was defeated, it abandoned its plans for interstellar attack and vowed not to leave the Black Galaxy.The next time Ego encountered the mighty Thor was during a battle with Galactus. Galactus had just recently consumed a world that had been home to the Wanderers, surviving members of an Archeopian extraterrestrial race. Thor decided that Galactus was the bigger threat and he took Ego’s side against the world devourer. In gratitude, Ego allowed its surface to become the new home of Wanderers.A portion of Ego’s mass was taken by the Rigellian colonizer Tana Nile who hoped  that it could transform other uninhabitable worlds into worlds where life could flourish. In an unforeseen event, the piece of Ego gained its own consciousness and called itself Ego-Prime. Ego-Prime eventually made its way to Earth, which it sought to transform to resemble itself. In combat with Thor, Ego-Prime's energies were stolen and used to empower three mortals that would become members of the Young Gods. The weakened Ego-Prime was taken prisoner by the Stranger, who stored it within his laboratory world.Driven insane by the removal of Tana Nile's sample, Ego devoured the Wanderers. Desperate for energy, Galactus again tried to devour Ego, but was outmatched and forced to flee. Recognizing the Ego had gone insane, Galactus dispatched his herald Firelord, Thor, and Hercules against Ego. To win the fight, Galactus attached a self-designed sidereal propulsion unit to the south pole of Ego, forcing the planet to be driven through space, away from the populated areas of the universe. However, Ego gained control over the thruster. Seeking revenge on Galactus, Ego traveled to Earth, but instead found opposition in the Fantastic Four. Mister Fantastic directed the Thing to sabotage Ego's sidereal propulsion unit, which Ego could not seem to remove from its body. Ego was broken apart by the gravitational pull of the sun when the engine failed.However, Ego's consciousness still existed in every remaining portion of itself. Ego gradually reformed itself and repaired the damage done to the propulsion unit. Ego expended much of its energy in doing so and had to bring its energy reserves back up. Disguising itself as an idyllic, paradise-like sphere, it lured a party of Dire Wraiths to establish a base on its surface. Ego then absorbed them into his being in order to replenish his energy. But, ROM landed on Ego, seeking fellow Space Knights trapped within the planet along with the Dire Wraiths, and battled the living planet. Rom saved his fellow Space Knights and sent the Dire Wraiths to Limbo before Ego could consume them.Ego then allied himself with the Elders of the Universe claiming to be one himself. He allowed the Elders to even meet on its surface to discuss their plans. However, Ego is not the sole survivor of a particular race that was dedicated to one specific pursuit, so he did not qualify for membership. Still, it joined in their plot against Galactus and battled the Silver Surfer, eventually capturing and attempting to absorb the power cosmic of the former herald. But, the Surfer seized control of the thruster and threatened to steer Ego into the sun, ensuring his release.Ego later encountered the Korbinite fleet, led by Beta Ray Bill, and attacked them, destroying several ships. When Ego revealed to Bill that it was being driven mad by Galactus' thruster, Bill had the fleet destroy the thruster. Ego offered to make itself the Korbinites' new home, but Bill refused, suspicious of Ego and knowing that the Korbinites would resent Ego for having killed some of them. Bill left Ego deserted.The enigmatic Celestials had transformed the Black Galaxy into a new member of their race, and this Celestial made contact with Ego. The High Evolutionary investigated this, and as Ego was being consumed by an immense \"Super-Ego\", speculated that Ego might be a single manifestation of a larger being, and that more than one Ego may exist. More Celestials came to examine Ego's dilemma, but how Ego escaped the Super-Ego is unknown.Ego began searching for worlds that he could \"wake up,\" so it would not be alone in the universe. If Ego could not wake a planet, it would deem it unworthy and destroy it regardless of the life forms that may have lived on the surface. Charles Xavier led a group of Skrulls to Ego in order to stop its actions, and with the assistance of the Silver Surfer, they almost succeeded in halting its insane plan. Xavier looked into the mind of Ego and found madness, which immediately told him that Ego could not be reasoned with. He decided that he would have to shut Ego's mind down, and as he began the process, a starship belonging to the alien race, the Ruul, intervened and shocked Ego into unconsciousness. This was going on at a time when an interplanetary council was deciding the fate of the Earth and ultimately declared it a prison planet for all alien criminals, including Ego.The Ruul somehow managed to manipulate Ego's mass into a human sized vessel, but once on Earth, Ego started to expand. The heroes of Earth knew they only had a small amount of time to get Ego off the planet before it absorbed everything into itself. During the course of an investigation, U.S.Agent discovered that the Ruul were actually evolved members of the Kree race and had manipulated the interplanetary council for their own purposes. They had placed power conduits all over the Earth, so that once Ego expanded fully (which they knew would happen) and absorbed the Earth, they would take control of Ego and use its massive power for universal conquest. The Ruul, along with Ronan the Accuser, freed the Supreme Intelligence from captivity so that they would have a leader once more. Unfortunately for the Ruul, their plans would fail as Reed Richards created a device that enabled Quasar to absorb Ego into himself. With Ego gone and the council now aware of how they were tricked, the decision to make Earth a prison planet was reversed and the Ruul were defeated. Quasar, not wanting to endanger the Earth in case Ego escaped, decided that he would go into exile.Recently, Ego was among the beings who assaulted Thanos while he possessed the Heart of the Infinite. How Ego escaped from within Quasar has not been chronicled.", 
    "durability": 7, 
    "education": "Inapplicable", 
    "energy": 7, 
    "eyes": "None\n", 
    "fighting": 2, 
    "firstappearance": "Thor #132 (1966)\n", 
    "groupaffiliation": "Unofficial member of the Elders of the Universe", 
    "hair": "None\n", 
    "height": 0, 
    "id": "Ego", 
    "identity": "Known", 
    "intelligence": 6, 
    "knownrelatives": "Ego-Prime (clonal scion)", 
    "occupation": "Inapplicable", 
    "origin": "(alleged) Fantastic Four #235 (1981)", 
    "placeofbirth": "The Black Galaxy", 
    "powers": "Ego is a planet sized entity that has immeasurable intelligence, and incalculable strength. Its stamina and durability are god-like, and it can fly through space at warp speed. Since Ego is essentially a \"living planet\", it has total control over its total mass down to the molecular level. It can shift its surface to appear as if it had a giant face, or grow enormous tentacles. It can make itself look like either a paradise, to lure unsuspecting travelers to their doom, or a barren world and can use its mass to create plant-like growths or humanoid bodies to carry it consciousness. Ego has an internal organ system that has giant tunnels, or arteries, a brain-like organ that is buried deep within its surface, and digestive organs to digest the living beings it absorbs into its body. Ego also has an immune system that will attack an entity that resists being absorbed.\nEgo has vast mental powers that allow it to tap into energy sources such as the stars or absorbing other living entities and use that power for itself. It also has extreme telepathic abilities that are effective over interstellar distances.", 
    "realname": "Ego", 
    "significantissues": [
        "Thor #132-133, Thor #161, Thor #227-228, Fantastic Four #234-235, Rom #69, Silver Surfer #4, Silver Surfer #22, Maximum Security: Dangerous Planet 1-shot, Maximum Security limited series #1-3, Became new HQ for the Nova Corps (Nova #20-21, 2009)", 
        "Expelled Nova Corps from its being and seeks revenge (Nova #29-30, 2009)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe"
}