{
    "add": {
        "doc": {
            "aliases": "Mistress of Paradise", 
            "citizenship": "Titan", 
            "content": "The Kree hero Captain Marvel came to Titan accompanied by Drax the Destroyer to oppose ISSAC. Elysius confronted them with her genetically engineered griffins. She commanded the griffins telepathically to do her bidding. They refused to follow her commands sensing Captain Marvel to be serene and honorable. She trusted her pets' instincts and became attracted to the warrior. Elysius helped Marvel and Drax purge Thanos' influence from ISAAC.When Marvel returned to his adopted home, Earth, Elysius accompanied him there. They soon became lovers. Marvel was soon diagnosed with cancer, Elysius stayed with him on Titan as he weakened and finally succumbed to the disease. Before his passing, he asked his friend Starfox to take care of Elysius. She knew that she could not constrain Starfox's lust for adventure. She chose to release him from his vow to Marvel sometime later.Grief stricken by her lover’s death, Elysius obtained Marvel's DNA code from ISAAC and it was used to impregnate her with a son. He would become known as Genis-Vell. Mentor felt that the son of Captain Marvel would be in danger from his fathers enemies. So he had ISAAC accelerate the child's growth into adolescence, and then implanted him with false memories of his childhood. This plan would enable Genis to defend himself from any would be attackers.Elysius raised Genis on the far flung planet of Paraxis. He believed Starfox to be his father. As he grew older he left Paraxis for fun and adventure. Elysius asked a Herald of Galactus, the Silver Surfer to retrieve him, and present him with a pair of Nega-Bands, like those worn by his father Marvel. Genis began to follow in his fathers heroic footsteps. He took on various names such as Legacy, Captain Marvel and Photon.Genis once accidentally exposed Elysius to an alien disease that began to kill her. He managed to save her life by aiding Thanos in a game against one of the Elders of the Universe known as the Grandmaster. Elysius was later slain by Syphonn, a conqueror from the Negative Zone. He animated the dead corps of Marvel to do his bidding. Genis aided the golden cosmic adventurer Adam Warlock and the ex-members of the Infinity Watch, in bringing Syphonn to defeat.Genis would soon be manipulated by the cosmic entities Entropy and Epiphany into helping them recreate the universe. Recreating the universe caused subtle alterations in the timeline. Genis was unaware of at first, that this action revived Elysius' life. Newly resurrected she created a daughter, Phyla-Vell, to follow in Genis' footsteps. Elysius used the same process that brought Genis to life, to create Phyla.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Captain Marvel #59 (1978)\n", 
            "groupaffiliation": "Eternals of Titan", 
            "hair": "Black\n", 
            "height": 68, 
            "id": "Elysius", 
            "identity": "The general populace of Earth is unaware of Elysius' existence.", 
            "intelligence": 1, 
            "knownrelatives": "Genis-Vell (Photon, son, deceased), Phyla-Vell (Quasar, daughter)", 
            "occupation": "Representative of Titan", 
            "origin": "Unrevealed", 
            "placeofbirth": [
                "Titan", 
                "moon of Saturn"
            ], 
            "powers": "None", 
            "realname": "Elysius", 
            "significantissues": [
                "Met Mar-Vell, fell in love with him, returned to Earth with him (Captain Marvel #59-62/Marvel Spotlight #1-3, 1978-1979)", 
                "witnessed Mar-Vell's death (Marvel Graphic Novel #1: The Death of Captain Marvel, 1982)", 
                "revealed to have created Genis, gave Genis his Nega-Bands (Silver Surfer Annual #6, 1993)", 
                "began to suffer effects of disease (Captain Marvel #5-6, 1996)", 
                "revealed how Genis saved her (Captain Marvel #14, 2001)", 
                "seemingly killed by Syphonn (Warlock #1, 1998)", 
                "revealed to be alive (Captain Marvel #32, 2002)", 
                "confronted Genis, revealed how he had restored her to life (Captain Marvel #15-18, 2003-2004)."
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 155
        }
    }
}