{
    "aliases": "Formerly White Queen", 
    "citizenship": "U.S.A.", 
    "content": "When it came time for their father to choose a worthy heir to the family fortune, Christian was automatically dismissed due to his drug problem.  Whilst the older sister Adrienne seemed the most obvious choice, the father chose Emma.  Surprisingly, she refused, choosing to make her own way through life.Emma ultimately inherited a good deal of wealth, but most of her large fortune resulted from her professional success. She ascended rapidly to the upper echelon of the business world on the strength of her intelligence, drive, and personal charm, as well as the secret use of her mental powers. Also, at some point, the Dark Beast met Emma, and helped her rise to wealth and power.Eventually, Emma became majority stockholder of a multi-billion dollar conglomerate principally involved in electronics and transportation - both the building of ships and aircraft, and their use for freight and passenger conveyance. Despite her relative youth, she was named chairwoman of the board and chief executive officer of the rechristened Frost International. She also became headmistress and chairwoman of the board of trustees of the Massachusetts Academy - a college preparatory school for students in grades seven through twelve located in the Berkshire Mountains in Snow Valley, Massachusetts.Frost quickly became an ally of Sebastian Shaw, a member of the club's Council of the Chosen who were secretly conspiring to achieve world domination through economic and political means. At the time, the leaders of the club and council - its foremost Lords Cardinal, whose titles corresponded to the names of chess pieces - were White King Edward Buckman and White Queen Paris Seville.Buckman threw the council's support behind Project: Armageddon, scientist Steven Lang's program to construct mutant-hunting Sentinel robots. Aware of Shaw's genetic disposition, Buckman told him the initiative's intent was to capture mutants as a means of helping the council attain power. Using her psionic powers, Emma learned that the project's actual purpose was the annihilation of all genetic deviants. After Shaw's lover, Lourdes Chantel, was murdered by one of the Sentinels, Shaw and Frost staged a coup that saw them seize control of the Council of the Chosen, which they renamed the Inner Circle. Shaw took the title of Black King, and Frost became the new White Queen.Under Shaw and Frost's leadership, mutants dominated the Inner Circle. To strengthen the Club's power base, Emma recruited genetically gifted youngsters and helped them hone their abilities at her school. Most of these students were members of the Hellions, Emma's first mutant super-team. She initially encountered the outlaw band of heroic mutant adventurers known as the X-Men when she unsuccessfully attempted to recruit young Kitty Pryde, the phase-shifting mutant then known as Shadowcat. Subsequently, Emma crossed paths with the X-Men - and their protégés, the New Mutants - on a number of occasions, often as their adversary. Later, the X-Men joined with the Hellions to protect the White Queen from the time-traveling terrorist named Trevor Fitzroy. However, the madman's brutal assault plunged Emma into a deep coma and brought about the Hellions' untimely demise.Whilst Emma's consciousness still active on the material plane, her body was kept in the med-lab at the X-Men's mansion. Seeking to ensure her students' welfare and the school's future, Emma had willed responsibility for the Massachusetts Academy to Professor Charles Xavier, the X-Men's telepathic founder. During her psychic incapacitation, the school was added to the rapidly expanding Xavier Institute. While Emma’s corporeal form was in stasis, a short-circuit in the mansion inadvertently caused her psyche to possess the X-Man named Iceman, whilst his mind was transferred into her body.Coerced by Professor X, Emma eventually reclaimed her own form. After making a full recovery, she resumed her role as headmistress of the academy. Ably assisted by Sean Cassidy, the sonically empowered former X-Man known as Banshee, she set out to train a new crop of young mutants: Generation X. When the sinking stock market dealt Frost International a major blow, Emma swallowed her pride and sought the help of her older sister, Adrienne, who agreed to support her sibling's flagging financial interests only if she were named co-headmaster. But Adrienne's power play did not wind down when Emma acceded to her request, nor did it end when she supplanted her sister as the Hellfire Club's White Queen. Only after Adrienne telepathically incited a riot at the school did Emma find a way to upset her ascension: the way of the gun. Emma shot and killed her sister, thereby laying claim to Adrienne's inheritance.Emma later counseled her teammate Cyclops following his possession by the eternal mutant warlord Apocalypse.  This soon turned into a telepathic affair between the two which was short-lived after Summers' wife, Jean Grey, discovered what was happening.During the riot at the Xavier Institute, Sophie of the telepathic sisters the Stepford Cuckoos died. The remaining sisters blamed Emma for this and told Jean Grey-Summers of Emma's affair with her husband. When Emma was confronted by Jean, she was forced to relive various moments of her past. Following this confrontation, Emma was shot with a diamond bullet whilst in her diamond form, shattering it. Though she was believed to be dead at first, Emma's consciousness was trapped in her shattered remains. Phoenix discovered this and telekinetically fused Emma's body back together. Upon being reassembled, Emma identified Esme of the Cuckoos as the culprit behind her assassination. However, Esme was working with the X-Man Xorn, who believed himself to be Magneto at the time, and it was he who shot Emma as she had learned of his dual identity.", 
    "durability": 7, 
    "education": "College degree in business administration, qualified sex therapist", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 6, 
    "firstappearance": "X-Men #129 (1979)\n", 
    "groupaffiliation": [
        "X-Men", 
        "formerly X-Men (Osborn's team)", 
        "Generation X (headmistress)", 
        "Hellions (mentor)", 
        "Hellfire Club (White Queen)"
    ], 
    "hair": "Brown (dyed ash blonde)\n", 
    "height": 70, 
    "id": "Emma_Frost", 
    "identity": [
        "Frost is known to have been a leader of the Hellfire Club", 
        "but her past criminal activities are not public knowledge"
    ], 
    "intelligence": 7, 
    "knownrelatives": "Winston Frost (father), Hazel Frost (mother), Cordelia Frost (sister), Adrienne Frost (sister, deceased), Christian Frost (brother), Steven (full name unrevealed, brother-in-law, deceased), Jocasta (cousin), Stepford Cuckoos (daughters)", 
    "occupation": [
        "Co-headmaster of Xavier Institute for Higher Learning", 
        "adventurer", 
        "Chairman of the Board and CEO of Frost International", 
        "former Chairman of the Board of Trustees and headmistress of Massachusetts Academy"
    ], 
    "origin": [
        "Generation X #-1 (1997)", 
        "New X-Men #139 (2003)", 
        "Emma Frost #1-18 (2003-2004)"
    ], 
    "placeofbirth": [
        "Boston", 
        "Massachusetts"
    ], 
    "powers": "Emma Frost is a mutant who possesses various telepathic talents.  Emma can read minds and project her thoughts into the minds of others, project psionic force bolts which have no physical effects but which can affect a victim's mind so as to cause the victim pain or unconsciousness, and can also induce mental pain merely by touching the brow of her victim. Emma can telepathically \"sedate\" her victims so that, if already rendered unconscious, they remain so for as long as she continues to \"sedate\" them. It is unknown how effective her \"sedating\" ability is on victims who are awake.\nFurthermore, as a consequence of continued mutation, Emma can now transform her skin and hair into a diamond-hard form at will.  In this form, Emma is nigh indestructible except for one small flaw that, if exploited, can cause her to shatter.  Whilst in her diamond form, Emma's telepathic abilities are suppressed.", 
    "realname": "Emma Grace Frost", 
    "significantissues": [
        "Aided Shaw in takeover of Hellfire Club (Classic X-Men #7, 1987)", 
        "first clashed with X-Men (X-Men #129, 1979)", 
        "death of Hellions (Uncanny X-Men #281, 1991)", 
        "became headmistress of Generation X (Uncanny X-Men #318/Generation X #1, 1994)", 
        "killed sister Adrienne (Generation X #70, 2000)", 
        "secondary mutation triggered, joined X-Men (New X-Men #116, 2001)", 
        "attempted seduction of Cyclops (New X-Men 2001 Annual, 2001)", 
        "began mentoring Stepford Cuckoos (New X-Men #123, 2002)", 
        "began psychic affair with Cyclops (New X-Men #128, 2002)", 
        "diamond form shattered, restored by Phoenix (New X-Men #139-141, 2003)", 
        "became co-headmaster of Xavier's (Astonishing X-Men #1, 2004)"
    ], 
    "speed": 4, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 144
}