{
    "aliases": "None", 
    "citizenship": "Inapplicable", 
    "content": "She targeted the women of the Lady Liberators and the female members of the Guardians of the Galaxy. Unum's battle against the She-Hulk and Jazinda was interrupted by the Elder of the Universe known as the Collector. Unbeknownst to both groups of women the Collector has whisked them to safety hoping that their collective powers would defeat the pawn of Enmity. However, without a true battle plan the women basically just fell over each other making their defeat inevitable. Had it not been for the quick thinking of the Celestial Madonna, Mantis, who led Gamora and She-Hulk in an attack that ended with Quasar impaling all the combatants. Mantis quickly entered the mind of Unum and She-Hulk was able to convince her that Enmity was using just as the others did, only she was doing for giggles and grins, which caused Unum to betray her creator, by impaling Enmity with her weapon.  An enraged Enmity responded by apparently destroying Unum and teleporting away from the scene.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "(Mentioned) Captain Marvel #25 (2004); (seen) She-Hulk Cosmic Collision #1 (2009)\n", 
    "groupaffiliation": "The Seven Friendless", 
    "hair": "Red\n", 
    "height": 61, 
    "id": "Enmity", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Eternity (father), Entropy, Epiphany, Expediency, Empathy, Eulogy (all siblings)", 
    "occupation": [
        "Abstract entity", 
        "personification of animosity"
    ], 
    "origin": "Unrevealed", 
    "placeofbirth": "Unrevealed", 
    "powers": "Enmity possesses vast cosmic powers; she can teleport, survive unaided in the vacuum of space, and recover from apparently grievous physical injury: She once merged a group of powerful beings into one supremely formidable gestalt entity.", 
    "realname": "Enmity", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 84
}