{
    "aliases": "None", 
    "citizenship": "Eon originally dwelled within a pocket dimension adjacent to Earth's universe from which it could observe this universe.", 
    "content": "Eon considered himself to be a \"cosmic custodian\" that monitored life throughout the universe. Beings who had an abundance of power particularly attracted Eon' attention. Eon is believed to be responsible for certain phenomena on Earth, which lies along the Celestial Axis. Eon also apparently had something to do with certain other dimensions in which beings of godlike power dwell. (In many of these dimensions the Celestial Axis manifested itself as a physical object. In Asgard the Celestial Axis manifested as Yggdrasil the World Tree). Eon's principal function was to nurture the evolution of the sentient life forms of the universe and to maintain conditions conducive to life within the universe.Eon regarded Earth and its human denizens as having particular importance to the history of the universe. Eon believed that due to the constant emergence of superbeings on Earth that humans were going to become a \"superhuman\" race which would lead the universe into a golden age.One of Eon's primary functions was to appoint a \"Protector of the Universe\" who's job it was to ensure that conditions in the universe remained conducive to life in the universe. Since almost the beginning of the present universe, Eon had anticipated major threats to life in the universe and had chosen his champions to defend the universe against these threats. It is unknown how frequently Eon appointed his protectors, but he had appointed thousands of them throughout history some of whom achieved their destinies and some of whom failed. One of his protectors was a member of the Elan alien race. All but one of these champions wore devices called the Quantum Bands that Eon created that enable them to manipulate energy at will. Eon has also bestowed other powers upon the champions he has chosen. The first champion he appointed was Glakandar, whom he drafted over five billion years ago.In recent recorded history Eon selected Captain Marvel (Mar-Vell) of the Kree as his protector of the universe. Mar-Vell who had distinguished himself both in the Kree military and as a defender of Earth was appointed protector to combat the menace of Thanos, one of the Eternals of Titan who sought to destroy the universe. Mar-Vell led several of Earth's champions against Thanos who was ultimately defeated by them. Eon granted Mar-Vell \"Cosmic Awareness\" to aid him in his crusade against Thanos. Mar-Vell was one of the Protectors of the Universe who did not wear the Quantum Bands, which had then fallen into the possession of the costumed crusader known as Marvel Boy.", 
    "durability": 1, 
    "education": "Eon had observed a wide range of events since the beginning of this universe and had learned many things based on these observations.", 
    "energy": 1, 
    "eyes": "His eye was red\n", 
    "fighting": 1, 
    "groupaffiliation": "None", 
    "hair": "What appeared to be his \"hair\" was brown\n", 
    "height": 0, 
    "id": "Eon", 
    "identity": "Cosmic Entity whose existence was unknown to the majority of the populace of Earth", 
    "intelligence": 1, 
    "knownrelatives": "Epoch (offspring)", 
    "occupation": "(At Time of Death) Cosmic Custodian", 
    "powers": "He possessed the ability to shift into this universe whenever he so chose, and he finally shifted the access aperture into his dimension so that it was located behind the bookshelf in Wendell Vaughn's office in Four Freedom's Plaza. Eon also possessed the ability to grant \"cosmic awareness\" and other unspecified powers to his champions. He could also utilize cosmic energy to fire blasts and to fly.", 
    "realname": "Eon", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}