{
    "aliases": "Unrevealed", 
    "citizenship": "Unrevealed", 
    "content": "After Captain Marvel along with Entropy destroyed Eternity, who is the embodiment of all space and time. Epiphany was among the four remaining survivors of the universe. Realizing that he had now fulfilled his mission Entropy became dissatisfied. Genis encouraged him to create something, instead of destroying everything, having knowledge of nothing other than Eternity. Entropy became Eternity and restored all reality.Epiphany accompanied Genis to Titan, where he sought to see his resurrected mother Elysius, and other Titans. Epiphany and Marvel discovered that the other Titans had made themselves intangible and unnoticeable to avoid Genis. Epiphany repeatedly encouraged Genis, by telling him that the Titans were present but they were afraid of him. Rick Jones who was unable to see Epiphany told Genis that there was nobody there, and he had been talking to thin air. Rick believed that Epiphany was only in his head and Genis was going crazy. Epiphany repeatedly assured Genis that she was real. This insanity was believed to be the effects of Genis' powers fully manifesting themselves. While on Titan it was revealed that Elysius was indeed alive and she had conceived another child via Mar-Vell's genetic material: the child would come to be known as Phyla-Vel.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "Captain Marvel #3 (2002)\n", 
    "groupaffiliation": "The Seven Friendless", 
    "hair": "Red\n", 
    "id": "Epiphany", 
    "identity": "Unknown to the general inhabitants of the Universe", 
    "intelligence": 1, 
    "knownrelatives": "Eternity (father), Empathy, Enmity, Entropy, Eulogy, Expediency,  (all siblings)", 
    "occupation": "Unrevealed", 
    "origin": "Unrevealed", 
    "placeofbirth": "Unrevealed", 
    "powers": "It is believed that Epiphany possesses cosmic on a scale that is incalculably due her being the offspring of Eternity. She has the ability to teleport throughout space and can survive in the cold vacuum of space without life-support.", 
    "realname": "Unrevealed, possibly Epiphany", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}