{
    "aliases": [
        "Sai Anand", 
        "Socrates Carvopolis", 
        "Entropy", 
        "Ivan", 
        "Adam Qadmon", 
        "Shakti"
    ], 
    "citizenship": "Inapplicable", 
    "content": "The origin and precise nature of the abstract being known as Eternity are unknown and unknowable. It is the sum total of collective consciousness of all living things in the universe, the embodiment of their life as Death is the embodiment of the ending of that life.Unlike Death, which Eternity refers to as it's sibling, Eternity does not often take an active hand in the dealings of the trillions of lives that make up it's total. However, since controlling the being Eternity allows the controller to wield Eternity's unlimited Powers over the beings that make it up, this entity is a target for extra-dimensional attackers of various abilities. Usually Eternity can deflect such attacks without significant exertion, but on occasion has had to bring it's own servants into play. While not as organized as the \"death-gods\" that serve Death, these servants are usually powerful individuals, such as Doctor Strange, who may combat the attackers on their own mortal levels. These servants have a vested interest in seeing Eternity survive intact, as Eternity makes their very existence possible.Such was the case when the powerful extra-dimensional being known as Nightmare attempted to seize Eternity from the inside, using all sleeping sentient beings (usually one-third of the total lifeforms in the universe and therefore a powerful minority of Eternity) to drive Eternity to sleep, thereby putting Eternity under Nightmare's control. In this state, Eternity was induced to dream planet Earth's obliteration. Doctor Strange, who possessed the Gift of Extended Life, did not die, and journeyed to Nightmare's realm, there to free Eternity and persuade him to recreate Earth. As Eternity is the sum total of all living forces, destruction of Eternity may eradicate the universe, and with it all other quasi-physical entities. Death and Eternity exist as partners, not competitors, and Death has never shown and \"rivalry\" (at least until the Infinity Gauntlet, one such event that comes to mind) against it's \"sibling\". Eternity, for its part, has rarely shown any interest in the pieces that make it up, though if given sufficient threat (on the level of the Beyonder, for example) would willingly sacrifice part of its infinite existence (and the planets, stars, and lifeforms that make up that existence) to foil such a foe.", 
    "durability": 7, 
    "education": "Inapplicable", 
    "energy": 7, 
    "eyes": "Black with stars\n", 
    "fighting": 7, 
    "firstappearance": "Strange Tales #138 (1965)\n", 
    "groupaffiliation": "The Friendless", 
    "hair": "None\n", 
    "height": 0, 
    "id": "Eternity", 
    "identity": [
        "Inapplicable", 
        "the general populace of Earth is unaware of Eternity's existence"
    ], 
    "intelligence": 7, 
    "knownrelatives": "Inapplicable; has referred to Infinity as his mate; has referred to Death, Oblivion, Galactus, Empathy, Eulogy, Expediency, Entropy, Epiphany and Enmity as offspring", 
    "occupation": [
        "Abstract entity", 
        "personification of sum total of all that exist along the temporal axis"
    ], 
    "origin": "unrevealed", 
    "placeofbirth": "Inapplicable", 
    "powers": "Eternity is the embodiment of time, and possesses within itself near-omnipotent cosmic powers. Eternity's utilizes Dimension of Manifestations to great M-Body (Manifestation Body) when interacting with physical begins. When merged with Infinity, Eternity possesses the combined power of the entire space/time continuum.", 
    "realname": "Inapplicable", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe"
}