{
    "aliases": "Champion of the Universe", 
    "citizenship": "Extraterrestrial", 
    "content": "The Champion subsequently conspired with fellow Elders Astronomer, Collector, Contemplator (actually a Skrull imposter), Gardener, Grandmaster, Obliterator, Possessor, Runner, Trader and their ally Ego to vanquish the few beings older than them. The Elders claimed that their ultimate goal was to obliterate the entire universe, with themselves re-emerging in the new universe that would follow as the oldest beings in creation, each possessing as much power in that universe as Galactus currently did in theirs.. The Champion traveled to Earth to defeat the Silver Surfer, whom the elders saw as a threat, but the Surfer beat Champion by using the power cosmic instead of hand-to-hand combat. The Champion then claimed that he had come only to prevent the Surfer from interfering in a Skrull attempt at cosmic domination-the Skrulls had captured Galactus' then herald Nova (Frankie Raye) and were using her to blackmail Galactus into devouring worlds of their choice; access to this information allowed the Surfer to deduce a method to free himself from his imprisonment on Earth. Retrieved by his fellow Elders after this defeat, the Champion observed as the Grandmaster manipulated Earth's Avengers as part of a wager with Death, winning Death's permanent refusal of all the Elders into its realm as his prize. Champion then battled Mantis and the Surfer when they learned of and opposed the Elder's plans.The Champion soon traveled to Grinx and defeated the planet's ablest combatants, claiming as his prize their world-trophy, an Infinity Gem. The other Elders gathered the remaining Infinity Gems and created a solar system spanning Infinity matrix which allowed them to draw out the energy of its sun and six planets and use that to drain Galactus's life force. The Surfer and Nova interfered by exploding the system's sun, disrupting the Elder's scheme, and Galactus consumed Champion, Collector, Gardener, Grandmaster, and Runner. Unable to die, the Elders survived inside Galactus, weakening him from within. When the Astronomer, Trader and Possessor allied with the In-Betweener to attempt to retrieve the five trapped Elders, the foursome attacked and defeated Galactus. Wanting Galactus dead (as part of a struggle against his own superiors, Master Order and Lord Chaos), the In-Betweener betrayed the three free Elders, confining them to Oblivion (disguised as Death by the In-Betweener). However, the Silver Surfer, Nova, Mr. Fantastic, and the Invisible Woman opposed the In-Betweener, saved Galactus. And inadvertently allowed the Elders trapped within Galactus, including Champion, to escape. Now free, the Elders each claimed an Infinity Gem, with the Champion taking the Infinity Gem of Power. They observed the battle which ensued between the In-Betweener and Galactus, intervening to see the In-Betweener banished back to the care of his masters as punishment in his role in condemning their three fellow Elders. When Galactus proved victorious, the Elders fled before the specter of his anger after their earlier attempt to kill him.Believing the Gem to be dormant and not wanting to attract the notice of Galactus, Death or Eternity, the Champion returned to his competitions. The Mad Titan Thanos found Slatterus on Tamarata, where the suddenly bloodthirsty Champion was engaging in mass battles instead of one-on-one fights, leaving many opponents dead on the field. Thanos tricked Slatterus into destroying the planet, and then offered to teleport the marooned Champion to another world in exchange for the \"dormant\" Power Gem, a bargain he gladly accepted. Quickly conquering the simple dwellers on this new planet, the Champion obtained the foremost mystical artifacts of that world (wristlets which were apparently adaptations of the Quantum Bands), and then exterminated the planet's population before departing in search of both the Power Gem and revenge against its \"thief\". Champion eventually located the mad Titan, but when Thanos dismissively teleported Slatterus to a lifeless world, the Champion destroyed it in anger. Through the machinations of Mephisto (who was manipulating the Silver Surfer), the Champion soon learned that Thanos no longer held the Power Gem, and it was now in the hands of Drax the Destroyer. Slatterus attempted to head for Earth to find Drax but was opposed by the Surfer; Mephisto transported Drax to the field of battle and the Champion was defeated by the Silver Surfer and the Gem-powered Drax. The Surfer claimed and then destroyed the Champion's wristlets once he was defeated.The Power Gem passed through a number of hands (and universes) before the Champion finally recovered it and resumed his practice of seeking opponents. He settled in on planet Skardon, a planet where leadership was determined in hand-to-hand combat, and quickly became the planet's ruler. He then began running the planet into the ground, spreading word that he'd make the Skard suffer until a worthy challenger to his rule arose. Adam Warlock, who had experienced psychological difficulties himself while wielding the vampiric Soul Gem (another of the Infinity Gems), learned of the Champion's instability and used his Soul Gem to defeat Champion, but Skardon law did not allow them to acknowledge the out-of-ring defeat.While the Skardons aided the Champion in restoring himself after the defeat. Warlock sought opponents to defeat him within the ring. The Champion defeated the Shi'ar Gladiator, the Silver Surfer, Beta Ray Bill, Drax the Destroyer, and Adam Warlock himself before the Magistrati (agents of the Living Tribunal's universal law) sent a court-appointed advocate, the She-Hulk, to Skardon to oppose Champion at the request of Warlock's companion, Pip the Troll. Skardon law required Champion to accept even the challenge of a \"lesser\" female, and She-Hulk was losing badly to Champion when she asked for an appeal and was granted an extension. She trained for three months on the theory that her human form of Jennifer Walters was weak, and by increasing her human strength, she'd exponentially increase her strength as She-Hulk. She then returned and objected to the Champion's use of the Power Gem, an alien object which should not be permissible within the ring according to Skardon law. The Champion, already irritated over the lengthy delay, angrily conceded the point and fought She-Hulk without it, and the pair even extended a bitter wager: if the Champion lost, he'd never wear the Gem again, and if the She-Hulk lost, she'd bear the Champion children for him to raise as future combatants. However, the Champion had apparently become dependent upon the Gem; that the She-Hulk's newly acquired bulk led to a quick defeat for the former Champion, reputedly his first ever defeat within the ring. He took the name \"Fallen One\" and chose to provide the new \"Champion of the Universe\" with worthy competition (and perhaps a little punishment as well).", 
    "durability": 7, 
    "education": "Unrevealed", 
    "energy": 3, 
    "eyes": "Silver\n", 
    "fighting": 7, 
    "firstappearance": "Marvel Two-in-One Annual #7 (1982)\n", 
    "groupaffiliation": "Elders of the Universe", 
    "hair": "Red\n", 
    "height": 110, 
    "id": "Fallen_One_(Tryco_Slatterus)", 
    "identity": "His true nature is disbelieved by the general public", 
    "intelligence": 3, 
    "knownrelatives": "All of the bipeds in the Thudrax, Baccan and Velabian star systems are reputed to be his offspring", 
    "occupation": "Competitor", 
    "origin": "Unrevealed", 
    "placeofbirth": [
        "The Ancrindo Nebula", 
        "in the direction of the Magellanic Clouds"
    ], 
    "powers": "Tryco possesses the 'Power Primordial' like the other Elders, but he seems to have focused solely on his physical attributes. He is very strong (he has destroyed a planet with a single punch) and invulnerable. His abilities were further augmented by the Power Gem. Death has cursed Tryco as well as the other Elders with immortality.", 
    "realname": "Tryco Slatterus", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 5, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 2
}