{
    "add": {
        "doc": {
            "aliases": "None Known", 
            "citizenship": "Unrevealed", 
            "content": "During a battle between the Maker and Thanos of Titan on the prison planet of Kyln, the power was shut down to many portions of the Kyln. Without power flowing into his containment unit, the Fallen One escaped the Kyln and again sought vengeance on Galactus. As the Fallen One confronted Galactus, Thanos mentally tried to reason with him, reminding him of Galactus' special purpose in the universe. The Fallen One justified himself, saying that Galactus knew his true nature when he made him into what he had become, and still he was casted out. Galactus decides to simultaneously alleviate his own problems and spite Thanos, teleporting the Fallen One to Thanos' ship. The Fallen One's powerful energy attack devastated Thanos' giant ship, sending him plummeting to the surface of the planet below. Surviving unscathed, Thanos and his new ally Skreet overpowered the Fallen One, sending him into the core of the gas giant and ignited it. Thanos mentally enslaved the Fallen One's unconscious form, so that when he awoke he would serve as Thanos' own herald, as well as provide him with information as to a source of unlimited energy.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Black\n", 
            "fighting": 1, 
            "firstappearance": "Thanos #11 (2004)\n", 
            "groupaffiliation": "None", 
            "hair": "Dark blue\n", 
            "id": "Fallen_One_(unrevealed)", 
            "identity": "Unknown to the general populace of Earth", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": [
                "Formerly Herald of Galactus", 
                "and Thanos"
            ], 
            "origin": "The origin of the Fallen One is revealed (Thanos #12 (2004)", 
            "placeofbirth": "Unrevealed", 
            "powers": "The Fallen One, has cosmic powers befitting those of all of Galactus' Heralds. The Fallen One uses Black Matter as his power base (The \"binding halo by which galaxies are made solvent,\" and therefore has a nearly inexhaustible power source.), which sets him apart from the other Heralds. He is also naturally violent and dangerously insane, deriving great joy in making others suffer.", 
            "realname": "Unrevealed", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}