{
    "add": {
        "doc": {
            "aliases": [
                "Maker", 
                "Cheyenne"
            ], 
            "citizenship": "U.S.A.", 
            "content": "Turning his back on his mystic side, Forge concentrated on a career as an inventor and was commissioned by the Department of Defense to create weaponry. His many inventions include a device for neutralizing superhuman abilities, necessitated by the presence of the alien Dire Wraiths that were invading Earth at the time. Instead, however, Henry Gyrich and Valerie Cooper hoped to use the weapon against mutants and decided to test the prototype against Rogue, who framed for murder at the time. Although Rogue was saved by her teammate Storm, Storm was accidentally hit and stripped of her powers. Storm fell into a river and was rescued by Forge. Feeling guilty for her loss of powers, Forge brought Storm to his headquarters in Dallas, Texas and nursed her back to health. The two developed a romantic relationship until Storm learned of Forge's role in the loss of her powers, and she left, furious at him. However, Storm did return with other X-Men and associates to save Forge's life from the Dire Wraiths.Forge was able to improve his device to neutralize the Dire Wraiths, and joined with the Dire Wraith's ultimate foe, the Spaceknight Rom, to stop the Wraiths in Dallas and to send a gigantic \"neo-neutralizer\" to their home planet, casting all Dire Wraiths to an extradimensional limbo. Forge destroyed all neutralizing technology to avoid it falling into the hands of Gyrich and the American government.Some time later, Storm returned to Forge to find a way to get her powers back. She was tricked by the demon known as the Adversary (who had taken the form of Naze) into attempting to kill Forge, effectively stopping him from closing a similar demonic portal to the one he had opened before. Forge and Storm found themselves shunted to another dimension with an accelerated time structure. There, they rekindled their romance and Forge eventually restored Storm's powers. They both returned to Earth in time to help the rest of the X-Men stop Adversary and the demonic forces. To do so, he was forced to utilize the souls of the X-Men, even though the heroes were restored to life soon after. Forge left to go into seclusion believing he had killed the X-Men.Some time later, Forge saw Storm in a vision and realized that the X-Men must not be dead. Realizing the vision was somehow connected to the villain Shadow King, he elicited the help of Mystique’s Freedom Force who were working for the American government. Together, they left for the research facility Muir Island which was in the process of being taken over by the Shadow King. Their arrival coincided with the villains called the Reavers. They saved the island from the Reavers with help from mutants living on Muir Island, but Forge was unable to save Freedom Force member Destiny, who Mystique had placed under his protection.After the battle, Forge convinced former X-Man Banshee that the X-Men were alive, and the two set off to find them. They succeeded in reuniting several mutants, including Storm, and began to repair the remains of their former mansion headquarters in Westchester. However, they were all captured by agents of the country Genosha, working on behalf of Cameron Hodge. Forge battled alongside the X-Men in Genosha to escape, then in the Shi'ar Galaxy to rescue the X-Men's mentor, Professor X, and finally at Muir Island to rid its inhabitants from the Shadow King once and for all.Forge returned with the X-Men to completely restore their mansion to their previous level of technology. Forge proposed to Storm, but when she would not leave the X-Men for him, he retracted his offer. He returned to Dallas with Mystique, taking it upon himself (and fulfilling Destiny's dying prophecy) to rehabilitate her as she was suffering from psychological damage after having been possessed by the Shadow King. Forge and Mystique were attacked by the time-hopping mutant Fitzroy and were rescued by the X-Men. Mystique left Forge soon afterward, claiming her sufferings were a ruse to enable her to steal sensitive information from Forge's computers.Forge was then contacted by Valerie Cooper to become the government liaison to a new version of the mutant team X-Factor, modeled after the defunct government-sanctioned Freedom Force. Forge soon became an active member of the team, participating on many missions and supplying the team with its technology. During this time, he was reunited with Mystique and also fixed a holographic module that contained the mutant law enforcer from the future, Shard. When team leader Havok was MIA, Forge took his place. He later reclaimed his mystical heritage in another confrontation with the Adversary, defeating him by using both his technological and his magical abilities.Later still, Forge divorced X-Factor from government sanction in order to take the team underground. Soon after, however, the team was nearly destroyed by the rampaging of its member Sabretooth, and Forge quit the team, returning leadership to Havok.After a time, Forge was contacted by Professor X to infiltrate Genosha with Jamie Madrox, the Multiple Man, since Magneto had seized control over the country. In reality, Magneto's acolyte Exodus was posing as Magneto, and he captured Forge to force him to enhance his psionic powers. The X-Men rescued Forge, and he returned to his clandestine mission observing Genosha. With the apparent demise of Magneto and the freedom of Genosha, Forge returned to the X-Men where he acted as a member of the team's support crew.", 
            "durability": 2, 
            "education": "Unrevealed; presumably completed doctorate", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 4, 
            "firstappearance": "Uncanny X-Men #184 (1984)\n", 
            "groupaffiliation": [
                "Formerly X-Men", 
                "X-Factor (leader)", 
                "U.S. Army/\"Marauders\""
            ], 
            "hair": "Black\n", 
            "height": 72, 
            "id": "Forge", 
            "identity": "Known to authorities", 
            "intelligence": 4, 
            "knownrelatives": "None", 
            "occupation": [
                "Inventor", 
                "adventurer", 
                "former government operative", 
                "soldier", 
                "shaman"
            ], 
            "origin": [
                "Uncanny X-Men #262-263 (1990)", 
                "X-Factor #114-115 (1995)"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "Forge can intuitively create almost any device imaginable using his mutant ability - an uncanny and almost empathic ability to understand machines and to perceive \"mechanical energy.\" He has created fantastic futuristic devices including cybernetic systems (to replace his lost hand and leg), sophisticated holograms, and elaborate computer and fiber-optic systems.", 
            "realname": "Unrevealed", 
            "significantissues": [
                "Misused shaman magic during war (Uncanny X-Men #227, 1988)", 
                "revealed to have helped design S.H.I.E.L.D.'s original Helicarrier (Fury #1, 1994)", 
                "invented Neutralizer, attempted to prevent Neutralizer being used on Rogue, cared for Storm after her powers removed by Neutralizer (Uncanny X-Men #184-186, 1984)", 
                "with Storm & others, vs Dire Wraiths (Uncanny X-Men #187-188, 1984)", 
                "allied with Rom vs Dire Wraiths (Rom #62, 1985)", 
                "oversaw construction of orbital Neo-Neutralizer (Rom #63-64, 1985)", 
                "confronted by Storm, sent to alternate Earth (Uncanny X-Men #224, 1987)", 
                "restored Storm's powers, returned home (Uncanny X-Men #226, 1988)", 
                "with X-Men, vs Adversary, used X-Men's souls to trap Adversary, X-Men restored to life by Roma (Uncanny X-Men #227, 1988)", 
                "confronted by Magik over Colossus' supposed death (New Mutants #65-66, 1988)", 
                "encountered Amahl Farouk, began search for X-Men (Uncanny X-Men #253, 1989)", 
                "briefly joined Muir Island X-Men vs Reavers, joined Banshee in search for missing X-Men (Uncanny X-Men #254-255/X-Men Forever #2, 1989/2001)", 
                "designed new defense system for Muir Isle (Uncanny X-Men #257-258, 1990)", 
                "aided Alpha Flight in rescuing James Hudson (Alpha Flight #88-90, 1990)", 
                "with Banshee & Jean Grey, vs Morlocks (Uncanny X-Men #261-263, 1990)", 
                "with Charlotte Jones, vs Genoshan Magistrates (Uncanny X-Men #264, 1990)", 
                "with Banshee, helped X-Factor free Archangel from Ravens' control (X-Factor #57-58, 1990)", 
                "with Banshee, Fantastic Four, X-Factor, New Mutants, Storm & Gambit, vs Ahab (Fantastic Four Annual #23/X-Factor Annual #5/X-Men Annual #14, 1990)", 
                "with X-Men, X-Factor & New Mutants, vs Genoshan Magistrates & Cameron Hodge (Uncanny X-Men #270/New Mutants #95/X-Factor #60/New Mutants #96/X-Factor #61/Uncanny X-Men #272/New Mutants #97/X-Factor #62, 1990-1991)", 
                "with X-Men & Lila Cheney, vs Warskrulls (Uncanny X-Men #273-277, 1991)", 
                "with X-Men & X-Factor, vs Shadow King (Uncanny X-Men #279/X-Factor #69/Uncanny X-Men #270/X-Factor #70, 1991)", 
                "captured by Mechadoom, freed by Deathlok, X-Men & others (Deathlok #2 & 5, 1991)", 
                "upgraded Xavier's School's technology, designed & built new Blackbird jet (X-Men #1, 1991)", 
                "with Storm's team, opposed Cyclops' team & Magneto's Acolytes (X-Men #3, 1991)", 
                "helped rescue Jean Grey from Fitzroy (Uncanny X-Men #282-283, 1991)", 
                "first met Bishop, learned of alternate future identity (X-Men #8, 1992)", 
                "with other heroes, opposed Magus & doppelgangers (Infinity War #1-4 & 6, 1992)", 
                "proposed to Storm, left to treat Mystique (Uncanny X-Men #289-290, 1992)", 
                "investigated crashed Asteroid M (Uncanny X-Men #299, 1993)", 
                "helped X-Men locate Acolytes (Uncanny X-Men #300, 1993)", 
                "with Mystique, opposed Fitzroy (Uncanny X-Men #301-302, 1993)", 
                "became X-Factor's government liaison (X-Factor #93-94, 1993)", 
                "reconciled with Storm (Uncanny X-Men #306, 1993)", 
                "created planetary electro-magnetic energy web to oppose Magneto (X-Men #25, 1993)", 
                "evaluated X-Factor (X-Factor #95, 1993)", 
                "sent X-Factor to arrest Haven, hired Random to help (X-Factor #97-99, 1993)", 
                "with Polaris, vs Strange (Doctor Strange: Sorcerer Supreme #69, 1994)", 
                "built Game Room for X-Factor (X-Factor #107, 1994)", 
                "with others, vs Phalanx (X-Factor #106/X-Force #38/Excalibur #82, 1994)", 
                "repaired & upgraded Shard's holomatrix (Bishop #1-2, 1994-1995)", 
                "created nanotech inhibitor for Mystique (X-Factor #114, 1995)", 
                "learned of Adversary's rebirth (X-Factor #117-118, 1995-1996)", 
                "with X-Factor, vs Adversary, reclaimed shaman heritage, defeated Adversary (X-Factor #120-121, 1996)", 
                "with Mystique & Sabretooth, rescued Beast from Dark Beast (X-Factor #125-126, 1996)", 
                "with X-Factor, assigned to protect Graydon Creed during campaign speech, failed to prevent his death (X-Factor #130, 1997)", 
                "designed gun to help X-Men restrain Hulk (Incredible Hulk #455, 1997)", 
                "cut ties with government, took X-Factor underground (X-Factor #132-134, 1997)", 
                "betrayed by Sabretooth, almost died from injuries (X-Factor #136-137, 1997)", 
                "built training room for Generation X (Generation X #47,1999)", 
                "with Madrox, monitored Genoshan situation (Uncanny X-Men '99 Annual, 1999)", 
                "attended Havok's & Polaris' wedding (Uncanny X-Men #425, 2003)", 
                "agreed to aid Mystique in her role as Xavier's agent (Mystique #1-3, 2003)", 
                "mind-controlled by Spencer Bronson into fighting Mystique (Mystique #11-12, 2004)", 
                "prevented Mystique from assassinating Xavier (Mystique #23, 2005)", 
                "helped locate & restore Cable (Cable & Deadpool #15 & 18, 2005)", 
                "revealed to have retained mutant nature after \"M-Day\" (X-Men: The 198 Files, 2006)", 
                "built new gauntlets for Surge (New X-Men #21, 2005)", 
                "attended mass funeral for slain depowered students (New X-Men #24, 2006)", 
                "deceased (Astonishing X-Men #30, 2009)"
            ], 
            "speed": 2, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 179
        }
    }
}