{
    "aliases": [
        "Freda Barker", 
        "Fricka", 
        "Frig", 
        "Frijja"
    ], 
    "citizenship": "Asgard", 
    "content": "Around 1000 AD, the multi-pantheon Council of the Godheads saw a threat to humanity from the cosmic Celestials, who would one day decide if the human race was worthy of existence. While the male gods planned to wage war against the Celestials, the Earth goddess Gaea gathered Frigga and goddesses of other pantheons to locate humans across a span of a thousand years and release the latent genetic potential within them. These superhumans, called the Young Gods, were intended to show the Celestials the greatness humanity could achieve. The Young Gods were kept in suspended animation, watched over by Frigga and others. When the Celestials finally returned to judge humanity, Frigga relinquished the Young Gods to Gaea and returned to Asgard. In turn, Gaea offered the Young Gods to the Celestials, satisfying them of Earth’s value.During a war against the fire demon Surtur (“the Surtur War”), Frigga fled from Asgard with the Asgardian children under her protection. She returned to Asgard with Surtur’s defeat to find that Odin had fallen in battle;, but they were later reunited when Thor rescued Odin from the Ennead death god Seth.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Jouner Into Mystery #92 (1963)\n", 
    "groupaffiliation": "Gods of Asgard", 
    "hair": "White\n", 
    "height": 71, 
    "id": "Frigga", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Odin (husband, deceased); Balder, Hermod, Tyr (sons); Thor, Loki (foster sons)", 
    "occupation": [
        "Queen of Asgard", 
        "goddess of marriage"
    ], 
    "placeofbirth": "Asgard", 
    "powers": "Frigga possesses the conventional superhuman attributes of an Asgardian goddess. Though relatively old, she can lift about 20 tons. She possesses certain abilities to wield magic which have not yet been defined.", 
    "realname": "Frigga", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 370
}