{
    "aliases": "None", 
    "citizenship": "England", 
    "content": "Fury took his protégé Peter and hired the blind mercenary Matthew Murdoch, who charged a reasonably high price for his efficiency, to secure the weapon. On the way back, an assassin attacked Fury and Peter, whom Fury quickly subdued and captured to be interrogated. Fury then traveled to Carlos Javier’s witchbreed school and warned him that the Queen, who tolerated his existence, would soon be dead; and King James of Scotland would soon take her place, and would not be so kind to Javier’s students.He returned to England in time to miss the assassination attempt on Virginia Dare, and arrived shortly after Dr. Strange had coaxed her out of her transformation into a giant griffin, still unaware of her powers. Fury later questioned the first assassin after challenging him to defeat Fury while the prisoner had a sword, and Fury was unarmed. After a quick scuffle, Fury overpowered him with his bare hands and forced him to reveal his master. The assassin told him that Count Otto von Doom had ordered it, but Fury left the interrogation cell too late to stop a second assassination attempt, this time a successful one against the Queen herself.Embarrassed, Fury turned to the new ruler, King James, and offered him his services. James sent him to Javier’s school to either take them in or destroy them, officially blaming them for the Queen’s death. Fury agreed, but sent Peter ahead to warn them to go quietly. Strange appeared while Fury traveled with a small army to the school, and warned him that James would not tolerate Fury for long, but he ignored the astral projection’s words. Fury’s army soon approached the school, and as he had suggested, Javier went easily. Later, Dr. Strange called a meeting of Fury, Javier, and himself, and explained that the world was going to end, and the only way to save it would be to travel to Latveria and rescue Donal’s staff and the imprisoned four of the Fantastick, believed dead. Fury was hesitant at first, not believing that his friend Richard Reed was still alive, but Javier used his powers to reveal that Strange was telling the truth. Fury was forced to agree, and traveled on a flying ship with Javier’s witchbreed to attack the Castle of Count von Doom.The battle against Doom went badly at first, until Donal managed to escape with the assistance of the Fantastick’s Captain Benjamin. Donal transformed into the Thunder God, Thor, creating a storm that allowed Javier’s student Robert to use his ice powers to stop Doom’s cannons. Thor’s storm also encouraged Doom to use a flashy golden sphere that Donal had given to him instead of the staff, but it exploded in his face, scarring Doom and bringing him to the brink of death. Then, together with a collection of heroes, Fury traveled to the New World to fix their world’s oncoming destruction.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Hazel\n", 
    "fighting": 1, 
    "firstappearance": "Marvel 1602 #1\n", 
    "groupaffiliation": "Former servant of the Crown", 
    "hair": "Brown w/gray streaks\n", 
    "id": "Fury,_Nick_(1602)", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Former servant to the Crown", 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Nicholas Fury", 
    "significantissues": "Marvel 1602 #1 (intro), Marvel 1602 #8 (disappears into the rift)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 1602 (Earth-311)"
}