{
    "aliases": [
        "Mother Earth", 
        "Mother Nature", 
        "Great Mother", 
        "Aditi", 
        "Akka", 
        "Ala", 
        "Ammaveru", 
        "Citlacicue", 
        "Coatilique", 
        "Danu", 
        "Eithinoha", 
        "Erce", 
        "Hou-Tou", 
        "Jord", 
        "Nana", 
        "Nertha", 
        "Ninhursag", 
        "Nokomis", 
        "Pachamama", 
        "Prakriti", 
        "Rangi", 
        "Vaat", 
        "Yo", 
        "others"
    ], 
    "citizenship": "Inapplicable", 
    "content": "Gaea became the mother god to virtually all of the pantheons of later gods in humanity, receiving many different names. In her guise of Jord she mated with the Asgardian god Odin to conceive Thor. A millennium ago she learned of humanity's future judgment by the Celestials and organized goddesses of numerous pantheons to gather the best examples of humanity. This resulted in the Young Gods, whose existence swayed the Celestials to judge in humanity's favor in the 21st century.", 
    "durability": 7, 
    "education": "5 billion years of life experience", 
    "energy": 7, 
    "eyes": "Variable\n", 
    "fighting": 7, 
    "firstappearance": "Dr. Strange #6 (1975)\n", 
    "groupaffiliation": "Elder Gods", 
    "hair": "Variable\n", 
    "height": 0, 
    "id": "Gaea", 
    "identity": "Believed to be a fictional being by most", 
    "intelligence": 7, 
    "knownrelatives": "Demiurge (\"father\"); Chthon, Set (brothers); Hyppus (brother, deceased); Isuus, Oshtur (sisters); Atum (deceased), Coeus, Chronus, Crius, Hyperion, Japetus, Leir, Lusa, Oceanus, Ophion, Ouranos, Thor, Thoth (sons); Dione, Mahu, Mnemosyne, Rhea, Theia, Tethys, Themis (daughters); Age, Atlas, Bash (Panther God), Bes, Damballah (Dan-Ayido-Hwedo), Eprimetheus, Eschu, Legba, Neptune, Ogun, Pluto, Prometheus, Sekhmet (Lion God), Sagbata (Baron Samedi), Shango, Shu, Zeus (grandsons); Avlekete, Circe, Demeter, Erzulie, Hecate, Hera, Oya, Tefnut, Vesta (granddaughters); Apollo, Ares, Consus, Dionysus, Geb, Hephaestus, Hercules, Hermes, Triton, Vertumnus (great-grandsons); Artemis, Athena, Aphrodite, Discord, Eileithyia, Hebe, Helen, Iris, Nut, Pandia, Pomona (great-granddaughters); Cupid, Janus, Deimos, Osiris, Phobos, Pan, Seth (great-great-grandsons); Harmonia, Isis, Nepthys (great-great-granddaughters); Anubis, Horus (5th generation decendents); Damballah, Dragon of the Moon, Phorcys, Sligguth, Yamata-no-Orichi (nephews); Ishiti, Tartessus (nieces); Many other decendents", 
    "occupation": "Patron goddess of Earth", 
    "origin": [
        "Thor Annual #10 (1982)", 
        "Silver Surfer Annual #2 (1989)"
    ], 
    "placeofbirth": "Earth", 
    "powers": "Gaea can draw on the spiritual energy of all of Earth's living beings, command the forces of nature, heal others, levitate objects, and bestow mystical or other power upon those who call upon her. Her magical abilities allow her to disrupt enchantments, such as those in Thor's hammer. Though she is incalculably strong, she rarely uses her physical abilities.", 
    "realname": "Unrevealed; Gaea is her Greek name", 
    "significantissues": [
        "Called on Atum to drive off Set (Iron Man Annual #10, 1989)", 
        "organized Young Gods (Thor #300-301, 1980)", 
        "alerted Dr. Strange to Maelstrom's threat (Quasar #24-25, 1991)", 
        "placed curse on Defenders (Defenders #1-12, The Order #1-6, 2001-2002)", 
        "pain affected Humus Sapien (Thunderbolts #55, 2001)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": "Variable\n"
}