{
    "aliases": [
        "Death", 
        "Le Diable Blanc", 
        "formerly Robert Lord", 
        "Cajun"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Later, when he was around ten years old, Remy attempted to pick the pocket of Jean-Luc LeBeau, then-patriarch of the Thieves’ Guild.  Jean-Luc took the boy in off the streets and adopted him into his own family.  As part of a peace pact between the Thieves’ Guild and their rivals, the Assassin’s Guild, a marriage was arranged between Remy and Bella Donna Boudreaux, the granddaughter of the head of the Assassin's Guild.  However, Bella Donna's brother Julien objected to the marriage and challenged Gambit to a duel.  Remy killed Julien in self-defense, but was excommunicated and banished from New Orleans in an attempt to maintain the nonaggression pact between the two guilds.Eventually, Remy encountered Storm, a member of the outlaw team of mutant adventurers known as the X-Men.  Storm had been transformed into an amnesiac child who had turned to theft as a means to survive. Remy helped her escape her enemy, the malevolent psionic entity known as the Shadow King, and they became partners.  Later, when the X-Men's founder Professor Charles Xavier returned from a long period of traveling in outer space, Storm sponsored Remy's admission into the X-Men.  Remy soon fell in love with his fellow X-Man, Rogue, blessed and cursed with the ability to absorb other mutants' thoughts and abilities through skin-on-skin contact. The feeling was mutual, but the two soulmates were condemned never to touch.  At one point, Rogue left the X-Men after she kissed Remy and absorbed a portion of his memories, learning of his role in the Morlock Massacre.Remy was subsequently captured and brought before a mock trial held by Magneto, the mutant master of magnetism, then disguised as Erik the Red.  He was summarily cast out of the X-Men and was abandoned in the frozen wastes of Antarctica.  Starving to death, Remy made his way back into Magneto's citadel where he came upon the psionic essence of a dead mutant named Mary Purcell.  The wraith-like Mary bonded with him, allowing him to survive until he reached the Savage Land, a hidden jungle nestled in the icy wasteland.  There, Remy struck a deal with the enigmatic being known as the New Sun. In exchange for passage back to America, Remy agreed to run errands for the New Sun.During a trip back in time, Remy's powers were restored to their maximum potential by Sinister and he was able to utilize them to return to the present.  Soon after his return, Remy served for a time as patriarch of the Thieves' Guild in his father's stead, as well as leading one of two teams of X-Men.  Remy was also responsible for the unification of the Thieves' and Assassins' Guilds into the Unified Guild, of which he also served briefly as patriarch.Meanwhile, the New Sun revealed his true nature after organizing an assassination game for a cadre of super-powered mercenaries with Remy as the target.  When Remy took the fight back to the New Sun, he was shocked to learn that the New Sun was actually an alternate reality version of himself.  In his own reality, the New Sun's kinetic charging powers had flared out of control, burning the world and killing everyone.  As a result, the New Sun hunted down and killed versions of himself in other realities to ensure that they would not repeat his mistakes.  During their final battle, Remy burned out his enhanced powers to defeat the New Sun, ending his threat and returning his powers to their normal level.However try as they might, a normal life was not for them to lead as the pair soon became embroiled in the X-Treme X-Men's fight against the mutant predator Elias Bogan.  After Bogan was defeated, the X-Man named Sage used her mutant ability to \"jumpstart\" Remy's mutant powers and he rejoined the team.In an alternate future over 70 years from now in which the X-Man Bishop was born, Remy had become an aged figure named the Witness, so-called because he had apparently witnessed the betrayal of the X-Men by one of their own members. He was also thought to be the last survivor of the X-Men.  Upon joining the X-Men himself, Bishop suspected Remy to be the traitor until realized that Xavier's mind and Magneto's mind spawned the corrupt psionic entity known as Onslaught.During Apocalypse's most recent bid for power, Gambit joined Apocalypse's side as the horseman, Death. Gambit believed that Apocalypse would be able to save the mutants, but he would be able to stop Apocalypse should he betray them.As Death, Gambit attacked his lover Rogue and his former group X-Men. Cyclops arrived with The Avengers to stop Apocalypse and his Horsemen. Apocalypse finally lost, and seems dead for a while. Sunfire, Apocaypse's other Horseman rescued Death from battle and they escaped. Afterwards they returned to take Polaris, who had also become a Horseman of Apocalypse only to find Polaris had been injured in the last battle and was now in a coma. Death and Sunfire lost the battle and were forced to run from the X-Base. Afterwards they discussed what will happen to them without Apocalypse.  During their conversation, Mr. Sinister found them and they joined his Marauders.As Death, Gambit regretted attacking Rogue. Sinister rescued him from his Death form, leaving Gambit feeling betrayed by the X-Men and indebted to Sinister.  In the end, Gambit decided to stay with Sinister. The Marauders waited for the right time to attack the X-Men, with Gambit at the Marauders' side. During the battle, Mystique betrayed the X-Men and shot her step-daughter Rogue, Gambit's lover. They then took Rogue and ran. The Marauders had won the first battle.After that, Gambit and Sunfire attacked Cable. Cable lost and was thought to be killed by Gambit, but Cable was in fact not dead.The X-Men went to the Marauders for the baby where Wolverine injured Gambit, and learned the baby Messiah was actually with Cable. Upon learning the Marauders had no idea where the baby was, it was surmised Gambit assisted Cable in taking her.When Bishop attacked Cable, Gambit rescued the baby, but as he returned to Sinister, he discovered Mystique killed him. Gambit felt as if he was finally free, and when Mystique used the baby to try to heal Rogue, Gambit saved baby again. Professor X and Cable came to take child, so Gambit gave the baby to them. Rogue was healed, and even though she wanted to kill Mystique, she didn't. Rogue's final request of Gambit was that he didn't follow her.", 
    "durability": 3, 
    "education": "No official schooling", 
    "energy": 5, 
    "eyes": "Burning red\n", 
    "fighting": 4, 
    "firstappearance": "(as Gambit) Uncanny X-Men #266 (1990), (as Death) X-Men #184 (2006)\n", 
    "groupaffiliation": [
        "X-Men", 
        "formerly Marauders", 
        "Horsemen of Apocalypse", 
        "X-Treme Sanctions Executive", 
        "Unified Guilds (patriarch)", 
        "Thieves Guild (patriarch)"
    ], 
    "hair": "(Originally) Brown; white(as Death)\n", 
    "height": 73, 
    "id": "Gambit", 
    "identity": "Publicly known", 
    "intelligence": 3, 
    "knownrelatives": "Jacques LeBeau (foster grandfather, deceased), Jean-Luc LeBeau (foster father, deceased), Rochelle LeBeau (foster grandmother, deceased), Bella Donna Boudreaux (ex-wife), Henri LeBeau (foster brother, deceased), Mercy LeBeau (sister-in-law), Theoren Marceaux (cousin), Etienne Marceaux (cousin, deceased), Marius Boudreaux (father-in-law, deceased), Julien Boudreaux (brother-in-law, deceased)", 
    "occupation": [
        "Unknown", 
        "formerly thief", 
        "adventurer"
    ], 
    "origin": [
        "Gambit #1 (1999)", 
        "X-Men #8 (1992)"
    ], 
    "placeofbirth": [
        "New Orleans", 
        "Louisiana (presumed)"
    ], 
    "powers": "Gambit has the mutant ability to tap into the potential energy contained within an object and transform it into kinetic energy upon touching it.  When Gambit thus charges an object and throws it at a target, the object releases this energy explosively on impact.  Gambit is unable to use this power to charge living objects. / As Death: He can control deadly gas\nAfter surgery performed by Mister Sinister, Gambit's powers were restored to their natural potential.  He was able to use his power simply by looking at an object that he wished to charge, including living tissue.  Gambit could also manipulate the potency of the energy release and could even exercise a measure of control over time.  Following his climactic battle with the New Sun, Gambit lost this enhanced level of power.\nGambit's ability to tap energy also grants him superhuman agility and dexterity, as well as creating a static interference that shields his mind from detection and intrusion by even the most powerful telepaths.\n\nGambit also possesses a hypnotic charm that allows him to exert a subtle influence over any sentient mind.  This power allows Gambit to compel others to believe what he says and agree with anything he suggests.  More powerful minds have proven immune to Gambit's charm.", 
    "realname": "Remy Etienne LeBeau", 
    "significantissues": [
        "Assembled Marauders (Uncanny X-Men #350, 1997)", 
        "first encountered Storm (Uncanny X-Men #266, 1990)", 
        "joined X-Men (Uncanny X-Men Annual #14, 1990)", 
        "began romance with Rogue (X-Men #4, 1992)", 
        "put on trial by Magneto (Uncanny X-Men #350, 1997)", 
        "rescued by New Son (Gambit #½, 1999)", 
        "returned to X-Men (Uncanny X-Men #361/X-Men #81, 1998)", 
        "regained full powers (Gambit #16, 2000)", 
        "formed Unified Guild (Gambit #19, 2000)", 
        "vs New Sun (Gambit #24, 2001)", 
        "lost powers (X-Treme X-Men #16-19, 2002)", 
        "powers restored, returned to the Xavier Institute (X-Treme X-Men #46, 2004)", 
        "joined Apocalypse, became Death (X-Men #184, 2006)", 
        "rejoined Marauders (X-Men #200, 2007)", 
        "left Marauders (X-Men #207)", 
        "rejoined X-Men (X-Men: Legacy Annual #1, 2009)"
    ], 
    "speed": 3, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 179
}