{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Zen-Whoberian", 
            "content": "Returning back to Thanos, Gamora saw his true nature and tried to stop him. Thanos slew Gamora but Warlock found her and placed her soul inside the Soul Gem. Sometime later, when Thanos gained the Infinity Gauntlet, Gamora (along with Adam Warlock and Pip) were brought back to life and gained new bodies. After Adam gained control of the Infinity Gauntlet he gave the Time Gem to Gamora, and made her a member of the Infinity Watch.  Gamora and the Infinity Watch took up residence on Monster Island. While on the Island they defended it from a United Nations invasion. Later Gamora would find herself back in the cosmos assisting Galactus, in reviving Eternity. This event would catapult her and many of the Earth’s heroes into conflict with the Goddess in a crisis that was dubbed the Infinity Crusade.During her adventures with the Infinity watch Gamora battled the likes of the Man-Beast and his minions, the Trolls of the famed  Asgard, the evil  Count Abyss, Tyrannus,  Zakaius and Domitian. The Watch was disbanded after Maxam attacked Warlock. Gamora has since returned to the aid of Thanos, together they have defeated the Thanosi a group of very powerful clones created by Thanos himself. The clones had been manipulated into action by a being known as Atlez. He was bestowed with the task of Anchor to the Earth-616 universe by an unknown predecessor. Gamora and Thanos help to thwart this audacious attempt at universal control, with the help of Doctor Strange, Spider-Man, Captain Marvel, and Adam Warlock. Atlez die and was replace by a Earth girl known as Atleza Langunn.After a long hiatus to parts of the universe unknown, Gamora appeared on Godthab Omega. This was a planet that somehow been altered by Glorian the apprentice Shaper of Worlds. Gamora established herself as leader of a group of cosmic female warriors known as the Graces. This group consisted of Tana Nile, Stellaris, Nebula, Cerise and Spirit. Ronan the Accuser also traveled to Godthab Omega in search of Tana Nile whom he believed to be responsible for his being exiled from the Kree homeworld of Hala. Ronan and Gamora soon engaged each other in a violent confrontation. During their battle Gamora revealed that she had undergone a cosmic makeover through science and arcanum. Gamora was more than able to stand her ground against Ronan, although their battle had no apparent winner, basically due to it being interrupted by the invasion of the Annihilation Wave. Gamora, Glorian and Ronan stood together to defeat the Wave. Later Gamora and Ronan’s paths would cross again, when they joined Nova and his United Front in their last effort to protect the universe from Annihilus the Negative Zone invaders.  During this event Gamora would become romantically involved with Nova, she  led covert missions against the wave, which was eventually defeated when her ex-infinity Watch member Drax the Destroyer took Thanos' life, thus freeing the mighty Galactus and his Hearld the Silver Surfer.Gamora found herself entangled in the next cosmic fiasco when the parasitic Phalanx captured control of the Kree defense grids, denying anyone to enter or exit this sector of the universe. Gamora was eventually converted to a Phalanx super solider known as the Select, along with other cosmically powered beings such as Blastaar of the Negative Zone, Daystar, and Lightstorm, from the Spaceknights of Galador,  Shatterax and Korath the Pursuer of the Kree Starforce, and Xemnu the Titan. As a member of the Select, Gamora would take the life of Ko-Rel, a Kree warrior appointed to the position of Nova Centurion by the Worldmind after Richard Rider was severely injured by a Phalanx hunter pack led by Lightstorm. It would later be discovered that Ultron was behind the Phalanx invasion. Gamora and Drax were freed of the Phalanx’s control by Nova, the three of them joined the reborn Adam Warlock, Quasar, Star-Lord, Mantis, Rocket Racoon, Bug and Groot to free the Kree from the crushing grip of Ultron and the Phalanx.Seeing the need for a proactive peace keeping team, to protect the universe after the attacks of the Annihilation Wave and the Phalanx, Star-Lord, asked Gamora to join this new team. She accepted his proposal. The team would assume the name of the Guardians of the Galaxy and make their base in Knowhere the severed head of an unknown Celestial floating at the edge of space.  During their first mission Gamora and these Guardians destroyed a Templeship belonging to the Universal Church of Truth in order to close a fissure within the fabric of reality. The Guardians' act was considered as blasphemy by the Matriarch of the church who summoned Raker and the Cardinals to mete out retribution and penance on the infidels, and verify the identity of one of the Guardian members.", 
            "durability": 6, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 7, 
            "firstappearance": "Strange Tales #180\n", 
            "groupaffiliation": [
                "Guardians of the Galaxy", 
                "formerly United Front", 
                "Infinity Watch", 
                "former minion of Thanos", 
                "Phalanx", 
                "Graces"
            ], 
            "hair": "Black\n", 
            "height": 72, 
            "id": "Gamora", 
            "identity": "The general populace of Earth was unaware of Gamora’s existence", 
            "intelligence": 4, 
            "knownrelatives": "Thanos (adoptive father)", 
            "occupation": "Adventurer", 
            "placeofbirth": [
                "Planet Zen-Whoberi", 
                "Silcan System", 
                "Milky Way"
            ], 
            "powers": "None", 
            "realname": "Gamora", 
            "significantissues": "Annihilation: Ronan #3", 
            "speed": 5, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 170
        }
    }
}