{
    "aliases": "Unknown", 
    "citizenship": "Unrevealed", 
    "content": "Recently Tyrant's return reactivated the Spinsterhood. Virtually all of their suspension chambers had failed over the years and when Ganymede awoke the Spinster's computer network  identified her as the sole surviving Spinster. Allying herself with the Silver Surfer, Ganymede stormed Fortress, Tyrant's planet-sized city-base, where the pair were captured alongside the Gladiator, Beta Ray Bill, Terrax, Morg and the Jack of Hearts; Galactus eventually arrived, forcing Tyrant to retreat. Ganymede took the depleted Jack of Hearts to the Spinstershoods's Jupiter moon base to recover and the pair almost began a romantic relationship, but she elected to maintain her religious vows until Tyrant's final defeat. Ganymede and Jack were ambushed there by Thanos and  Terrax; the pair kidnapped Ganymede, though she soon allied her self with them when they opposed Tyrant. Leading them to the Fortress, Ganymede and Terrax battled Tyrant while Thanos raided his files; Jack of Hearts, with Genis-Vell, followed and aided them. Thanos revealed Tyrant's origin and that it had been Tyrant's creator Galactus, who had actually originally driven off Tyrant, but refused to reveal more and departed. Without Thanos' help, Ganymede fell before Tyrant; Jack transported her unconscious form to the Jupiter base.", 
    "durability": 1, 
    "education": "Graduate of Spinsterhood training programs.", 
    "energy": 1, 
    "eyes": "Yellow\n", 
    "fighting": 1, 
    "firstappearance": "Silver Surfer #80, (1993)\n", 
    "groupaffiliation": "Sisters of the  Spinsterhood", 
    "hair": "Black\n", 
    "height": 68, 
    "id": "Ganymede", 
    "identity": "Not known to the inhabitants of Earth", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": "Soldier", 
    "origin": "Ganymede's origin is revealed in (Cosmic Powers #3 1994)", 
    "placeofbirth": "Jovian moon of Jupiter", 
    "realname": "Ganymede", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 195
}