{
    "add": {
        "doc": {
            "aliases": "Formerly Molasses", 
            "citizenship": "U.S.A.", 
            "content": "Isaac Christians was born in Christiansboro, Virginia, a town founded by his ancestors. His life was full of regrets. As a child he accidentally pushed his brother Jeremiah off the roof to his death during a game. Stricken with guilt, Isaac built an emotional shell around himself, gradually emerging years later thanks to his friends, Elaine Willoughby and Buster Henderson; they called themselves the “Three Musketeers”, and while Buster was Isaac’s idol, Elaine was his first crush. When Buster became engaged to Elaine, Isaac was devastated. Soon after America entered the First World War; Buster swiftly signed up. Isaac followed soon after, but panicked when a sniper’s bullet killed a comrade on his first day in the trenches. Fleeing, Isaac ran into Buster, but soon saw him cut down by a hail of German gunfire while Isaac froze in terror. After the war Isaac abandoned his hometown and its memories. He traveled to Paris, where he became obsessed with Germaine, a prostitute bearing an uncanny resemblance to Elaine. Eventually, when she left him, Isaac resumed his travels, finally reaching Hyderabad, India, where for two years he became a follower of the holy man Vishnu Dass, gradually regaining his faith. His journey ended with a letter informing him his father had died; Isaac returned home to take on his familial responsibilities, spending decades as Christiansboro’s mayor until he retired.Increasingly upset at Christiansboro’s decline into poverty, Isaac read old books on magic, then summoned up Avarrish, one of the Six-Fingered Hand, who promised to save Christiansboro if Isaac would temporarily serve him. Agreeing, Isaac found himself in the body of the gargoyle, and was sent to kidnap Patsy Walker (Hellcat), nearly killing her housekeeper Dolly Donahue in the execution of this task. Isaac carried out a ceremony to make Patsy a demonic host; when her Defenders teammates arrived, he led a horde of demons against them, but because he tried to warn them off rather than slay them, Avarrish trapped him in the gargoyle body. After Hellcat was exorcised, the Defenders confronted the penitent Isaac; wishing to atone, he joined their ranks as Gargoyle, fighting other pawns of the Hand, including Dracula, Gordski and his undead legions, Asmodeus Jones, David Kessler and the Man-Thing, before finally confronting the true powers behind the group, an alliance of Hell Lords. Patsy, previously resentful towards him, finally forgave him in light of her own experiences during this battle, forging an enduring friendship; Isaac also became increasingly close to the recovered Dolly, finding their similar ages gave them much in common.Isaac remained with the Defenders, battling the Serpent-Men and attending the funeral of Captain Marvel, but became increasingly depressed by his perceived failure to save Christiansboro. Alongside the Defenders, he returned home to find the town full of ghostly apparitions. While Isaac was haunted by visions of his family, other specters overwhelmed the Defenders; fleeing the taunting ghosts, Isaac found his friends under attack from Null the Living Darkness, and used his own lifeforce to drive it off. The exhausted Gargoyle, near death, was saved by his family’s ghosts; having not been conjured by Null, they replenished him and informed him of their love, restoring his will to live.The next few months saw Isaac battle alongside the Defenders against the Secret Empire and the Enchantress, fight the Avengers as a pawn in the alien Supernalia’s feud against her estranged husband Nebulon, and travel to Earth-712 to free the Squadron Supreme from Null the Living Darkness’ new pawn, the Overmind. En route home, Isaac, Valkyrie, Beast and Namor took an extradimensional detour to the bizarre reality Here; dubbed “They” by the locals, the group obtained the Ruby Sneakers from the evil Lord Mayor Easy-Read the First to get home. While his relationship with Dolly slowly blossomed into love, Isaac took part in the Grandmaster’s Contest of Champions, joined other heroes in congratulating the Hulk on his pardon, and battled the Miracle Man after he stole the Son of Satan’s darksoul. Soon after Isaac attended the wedding of Daimon and Patsy, fighting agents of the Secret Empire who interrupted the nuptials. Following the Beast’s renovation of the team, the Defenders continued their vendetta with the Secret Empire and relocated to New Mexico. Magically kidnapped by an Afghan wizard for use as a familiar, Isaac was trapped within a pentagram-inscribed orb, until he tricked the wizard into coming to America, where the Defenders managed to free him.Drawn home by Elaine’s death, Isaac met the gargoyle’s spirit now wearing his old body. He allowed it to swap their forms, but the Gargoyle and its surviving fellows went on a rampage. Derwyddon, who had been tracking down the gargoyles, helped Isaac overcome his feelings of failure; after Derwyddon turned the other gargoyles to stone, Isaac reclaimed his demonic form, then slew his old body which again hosted the gargoyle’s spirit. During a subsequent visit to Dr. Strange’s house, Isaac was drawn to steal a crystal without knowing why; sometime later a possessed Moondragon ripped out Isaac’s soul and turned his gargoyle body into her pawn, warping it into an even more monstrous visage. Several of the Defenders, aided by the Interloper, sacrificed themselves, using their lifeforces to turn it, Moondragon and themselves to dust.Isaac’s unbound spirit entered the crystal he had taken from Strange’s sanctum, which was found by a soldier involved in the clean-up after the battle. Isaac controlled the soldier, tracking down Moondragon’s still active spirit, catching up with her when she made contact with her cousin Pamela Douglas. Moondragon convinced Isaac to accompany her and Pamela to Titan, where the Eternals grew Moondragon a new body. For his part, Isaac hung round Pamela’s neck, until she became Sundragon, using her new powers to give him a new body, capable of changing between human and gargoyle forms. While Moondragon returned to Earth, Isaac left for deep space with Sundragon, Cloud and the Titanian Eternal Demeityr, but was captured by the Stranger. Eventually Isaac escaped the Stranger’s Lab World with many of the other inmates and returned to Earth.Isaac sought out Dolly, resuming their relationship, but after she died of old age he moved in with Patsy and Daimon Hellstrom at their mansion at Fire Lake, Massachusetts. Having lost his darksoul Daimon began to die; Patsy worked with Isaac to summon “Satan” to help his son, but the sight of Daimon’s true, demonic face drove Patsy insane. Isaac stayed on to care for Patsy, and tried to keep Daimon from straying too far. Even after Patsy’s suicide, and disapproving of Daimon’s new consort, Jaine Cutter, Isaac felt he had nowhere else to go. He eventually managed to stop viewing Jaine as Patsy’s replacement, and they became friends.", 
            "durability": 5, 
            "education": "Unrevealed", 
            "energy": 4, 
            "eyes": "(Christians) Blue; (Gargoyle) Red\n", 
            "fighting": 2, 
            "firstappearance": "Defenders #94 (1981)\n", 
            "groupaffiliation": [
                "Initiative Trainees", 
                "formerly Defenders", 
                "They", 
                "Three Musketeers", 
                "agent of the Six-Fingered Hand"
            ], 
            "hair": "(Christians) Black, white in later life; (Gargoyle) None\n", 
            "height": 0, 
            "id": "Gargoyle_(Isaac_Christians)", 
            "identity": "Secret", 
            "intelligence": 3, 
            "knownrelatives": "Ezekial (father, deceased), Mary (mother, deceased), Jeremiah (brother, deceased)", 
            "occupation": [
                "Housekeeper", 
                "adventurer", 
                "former mayor", 
                "soldier"
            ], 
            "placeofbirth": [
                "Christiansboro", 
                "Virginia"
            ], 
            "powers": "Gargoyle can fly, and is able to fire bio-mystic blasts which steal part of the victim’s soul; he can also reverse this to strengthen others with his own lifeforce, though this is potentially fatal. He can also form bio-energy shields to deflect magical attacks. This bio-energy also jams sorcerous attempts to locate him. His body is immortal, does not need to breathe, can regenerate lost limbs, and is superhumanly strong and durable. He can breathe a bio-mystic fire which can remove madness and evil from people. He can assume human shape at will. He can be used as a familiar by more experienced magicians to transmute matter or manifest a gigantic spectral form.", 
            "realname": "Isaac Christians", 
            "speed": 3, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": 150
        }
    }
}