{
    "aliases": "None", 
    "citizenship": "Australia", 
    "content": "It was the Reavers who named the man \"Gateway,\" as his true name is, apparently, known only to himself.  Gateway spent virtually all his time sitting atop a rock near the Reavers' headquarters in the Australian outback. The team of superhuman mutants known as the X-Men tracked the Reavers from Hong Kong to their outback base and defeated them in battle.  One of the Reavers, Skullbuster, told Gateway he would release him from all vows and obligations to the Reavers if he would use his powers to transport him to safety this one last time.  Gateway agreed, and Skullbuster and two other Reavers escaped through a teleportational \"gateway\" that he created.After defeating the Reavers, the X-Men took over their headquarters.  Gateway began voluntarily using his teleportational powers to transport the X-Men from place to place, with the telepathic X-Man named Psylocke using her mental powers to tell Gateway where they wanted him to send them.  Gateway thus became an unofficial member of the team, but he himself remains a mystery even to them.During his affiliation with the X-Men, Gateway transported the young mutant named Jubilee to their Australian outback base.  Gateway later appeared at the campus of the new branch of Professor Charles Xavier's School for Gifted Youngsters at the Massachusetts Academy in western Massachusetts where the members of the young team of mutants known as Generation X received training in the use of their mutant powers.  Here, Gateway continued his mysterious meditations, although he did break his silence to utter the name of Penance, a young mutant he had brought to the school.  Gateway had been weighed down by guilt for a role he played in the destruction of another group of mutant students, the Hellions, and sought to redeem himself.  It was also revealed that Gateway was, at one time, mentor to the young mutant St. Croix twins, Claudette and Nicolette, when they were merged together to impersonate their older sister Monet.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Uncanny X-Men #229 (1988)\n", 
    "groupaffiliation": "(formerly) associate of X-Men", 
    "hair": "Grey\n", 
    "height": 54, 
    "id": "Gateway", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Lucas Bishop (great-grandson), Shard (great-granddaughter, deceased)", 
    "occupation": "Ascetic", 
    "placeofbirth": "Unrevealed location in Australia", 
    "powers": "Gateway is in tune with the spiritual force of his people that allows him to create teleportational \"gateways\" from one location to another. Gateway creates these warp tunnels, which can traverse both time and space, by whirling his bullroarer over his head. Gateway somehow causes a burning fire to appear before him when he creates one of his gateways, though the role that the fire and the bullroarer play in the creation and functioning of the gateways is unclear. The gateways can be used for both observation and transport. The exact limits of how much mass can be transported is yet to be revealed.\nThere are no known limits to Gateway's teleportational range. He has, for example, transported the X-Men from Australia to the United States and back using his powers, as well as transporting them trans-dimensionally to another Earth. He also opened up gateways that observe past events, such as the one that allowed the feral X-Man Wolverine and the ninja named Elektra to learn the truth behind the powerful psionic being known as Onslaught.\n\nGateway also possesses psionic abilities that allow him to communicate with telepaths. Gateway apparently prefers this method of communication over the verbal method, having spoken out loud only twice during his association with the X-Men. It was this ability that allowed him to communicate with the X-Man Psylocke to ascertain where and when the X-Men wished to be telported, as well as knowing when they wished to return or what their exact location was at the time they wished to come back. Gateway also once spoke to the telepathic Generation X member named Chamber psionically, as well as regularly communicating psionically with the St. Croix twins.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 80
}