{
    "aliases": [
        "Brimstone Biker", 
        "Spirit of Vengeance"
    ], 
    "citizenship": "U.S.A.", 
    "content": "John Blaze was born into a world of motorcycle grease and cheering crowds. The son of Barton Blaze and Naomi Kale, Johnny spent his early years in the Quentin Carnival, where his parents starred in a stunt show with Craig \"Crash\" Simpson. His idyllic home life ended abruptly, however, when Naomi abandoned John, taking his younger siblings - Barbara and Daniel - with her. Naomi's decision to leave had been difficult, but she felt it was necessary because of the family curse. She feared that her own firstborn would suffer in the same way that she had, so she left him behind and placed her other children in the care of a woman named Francis Ketch.The pain of losing his mother caused John to repress many of his memories of Naomi and his siblings. When Barton died in a stunt shortly thereafter, John was adopted by Crash and Mona Simpson, who helped fabricate a past for Johnny, one that they hoped would be less painful than the truth. Believing that his real mother - \"Clara Blaze\" - had passed away, Johnny became an enthusiastic member of the Simpson clan, growing close to their daughter, Roxanne. The two became inseparable and, as they grew older, their love for one another moved beyond familial.Naomi Kale returned to spy on John; while glad to see him grow into a happy young man, she still feared he might eventually succumb to the family curse. Naomi bargained with Mephisto to spare John, hoping this might end the curse. Unfortunately, Mephisto betrayed her in the final moments of her life, swearing that even though Johnny would not become the true Ghost Rider, he still could become \"a\" Ghost Rider.Unaware of the mystical forces swirling around him, John followed the Simpsons into their own traveling stunt show - the Crash Simpson Stunt Cycle Extravaganza. Crash had become a true father figure to Johnny by this time, teaching him how to ride in the hopes that the younger man might eventually succeed him as the star of the show. This dream came to a fiery end when Johnny was fifteen. While practicing a dangerous stunt, Johnny was nearly killed and Mona Simpson was mortally wounded. When Mona asked John on her deathbed to quit riding, he swore to her that he would.Over the next five years, Johnny's relationship with Crash deteriorated as John refused to take part in the show. Not understanding John's motivations, Crash grew increasingly frustrated, even accusing his adopted son of cowardice; however, John continued to practice at night, honing his skills until he surpassed his mentor. He had another secret, too: he and Roxanne had become lovers. When Crash revealed he was dying of cancer, he asked Johnny once more to take over the show, but Johnny refused despite Roxanne's disappointment. Distraught, John turned to the occult in search of answers. His studies ultimately led to a spell that supposedly could summon Satan himself. John didn't realize it, but the entity he summoned was actually the same Mephisto who had cheated Naomi Kale years before. Mephisto cured Crash of his cancer in return for Johnny's promise of servitude. Crash died almost immediately afterwards, however, in a failed attempt to set a world's record by jumping over 22 cars. Despairing over the loss of his adopted father, Johnny attempted - and made - the jump himself, seeking to honor Crash's memory. Johnny was still at Mephisto's mercy, though, and would have lost his soul outright if not for the heroic intervention of Roxanne, who proclaimed her love for Johnny and drove the demon away with the purity of her emotion (though Mephisto would return).John and Roxanne then journeyed into the American Southwest, where Ghost Rider battled the Satanist known as Witch Woman, Linda Littletrees. Remaining for a time near Copperhead Canyon, Ghost Rider also fought Daimon Hellstrom, the Son of Satan. This began a long period of roaming the West, as John sought to avoid Mephisto and protect Roxanne. While in San Francisco, Roxanne was tricked into renouncing her love for John, and Mephisto nearly claimed John's soul in full; however, a long-haired stranger saved the day, driving Mephisto away at the last minute. This bearded mystery man identified himself only as \"a friend\", and Blaze came to view him as a heavenly figure, offering hope and salvation. This stranger would appear several more times before finally being revealed as another falsehood of Mephisto.Discouraged over the revelations about the \"friend\" and fearing his growing lack of control over the Ghost Rider, John left Roxanne and spent years wandering on his own. During this time, he teamed with the Black Widow, Angel, Iceman and Hercules to foil one of Pluto's evil plots, and the five heroes founded the Champions. Though billed as \"super heroes for the ordinary man\", the Champions were beset by internal tensions and never truly gelled as a team. After a few months, Ghost Rider realized that he was too much of a loner to remain with the group and he bid them farewell when the Champions disbanded.By this time, the demonic half of the Ghost Rider was exerting more and more control over his actions and personality. John found it increasingly difficult to continue his stunt rider career, surrendering the title of World Champion Stunt Rider after losing a series of grueling challenges to Flagg Fargo. A demoralized John found a sense of peace by joining the Quentin Carnival, a place he did not remember from his childhood, but which nevertheless felt like home. Blaze forged a friendly rivalry with fellow rider Red Fowler and engaged in harmless flirtation with Cynthia Randolph, a journalist for Woman magazine assigned to follow the Carnival. While traveling with the Carnival, John also ran afoul of the mad Centurious, who fed off imprisoned souls using an ancient artifact called the Crystal of Souls; this encounter stirred dark memories in the Ghost Rider. Shortly thereafter, the demonic Nightmare captured John and revealed the name of the demon within Blaze: Zarathos.Blaze and Zarathos continued to struggle with each other for dominance until Roxanne Simpson returned, seeking aid for a town overrun by Centurious and his agent, the Sin-Eater (Ethan Domblue). Ghost Rider clashed once more with Centurious, learning that he and Zarathos had a feud going back centuries. In the end, Zarathos and Centurious were bound within the Crystal of Souls and John Blaze was free at last. With a gracious donation from his old friend the Angel, John was able to purchase the Carnival and marry Roxanne, with whom he had two children, Craig and Emma.Years later, John heard about a new Ghost Rider in New York. Fearing Zarathos was free, Blaze captured the Dan Ketch Ghost Rider, but soon realized the entity within Dan was not Zarathos. During their clash, a burst of Ghost Rider's Hellfire was conducted through Blaze's shotgun into John himself, who discovered he could now discharge Hellfire from the weapon. Armed with this shotgun and a mystical motorcycle, John became a mentor of sorts to the new Ghost Rider, trying to guard Dan against evil forces.Against his wife's wishes, John was immersed in the supernatural again. When he allied himself with the Midnight Sons against Lilith, Mother of Demons, the Carnival became a target for John's enemies. It was attacked by Vengeance, who blamed John for having ruined his father's career. John and the Midnight Sons later thwarted an alliance between Centurious and Lilith, though their schemes led to the return of Zarathos. When Centurious's agent Carver tried to remove a Medallion of Power fragment from Blaze by slashing him, Blaze's wounds burnt with Hellfire, and he was encased in a cybernetic shell to save his life. Shortly thereafter, the Blood known as Caretaker revealed that John and Dan were brothers, strengthening their bond further. Together, they helped destroy Zarathos' physical form, though Dan was temporarily lost.Starting over, John found a new job as an accountant and a new girlfriend, Chloe; but he was still linked to Zarathos, and the demon began to reconstitute within him. Regularly transforming into Ghost Rider again, John quit his job and hit the road. However, the reborn Ghost Rider's personality was different than before, less talkative and more indifferent to the welfare of innocent bystanders. Desperate to escape this renewed curse, John hired mercenary Gunmetal Gray to kill Ghost Rider, whom Gray pursued with malicious glee. Finally cornered at the Sturgis biker convention, John Blaze and Zarathos seemed to make peace with one another and merged in a new way, defeating Gray. Ghost Rider rode off into the sunset, seeking more innocents to avenge.Ghost Rider was eventually cast back into Hell where Lucifer plotted to allow Blaze to escape and unknowingly pull the devil out into the mortal world with him. Once there, Lucifer's body was separated into 666 pieces, and those slivers of his essence would reanimate random corpses of the recently deceased. Each time Ghost Rider destroyed one avatar, its power would be divided to the rest. It was Lucifer's hope that Blaze would destroy every piece of him until only one remained with enough power to bring Hell to Earth.  Ghost Rider, during his hunt, encountered others such as Doctor Strange and Numecet that warned him of the consequences should Lucifer become whole again, but Ghost Rider was determined to kill every tainted piece of his tormentor. Blaze even found himself in Sleepy Hollow, Illinois fighting Lucifer in the form of a deceased Jack O' Lantern. After defeating Lucifer and his zombie army, with the help of a local sheriff, Blaze forced the Ghost Rider entity to go to New York and help the other heroes oppose the Hulk during the war he waged in Manhattan. With Blaze in control, the Hulk had no trouble defending himself, but once Ghost Rider exerted his control over Blaze, the Hulk almost a fight on his hands. However, Ghost Rider only avenges the innocent, and he did not deem the members of the Illuminati blameless for what they did to the Hulk. Ghost Rider left Manhattan immediately and resumed his search for the last remaining avatars of Lucifer. Blaze eventually did what he said he would and drove the devil back to Hell, but the effort cost him the life of a friend and lover in the form of a trucker named Dixie.Just because Lucifer was conquered, it didn't mean life would get any easier for Ghost Rider. With the devil's defeat, came the revelation of who was really behind Blaze’s suffering. The devil had help in the form of an angel – a rogue angel by the name of Zadkiel. Zadkiel and his minions waged war in Heaven because Zadkiel thought he could prevail where Lucifer had lost. Only thing was Zadkiel bonded Heaven’s greatest weapon to the soul of Johnny Blaze which also became Johnny’s curse. Now Blaze is on a mission to hunt an angel, and pay him back for ruining his life. Ghost Rider’s hunt for Zadkiel brought him to a place in Montana called New Beulah where Zadkiel's earthly servants, the Cycle Nurses almost put a premature end to the Spirit of Vengeance’s plans. Not only that, but a horde of flesh eating ghosts almost made a meal out of Blaze, but nothing would deter him from his goal. Ghost Rider did away with both threats, but he didn’t know about the one person from his past that would come back into his life as a possible enemy – Daniel Ketch, the other Ghost Rider. Johnny then broke into a maximum security penitentiary where he thought he could find answers on how to make it to Heaven to face Zadkiel, but all Ghost Rider found was another enemy in the form of the Deacon. Although quite formidable, the Deacon was defeated, but Blaze wasn’t out of the woods yet. He was closer to Zadkiel than he’d been before, but now he would have to get through his brother, Daniel, to get to the rogue angel.Daniel Ketch, a former Ghost Rider on the right side of justice, was now a servant of Zadkiel's, and he was hunting other Spirits of Vengeance throughout the world. He was hunting and killing them, so Zadkiel could have their power as his own. Ketch even  allied himself with Ghost Rider’s enemies. Blackout, Death Ninja, Doghead and the Orb paid Caretaker a visit with a tragic ending. Caretaker was killed, but his granddaughter, Sara took his place as the new Caretaker. Blaze eventually caught up with Daniel in Tibet, but not before Ketch could take the life of another Ghost Rider. Blaze confronted Daniel, and the resulting fight left Blaze begging Danny to end his burden and take away the curse of the Ghost Rider. Much to Daniel's frustration, Sara would not let this happen. Wallowing in self-pity, Blaze began to think Daniel was right in his actions. However, two more Spirits of Vengeance, Molek and Bai Gu Jing, came to Blaze and forced him to take a trip with them. The first stop was Tokyo, Japan where another Ghost Rider, Yoshio Kannabe was stationed. The group arrived too late to help their mystical brother-in-arms, however, for they found Yoshio terrified and defeated, the Ghost Rider entity no longer within his body. Blaze then accompanied his associates to the Congo where Baron Skullfire and Marinette Bwa Chech were waiting. These were the last two remaining Ghost Riders, and they were eager to bring Zadkiel to his knees. Unfortunately, Ketch and the Black Host proved to be too strong for even their combined might. Ketch stole all the Ghost Rider powers from everyone, including Blaze, and delivered them to his master. Zadkiel revealed he was playing Ketch for a fool and cast him out of Heaven, so Daniel took back as much power as he could - keeping some for himself and giving some back to Blaze. Sara and Blaze went their separate ways, and Blaze all but gave up on himself and Heaven. His travels led him to a small town under siege by a demon calling herself the Skin-Bender. Blaze was immune to her maniacal manipulations because of the power of the Ghost Rider, and once unleashed, the Skin-Bender didn't stand a chance. Ghost Rider defeated the monster and reunited with Sara. Blaze had to be reminded where the souls of his deceased children were before he decided to renew his war with Zadkiel and retake Heaven.", 
    "durability": 7, 
    "education": "High-school graduate", 
    "energy": 6, 
    "eyes": "Blue (Blaze), flaming red (Ghost Rider)\n", 
    "fighting": 4, 
    "firstappearance": "Marvel Spotlight #5 (1972)\n", 
    "groupaffiliation": [
        "None", 
        "Formerly the Midnight Sons", 
        "Nine", 
        "Champions", 
        "Legion of Monsters"
    ], 
    "hair": "Reddish-blond (Blaze), none (Ghost Rider)\n", 
    "height": 70, 
    "id": "Ghost_Rider_(John_Blaze)", 
    "identity": "Secret", 
    "intelligence": 3, 
    "knownrelatives": "Roxanne Simpson Blaze (wife), Craig Blaze (son, presumed dead), Emma Blaze (daughter, presumed dead), Barton Blaze (father, deceased), Naomi Kale (mother, deceased), Craig \"Crash\" Simpson (adopted father, deceased), Mona Simpson (adopted mother, deceased), Barbara Ketch (sister, deceased), Dan Ketch (half brother), Andrew Kale (cousin, deceased), Jennifer Kale (cousin), Joshua Kale (grandfather, deceased), Illyana Kale, Noble and Pastor Kale, Magdalena (ancestors)", 
    "occupation": [
        "Unemployed", 
        "former stunt cyclist", 
        "accountant and various other odd jobs"
    ], 
    "origin": [
        "Marvel Spotlight #5 (1972)", 
        "Ghost Rider #76-77 (1983)"
    ], 
    "placeofbirth": [
        "Waukegan", 
        "Illinois"
    ], 
    "powers": "Ghost Rider has superhuman strength and durability, as well as the ability to project and control Hellfire, which can sear the soul as well as burn the flesh. He can shape his Hellfire into a mystical motorcycle capable of traveling over water and up vertical surfaces. He is also immune to any mystical attacks that are specific to beings with living souls.", 
    "realname": "Johnathon \"Johnny\" Blaze", 
    "significantissues": [
        "Shared his secret identity with Roxanne (Marvel Spotlight #6, 1972)", 
        "joined Champions (Champions #1, 1975)", 
        "raced against Death (Ghost Rider #35, 1979)", 
        "first encounter with Centurious (Ghost Rider #74, 1982)", 
        "freed from Zarathos (Ghost Rider #80-81, 1983)", 
        "met Daniel Ketch (Ghost Rider #14, 1991)", 
        "learned of sibling relationship to Daniel and the full truth about Zarathos (Ghost Rider #43, 1993, Spirits of Vengeance #16, 1993)", 
        "Roxanne slain by Hellgate (Ghost Rider #50, 1994)", 
        "rescue children form Ba'al (Blaze #12, 1995)", 
        "learned the truth about the Kale family curse (Ghost Rider #77-78, 1996)", 
        "secrets behind Naomi Kale's life revealed (Ghost Rider #-1, 1997)", 
        "headed out on the open road as the Ghost Rider once more (Ghost Rider #1, 2001)"
    ], 
    "speed": 2, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 180
}