{
    "aliases": "Zero", 
    "citizenship": "Citizen of the United States of America", 
    "content": "Zero found his consciousness floating in a hidden part of cyberspace called the Ghostworks, where a group of beings with an agenda for the human race had taken him.  In order to fight the corruption of society and further their plans, they rebuilt Zero into a carbon steel, android body, and infused him with powers and the mantle of the long-vanished Ghost Rider.  They also edited out parts of Zero’s personality in order to keep him docile but gave him the illusion of free will.The new Ghost Rider’s first act was to track down his killers, and before he mutilated Jeter by removing his bionic appendages, he found that D/Monix had set him up to be attacked.  Further bloody investigating led him to discover that his own father, Harrison Cochrane, through his place in the D/Monix company, ordered the attack on his son.  In order to end the threat of the Ghost Rider, D/Monix rebuilt Zero’s only living cohort in the theft, Warewolf, into a giant wolf robot to fight him, but instead the police intervened and killed the Warewolf.When the Ghost Rider came to rescue his ex-girlfriend Kylie Gagarin he found that she was in a form of coma and wouldn’t come out.  The underground doctor, Sandoz, helped the Ghost Rider fix his ex-girlfriend, but needed a series of chemicals to bring her out.  The hunt for the chemical brought the Ghost Rider up against 2099’s Spider-Man,  but they parted as confused rivals and the Ghost Rider returned with the cure.  Unfortunately, the cure wasn’t enough, and Ghost Rider was forced to enter Kylie’s mind in order to bring her out.  Finding out that her hatred for Zero kept her in a memory loop, he freed her, and they also parted ways, both thinking ill of the other.A new governmental enforcer, Coda, then appeared, coming after the Ghost Rider and destroyed his physical, android body in a fight.  It was then that Zero learned that his body was able to repair itself, and afterwards he is sent for by the new President of the United States, Doctor Doom, who came to power through a deal with the residents of the Ghostworks.  Then, using codes given to him by the Ghostworks, Doom rearranged the Ghost Rider’s programming and controlled him as well, making him his willing Federal Marshal, in order to keep the peace in a further-disintegrating society.During this time the Ghost Rider fought a series of villains.  First, a rich woman named Diana J. Matlin, who, along with her friends in the Pioneer Society, used remote controlled predator robots to murder people for sport.  Secondly, the femme fatale Heartbreaker, a woman who cut out men’s hearts, whose face the Ghost Rider tore apart, forcing her to wear a mask over the damage side.  Later, the Ghost Rider fought the Ghostworks first avatar, a being called L-Cypher, who turned a group of normal humans into beasts like him to fight the Ghost Rider.  These creatures captured the Ghost Rider, but while L-Cypher tortured him, the Ghost Rider managed to hack into the place L-Cypher built for his playground, and seemingly killed him.  Whereas, in reality, L-Cypher downloaded his consciousness into a human body and escaped unnoticed.When Doom’s reign as President fell apart the Ghost Rider’s memory was restored, including what Doom had programmed into him, as well as the changes that the Ghostworks had made.  The Ghost Rider traveled to Anesthesia Jones’ bar trying to find someone to help him restore his failing power.  There he met Vengeance (2099), an ex-cop murdered by the Ghost Rider, named Colt Wagner, who was infused with stolen adamantium and rebuilt into an android body.  Vengeance attacked the Ghost Rider, but when he found that the Ghost Rider was the Federal Marshal, making Vengeance a criminal for fighting him, his computer logic couldn’t take it and he collapsed.  The Ghost Rider then promptly quit his job as Marshal and ran to find someone else to help him who hadn’t abandoned him during his own corruption by authority.The Ghost Rider finally ran to the hacker Doctor Neon for help, ignorant of the fact that a mysterious being was working with Neon to destroy the Ghost Rider.  With Ghost Rider’s permission, Neon rebooted him, restoring much of his missing programming.  Then the Ghost Rider awoke, going insane with his new knowledge, before being shut back down.  It was revealed that the person helping Neon was actually the original Zero, or the “source code,” and that the Ghost Rider was a copy made by the Ghostworks.  The real Zero took control of Ghost Rider’s body, and left the copy trapped in Neon’s computer.  His next step was to revenge himself on D/Monix.Anesthesia had already gathered together a group of people in order to mount an attack on the D/Monix building, including Kabal and his mercenaries, Neurodancer, Ice 9, Warp Angel, as well as Willis Adams, an honest reporter who had dealt with the media corruption before quitting when Doom came to power and wanted him to write propaganda, and finally the Ghost Rider himself.  So while the rest of the group snuck into the lower levels of the building to plant a bomb, the Ghost Rider distracted his father and Kellerman, the head of D/Monix, long enough for the bomb to finish its work, demolishing the entire building.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "Ghost Rider (2099) #1\n", 
    "groupaffiliation": "Former Federal Marshal for the government", 
    "hair": "None (flames)\n", 
    "id": "Ghost_Rider_(2099)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Harrison Cochrane (father), Shinobu Cochrane (mother)", 
    "occupation": "Hacker/Data Thief", 
    "origin": "Ghost Rider (2099) #1", 
    "placeofbirth": "Transverse City", 
    "powers": "None", 
    "realname": "Kenshiro Cochrane", 
    "significantissues": "Ghost Rider (2099) #1 (origin), Ghost Rider (2099) #25 (final issue)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}