{
    "aliases": "None", 
    "citizenship": "Shi'ar Empire", 
    "content": "The Guard and the X-Men subsequently clashed once more when the Shi'ar sought to end the threat to the universe posed by the cosmic entity known as the Phoenix, which had assumed the form of X-Men member Jean Grey.  As praetor of the Guard, Gladiator was an obvious choice to be one of eight Guardsmen chosen to battle the X-Men.  The Guard defeated the X-Men on this occasion, but the mutants were allowed to return to Earth after Phoenix seemingly committed suicide.Gladiator was later amongst those few Imperial Guard members who opposed the treacherous Shi'ar High Council member Lord Samédàr who was aiding an attempted coup of the Shi'ar throne by Deathbird.  Even after many of the Guard chose to side with Samédàr, Gladiator remained steadfast in his loyalty to then-Empress Lilandra.Later, Gladiator travelled to Earth in an effort to capture a spaceship of renegade members of the shape-changing alien Skrulls. Mistakenly thinking the Skrulls had disguised themselves as members of the world-famous Fantastic Four, Gladiator attacked and defeated the super-hero family.  When the Skrulls, posing as X-Men, then appeared, Gladiator was irritated on having his \"friends\" attack him.  Together with the help of the web-slinging Spider-Man and the super-soldier named Captain America, the Skrulls treachery was exposed and they were quickly captured by Gladiator.When the formerly-exiled Deathbird had usurped the Shi'ar throne from her sister Lilandra in a successful coup, Gladiator was forced to swear fealty to his new empress, even though his loyalties still lay with Lilandra.  However, Gladiator's sense of duty saw him continue to serve as the Guard's praetor, despite his personal feelings about his new empress.Soon after, when a member of an alien race that had been forced to join the Shi'ar Empire came into possession of armor belonging to the Spaceknight of Galador, the Imperial Guard mistakenly attacked the Spaceknight named Rom.  After the misunderstanding was made clear, Rom and Gladiator teamed up to face the culprit, and Gladiator came to realize that even though the Shi'ar provides their conquered species with everything, they lack one important thing - freedom.Gladiator subsequently led the Imperial Guard against the British team of costumed adventurers known as Excalibur and the team of interstellar freebooters known as the Starjammers over the fate of the then-bearer of the cosmic Phoenix Force, the alternate future daughter of the X-Man Jean Grey named Rachel Summers, whose power Deathbird sought for herself.  After Deathbird was struck down whilst siphoning Phoenix's power, Gladiator ordered the Guard to retreat, thus robbing Deathbird of the chance to become supremely powerful.Much later, the intergalactic teleporter Lila Cheney transported the X-Men to the Shi'ar Empire at the behest of then-Empress Deathbird in time to see Lilandra regain her throne.  Not all was as it seemed, however, as in reality a group of Warskrulls, using technology to allow them to duplicate superpowers, had captured and impersonated Xavier, using his telepathy to control Lilandra and the Imperial Guard, including Gladiator.  After the ruse was discovered by the X-Men and all the Warskrull impostors were exposed, Lilandra settled matters with Deathbird, discovering her sister did not want the throne anymore.During the war between the Shi'ar and Kree Empires, Gladiator sought to stop the team of super-powered Earth beings known as the Avengers from becoming embroiled in the conflict.  He clashed with both the ionic energy-powered Wonder Man and the Norse god of thunder, Thor.  However, Gladiator had met his match with Thor, who brutally rendered Gladiator unconscious and then hurled him through one of the Shi'ar's transportational stargates, sealing it behind him.When Lilandra learned of the many Earth heroes that had sacrificed their lives to stop the malevolent psionic being named Onslaught, she dispatched eight members of the Imperial Guard, including Gladiator, to protect Earth.  While on Earth, the Guard uncovered a plot by a militant Kree faction to simulate a radical political activist group in revenge for Earth's involvement in the Kree/Shi'ar war.  In reality, the group created a \"nega-reactor\", similar to the bomb that was used on the Kree.  However, this plot was stopped by the Guard, but not before the reactor was used by the Kree's leader, the Supreme Intelligence, to re-incorporate itself after being presumably killed at the end of the war.During their brief stay on Earth, Gladiator and his fellow Guardsman Oracle learned that a fugitive from Shi'ar justice was hiding on the planet, stuck in the form of a child and with no memory of his former life.  Their search brought them into confrontation with the gamma-spawned man-beast known as the incredible Hulk.Subsequently, Gladiator was amongst those Imperial Guard members who defended Lilandra against an assassination attempt by the Kree Ronan the Accuser and his unwilling agents, the royal family of the Earth race known as the Inhumans.After his Empress Lilandra, under the mental control of Charles Xavier's mutant twin sister Cassandra Nova, had ordered the destruction of all mutants on Earth, Gladiator led the assault team that attacked the X-Men's mansion home. Defeating both Wolverine and the Beast, Gladiator was halted by the arrival of his fellow Guardsman Smasher who managed to convince the Guard of the true threat.  Together, the Guard and the X-Men managed to defeat Nova and free Lilandra.", 
    "durability": 6, 
    "education": "Unrevealed", 
    "energy": 6, 
    "eyes": "Blue\n", 
    "fighting": 6, 
    "firstappearance": "X-Men #107 (1977)\n", 
    "groupaffiliation": "Imperial Guard (praetor/leader)", 
    "hair": "Dark blue\n", 
    "height": 78, 
    "id": "Gladiator_(Kallark)", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Xenith (cousin)", 
    "occupation": "Peacekeeper", 
    "placeofbirth": "Unrevealed planet in the Shi'ar Galaxy", 
    "powers": "Gladiator is an alien possessed of numerous abilities, first and foremost being his extraordinary strength.  Whilst the uppermost limit of his strength is unknown, Gladiator has proven able to lift over 100 tons in weight.  He once lifted the entire 35 floor Baxter Building in New York City, and has boasted of being able to move whole planets.  In addition to his strength, Gladiator is virtually invulnerable to the point where he has survived an explosion of nearly nova force completely unharmed.  He is, however, vulnerable to certain unspecified wavelengths of radiation.\nGladiator can fly at speeds rivaling those of starships, and can achieve faster-than-light speeds in hyperspace.  He can survive unprotected in the vacuum of outer space, being able to go long periods of time without needing to draw breath.  Thanks to his incredible lung capacity, Gladiator is also able to draw in large amounts of air and then expel it all to create a gale force wind.  Gladiator can also project intense beams of heat from his eyes that can reach temperatures comparable to those produced by stars, as well as microscopic vision that lets him see beyond the sub-atomic barrier.\n\nMuch, if not all of Gladiator's abilities are entirely dependent on his level of self-confidence.  The more confident he is in being able to complete the task at hand, the more powerful he becomes.  Consequently, if Gladiator ever has the slightest hint of doubt that he is unable to accomplish something, then his powers quickly weaken.", 
    "realname": "Kallark", 
    "speed": 6, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 595
}