{
    "add": {
        "doc": {
            "aliases": [
                "formerly the Golden Brain", 
                "\"Joe\""
            ], 
            "citizenship": "U.S.A.", 
            "content": "For Joe Timms, a petty criminal, the legend proved to be true. While Timms was serving a sentence in the Florida Penal System, he received news his wife was dying. He asked for an early release, but when he was denied, Timms decided to escape. Pursued by the authorities, Joe went into the Everglades to elude them, but he fell into the swamp and was sucked under. Decades later, the behemoth known as the Hulk accidentally dumped some toxic waste into the same swamp that held Joe's body, and the monster called the Glob was born.The Glob left the swamp, the last memories of Timms' still on its mind, and when it laid eyes on Betty Ross, it mistook her for his long-dead wife. The Hulk attempted a rescue, but the Glob proved to be too powerful a foe. The muck monster returned to the swamp with Betty, but once it realized the toxic chemicals in the Everglades would kill her, the Glob held her high enough above the waste for the Hulk to save her. Sometime later, the Leader learned of the Glob's existence and believed it was the only being that could defeat the Hulk. Using a machine of his own design, the Leader resurrected the Glob and set it loose against his archenemy. The only way the Hulk could beat the Glob was to hurl it into a dynamo that exploded it into millions of tiny particles.The creature began to reform, but the process was so slow it began to die. A man named Yagzan, leader of the Cult of Entropy, found the Glob and removed its brain, linking his own mind to it. He called it the Golden Brain, but he lost possession of it during a fight with the Man-Thing. The brain sank into the swamp, eventually growing a new body of a handsome man. Calling itself \"Joe\", the Glob tried to have a normal life until Yagzan found him and devolved him into a clay-like being. The Man-Thing found Yagzan again and tore the Glob apart, but when Yagzan used his mind control over the creature to attempt another reformation, the clay engulfed Yagzan's body - killing him.\"Joe\" eventually reformed and found Bruce Banner in the swamp. An Elder of the Universe attacked them and changed the Glob back to its muck form while forcing the Man-Thing to fight the Hulk. This time the Glob found himself allied with his former enemies as the Collector captured them for his cosmic zoo. The Man-Thing and Glob were the first to escape their bonds, and the two provided a distraction, allowing the Hulk to break free, foiling the Collector's plans.", 
            "durability": 1, 
            "education": "High school dropout", 
            "energy": 1, 
            "eyes": "(Timms) Brown; (Glob) Brown\n", 
            "fighting": 1, 
            "firstappearance": "Incredible Hulk #121 (1969)\n", 
            "groupaffiliation": "Formerly Howling Commandos", 
            "hair": "(Timms) Brown; (Glob) None\n", 
            "height": 0, 
            "id": "Glob_(Joseph_Timms)", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Leeora (wife, deceased)", 
            "occupation": [
                "Former soldier", 
                "professional criminal"
            ], 
            "origin": "Incredible Hulk #121 (1969)", 
            "placeofbirth": [
                "Miami", 
                "Florida"
            ], 
            "powers": "The Glob is a creature more powerful than the Hulk – both in strength and durability. This monster cannot feel pain, and since its body is composed almost entirely of muck, even the mightiest of blows will simply sink into its body. The Glob can reform itself even after being torn apart, although it is a slow process, but the pieces that couldn't make it back to the whole would die off.\n\n\nAs the Golden Brain, Timms' brain could somehow create electrically-charged duplicates of its Glob form. It could also control nearby soil, including using it to create a new body for itself. In this second form, the Timms Glob was comprised of Timms' brain and a mass of clay-like mud. While made up of a different composition, it retained many of the same attributes of the original body and could sometimes alter its appearance.", 
            "realname": "Joseph Timms", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 187
        }
    }
}