{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Attilan", 
            "content": "There, he discovered the Human Torch alongside his cousin, Crystal, who believed Johnny to be a fellow Inhuman. Gorgon and Triton then attacked the Torch and he escaped through the roof to alert the rest of the Fantastic Four. Together the Inhumans, led by Black Bolt, battled with the four until Crystal announced that Triton had been taken by the Seeker, who had been sent to bring them all back to Attilan. Black Bolt then commanded Lockjaw to transport them, and they disappeared off the rooftop, with the Torch and Crystal trying to stay together but being torn apart.They appeared back in Attilan, where Maximus explained that he had Gorgon bring Medusa back to be his queen. Gorgon apologized and claimed ignorance of Maximus' motives. Then, Maximus taunted Black Bolt with his stolen crown until Black Bolt tore it from his hands by force, reclaiming the leadership of the Inhumans. But soon the Fantastic Four appeared, having followed the Seeker back to the refuge, and argued with Black Bolt, telling him that he and the Inhumans should rejoin the human race. While they discussed it, Maximus set off his atmo-gun and intended to destroy all the humans on the planet. Yet when it failed to work, as evidenced by the Fantastic Four’s survival, Medusa deduced that it proved the Inhumans were of the same race as humans. This infuriated Maximus and he reversed his machine, creating a Negative Zone around Attilan that trapped the Inhumans inside, which the Fantastic Four narrowly escaped.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "Fantastic Four #44\n", 
            "groupaffiliation": "None", 
            "hair": "Brown\n", 
            "id": "Gorgon_(Inhuman)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Korath (father), Milena (mother), Black Bolt, Medusa, Crystal, Karnak, Triton (cousins)", 
            "occupation": "Member of the Royal Family of the Inhumans", 
            "placeofbirth": "Unrevealed", 
            "powers": "Gorgon's legs are thickly muscled, allowing him to do massive damage by kicking something or someone, or he can use them to create seismic shocks by stomping the ground.", 
            "realname": "Unrevealed", 
            "significantissues": "Fantastic Four #44 (intro)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}