{
    "aliases": "None", 
    "citizenship": "Canada", 
    "content": "Graviton attempted to find a female companion by taking a New York department store hostage and levitating it above the skyscrapers. This caught the attention of Thor and during the battle, Graviton was exiled in a dimensional void by Thor. For months he drifted in a state of suspended animation until a sudden influx of energy released a bizarre construct passing through the void at the time, which would soon become the creation of the mysterious Beyonder. Graviton's consciousness was restored and he was able to home in on the charging field used by the criminal Blank and returned to Earth.Setting up a base of operations in Los Angeles, Graviton attempted to unite all of the criminal mobs under his leadership, but was thwarted in the attempt by the newly-formed West Coast Avengers. Almost immediately afterward, Hall escaped from custody and formed a group of villains based on the four 'Fundamental Forces' with the villains Halflife, Quantum, and Zzzax. Although he temporarily defeated the West Coast Avengers once more, he was eventually thwarted when the Avenger Tigra turned the villains against each other, and Hall's floating island shot into the atmosphere.Hall again returned to battle the Avengers in revenge, but during the battle the Vision merged his intangible android body with Hall's, then increased his density, causing Hall's density to collapse in on itself. Hall was thus shunted from reality, finding himself in another dimension. The natives of the dimension, which Hall named the P'Tah, hailed his arrival as one of a god's, and Hall used this to his advantage, although their limited intelligence soon left frustrated. Using his scientific abilities, he constructed a beacon so that someone might find and rescue him.After many months, Hall's signal was noticed by the robotic Techno, who at the time was working with the Baron Zemo. At Zemo's direction, Techno reconfigured a robotic version of the Hulk, and Zemo set the robot Hulk against his former lackeys, now the hero team Thunderbolts, who fought the Hulk-bot. The battle allowed the robot to siphon and store enough energy to breach the dimensional barriers and release Hall. Not caring about the particulars of his rescue, Hall lashed out at the Thunderbolts and the Great Lakes Avengers (then, the Lightning Rods) who were on the scene. He was about to kill them all when the Thunderbolt Moonstone convinced Hall that his power and ambition meant nothing if he had no goals. Losing face, Hall left the scene to think about this fact.Hall soon returned, commanding a large mass of floating land and declaring himself ruler of a new nation, Sky Island. He recruited his subjects, dubbed Sky Raiders, and a harem in return for granting them the power to defy gravity, and they began to loot and pillage San Francisco, California. He was again opposed by the Thunderbolts with their erstwhile ally, Archangel, and he summarily defeated them all. They were freed by the Thunderbolt Jolt, who borrowed technology derived from Machine Man, whose flight capabilities were powered by \"canceling out the gravity equation.\" Now unaffected by Hall's power, the Thunderbolts escaped and continued to battle, ultimately canceling out Hall's access to his power. When Hall regained his power, the gravitational force rushed inward, collapsing inward on himself once again, and Hall was shunted to another dimension like before.There, Hall was rescued by a mysterious stranger, a representative of the P'tah known as M'Reel, and both came to Earth. M'Reel encouraged Hall to begin discovering his true calling, and Hall recruited Moonstone of the Thunderbolts for help, still spurred by her accusations of thinking too small. Moonstone helped Hall to further refine his godlike power and fueled his ego, thinking that by so doing, she would be better able to manipulate him for her own ends. Instead, Hall embarked on an ambitious plan to capture every major world city, hold the world's heroes captive, and literally reshape the planet in his own image.Also bent on revenge, Hall confronted the headquarters of the Thunderbolts, although the team at this time had disbanded and been replaced by the Redeemers. The Redeemers opposed Hall and were killed, except for the Fixer, who joined Moonstone alongside Hall, and Citizen V, who recruited the remaining Thunderbolts to confront Hall. Through a mixture of surprise tactics and negotiation, all of the Thunderbolts managed to fight Hall to a standstill, and Hall sustained fatal injuries as a result. At this time, Fixer discovered M'Reel was surreptitiously using Hall's ambient energies, funneling them in order to open a portal to the P'Tah's dimension. M'Reel succeeded in opening the portal, revealing this to be his motives in helping Hall. The Thunderbolts fought back the P'Tah invasion, but it took Hall's dying effort to cause the portal to implode, sending himself and the P'Tah back. At the same time, Hall attempted to save the Thunderbolts from a similar fate, using his powers to send them to the planet known as Counter-Earth. Hall was presumed dead, unable to survive his injuries and the dimensional fold.", 
    "durability": 6, 
    "education": "Ph.D. in physics", 
    "energy": 7, 
    "eyes": "Blue-Gray\n", 
    "fighting": 2, 
    "firstappearance": "Avengers #158 (1977)\n", 
    "groupaffiliation": [
        "(Formerly) leader of the Sky Raiders", 
        "leader of a group consisting of Halflife", 
        "Quantum", 
        "and Zzzax"
    ], 
    "hair": "Black with streaks of gray\n", 
    "height": 73, 
    "id": "Graviton", 
    "identity": "Publicly known", 
    "intelligence": 4, 
    "knownrelatives": "None known", 
    "occupation": [
        "Criminal", 
        "former physicist"
    ], 
    "origin": "Avengers #158 (1977)", 
    "placeofbirth": [
        "Banff", 
        "Alberta", 
        "Canada"
    ], 
    "powers": "Frank Hall has the superhuman ability to control gravitation. His power is so great as to nearly be immeasurable. He can increase and decrease gravity to a nearly unlimited number of objects at the same time, even while distracted. He has proven to control the gravity around objects of any mass, even particles of energy and objects slightly out of phase with reality. He can cause enough force to hold down the Asgardian god Thor. He can also form gravitic force bolts and force fields.", 
    "realname": "Franklin Hall", 
    "significantissues": [
        "defeated by the Avengers (Avengers #158-159, 1977)", 
        "battles West Coast Avengers (West Coast Avengers #2-4, 1984)", 
        "fought cosmic Spider-Man (Amazing Spider-Man #326, 1989)", 
        "teams with Goliath, Titania, Trapster and Brothers Grimm against Spider-Man (Web of Spider-Man #64-65, 1990)"
    ], 
    "speed": 6, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 200
}