{
    "add": {
        "doc": {
            "aliases": [
                "Iron Patriot", 
                "Overlord", 
                "the Goblin", 
                "the Goblin-Lord", 
                "\"Gobby\""
            ], 
            "citizenship": "U.S.A.", 
            "content": "Osborn changed tactics, and laid low while hiring Kraven the Hunter to attack Spider-Man. Over time, Osborn established a network of safe houses to store his Goblin equipment throughout New York City. Unaware of the Goblin's secret identity, Spider-Man protected an ungrateful Norman Osborn from the vengeance of Professor Stromm, released from prison. Devising a compound that weakened Spider-Man's spider-sense enabled Norman, aloft on an improved glider, to follow Spider-Man and witness him resume his civilian identity as Peter Parker, one of Harry's classmates. The Goblin confronted Spider-Man at his home in Forest Hills, captured him, and carried him to the Goblin's waterfront hideout at Osborn Chemicals. There the Goblin boastfully revealed to Spider-Man of his own secret identity and how he came to be. Spider-Man broke free, and in the ensuing battle, the Goblin fell back into live wires and vials of chemicals, leaving Osborn unconscious and amnesiac regarding his past few years and his criminal alter-ego. Spider-Man decided Osborn was rendered an innocent man, and burned his costume before police and firefighters arrived on the scene. The world believed the Green Goblin had perished. Subsequently, Osborn’s insane mind developed a dual-personality disorder, as traumatic events triggered a switch between being a memory-impaired kinder Norman Osborn, concerned about his relationship with his son, and the nefarious Green Goblin, aware of Spider-Man's secret identity.After Harry invited Peter Parker to live with him, Norman met Peter again, unaware of his dual identity. Released from prison and seeking his payment for services to the Goblin, Kraven sought Osborn after learning of the Goblin's apparent death and believing him to be the Goblin's \"emissary\". Kraven abandoned his violent pursuit and capture of Osborn after realizing Osborn was truly unaware of the Goblin; Spider-Man had to rescue a bound Osborn from plummeting to his death.Harry Osborn, Norman's son, had witnessed the apparent death of his father at the hands of Spider-Man and removed the Goblin costume before the authorities could arrive, thus preserving his secret identity. He even bribed the coroner so that further autopsy reports would show no mention of the \"goblin\" formula in Norman's blood. And for many years, the world believed Norman Osborn to be dead.After the apparent death of the Green Goblin, many tried to follow in his footsteps, including his son Harry, Harry's therapist Bart Hamilton and millionaire Roderick Kingsley who attempted to create his own variation and legacy on the Goblin motif as the murderous Hobgoblin. Each subsequent version of the Goblin was defeated and Harry eventually died as a result of exposure to an untested experimental version of the formula that had given his father his abilities. Little did anyone know that Norman Osborn was in fact alive and well and putting a master plan into place that he hoped would ruin Spider-Man forever.The same formula that had given Osborn his heightened strength and intellect also gave him powerful regenerative abilities, allowing him to survive the impalement by his goblin glider. He had escaped the morgue, replacing his body with that of a drifter he had murdered (and impaled through the chest) and fled to Europe. There he joined the Cabal of Scriers, eventually moving up in their ranks and completely taking them over. While in Europe, Osborn also manipulated Gwen Stacy's children into believing that Peter Parker was their father and had abandoned them and that Spider-Man had killed Gwen. Osborn also raised them to believe he was a loving and kind figure, preparing them to become his heirs. After the death of his son Harry, whom Norman believed would prove himself in his absence, Osborn accelerated a series of plans he had formulated over the past several years.From the shadows, Osborn manipulated Empire State University professor Miles Warren as part of a grand scheme to have Parker believe he was in fact a clone and that Ben Reilly (the real clone) was the real Peter Parker. However, with Peter's wife Mary Jane pregnant and the possibility of a life without Spider-Man on the horizon, Peter freely relinquished his alter-ego to Reilly. Unsatisfied with these results, Osborn returned as the Green Goblin revealing himself as the mastermind behind the entire fiasco and killed Ben Reilly who sacrificed himself to save Peter. Reilly's body disintegrated, proving that Peter was in fact the real Spider-Man all along. In addition, Osborn had an employee of his, Alison Mongrain poison Mary Jane inducing a premature labor, and causing an apparent miscarriage. When it became evident that Osborn was finished using Mongrain, she fled for her life revealing to the Parkers that Peter's Aunt May, believed to have died, was alive and held against her will by Osborn. In truth, the May Parker living with the Parkers had been an actress Osborn genetically altered into the likeness of May Parker. Mongrain was killed, and the entirety of her role in the miscarriage remains a mystery.Osborn's next grand scheme was to make Spider-Man his heir, first drugging him into wearing the Goblin costume and attacking his friends. After days of physical and mental torture at the Osborn Estate, Peter nearly gave in, but refused at the last minute. Next, the Goblin forced his employee Flash Thompson, a recovering alcoholic, to drive a truck while in an inebriated state into Midtown High School where Peter had taken a job as a teacher. The accident caused Flash brain damage, and spurred Peter into a no-holds barred battle with his old enemy. Although, it seemed that in some strange way Norman wanted Peter to finish him off, Peter refused saying he did not want to fight him anymore and declared a truce.Sometime later, Norman Osborn was finally revealed to the public as the Green Goblin and after an climatic battle with Spider-Man and Luke Cage that raged across Manhattan, he was finally imprisoned. However, things were far from over.However, a drugged Doctor Octopus intervened attacking the Goblin. Spider-Man was able to save Mary Jane after a bolt of lightning sent the two villains into the river. Osborn escsaped. Following some verbal clues from the Goblin, Peter was also able to discover where he had hidden Aunt May and rescued her as well. Peter then received a letter mailed by Osborn before the fight, thanking Peter for giving his life meaning and purpose.After Osborn was picked up by S.H.I.E.L.D. agents in France and returned to jail, the twins of Gwen Stacy resurfaced to destroy Spider-Man. They had rapidly aged to teenagers due their superhuman physiology inherited from their father, and had developed superhuman strength and endurance capable of combating Spider-Man. After the Goblin's takedown, the twins confronted Spider-Man, whom they believed to be their real father who had killed their mother and abandoned them. Spider-Man told the twins the truth - however Gabriel rejected Spider-Man, and accepted the Goblin mantle as the Gray Goblin, becoming insane in the process. After battling Spider-Man, a deranged Gabriel disappeared, while Sarah sought training to use her powers for good.The passage of the Superhuman Registration Act provided an opportunity for Osborn to offer his abilities for the good of the country. Injected with nanites by Tony Stark (Iron Man) capable of delivering a powerful shock should he go astray, Osborn was offered leadership of a new government sponsored Thunderbolts with a small army of superpowered evildoers as a temporary means to round up rogue heroes who refused to register. He would go from the Thunderbolts to leading his own team of Avengers, as the Iron Patriot, but the power went to his head. Feeling he was more important than even the President of the United States, Osborn led an unsanctioned siege on Asgard and was opposed by not only the Asgardians but every major unregistered hero he attempted to capture. He was exposed to the nation as a deranged criminal and was removed from power.Osborn was thrown into a classified prison called the Special Containment Center along with some of the most dangerous individuals on the planet. It was meant for him to rot there for the rest of his days, but a Goblin cult orchestrated a riot to free him. Osborn liberated others too and found new powerful allies: the South American chimera god, Ai Apaec, a demonic entity known as Kingmaker, the intangible killer \"Carny\" Rives, and a scientific genius wrapped up in the perfect form of the Toxic Doxie. During his escape, Osborn killed another inmate, Xirdal, an alien who accused him of being a psychotic murderer. Once back in the open, Osborn turned himself in just so he could be jailed at the Raft to await his day in court.", 
            "durability": 6, 
            "education": "College graduate", 
            "energy": 6, 
            "eyes": "Blue\n", 
            "fighting": 3, 
            "firstappearance": "Amazing Spider-Man #14 (1964)\n", 
            "groupaffiliation": [
                "Formerly H.A.M.M.E.R. (director)", 
                "Avengers (Osborn's team) (leader)", 
                "Thunderbolts (director)", 
                "Order of the Goblin (leader)", 
                "Cabal of Scrier (leader)", 
                "Sinister Twelve", 
                "Hellfire Club", 
                "Executives Club"
            ], 
            "hair": "Reddish-brown\n", 
            "height": 71, 
            "id": "Green_Goblin_(Norman_Osborn)", 
            "identity": "Publicly known", 
            "intelligence": 6, 
            "knownrelatives": "Emily Osborn (wife, deceased), Harold \"Harry\" Osborn (son), Sarah Stacy (daughter), Gabriel Stacy (son), Liz Osborn (daughter-in-law), Norman \"Normie\" Osborn Jr. (grandson), Amberson \"Ambrose\" Osborn (father, deceased), Alton Osborn Jr. (grandfather, deceased), Alton Osborn Sr. (great-grandfather, deceased)", 
            "occupation": [
                "Government agent", 
                "former professional criminal", 
                "leader of the Order of the Goblin / Cabal of Scrier", 
                "businessman"
            ], 
            "origin": [
                "Amazing Spider-Man #40 (1966)", 
                "Spectacular Spider-Man Annual #14 (1994)"
            ], 
            "placeofbirth": [
                "Hartford", 
                "Connecticut"
            ], 
            "powers": "Due to the \"Goblin Formula\" Norman possesses super-human strength (lifting 9 tons under optimal conditions), increased speed, reflexes, endurance, and healing rate. Though much slower than the likes of Wolverine, he can regenerate damaged tissue and organs. His intelligence has been enhanced to gifted levels, though at the price of his sanity. His involvement with the Gathering of the Five loosened his grip on reality, though he is able to maintain his sanity via chemically treated dermal patches. When not impaired by mental illness, Osborn is a cunning businessman, masterful strategist, and highly skilled at electronics, mechanics, and chemistry.", 
            "realname": "Norman Osborn", 
            "significantissues": [
                "Appeared riding a broom (Amazing Spider-Man #14, 1964)", 
                "first time riding the glider (Amazing Spider-Man #17, 1964)", 
                "first appearance of Green Goblin's son Harry Osborn (Amazing Spider-Man #31, 1965)", 
                "Green Goblin's identity revealed (Amazing Spider-Man #39, 1966)", 
                "killed Spider-Man's girlfriend Gwen Stacy (Amazing Spider-Man #121, 1973)", 
                "apparent death impaled on own glider (Amazing Spider-Man #122, 1973))", 
                "becoming the Iron Patriot (Dark Avengers #1, 2009)"
            ], 
            "speed": 5, 
            "strength": 6, 
            "universe": "Marvel Universe", 
            "weight": 185
        }
    }
}