{
    "aliases": "None", 
    "citizenship": "U.S.A. with a criminal record", 
    "content": "Simon was transformed into Wonder Man by Baron Heinrich Zemo and used against the Avengers before sacrificing himself to save the heroes, who preserved a copy of his brain patterns in the hope of resurrecting him someday. Learning of Simon's apparent demise, Eric went mad with grief and wrongly blamed the Avengers for Simon's death. He hired the Tinkerer to build him a high-tech miniature arsenal in the form of a scythe, enhancing it with a coma-inducing device created by the mad robot Ultron, a fellow Avengers enemy who became so intrigued by Eric's family-inspired vendetta that he secured a copy of Simon's brain patterns for experimental purposes, later using them to create the android Vision. As the Grim Reaper, Eric very nearly killed the Avengers but was thwarted by the Black Panther. Escaping, the Reaper recruited fellow Avengers foes Living Laser, Man-Ape (M'Baku), Power Man (Erik Josten) and Swordsman (Jacques Duquesne) into the Lethal Legion, whose members competed with each other to see who could capture or kill the most Avengers; but the Legion was soon defeated and imprisoned, thanks largely to a new Avengers recruit, the Vision, whom the Reaper could not bring himself to kill.Stealing and preserving Simon's body, the Reaper offered to transfer Vision's mind into it and make him human in exchange for not opposing Reaper's efforts to destroy the Avengers, though Vision refused. Later, in partnership with a Space Phantom and unwittingly manipulated by Immortus, the Reaper seized control of a faction of the subversive group Hydra and conspired against the Avengers, again tempting Vision with offers of a human body, at one point promising to seize the body of Captain America for this purpose. Vision played along to infiltrate the Reaper's plans but ultimately helped the Avengers defeat the villains, though the Reaper and Vision saved each other's lives in turn during the fight. Captured and imprisoned, Eric eventually escaped and recovered Simon's body, which had actually been in a death-like stasis for years while he mutated into a new form. Once Simon was revived (apparently with the aid of Ultron), the Reaper hired the voodoo master Black Talon (Sam Barone) to send the half-dead hero after the Avengers in a zombie-like state, though Simon soon regained full consciousness and took up residence with the Avengers. Aided in penetrating Avengers security by Ultron, the Reaper imprisoned Vision, Wonder Man and several Avengers, staging a mock trial to determine whether the mutated Wonder Man or the android Vision was truly the real Simon Williams. The Reaper decided in favor of Simon and would have killed Vision, but he was defeated by Wonder Man.Deciding that Wonder Man and Vision were both inhuman mockeries of the true Simon, the Reaper tried unsuccessfully to kill them before enlisting his new lover Nekra and old allies Ultron, Black Talon, Goliath (Josten) and Man-Ape in a bizarre scheme to destroy the Avengers and re-create the \"real\" Simon Williams by transferring portions of the minds of Vision and Wonder Man into the voodoo-animated corpse of criminal Brady Kent, which had been surgically altered to duplicate Simon's original human form. The plan failed and the Reaper-having belatedly realized that Vision and Wonder Man were truly his brothers-fell to his death while fleeing in shame. Nekra revived Eric as an unwitting, unusually lifelike zombie, teaming with him and the Brady Kent zombie to assault the hospital where Vision's wife Scarlet Witch was giving birth; but the Reaper fell dead when he broke Nekra's spell by discovering, to his horror, that he was a zombie. A Grim Reaper soon fought the Avengers as part of Immortus's Legion of the Unliving, but whether that was the true Eric Williams or not is unclear. Later, Nekra raised the Reaper again, this time as a zombie who could sustain his existence by draining others' life force with his scythe, an ability he tested by fatally stabbing Nekra. He renewed his partnership with Ultron, but did so in order to subvert Ultron's plans to \"robotize\" humanity since this scheme would have deprived the Reaper of human victims; in the end, both villains were captured by the Avengers. Shortly thereafter, the Red Skull used both Reaper and Ultron as part of his mind-controlled army of super-villains in a world conquest scheme involving a giant laser cannon, but the Avengers thwarted this plot.Gaining power from the demonic Old Ones' Lloigoroth, the Reaper caused an airliner crash and captured a commuter train, transforming some of his victims into superhuman zombie facsimiles of deceased Avengers foes, apparently imbuing them with the originals' spirits. Reaper's Legion of the Unliving nearly destroyed the Avengers, but his hold over the zombies broke when Vision forced Eric to admit that he had killed himself and the Avengers were not to blame. The Reaper was seemingly consumed by Lloigoroth for his failure. Later, the Reaper appeared to haunt Simon again as part of a baffling conflict staged by the demons Mephisto and Blackheart, though how much (if any) of this encounter was real remains unclear. When Wonder Man died again and mystically returned in a ghostly state, the barriers between life and death weakened enough for Grim Reaper's spirit to return to the earthly plane, mystically enslaving the spirits of Wonder Man and several other dead Avengers to attack the living Avengers. However, the undead Avengers were freed from the Reaper's control by the Scarlet Witch and turned on the Reaper, helping the living Avengers defeat him. In the end, most of the undead Avengers returned to their respective afterlives, but Wonder Man was fully resurrected through the Witch's magic, which also restored the Grim Reaper to life after he was forced to admit his love for his brother.", 
    "durability": 7, 
    "education": "High school graduate", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 7, 
    "firstappearance": "Avengers #52 (1968)\n", 
    "groupaffiliation": [
        "Lethal Legion", 
        "formerly Maggia", 
        "Steelskulls (leader)", 
        "Legion of the Unliving", 
        "Hydra", 
        "partner of Ultron", 
        "partner of Nekra", 
        "partner of one of the Space Phantoms"
    ], 
    "hair": "Gray (formerly blond)\n", 
    "height": 72, 
    "id": "Grim_Reaper", 
    "identity": "Publicly known", 
    "intelligence": 7, 
    "knownrelatives": "Sanford Williams (father, deceased), Martha Williams (mother), Simon Williams (Wonder Man, brother), Vision (Victor Shade, android \"twin\" of brother Simon)", 
    "occupation": [
        "Professional criminal", 
        "formerly demon", 
        "zombie", 
        "subversive", 
        "assassin"
    ], 
    "placeofbirth": [
        "Paterson", 
        "New Jersey"
    ], 
    "powers": "As a zombie, he had unnatural strength and endurance, and was largely oblivious to pain and injury; he maintained his undead existence by draining the life forces of others through his scythe. After empowerment by Lloigoroth and Blackheart, the Reaper could perform illusion casting, shape-shifting, energy blasts, teleportation, inter-dimensional travel, conjuring/commanding minor demonic creatures, matter restructuring, remote communication, remote surveillance, transmutation, emotion vampirism (feeding off the despair of others) and reanimating the dead as his zombie servants.", 
    "realname": "Eric Williams", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 225
}