{
    "add": {
        "doc": {
            "aliases": [
                "Weapon Alpha", 
                "Vindicator", 
                "the Antiguard"
            ], 
            "citizenship": "Canada", 
            "content": "After a protracted legal battle, Hudson won the rights to claim his invention as his own. He was invited by the Canadian Prime Minister to participate in the creation of Department H, a top secret research and development agency within the Canadian Ministry of Defense. Within a year, Hudson married Heather McNeil.During this time, James and Heather Hudson were attacked by a \"wild man\" while visiting Canada's Wood Buffalo National Park. They helped nurse the man to health, helping the man called Logan recover from his state of shock. (It was later revealed that he had just escaped the tortuous experiments of the Weapon X program, which was responsible for his partial amnesia and animalistic rages at the time.)The first public appearance of the Fantastic Four inspired Hudson to create his own for of superhuman champions on behalf of the Canadian government. James Hudson, with Logan’s help, began the creation of Alpha Flight, and it was planned that Logan, as Wolverine, would lead the team. However, Logan quit Department H when he received an offer from Professor X to join the X-Men. James Hudson, then, reluctantly became the team’s leader after improving upon the first suit he had created.At first, James Hudson's codename was \"Weapon Alpha.\" Under this name he and Alpha Flight attempted to carry out his orders to bring Wolverine back to Department H by force. Hudson failed in this task, and in the course of this mission nearly killed the X-Men's ally, Dr. Moira MacTaggert, by accident. The guilt-ridden Hudson subsequently took the new code name Vindicator, believing he now had to vindicate himself. Over time, the Hudsons resumed their friendly relationship with Wolverine, and even the Canadian government accepted Wolverine's defection.With Hudson’s administration, Department H created Alpha Flight, Beta Flight, and Gamma Flight before financial considerations led the Canadian government to shut down the department. This didn’t stop Vindicator from patrolling the nation or keeping contacts with former Alphans. When investigating a mystical disturbance, Vindicator stumbled upon the emergence of Tundra, and Heather Hudson summoned Alpha Flight to assist him. With their success against Tundra, the heroes decided to remain together as a team despite the lack of government funding. Hudson took the codename Guardian in part because of the new change and also after having come to terms with his guilt over injuring MacTaggert.Alpha Flight faced its greatest contest within the next several months. Jerry Jaxon, whose career and life was ruined after Hudson’s departure from Am-Can, had created Omega Flight in the hopes of taking revenge on Hudson. He kidnapped Heather, led Omega Flight in defeating Alpha Flight, and used the Box armor to take on Guardian one-on-one. Hudson defeated Box in a pitched battle, and the feedback from the Box armor killed Jaxon. Unfortunately, Hudson’s own battlesuit was severely damaged as well. He tried to remove it before it would explode and failed. Heather entered the room just in time to witness the explosion that killed her husband.In reality, Hudson was not killed, but thrown backwards through time and space and captured by the alien race known as the Q`wrrlln. In their attempt to help him, they revived Hudson's body into a cybernetic composite, thinking that the leftovers of his battlesuit were a part of his physiology. The aliens returned him to Earth in suspended animation, where he lay buried for countless centuries, until he was discovered by the Roxxon Oil Corporation many years after his supposed death with Omega Flight. Roxxon attempted to use him for their own purposes, but he reasserted control of himself and rejoined Alpha Flight, now code-named Vindicator. Soon, however, the Q`wrrlln contacted Hudson in order to use him as a weapon against the planet-ravager alien Galactus. Hudson teleported members of Alpha Flight and the hero team Avengers to the Q`wrrlln homeworld. Successful in thwarting Galactus, Hudson apparently sacrificed himself again in order to return the teams back to Earth.As before, Hudson was not killed, but shunted into null space where he was later discovered by Alpha Flight's archenemy, the Master of the World. The Master bent James to his will and sent him against Alpha Flight as the Antiguard. It was Heather`s love for James that allowed him to reassert control and help defeat the Master. Hudson, reunited with his wife, left Alpha Flight to be free agents, occasionally doing assignments for the Canadian government. However, the two people had grown too far apart due to their separate life experiences, and they parted ways.Hudson returned to work for the Canadian government, when Department H was reopened, Hudson wanted to be on board. Unfortunately, Department H was involved in many dubiously criminal experiments, and Hudson refused to work for them. In retaliation, the Department had Hudson captured, his memories and mind downloaded into computers, and his body sent into space. Hudson's battlesuit, however, reacted with some part of Hudson to interfere with the trajectory, and Hudson landed in Antarctica, where Sasquatch was working at a secluded laboratory. Shortly afterward, Department H created a nineteen year old clone of Hudson with his memories and battlesuit. This new Guardian became the leader of a new version of Alpha Flight.Sasquatch managed to revive Hudson, since the electromagnetic pulse created by his suit allowed him to stay alive despite his body’s physical condition and the harsh Antarctic environment. Together, they reformed their own version of Alpha Flight to confront Department H. Hudson's Flight confronted the current Alpha Flight and cloned Guardian. The two versions of Alpha Flight soon reconciled and joined together as one.There was initially some confusion on which Guardian was the true Hudson, although the younger clone was soon revealed as the duplicate. Both the original and duplicate Hudson were soon kidnapped by the subversive organization A.I.M. who wanted to study them both. Through the intervention of both Alpha Flight and Wolverine, both Hudsons were freed, but the duplicate was seemingly killed during the escape.Hudson returned to Alpha Flight, where he led them under the guise of Guardian, and even returned to working for Departmnet H alongside Walter Langkowski, Sasquatch. Shortly thereafter, Heather learned she was pregnant.  A deranged co-worker, Dr. Jiroult, however, developed an obsessive infatuation for Heather. Picking up on an off-hand remark, he believed she wanted to be with him. He used a powerful energy projector called a Zero Gun to confront James Hudson, shooting him and leaving him for dead. James’ dying thoughts attracted the attention of Shaman, who rallied several Alphans to race to Hudson’s side. Shaman entreated the spirits of the air to revive Hudson, who was once again restored to life, albeit barely, and they saved Heather from the clutches of Jiroult. During the battle, Heather went into labor and gave birth to a baby girl.Both Hudsons continued to serve in Alpha Flight, until being captured by the alien Plodex. Sasquatch was the only member to escape, and he formed an all-new, all-different Alpha Flight to rescue the original team. Upon their rescue, they discovered that the Plodex complex was seeded with eggs that were using the genetic templates of the original Alphans for gestation. The Plodex homeworld was ready to receive these eggs to repopulate its planet, and the original Alpha Flight, James and Heather included, chose to accompany the eggs on the trip back to its home planet. They left Earth, and presumably their child, behind.", 
            "durability": 6, 
            "education": "Doctoral degree in science and engineering", 
            "energy": 5, 
            "eyes": "Brown\n", 
            "fighting": 5, 
            "firstappearance": "X-Men #109 (1978)\n", 
            "groupaffiliation": [
                "Alpha Flight", 
                "formerly Department H", 
                "founder of Beta Flight", 
                "Gamma Flight", 
                "Omega Flight associate"
            ], 
            "hair": "Black\n", 
            "height": 74, 
            "id": "Guardian_(James_Hudson)", 
            "identity": [
                "Secret", 
                "known to certain Canadian government officials"
            ], 
            "intelligence": 6, 
            "knownrelatives": "Unidentified parents, Heather McNeil Hudson (Vindicator, wife), unidentified daughter, Ramsey McNeil (father-in-law), Claire McNeil (mother-in-law)", 
            "occupation": [
                "Adventurer", 
                "government agent", 
                "former petrochemical engineer"
            ], 
            "origin": "Alpha Flight #2-3 (1983)", 
            "placeofbirth": [
                "London", 
                "Ontario", 
                "Canada"
            ], 
            "powers": "As Guardian, his superhuman abilities stem from a high-tech battlesuit of his own design. The suit is a steel-mesh costume that taps into Earth's electromagnetic field for a variety of effects, most notably allowing Guardian to fly up to Mach-1 and to shoot beams of concussive force, which were originally intended for the suit's capability to serve as a digging tool. The suit also amplifies its wearer’s strength to superhuman levels and forms a personal force field. \nBy tracking his global positioning with his suit’s navigation system, Guardian could temporarily cancel the Earth's rotation relative to himself, causing a nearly instantaneous acceleration. To the unaided human eye Guardian would have seemed to have instantaneously teleported himself from one location to another.", 
            "realname": "James MacDonald Hudson", 
            "significantissues": [
                "First appeared as Weapon Alpha, fought X-Men over the fate of Wolverine (X-Men #109, 1978)", 
                "took the name Vindicator (X-Men #120, 1978)", 
                "re-formed Alpha Flight, took the name Guardian (Alpha Flight #1-2, 1983)", 
                "seemingly died after battling Omega Flight (Alpha Flight #12, 1984)", 
                "resurrected by the Q`wrrlln, rescued by and rejoined Alpha Flight (Alpha Flight #87-90, 100", 
                "1991)", 
                "fought Alpha Flight as the Antiguard on behalf of the Master, resumes Guardian identity but Alpha Flight is disbanded (Alpha Flight #129-130, 1994)", 
                "separates from his wife (Wolverine #95, 1996)", 
                "younger clone asked to join Alpha Flight (Alpha Flight #1, 1997)", 
                "discovered and revived by Sasquatch (Alpha Flight #13, 1998)", 
                "confronted Alpha Flight with Sasquatch and others, fought clone but joined Alpha Flight (Alpha Flight #18-20, 1999)", 
                "captured by A.I.M., younger version revealed to be a clone, rescued by Wolverine and Alpha Flight (Wolverine #142-143", 
                "1999)", 
                "nearly killed by Jiroult, Heather gives birth to their baby (X-Men Unlimited #45, 2003)", 
                "captured by Plodex, agreed to accompany Plodex ship to its homeworld (Alpha Flight #1-6, 2004)", 
                "past version of Guardian brought to the present (Alpha Flight #12, 2005)", 
                "apparently deceased with the rest of the Alpha Flight (New Avengers #16, 2006)"
            ], 
            "speed": 4, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 190
        }
    }
}