{
    "add": {
        "doc": {
            "aliases": "Mister H", 
            "citizenship": "U.S.A. with a criminal record", 
            "content": "In recent years, Hammerhead ventured into loan shark territory, and among his clientele was wrestler Crusher Hogan; in a prophetic moment, Hammerhead was in the audience when Hogan was challenged by a masked youth soon to be known as Spider-Man. For years Hammerhead bided his time, and when the Maggia leader called the Top Man lost status after a clash with the Fantastic Four, he took control of the fallen gangster's mob and spent months reshaping it. When the Kingpin of Crime, the Maggia's greatest competitor, temporarily withdrew from New York, Hammerhead stepped into the power vacuum, as did Doctor Octopus. The pair's gangs warred in the streets until Spider-Man intervened, defeating them both. Octopus and the members of both gangs were arrested, but Hammerhead fled the country.During his exile, Hammerhead built his fighting skills to their peak. Returning to the U.S., he and his remaining gang attacked Octopus, who fled to an advanced atomic processing plant he hoped to acquire. Despite Spider-Man's interference, Hammerhead cornered Octopus near an atomic reactor, but when he charged Octopus, he struck the reactor instead. Spider-Man and Octopus fled, barely reaching safety before the reactor exploded and devastated the island, including Hammerhead's gang, the last survivors of the Top Man's organization.Through an unexplained space-time fluke, Hammerhead was not slain but rendered incorporeal, and he followed Octopus back to New York, briefly driving him to mental ruin. When not harassing Octopus, he materialized throughout New York and recruited new underlings, who were deeply impressed that not even an atomic explosion could end his efforts. Recovering, Octopus attempted to use a particle accelerator to eradicate Hammerhead, but this only played into Hammerhead's hands, for the accelerator instead restored him to solidity. Hunted by Octopus and Spider-Man, he fled in a helicopter, which Octopus downed over the bay, but he emerged unscathed, although he allowed his enemies to believe him dead.Hammerhead strengthened his new Maggia family with underlings trained by the super-skilled Taskmaster and hired the inventive Tinkerer to create a strength-magnifying exoskeleton. With the Kingpin back in power, Hammerhead sought to unite New York's Maggia families under his rule, but his summit was disrupted by the Human Torch who was following a false lead in a murder investigation. Despite his exoskeleton, Hammerhead proved no match for the Torch. When the Kingpin's interests again took him from New York, a new gang war broke out, much to the chagrin of Spider-Man and other crimefighters, but as Hammerhead planned his role, the Kingpin's right-hand man, the Arranger, had him bombed at a restaurant. Hammerhead hungered for vengeance but withdrew when the Kingpin returned to stabilize the city.Months later, when the lycanthropic Lobo Brothers challenged the Kingpin, the shape-shifting Chameleon, pursuing the underworld crown himself, allied with Hammerhead, who followed the former spy's lead in the fray. Predictably, Spider-Man opposed all comers, but when the smoke cleared, Hammerhead was one of New York's top three crimelords. Unfortunately, he hired the infamous hitman Tombstone as his right hand, which proved his undoing; in what he fancied was a gesture of good will, Hammerhead hired the Hobgoblin (Jason Macendale) to assassinate Tombstone's nemesis Robbie Robertson. But Tombstone had vowed that only he would slay Robertson, and when chance granted Tombstone superhuman power, he savagely beat Hammerhead, then lured Robertson into a trap. Spider-Man and other heroes intervened, enabling Hammerhead to escape, and he resumed sole rule of his organization when the Chameleon turned to other interests.When the Kingpin was temporarily toppled, both Hammerhead and Tombstone were among those who sought his Las Vegas interests, but the vigilantes Daredevil, Nomad, and the Punisher put an end to this venture. Soon afterward, Tombstone, aspiring to Maggia heights, once more beat up Hammerhead and had him ejected from New York. Mortified, Hammerhead went abroad and undermined the interests of the assassination mogul called the Foreigner, who recruited his ex-wife, famed mercenary Silver Sable, to aid him. Hammerhead got the better of Sable and, abandoning his imagined 1920s ethics, boasted that he would rape and kill her before his Maggia peers, but his twisted fantasies were punctured when Sable defeated him. Returning to the U.S., he regained his place among the Maggia leaders, which included, to his chagrin, Tombstone.However, when the long-absent crimelord Fortunato returned in alliance with the terrorists of Hydra, Hammerhead, incensed that such \"Nazis\" dared undermine New York, joined several other crimelords in a united front. They were nonetheless defeated, though the intervention of Daredevil and Scarlet Spider (briefly acting as Spider-Man) disrupted Fortunato's coup. While Hydra regrouped, Hammerhead remained one of the few holdouts and formed an uneasy alliance with Spider-Man and new hero SHOC against Hydra front man Crown. Dealing Crown a crippling blow, Hammerhead was content to lay low, apparently occupying himself with, among other things, marriage to an unidentified woman. However, the Kingpin, returning to his throne, had several crimelords, including Hammerhead, attacked and left for dead.But the Kingpin had unknowingly done Hammerhead a favor, for the attack seemingly stirred long-buried memories of a sister, Antonia, whom he learned was dying of cancer. Frantic to make up for years of amnesia, Hammerhead sought an ancient Atlantean tablet whose secrets would heal Antonia. Forcing scientist Curt Connors into his service, Hammerhead acquired the tablet and, despite Spider-Man's intervention, Connors created a serum that would bestow the desired power. However, when Connors attempted to drink the serum, Hammerhead's hireling Boomerang shattered the vial, prompting the scientist's transformation into his reptilian alter ego, the Lizard. Eventually, all concerned converged at the hospital where Antonia lay, and when the Lizard recreated the serum, Hammerhead consumed it and achieved godlike power. In a moment of compassion, he restored Connors to his senses, but the transcendent experience so enraptured him that the power faded before he could cure Antonia. However, Spider-Man prepared a third dosage to treat her, and a grateful Hammerhead allowed himself to be arrested.", 
            "durability": 5, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 4, 
            "firstappearance": "Amazing Spider-Man #113 (1972)\n", 
            "groupaffiliation": [
                "Maggia", 
                "formerly Sinister Twelve", 
                "former ally of Tombstone", 
                "the Chameleon", 
                "others"
            ], 
            "hair": "Black\n", 
            "height": 70, 
            "id": "Hammerhead", 
            "identity": "Secret", 
            "intelligence": 5, 
            "knownrelatives": "Antonia (sister); unnamed wife", 
            "occupation": [
                "Crimelord", 
                "former loan shark", 
                "enforcer", 
                "hitman"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "Portions of Hammerhead's skull and skeleton have been surgically replaced with a nearly unbreakable steel alloy, making him extremely resistant to physical injury; in particular, his head is virtually impervious to physical damage.", 
            "realname": "Unrevealed", 
            "speed": 2, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": 265
        }
    }
}