{
    "aliases": [
        "Formerly Mutant X", 
        "Goblin Prince"
    ], 
    "citizenship": "U.S.A.", 
    "content": "The two boys were hospitalized for injuries they sustained during their landing.  Alex left the hospital after two weeks and was placed in an orphanage in Omaha, Nebraska that was secretly run by the master geneticist Mister Sinister. Alex was soon adopted by the Blanding family, who had lost their son Todd. However, the family were still traumatized by their loss, and treated Alex as if he were Todd. (Unknown to Alex, his brother Scott would become the hero Cyclops and join the X-Men.)Sinister continued to monitor Alex whilst he lived with his foster family.  When he noticed the first stirrings of Alex's mutant powers, Sinister incited the local school bully Vincent, who had caused Todd's accident, to attack Alex.  The subsequent stress caused Alex's mutant powers to manifest and he incinerated Vincent.  Sinister then placed a genetic lock upon Alex to curtail the development of his powers.As a result, Alex did not become aware of his mutant abilities until after graduating college. A professor of archaeology named Ahmet Abdol had discovered a psychic link between himself and Alex. While both of them had the latent mutant power to absorb and transform cosmic radiation, Abdol's ability to exercise the power was blocked in an unknown manner by Alex. Abdol captured Alex and took him to his laboratory in Egypt. There, Abdol found a way to screen Alex's body from ambient cosmic radiation, permitting his own body to attain its latent potential. Abdol was transformed into the Living Monolith, a gigantic mutant with vast cosmic power, but was defeated when his brother and the X-Men came to the rescue. Incapable of controlling the power his body emanated, Alex fled into the Egyptian desert.Alex was soon captured by one of the mutant-hunting robotic Sentinels and brought to the headquarters of Larry Trask, son of the Sentinels' inventor Bolivar Trask. Larry gave Alex the codename Havok and a costume whose chest display monitored the build-up of cosmic energy within him. The X-Men came to Alex’s rescue; however, he was injured in the ensuing battle with the Sentinels and was taken to Doctor Karl Lykos for treatment.  Lykos was himself a mutant who fed off the life energies of other mutants, and when he siphoned energy from Alex he transformed for the first time into the flying reptilian creature named Sauron.After Sauron was defeated, Alex returned to New York with his brother and his teammates where he joined the X-Men and began training to control his powers. Eventually, Alex gained enough mastery over his power that he would release it only when he wished to do so and could wield his power with enough skill to become a formidable opponent in battle.During his time with the X-Men, Alex fell in love with his teammate Lorna Dane, the magnetism-manipulating mutant now known as Polaris.  They both served for a time in the X-Men helping to repel the invasion by the alien Z'nox; however, neither Alex nor Lorna wished to lead a life as an adventurer. They discovered a mutual interest in geophysics and left the X-Men to begin doctoral research in the Diablo mountain range in Arizona.Their idyllic lifestyle was eventually interrupted when the pair found themselves hunted by the team of superhuman assassins known as the Marauders. Lorna was possessed by the psionic entity known as Malice, who forced her to attack the X-Men as the Marauders’ leader.  Alex, who had rejoined the X-Men, had no choice but to fight his lover.Later, Alex traveled through the Siege Perilous, a mystic gateway that granted those who passed through it a new lease on life, free of their past baggage.  When he reappeared, it was as a member of the Magistrates of the mutant-enslaving island nation of Genosha.  After the X-Men overthrew the Genoshan government, Alex remained behind for a time to ensure the new government wouldn't repeat the mistakes of the former administration.  He later accepted an offer to lead the second version of X-Factor, a government-funded mutant agency, of which Lorna was a member.Alex continued to serve with X-Factor until the apparent death of his teammate Jamie Madrox, the Multiple Man, at the hands of the prophetic mutant named Haven. Disillusioned, Alex teamed up with the Dark Beast, an evil doppelganger of the X-Men's Beast from another timeline, and together they founded a team of mutant terrorists called the Brotherhood of Mutants. However, Alex had not truly become a villain and had only joined the Brotherhood in order to stop the Dark Beast's sinister plans.  After he was aided by the time-traveling Xavier Underground Enforcers in stopping the Dark Beast, Alex joined them in their quest to stop their apocalyptic future from occurring.  Alex was seemingly killed when a time machine created by X.U.E. member Greystone exploded, but he was actually shunted into an alternate universe, trading bodies with the Havok of that reality.  However, Alex's family and friends all believed him dead.After adventuring with a team of twisted versions of the heroes he once knew, Alex again seemingly died, but was left floating in a Limbo-like void.  On Alex's Earth, a catatonic \"John Doe\" patient at the Rosy Manor Convalescent Hospital in upstate New York was identified as being Alex Summers by his attending nurse, Annie Ghazikanian. After she contacted the X-Men, Cyclops came to collect his brother, and Annie sought to accompany Alex as she had come to care for him and sought to continue his rehabilitation.Alex was eventually saved by Annie's young son Carter, who used his fledgling mutant powers to reconnect Alex's consciousness to his body. Seizing the day, Alex's long-time love Lorna asked him to marry her.  Somewhat shocked at such a life-altering question so soon after his return, Alex faltered over a reply but his assembled friends and family made the decision for him.  However, Alex had fallen in love with Annie, and called off his wedding as Lorna was walking up the aisle.  Lorna snapped and attempted to kill both Alex and his newfound love, but she was stopped by Alex's teammate the Juggernaut.Soon after, the alternate reality Havok's personality resurfaced within Alex, having followed Alex's consciousness back from within the void in which he had been trapped.  The team of dimension-hopping mutants known as the Exiles were charged with the task of stopping the evil Havok, and they teamed up with the X-Men to prevent him from killing Carter.  The evil consciousness was eventually forced out of Alex's body and sent back into the void where it was destroyed by the Exiles' taskmaster, the enigmatic being known as the Timebroker.", 
    "durability": 3, 
    "education": "Masters degree in geophysics, some doctoral research completed", 
    "energy": 6, 
    "eyes": "Brown\n", 
    "fighting": 3, 
    "firstappearance": "(As Alex Summers) X-Men #54 (1969); (as Havok) X-Men #58 (1969)\n", 
    "groupaffiliation": [
        "Starjammers", 
        "formerly X-Men", 
        "Six", 
        "X-Factor", 
        "Brotherhood of Mutants", 
        "Dark Descendants", 
        "Genoshan Magistrates", 
        "Defenders"
    ], 
    "hair": "Blond\n", 
    "height": 72, 
    "id": "Havok", 
    "identity": "Secret", 
    "intelligence": 3, 
    "knownrelatives": "Christopher Summers (Corsair, father, deceased), Katherine Anne Summers (mother, deceased), Philip Summers (grandfather), Deborah Summers (grandmother), Scott Summers (Cyclops, brother), Gabriel Summers (Vulcan, brother), Andrew Blanding (foster father), Mrs Blanding (foster mother), Haley Blanding (foster sister), Nathan Christopher Summers (Cable, nephew), Madelyne Pryor-Summers (ex-sister-in-law, deceased), Jean Grey-Summers (Phoenix, sister-in-law, deceased), Tyler Dayspring (Genesis, grandnephew, deceased), Stryfe (clone nephew, deceased), Rachel Summers (Marvel Girl, alternate timeline niece)", 
    "occupation": [
        "Adventurer", 
        "former U.S. government operative", 
        "former graduate student in geophysics"
    ], 
    "origin": [
        "Uncanny X-Men #156 (1982)", 
        "X-Factor #-1 (1997)", 
        "X-Men #58 (1969)"
    ], 
    "placeofbirth": [
        "Honolulu", 
        "Hawaii"
    ], 
    "powers": "Havok is a mutant with the superhuman ability to absorb ambient cosmic energy into the cells of his body, transform it in an unknown manner, and release it as waves of energy that heat the air in their path enough to turn it into plasma, which is a super-heated state of matter consisting of charged subatomic particles.  These waves will emanate from his body in all directions unless he purposefully tries to channel them in a single direction, usually along the length of his arms. Havok is himself immune to the intense heat he creates, as well as the power blasts generated by his brother Cyclops.\nDespite past accounts, the energy that Havok releases is not truly a concussive force.  When Havok strikes an object with the waves of intensity of hot plasma, the sudden vast jump in temperature will often cause objects to shatter, explode, or seemingly disintegrate, and an observer might therefore wrongly think that the object had been struck by a concussive force.  Should Havok direct his energy at the lowest level, he can project it towards a human being and his target will suffer a severe headache but will not burn up.\n\nHavok's body is constantly in the process of absorbing cosmic radiation. When each of his body's power-storage cell enclaves reaches its capacity, excess cosmic energy is thereafter absorbed and immediately re-emitted in negligible quantities. Upon the total expenditure of all his available energy, it takes Havok's body about 16 hours to recharge to its peak level. The act of concentration involved in releasing his energy in anything other than an omnidirectional wave is physically exhausting for Havok if he continues it over an extended period of time.", 
    "realname": "Alexander \"Alex\" Summers", 
    "significantissues": [
        "First joined X-Men (X-Men #65, 1970)", 
        "alongside Polaris, left X-Men (X-Men #94, 1975)", 
        "reunited with father (Uncanny X-Men #158, 1982)", 
        "went through Siege Perilous (Uncanny X-Men #251, 1989)", 
        "reappeared as Genoshan Magistrate (Uncanny X-Men #270, 1990)", 
        "joined X-Factor (X-Factor #71, 1991)", 
        "joined Brotherhood (X-Factor #125, 1996)", 
        "believed killed, entered alternate reality (X-Factor #149/Mutant X #1, 1998)", 
        "found catatonic in hospital (Uncanny X-Men #411, 2002)", 
        "revived from catatonic state (Uncanny X-Men #419, 2003)", 
        "called off wedding to Lorna (Uncanny X-Men #425, 2003)", 
        "purged of evil counterpart (Exiles #30, 2003)", 
        "joined Starjammers (Uncanny X-Men #486, 2007)"
    ], 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 175
}