{
    "aliases": "Hawk God", 
    "citizenship": "Unrevealed", 
    "content": "The Hawk God’s primary reason for being was of predation which is a primal necessity for insuring the survival of the fittest at all existential stratum. However, he had travel far beyond the parameters of his directive. He began to find it necessary to perpetrate cruelty for its own sake. This behavior was far below that of being on his level of existence. The prime example of his exploitation of his power and purpose is when he deliberately initiated the extinction of the Watchers. For that genocide Eternity brought him before the Supreme Council of Abstract Beings. A jury of his peers was sequestered and the Living Tribunal called the hearing to order. Pleading the case of the Prosecution was Uilig the last Watcher. The mighty planet eater Galactus provided the defense for the Hawk God. He appeared to sway the jurors with an eloquent dissertation on \"the need to feed.\" However Uilig introduced proactive evidence that linked the Hawk God with the multiversally despised plague bringer Bubonicus. Galactus strongly objected to this inflammatory and uncorroborated accusation. The Tribunal ruled the rumor as inadmissible, although, he reminded the irate Hawk God that he had been deemed to be dangerous. As it was often wispered that he might be the one to precipitate the \"War of the Cosmic Beings.\"", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Marvel Presents #9  (1977)\n", 
    "groupaffiliation": "Cosmic Elite", 
    "hair": "None\n", 
    "height": 0, 
    "id": "Hawk_God_(Earth-691)", 
    "identity": "Unknown to the general populace of Earth", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Predatory Force of Nature", 
    "origin": [
        "History of Hawk God (Guardians of the Galaxy #49 & 62", 
        "1994 & 1995)"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "The true level of his powers and abilities are unknown at this time. However it is documented that he was powerful enough to destroy the entire Watchers race of his reality.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Earth-691", 
    "weight": "Variable\n"
}