{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "United States of America (Earth-712)", 
            "content": "He was somehow discovered and recruited by the Squadron member Nighthawk to serve in his team of super powered \"Redeemers\" to fight the influence of the Squadron Supreme's \"Utopia Program\" on their alternate earth. Haywire, along with other Redeemers Inertia, Thermite, Haywire and Redstone, infiltrated the Squadron and was elected to full membership. He served for a month before the Redeemers openly opposed the Squadron, during which time he was revealed to have a romantic relationship with Inertia. The two elected to stay members once the Utopia Program was dismantled.Later, when a white being of immense size began to grow and threaten to devour the Sun, members of the Squadron, including Haywire and Inertia, boarded a space ship to battle the mysterious foe. Inertia was killed in confronting the being, although the team eventually thwarted the threat. When trying to return to Earth, however, Haywire and the Squadron were exiled to the prime reality with the rest of the Squadron who tried to get back to their Earth. Haywire stood by the other Squadron members during their time trapped on Earth, including a battle with the Avengers, after which the team was restored home. However, Haywire elected to stay behind on the mainstream Earth, claiming to wish to explore the American Northwest, an area that was devastated in his native dimension.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "Squadron Supreme #10\n", 
            "groupaffiliation": [
                "(At time of death) None", 
                "(Formerly) Squadron Supreme", 
                "Redeemers"
            ], 
            "hair": "Reddish-blonde\n", 
            "height": 70, 
            "id": "Haywire_(Earth-712)", 
            "identity": "Publicly known to the people of Earth-712", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": [
                "(At time of death) Adventurer", 
                "(Formerly) subversive", 
                "government agent"
            ], 
            "origin": "Unrevealed", 
            "placeofbirth": "Unrevealed location in the Pacific Northwest", 
            "powers": "Haywire had the ability to form nearly unlimited quantities of a steel-like \"tanglewire\" filament from his fingertips which he can use to entangle opponents and/or form simple shapes. The tanglewire could be as sharp or safe according to his will.", 
            "realname": "Harold Danforth", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Earth-712", 
            "weight": 150
        }
    }
}