{
    "add": {
        "doc": {
            "aliases": "Patsy", 
            "citizenship": "U.S.A.", 
            "content": "While her husband was assigned to a security post at the heavily government-subsidized Brand Corporation in New Jersey, Patsy Walker met the Beast and learned his secret identity. Walker had long idolized \"super heroes\", and she elicited the promise from him that in exchange for keeping his secret, he would help her become a \"super heroine\". Walker’s marriage eventually came to a bitter end, and she sought out the Beast, who was now a member of the Avengers, to remind him of his promise. Tagging along with the Avengers to investigate criminal activities at the Brand Corporation, Walker discovered a costume like that worn by Greer Nelson in her identity as the Cat. Putting the costume on, Walker dubbed herself Hellcat and used her natural athletic abilities to help the Avengers. Walker believed that the costume had somehow enhanced her agility and speed, and by the power of suggestion more than anything else, it had.Although she hoped to join the Avengers, Hellcat was persuaded by the Titanian priestess Moondragon to accompany her to Titan to undergo a period of training. During her stay on Titan, Hellcat’s minor psionic potential was artificially enhanced by various electronic organic devices (Moondragon used similar technology to give powers to Angar the Screamer and Ramrod) and was given extensive martial arts training. Upon her return to Earth, she met the Defenders and decided to accept their offer of membership rather than the Avengers. Hellcat remained a core member of the loosely organized Defenders for several years, becoming particularly close to the Valkyrie and Nighthawk. Eventually she met Damion Hellstrom, who in his costumed guise of the Son of Satan, joined the Defenders for a short time, and after he was cured of his demonic aspect found that she was in love with him. Renouncing her costumed identity, Patsy Walker decided to marry Hellstrom. The couple was married in Greentown, Ohio, where her father currently resided. The wedding, attended by several of her Defenders colleagues, was interrupted by her ex-husband \"Buzz\" Baxter, who had assumed the costumed guise of Mad Dog, and the Mutant Force. The Defenders repulsed the attack and Hellstrom subdued Mad-Dog. The Hellstroms then moved to San Francisco where they established themselves as occult investigators. In this capacity, they helped several superheroes in mystical problems, notably the Avengers' West Coast branch. In helping the Avengers, Patsy again donned the Hellcat costume and remained on hand to help them capture the villains Tiger Shark and Whirlwind.Sometime later, however, Hellstrom's dark soul reasserted itself and Patsy was driven mad at the sight of it. She languished in a near-vegetable state for months afterward until the mercy-killing entity Deathurge sensed her despair and, at her request, freed her spirit from her body, effectively killing herself. She soon after contacted Earth from a spirit plane and announced her intention via radio to return in the near future.Patsy had ended up in the realm of the demon Mephisto, fighting an eternal battle in the so-called Arena of Tainted Souls, alongside fallen Avenger Mockingbird. Months later, the Avenger villain Grim Reaper resurrected Patsy and Mockingbird, among others, tainting them with his hatred for the Avengers and setting them against the team. With the help of the Scarlet Witch, Patsy and the others reverted to their true personalities and aided the Avengers against the Grim Reaper before returning from whence they came. Before she disappeared, Mockingbird was able to send a warning to her husband Hawkeye about a plan Hellstrom was developing. Hawkeye and his team the Thunderbolts confronted Hellstrom and then used their sorcerous connections to go to Hell in order to restore Mockingbird. They were tricked however, by Hellstrom, and the Thunderbolts rescued Patsy instead, restoring her bodily to Earth.Patsy remained despondent and depressed due to her perceived failures in life and time spent in Hell. She nevertheless presented a good front, wrote an autobiography and began a book tour. Shortly thereafter, Patsy returned to Centerville to find her high school rival Hedy had joined with the corporation that was built upon the Patsy comics fortune and turned Centerville into a tourist attraction. Patsy discovered the town was also infiltrated with demonic forces, led by the evil warlock Nicholas Scratch. Scratch had allowed a cult called the Sons of the Serpent to use the citizens of Centerville for their occult purposes, and altering the Avengers, Patsy resumed her Hellcat identity and defeated the Serpents alongside her team.Patsy was still despondent about life when later Scratch's minions attacked Hellcat. She then uncovered a plot by the extradimensional villain Dormammu to take over the various dimensions of Hell, each led by different demons, among them Mephisto, Hellstrom, and Satannish. Hellcat helped Mephisto thwart Dormammu by uniting the demons along with the death gods Pluto and Hela. She also revealed Hellstrom's father was actually Satannish, a pawn of Dormammu. Ultimately, she escaped back to Earth by proving to Mephisto that he would be better served to have her on Earth. Revitalized by her adventure, Patsy rededicated her life to super heroics as Hellcat. (Hellstrom later admitted that he manipulated Patsy into believing the accusations of his origins in order that she could distance herself from him and return to a more \"normal\" life.)", 
            "durability": 4, 
            "energy": 3, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "(as Patsy) Miss America Magazine #2, (as Hellcat) The Avengers Vol. 1, #144\n", 
            "groupaffiliation": [
                "Lady Liberators", 
                "formerly Avengers", 
                "Defenders"
            ], 
            "hair": "Red\n", 
            "height": 68, 
            "id": "Hellcat_(Patricia_Hellstrom)", 
            "identity": "Public", 
            "intelligence": 4, 
            "knownrelatives": "Joshua (father), Dorothy (mother, deceased), Bea (step-mother), Robert Baxter (Mad-Dog, ex-husband), Daimon Hellstrom (Hellstorm, ex-husband)", 
            "occupation": [
                "Housemaker", 
                "model", 
                "adventurer", 
                "paranormal investigator"
            ], 
            "origin": [
                "Avengers #144 (1976)", 
                "Defenders #89 (1980)"
            ], 
            "placeofbirth": [
                "Centerville", 
                "California"
            ], 
            "powers": "As a result of her experiences in hell and her resurrection, Patsy has a \"demon sight\" perception that allows her to sense mystical phenomena or those items or persons tinged with mystical energy. She is also surrounded by a mystical field that can deflect mystical attacks. It also allows Patsy to summon a costume that mimics her original Hellcat costume, and it appears in a fashion according to her whim. \nHellcat once possessed enhanced psionic abilities, due to the mental stimulation of Moondragon’s Titanian technology. She could move small objects telekinetically, resist mental control, and on one occasion was able to generate a psychokinetic force-blast. Moondragon has since used her own advanced psionic powers to undo the effects of her psychic augmenter. Since then, Walker’s psychic abilities have returned but to a far lesser degree than at their peak. She no longer has any psychokinetic ability, but she is still sensitive to certain psychic phenomena.", 
            "realname": "Patricia Walker Baxter Hellstrom", 
            "significantissues": [
                "Active with Avengers, took Hellcat identity (Avengers #139-144, 1975-1976)", 
                "married Daimon Hellstrom (Defenders #125, 1983)", 
                "committed suicide (Hellstorm #14, 1994)", 
                "restored to life by Thunderbolts (Thunderbolts 2000 Annual, 2000)"
            ], 
            "speed": 3, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": 135
        }
    }
}