{
    "add": {
        "doc": {
            "aliases": [
                "\"Hoblin\"", 
                "formerly Jack O'Lantern"
            ], 
            "citizenship": "U.S.A. (revoked)", 
            "content": "He tangled up with Spider-Man some time later and was again beaten, but this time was able to escape. After Spider-Man had gone missing Jack O'Lantern stumbled into Silver Sable, and after a short fight she managed to destroy Macendale's pumpkin helmet forcing Macendale to retreat. Macendale then went to free Flash Thompson from jail as he thought that he was the real Hobgoblin. When Hobgoblin heard about this he went to find Jack. He crashed in Jack's hideout and attacked him blaming him for ruining his plan. The fight ended in a stalemate and both villains went their separate ways. Flash managed to escape when Jack and Hobgoblin were fighting.These two later joined with the Kingpin to fight against Hammerhead and his troops. Jack and Hobgoblin, now allies were sent to fight against Hammerhead's troops, but their alliance didn't last long when they had a run-in with Spider-Man. Jack bailed out of the fight and left Hobgoblin to fight him alone. When Kingpin returned he fired Jack O'Lantern explaining that he \"didn't meet his standards.\" Hobgoblin hunted down Jack O'Lantern for revenge for his betrayal, but because of outside interference, the conflict ceased and Hobgoblin took off.Not long after last encounter with the Hobgoblin, Macendale hired the Foreigner to kill him. Foreigner pulled some strings and got hitmen to kill Ned Leeds. Macendale then acquired Hobgoblin's equipment and paid a visit to Rose and Kingpin. He then attacked Spidey again and managed to give Spider-Man a hard landing. He was just about to finish him off with a pumpkin bomb when Flash Thompson intervened. He caught the bomb and threw it back at Hobgoblin. It exploded and Hobgoblin ended up with broken rips and retreated.Next time he surfaced he was hired to kill Doctor Strange. They fought for sometime and Strange managed to trick Macendale into thinking that he had lost his powers, so he flew away. The next job to Hobgoblin was given by Hammerhead to kill Joe Robertson. Hobgoblin attacked Robertson at his home but didn't count on Puma being there and Spider-Man soon joined the fight. With a little help from Tombstone they managed to drive Hobgoblin away. He then decided to release Carrion from prison and attacked the prison transport that was transporting him. He freed him and convinced him to ally with himself against Spider-Man. Carrion and Hobgoblin succeeded in capturing Spider-Man, but Spider-Man eventually escaped. Carrion then sacrificed himself to save his mother by taking Hobgoblin and himself out with one of Hobgoblin's pumpkin bombs.", 
            "durability": 4, 
            "education": "Masters degree in electrical engineering and physics", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 4, 
            "firstappearance": "(as Jack O'Lantern) Machine Man #19 (1981); (as Hobgoblin) Amazing Spider-Man #289 (1987)\n", 
            "groupaffiliation": [
                "None", 
                "formerly the Sinister Six"
            ], 
            "hair": "Black\n", 
            "height": 73, 
            "id": "Hobgoblin_(Jason_Macendale)", 
            "identity": "Publicly known", 
            "intelligence": 5, 
            "knownrelatives": "Karen Vancolder (ex-wife), Jason \"Jay\" Macendale (son)", 
            "occupation": [
                "Mercenary", 
                "former professional criminal", 
                "mob enforcer", 
                "government operative", 
                "fighter pilot", 
                "soldier"
            ], 
            "origin": [
                "Amazing Spider-Man #279 (1986)", 
                "Spider-Man: Hobgoblin Lives #1 (1997)"
            ], 
            "placeofbirth": [
                "Boston", 
                "Massachusetts"
            ], 
            "powers": "As Jack O'Lantern and in his early time as the Hobgoblin, Macendale had normal human abilities for a man who engaged in intensive regular exercise. While possessed by Demogoblin, Macendale possessed superhuman strength (lifting up to 10 tons), speed and durability, resistance to some forms of magic, and the ability to create objects from demonic fire; he could use mystic energy to amplify his glove-blasts, alter the shape of his goblin-glider, and augment the range and effectiveness of his throwing weapons. Following his separation from Demogoblin, Macendale obtained superhuman strength (lifting up to 4 tons) via treatments provided by the Grim Hunter. As a cyborg, Jason Macendale was superhumanly strong (lifting up to 10 tons), with detachable claws and a bionic left eye capable of night vision and telescopic sight.", 
            "realname": "Jason Philip Macendale Jr.", 
            "significantissues": [
                "For more detaled bibliography see Official Handbook Bibliography", 
                "first encountered Spider-Man (Spectacular Spider-Man #56, 1981)", 
                "arranged killing of Ned Leeds and took Hobgoblin title for himself (Amazing Spider-Man #289, 1987)", 
                "fought Green Goblin (Amazing Spider-Man #312, 1989)", 
                "acquired demonic powers (Spectacular Spider-Man #147, 1989)", 
                "joined Sinister Six (Amazing Spider-Man #335, 1990)", 
                "Demogoblin separated from Macendale (Web of Spider-Man #86, 1992)", 
                "acquired Kraven's formula (Spider-Man #48, 1994)", 
                "acquired cybernetic enhancements (Spider-Man #68, 1996)", 
                "captured (Spider-Man #69, 1996)", 
                "killed by Roderick Kingsley (Spider-Man: Hobgoblin Lives #1, 1997)"
            ], 
            "speed": 3, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": 210
        }
    }
}