{
    "aliases": "Commander", 
    "citizenship": "U.S.A.", 
    "content": "Hodge became a lawyer, but then turned to advertising and public relations and became a highly successful member of a leading New York advertising agency. Meanwhile, he secretly created an organization devoted to the destruction of all mutants, the Right. Hodge was the leader of the group and was known as the Commander.Worthington, still believing that Hodge was his friend, turned to him to help with come up with a way to combat the growing prejudice against mutants. They came up with idea for the original X-Factor. The original members of the X-Men, the Beast, Cyclops, Marvel Girl, and Iceman agreed to join the group. X-Factor's concept-- a group of supposed mutant hunters who would in fact make contact with mutants and train them in the use of their powers-- quickly backfired on the group. It actually intensified people's hatred of mutants, just as Hodge had planned.Unknown to the rest of X-Factor, Hodge arranged for the Right to kidnap the young mutant known as Rictor in hopes of creating an earthquake that could be blamed on mutants, but X-Factor foiled their scheme and rescued Rictor. He also contacted a genetic engineer, Dr. Frederick Animus, who later became known as the Ani-Mator, and commissioned him to find a way to prevent mutations from occurring. Instead, Animus defied his employer's orders and created the \"Ani-Mates.\" The Right had arrived on the scene to discipline the defiant Animus, and ended up battling the Ani-Mates and their allies, the New Mutants. Ultimately, the New Mutant, Magik, transported all of the Right to the dimension of Limbo, but Hodge narrowly escaped that fate.When the Angel's wings were damaged in a fight with the Marauders, Hodge secretly arranged to have the damaged wings amputated. Then, he convinced Warren Worthington to change his will, to give most of his fortune to X-Factor if he were to die, with Hodge as the executor of the estate. Soon after, Worthington seemingly committed suicide in an airplane that exploded, and Hodge controlled the Worthington fortune. By now, the other members of X-Factor had realized that Hodge was their enemy. They engaged the Right in a battle and learned that Hodge was actually the leader of the group. Although he escaped, the Right were dealt a crippling blow and have yet to recover.Cameron Hodge later made a pact with the demon N'Astirh. He would provide it with mutant babies for his scheme to invade Earth with demons, and Hodge was told that he would not die in his next battle with the mutants. He was granted the gift of immortality.Warren Worthington's fiancée, Candy Southern, was kidnapped by Hodge, who killed her to get back at Worthington. To end that battle, Worthington, now Archangel, beheaded Hodge in a rage with his new metallic wings.Because of his immortality, Cameron Hodge did not die, but made his way to the island of Genosha, then a mutant-repressive nation. Hodge gained an influential governmental position, and his head was now attached to the form of a large mechanical spider with a myriad of mechanical powers. He lured all the mutants from the teams X-Men, X-Factor, and New Mutants to Genosha, where he would be able either to subjugate or kill all of them.Among his first captives was the alien Warlock, and Hodge attempted to siphon off his shape-shifting power so he could change his spider-form at will. His plan seemed to be thwarted by Warlock's friend Wolfsbane, but Warlock died anyway. It became apparent to the government of Genosha as well as to the mutants that Hodge was planning to take over the island and use it as his base for the extermination of all mutants. Hodge's body was destroyed by the brothers Cyclops and Havok, and he was buried during the collapse of a skyscraper.Hodge nonetheless survived, due to his partial success in siphoning Warlock's powers. Hodge now possessed powers similar to Warlock's \"techno-organic\" physiology, which allowed him to absorb other people and technology into himself. Eventually, he and the mutant haters he absorbed evolved and joined into the collective race know as the Phalanx (an offshoot of the alien Technarchy race of which Warlock was a part). The new Phalanx assimilated a number of people, including loved ones of the X-Men, while clashing with the X-Men at various times. The Phalanx, however, soon developed its own collective intelligence, greater than the sum of its parts. Realizing this, the Phalanx destroyed Hodge's brain, effectively killing him while allowing itself to live on. Later, it tried to contact the Phalanx collective in deep space, but they were stopped once again by the X-Men who ended up effectively melting the Phalanx.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "fighting": 1, 
    "firstappearance": "New Mutants #98\n", 
    "groupaffiliation": [
        "Purifiers", 
        "formerly Phalanx", 
        "consultant to the human government of Genosha", 
        "leader of the Right"
    ], 
    "id": "Hodge,_Cameron", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Leader of an anti-mutant militia", 
        "(formerly) public relations businessman"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "After a deal with the demon N'Astirh, Hodge was granted immortality, and his body could not be killed by conventional means. At this time, he also proved immune to psychic attacks, reflecting them back to their users, although whether this was a part of his deal with N'Astirh or due to unknown technology is unclear.  Later, as part of the Phalanx, Hodge was a part of the collective intelligence and physical mass of the Phalanx entity, sharing in its powers of matter-assimilation, shape-changing, computer interfacing, energy blasts, and more.", 
    "realname": "Cameron Hodge", 
    "significantissues": "X-Factor #1 (1986)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}