{
    "aliases": [
        "Count Drakula", 
        "Dirk Byrd", 
        "Dark Mallard of the Night", 
        "Dopey Duck", 
        "Drakula", 
        "the Drivin' Drake", 
        "Duckboy", 
        "Duck-Man", 
        "the Ducknight Detective", 
        "the Feathered Fury", 
        "Howard the Human", 
        "Iron Duck", 
        "Killmallard", 
        "Leonard the Duck", 
        "Master of Quak Fu", 
        "Mister Duck", 
        "Pondhopper", 
        "Santa Claus", 
        "Shang-Op", 
        "Son of Satan", 
        "Osama el-Braka"
    ], 
    "citizenship": "Formerly Duckworld", 
    "content": "Howard found himself trapped in a world that he never made when the power-hungry demon Thog the Nether-Spawn used his magic to shift the interdimensional Cosmic Axis in hopes that all realities could be collapsed into one under his control. Howard was plucked from Duckworld and dropped into the middle of the Florida Everglades on Earth-- the site of this world's Nexus of All Realities. Reluctantly, Howard joined the similarly-dislodged Korrek the Barbarian and Earth’s Jennifer Kale, Dakimh the Enchanter, and the Man-Thing in stopping the forces of Thog. When the battle was over, Howard accidentally fell off the otherdimensional Stepping Stones of Oblivion and landed in the city of Cleveland, Ohio.In Cleveland, Howard was almost immediately arrested for believing to be disrupting the peace. (Actually, the culprit was Garko the Man-Frog who had stumbled into an encounter with Howard.) However, the police soon released him, not wanting to face the public ridicule for having booked a duck. Howard then hoped to find a job, perhaps by solving a series of murders, and instead found himself in an encounter with the vampiric Hellcow.Despondent that he might never get home or even a job, Howard happened upon the castle of the costumed criminal accountant Pro-Rata. He rescued young life model Beverly Switzler, escaping with the timely arrival of Spider-Man. Bev invited Howard to stay with her, and the two even fell in love.Although Howard has attempted to live as normal a life as possible, considering that he is a talking duck on a world of human beings, he has continually run afoul (so to speak) of various unusual menaces, most notably the members of the Band of the Bland and his archnemesis Doctor Bong. However, through cleverness, persistence, and (perhaps most of all) good luck, Howard has always managed to defeat or escape his adversaries.Howard came to public notoriety when he became a candidate for the United States presidency on a very minor party ticket known as the All-Night Party. However, the general populace refused to believe that Howard is a real talking duck, thinking of him instead as a small person in a duck suit, and the public dismissed his candidacy as a joke.Bev eventually asked that she and Howard separate. Howard, despite his feelings for her, agreed but embarked on a series of wanderings that took him around the country, from Chicago, to New York, and San Francisco. His adventures finally led him back to Cleveland, whereupon he and Bev reunited. After the two reunited Howard faced several different and strange foes such as Ducktor Doom (Larval Earth), Spider-Ham (Larval Earth), Captain Americana, Jackpot, Grey Panther, Kidney Lady, Mister Chicken, Pinball Lizard, and several other creatures and people with fantastic (and sometimes lame) powers.When Howard’s nemesis Doctor Angst attempted to “squish” all realities into a universal state of inertness, Howard was chosen by the cosmic entity called the Critic to join She-Hulk in confronting Doctor Angst and the Band of the Bland, and the universes were restored to their rightful order.Later, Howard encountered the young mutants Chamber and Skin, who were on the run of the mutant-hunting X-Cutioner. Howard helped them escape and make their way back to their team, Generation X, at the Massachusetts Academy. Howard stayed at the Academy briefly, forming a friendship with the children Artie, Leech, and Franklin Richards. About the same time, the Academy was targeted by the villain Black Tom, and Man-Thing rescued the children, Howard, and an alien refugee Tana Nile. This unlikely band of heroes helped Man-Thing restore balance to the Nexus of All Realities before being returned to the Academy and Howard soon parted company.When a group of heroes was restored to reality after being shunted to Franklin Richards' Counter Earth, the Nexus of Reality was damaged. Howard, because of his experiences passing through the Nexus, he found that a fragment of it became lodged within him. The Cult of Entropy, led by Mahapralaya, hoped to kill Howard in the Man-Thing's swamp and thus destroy the Nexus, Howard was rescued by the Man-Thing and Ellen Brandt. The Man-Thing merged with the Nexus fragment by pouring itself down Howard's throat and being regurgitated. Mahapralaya and the cultists were forced to flee, and Howard left for Cleveland.", 
    "durability": 3, 
    "education": "Four-year college degree and limited training in various martial and mystic arts", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 3, 
    "firstappearance": "Adventure into Fear #19 (1973)\n", 
    "groupaffiliation": [
        "Formerly the Defenders", 
        "Daydreamers", 
        "To Hack and Back Cab Company", 
        "Circus of Crime", 
        "All-Night Party", 
        "ally to Dakimh the Enchanter", 
        "Jennifer Kale", 
        "Man-Thing", 
        "Korrek the Barbarian", 
        "She-Hulk", 
        "Spider-Man", 
        "and many others."
    ], 
    "hair": "Yellow/White\n", 
    "height": 0, 
    "id": "Howard_the_Duck", 
    "identity": [
        "Publicly known (most people believe Howard is a small person in a duck suit", 
        "not a real talking duck)"
    ], 
    "intelligence": 4, 
    "knownrelatives": "Dave (father), Dottie (mother), Theresa (sister, deceased), Orville (brother, deceased)", 
    "occupation": [
        "Adventurer", 
        "cab driver", 
        "reluctant warrior", 
        "former nursing home attendant", 
        "poster child for Ducktitis", 
        "baby sitter", 
        "video store clerk", 
        "burlesque show director", 
        "computer salesman", 
        "actor", 
        "dish washer", 
        "amateur wrestler", 
        "repossession man", 
        "presidential candidate", 
        "construction worker", 
        "poet", 
        "and folk singer."
    ], 
    "origin": [
        "Howard the Duck #13 (1977)", 
        "Howard the Duck #6", 
        "8 (1980)"
    ], 
    "placeofbirth": [
        "New Stork City", 
        "Duckworld"
    ], 
    "powers": "Howard the Duck has no superhuman powers, although it is suggested that Howard possesses a high degree of as yet undefined magical powers.", 
    "realname": "Howard (full name unrevealed)", 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 40
}