{
    "aliases": [
        "Annihilator", 
        "Captain Universe", 
        "Joe Fixit", 
        "Mr. Fixit", 
        "Mechano", 
        "Professor", 
        "War", 
        "Bruce Bancroft", 
        "David Banner", 
        "David Bixby", 
        "Bob Danner", 
        "Bruce Jones", 
        "Bruce Roberts", 
        "David Blaine", 
        "the Green Scar", 
        "Green Goliath", 
        "Jade Giant", 
        "Bob", 
        "World-breaker", 
        "Sakaarson"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Robert Bruce Banner was the son of an alcoholic who deeply hated him. Banner's mother showed much affection for her child, who returned her love, but this only served to fuel his father's rage. Dr. Brian Banner was an atomic physicist who worked on producing clean nuclear power as an energy source, but he was afraid his exposure to it mutated his son's genes. Bruce showed signs of high intelligence at an early age which strengthened his father's belief. Brian became abusive to Bruce and when his mother intervened, Brian murdered her. He frightened Bruce to keep quiet, but his own bragging landed him in a psychiatric institute.As a child Bruce was withdrawn, possibly developing a split personality to help deal with his pain and rage. His only happiness came from spending time with his cousin Jennifer Walters. Bruce found it hard to develop friendships and often found himself on the receiving end of physical abuse at the hands of school bullies. One such incident sparked him to build and plant a bomb in the basement of his school. The bomb was a dud, and Bruce was expelled, but the military took notice of his genius. Eventually, Bruce earned a doctorate in nuclear physics and started a career with them.File:Acotilletta2--Hulk beginning 2.jpgSupervising the trial of an experimental gamma bomb that he designed for the U.S. Defense Department at a nuclear research facility in New Mexico, Bruce selflessly rushed to the rescue of an ignorant teenager who had wandered onto the testing field as the countdown ticked inexorably toward zero. After shoving young Rick Jones to safety in a nearby ditch, Bruce was struck full-force by the bomb blast. He survived, but was irradiated by the deadly gamma energy.At first, Banner would transform into the brutish gray Hulk only at sunset, and revert to human form at dawn. Eventually, his changes into the childlike green Hulk came to be triggered by the release of adrenaline when he was intensely excited, no matter what time of day. The green Hulk possesses little of Banner's memory and intelligence, and is easily enraged; making him a menace to society.Since Banner's initial transformation into the Hulk, military forces commanded by the implacable General Thaddeus \"Thunderbolt\" Ross – Bruce's one-time benefactor – have hunted him continually. Hulk continued to make more enemies within the military such as Major Glenn Talbot as he and Bruce constantly competed for the affections of Ross' daughter, Betty.For a short time, Banner successfully treated his condition with radiation and was able to maintain enough of his own personality when he became the Hulk to control himself in that form. Subsequently, he earned the government's favor by destroying the alien Metal Master and received a presidential pardon.Unfortunately for the Hulk, there are many who used his limited intelligence against him and attempted to manipulate him for their own selfish means. Vile menaces like the Leader, Tyrannus, and Captain Omen. When Hulk proved to be too hard to control, they sent their minions like Aquon and Mogol to confront him physically. Enemies came in all shapes and sizes, ranging in power levels. From mere humans like Devastator, to evolved beings like the Inheritor, to monstrous powerhouses like Glob, Hulk always found a way to prevail – even against those who masqueraded as friends such as his old physics professor, Geoffrey Crawford – later known as Ravage.Gamma-powered psychiatrist Leonard \"Doc\" Samson captured the Hulk and successfully separated Banner and his alter ego. Without Banner's psyche to restrain him, the Hulk became a greater danger than ever before. Realizing there was only one way to reign in the Hulk, Banner agreed to merge with the monster. But the stress of the re-integration fractured Banner's subconscious, creating the street-smart gray Hulk. During this time, he spent several years in Las Vegas, sometimes operating as an enforcer calling himself Mr. Fixit (or \"Joe Fixit.\") The smart-mouth Fixit was an ill-tempered, wise-cracking, thuggish brute whose personality resembled that of his father and the fraternity boys who surrounded him in college. It was also at this time that Joe Fixit began his a short-lived relationship with the future wife of Rick Jones, Marlo Chandler.  In this state of the Hulk, Banner again found himself changing into the Hulk at night and into his human form in the light of the day.Soon after, the swirling mess of persona and mentalities took their toll on the ever-flustered mind of Dr. Banner, and a battle for supremacy and control took place in Banner's subconscious.  With assistance by the Ringmaster and his hypnotic abilities, Doc Samson tapped into the subconscious of Banner and reached his separate incarnations.  Through this hypnosis, Banner, the green Hulk, and the grey Fixit all aligned to face their true inner demons-- Banner's unresolved issues with his abusive father and the murderer of his mother. With this realization, Banner was able to fuse these mentalities together, finding peace of mind.  However, a green but intelligent version of the Hulk emerged. He had the mentality of Dr. Banner but the body and abilities of the Hulk – later nicknamed the Professor. Although Banner had his dominant personalities merged together, there were a number of other personas running through his mind including that of a \"Devil-Hulk.\"The surly version of the Hulk remained in this state, never changing until much later when the two Hulk fragments re-merged, and Banner and Hulk split their time and existence. The Maestro returned after absorbing enough radiation to re-form his body after suffering a previous defeat from Hulk, but was beaten again. He reestablished a connection to his wife, Betty, but was left a broken man after her death due to radiation poisoning. Banner blamed himself, believing it was Betty's prolonged exposure to him that caused her death, but he discovered the Abomination had injected her with his radioactive blood. Hulk would later bludgeon his archenemy into a bloody pulp, nearly killing him.After the events of the M-Day, Banner sought refuge and peace in Alaska, where he lived as a hermit loosely connected to the town community. He was eventually tracked down by Nick Fury of S.H.I.E.L.D., who required his help in defeating the Hydra space weapon called the Godseye which could detonate all the nuclear bombs in the world. Sent up as the Hulk, he discovered that the Godseye was actually a rogue S.H.I.E.L.D. weapon that could match the strength of any enemy. In the ensuing battle, the Godseye found that though it could try, it could not match the increasing power of the Hulk, and it exploded.Once they arrived, the Hulk crushed Black Bolt on Attilan and took the city of New York as his battleground. Iron Man, Mister Fantastic and Doctor Strange all fell before the Hulk and his Warbound too. Even old sparring partners such as the X-Men as well as new threats like the Gamma Corps couldn't even slow the Hulk's rampage.  \nIron Man called upon the combined power of various satellites to finally put an end to Hulk's war. Banner was taken into S.H.I.E.L.D. custody and was placed three miles below the Mojave Desert. The Warbound was also placed in S.H.I.E.L.D. custody, but they escaped after saving New York from being split in half by an expanding chasm the Hulk created.While Banner was incarcerated at Gamma Base, a new mystery revealed itself when long-time Hulk foe, the Abomination, was found murdered in his homeland of Russia. A team comprised of Iron Man, General Ross, Samson, She-Hulk and Commander Maria Hill went to investigate only to determine the only suspect that could have done this was the Hulk. The perpetrator soon revealed himself on a S.H.I.E.L.D. Helicarrier, and it was indeed a massive creature referring to itself as the Red Hulk. This new incarnation of the Hulk decimated the likes of She-Hulk, Iron Man, Thor, and even Rick Jones in his new powered up identity named A-Bomb. Banner was set free when the conflict between the Red Hulk and A-Bomb caused a big enough earthquake to damage his prison. The potential threat to Banner's life triggered his transformation into the Green Goliath, and the Hulk wasted no time in confronting his new nemesis. The Hulk was caught unprepared for the Red Hulk's fighting style. He was defeated in their first meeting - suffering a broken arm in the process - but the outcome was much different during their second clash. The Hulk found a potential weakness in the Red Hulk and exploited it. Once the Red Hulk was beaten, the Hulk left before he could find out the Red Hulk's true identity. However, Banner had been spending his time trying to track down the Red Hulk before he can do anymore damage. On his journey, Banner ended up in Las Vegas where the Hulk had to team up with Sentry, Ms. Marvel, Moon Knight and even Brother Voodoo to quell a pack of Wendigos from devouring everyone inside a casino.The Grandmaster came to Hulk with a proposition: if Hulk chose to participate in a game and won, Grandmaster would bring his love, Jarella, back to life. Hulk agreed and was told he could pick a group of allies to aid him in the game. Hulk chose his former teammates in the Defenders: Namor, Doctor Strange, and Silver Surfer. When the time came to meet their opponents, the Collector appeared with the Red Hulk, and his team: Baron Mordo, Terrax and Tiger Shark - now known as the Offenders. With the game underway, a member of each team was paired up on separate battlefields, but each couple was too evenly matched. In an unexpected turn of events, the Red Hulk impaled the Hulk on a trident, killing him. Grandmaster would eventually resurrect the Hulk to attend to an out of control Red Hulk, but he would still be left broken-hearted over the loss of his beloved Jarella – much to the satisfaction of his red nemesis.Banner became a captive of M.O.D.O.K. and the Intelligencia, and quartet of heroes attempted to infiltrate the underground base to free him. They uncovered that at the end of Hulk's war with the heroes of Earth, the satellites Stark used to end the Hulk's rampage were hacked into by M.O.D.O.K. for the sole purpose of interfacing with Banner's irradiated cells. With this information, and the help of a seemingly traitorous General Ross, M.O.D.O.K. intended to create an army of gamma-powered soldiers. They already caused Doc Samson to develop an evil split personality, transformed Rick Jones into the monstrous A-Bomb, and created the Red Hulk. When Samson turned on his group and attacked She-Hulk, leaving Ben Urich and Peter Parker to fend for themselves against the Red Hulk, an enraged Banner released his alter-ego to save them. The battle between the Hulks left the base in ruins, but it appeared it would be the last time these behemoths would ever clash again. The Red Hulk used his power to absorb radiation to drain Hulk dry, leaving Banner unable to ever transform into the Green Goliath again. Taking Hulk out of the equation so soon wasn't initially part of the plan, but that was only the start of the Intelligencia's master stroke.With the threat of the Intelligencia behind him Banner began to make amends with his makeshift family, but Betty wanted no part of it. The more Bruce pushed the more she spurned his advances and eventually transformed into her Red She-Hulk persona and vaulted away. Banner followed suit and pursued as the Hulk which only led to a clash titanic enough to grab the attention of Steve Rogers and his Avengers. It was at this time Hulk discovered he had another son – Skaar’s twin brother, Hiro-Kala, who was racing toward Earth with the planet K’ai in tow. The Hulk took his family into space to stop Hiro-Kala before the planets collided, killing everyone on both. While Hulk’s allies dealt with Hiro-Kala’s forces, Hulk confronted his son with the hope he could reason with him. He soon found out his second son was evil and cruel, and the only thing he understood was violence. Still, Hulk could not bring himself to kill his own flesh and blood, so Skaar sealed Hiro-Kala in a rock tomb, leaving him imprisoned on K’ai for the foreseeable future. K’ai was brought back to its point of origin, the Microverse, by Arcturus Rann and the Enigma Force.", 
    "durability": 7, 
    "education": "Banner has a PhD in Nuclear Physics. The various Hulk personas have demonstrated different intelligence levels, from brutish to average to the same level of intelligence as Banner.", 
    "energy": 1, 
    "eyes": "Brown (Banner); Gray (gray Hulk); Green (green/savage Hulk);\nGreen (green/Professor Hulk)\n", 
    "fighting": 5, 
    "firstappearance": "Incredible Hulk #1 (1962)\n", 
    "groupaffiliation": [
        "Formerly Avengers", 
        "Defenders", 
        "Fantastic Four", 
        "Pantheon", 
        "Horsemen of Apocalypse", 
        "Warbound"
    ], 
    "hair": "Brown (Banner); Black (gray Hulk); Green (green/savage Hulk);\nGreen (green/Professor Hulk)\n", 
    "height": 60, 
    "id": "Hulk_(Bruce_Banner)", 
    "identity": "Publicly known", 
    "intelligence": 6, 
    "knownrelatives": "Betty Ross Banner (wife, deceased), General Thaddeus \"Thunderbolt\" Ross (father-in-law), Jennifer Walters (She-Hulk, cousin), Morris Walters (uncle), Elaine Banner Walters (aunt, deceased), Brian Banner (father, deceased), Rebecca Banner (mother, deceased), Lyra (daughter), Skaar and Hiro-Kala (sons)", 
    "occupation": [
        "Unemployed", 
        "former nuclear physicist"
    ], 
    "origin": "Incredible Hulk #1 (1962)", 
    "placeofbirth": [
        "Dayton", 
        "Ohio"
    ], 
    "powers": "The Hulk possesses an incredible level of superhuman physical ability. His capacity for physical strength is potentially limitless due to the fact that the Hulk's strength increases proportionally with his level of great emotional stress, anger in particular. \nThe Hulk uses his superhumanly strong leg muscles to leap great distances. The Hulk has been known to cover hundreds of miles in a single bound and once leaped almost into orbit around the Earth. The Hulk can also use his superhumanly leg muscles to run at super speeds, although his legs have limitless strength he does not have limitless speed and once he reaches a certain speed his legs become too strong and destroy the ground giving him no friction to run on, therefore he jumps to travel. \nThe Hulk can slam his hands together creating a shock wave, this shock wave can deafen people, send objects flying and extinguish fires. His thunderclap has been compared to hurricanes and sonic booms. \nThe Hulk has shown a high resistance to physical damage nearly regardless of the cause, and has also shown resistance to extreme temperatures, mind control, nuclear explosions, poisons, and all diseases. In addition to the regeneration of limbs, vital organs, and damaged or destroyed areas of tissue at an amazing rate. The Hulk also has superhuman endurance.\n\nThe Hulk's body also has a gland that makes an \"oxygenated per fluorocarbon emulsion\", which creates pressure in the Hulk's lungs and effectively lets him breathe underwater and move quickly between varying depths without concerns about decompression or nitrogen narcosis.", 
    "realname": "Robert Bruce Banner", 
    "significantissues": [
        "See OHOTMU Bibliography", 
        "Working with the Red Hulk against Intelligencia  (Fall of the Hulks: Gamma, 2010)", 
        "Captured by the Intelligencia (Incredible Hulk #608, 2010)", 
        "Hulk returns (Incredible Hulk #610, 2010)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 128
}