{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A. (Earth-928)", 
            "content": "Seeing his mistakes for the first time, John returned to Lotusland, his old studio, and resigned.  But then a cybernetic tyrant named Draco attacked the studio and Gawain was killed despite John’s promise of protection.  Enraged, John turned into the Hulk and fought back against Draco, eventually being helped by the studio’s artist, Angel Zamora, and together the old employees took over the company to rededicate it to positive change and meaning.At the same time, a being called the Cybershaman appeared, leading a group called the Human Tribe and plotting to take over L.A. in the name of nature and chaos over corporate control.  While some at Lotusland wanted to join them, John didn’t.  And when the Cybershaman’s tribe chased Quirk Simulacrum, a subversive musician and friend to the Hulk, into the path of the Hulk, they offered for him to join them and lead the rebellion.  The Hulk refused, not wanting a new tyrant, and with the help of his enemy, Draco, he found the man behind the Cybershaman and stopped him just as he had taken control over the security systems of L.A., ending his plans and possibly killing him.Nikolai Apolonio, a scientist at Lotusland, later found the Knights of the Banners plans for gamma technology in Lotusland’s computers and discovered a way to use gamma radiation’s power to enhance inherent personality traits.  After turning himself into Doctor Apollo, a being with the power to radiate people with gamma and exaggerate their personalities, he affected the staff of Lotusland, bringing out their worst sides.  When his natural tendency for rage and destructive need for freedom got out of control along with his size and strength, The Hulk transformed back and used his personality as John to manipulate Apolonio into reversing his experiment, using the Doctor’s desire for knowledge against him.When Doctor Doom became President of the United States he sent a series of Environmental Maintenance Platforms to L.A. in order to subdue the problem city.  The Hulk immediately attacked one, destroying it, and inadvertently giving Draco the power to control them.  So that when Draco used them to poison the citizens of L.A. and blame Doom, the Hulk brought Apolonio with him onto one in order to stop it.  Instead, the device rocketed into space, taking both of them with it, while at the same time Draco made his move on Lotusland.  Once the Hulk and Apolonio managed to regain control of it, they returned to Lotusland to face Draco, but found that Zamora had promised the Gamma Ray’s mind-warping technology to Doom in order to save them.  Using his then-separate personality as John, the Hulk took over control of Lotusland, along with the power-hungry Keisha Schultz-Valdez, in order to work with Doom.But Quirk came back and tricked John into transforming into the Hulk in front of Keisha.  With the Hulk’s rebellious personality reestablished, he stole the Gamma technology and escaped with Quirk.  They came across John’s sister Marian, who was indebted to a group known as the Locusts, which the Hulk had been forced to restrain from rioting previously, and she revealed that her former group was planning to set off a bomb which would create earthquakes big enough to destroy California.", 
            "durability": 1, 
            "education": "Law degree", 
            "energy": 1, 
            "eyes": "(As Eisenhart) Blue; (as Hulk) Red iris with yellow sclera\n", 
            "fighting": 1, 
            "firstappearance": "2099 Unlimited #1 (1993)\n", 
            "groupaffiliation": "Lotusland Entertainment", 
            "hair": "(As Eisenhart)Blonde; (as Hulk) Green\n", 
            "height": 0, 
            "id": "Hulk_(2099)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Marian Eisenhart (sister)", 
            "occupation": [
                "Concept hunter", 
                "lawyer"
            ], 
            "origin": "2099 Unlimited #1 (1993)", 
            "placeofbirth": [
                "Hollywood", 
                "California (Earth-928)"
            ], 
            "powers": "Massively enhanced strength, which varies with his emotional state and when exposed to higher levels of gamma radiation.  Near invulnerable.  Able to leap great heights, but can be hurt if distance is too great.", 
            "realname": "John Eisenhart", 
            "significantissues": "See online bibliography", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel 2099 (Earth-928)", 
            "weight": 170
        }
    }
}