{
    "aliases": "None", 
    "citizenship": "Unrevealed", 
    "content": "When Virginia Dare and her Indian companion, Rojhaz, petitioned James to give money to the American colonies, Banner was there as James turned her down. Banner warned Virginia not to speak to the King in her disrespectful way, but James waved it away. Banner then read aloud a petition for the stay of execution of Doctor Strange, a cohort against the Crown, which promised that he would burn his magical books. But James explained that he wasn’t going to be killed a magician, but as a traitor. After the imprisonment of Peter Paraquagh, the former assistant to Nicholas Fury, James offered Peter the chance to redeem himself by working for the Crown again; then sent him across the sea to kill the traitor, Fury. Finally, Banner was asked to go with him, and he was given the chance to do his own work.Banner was absent when Fury found the boat carrying Banner's men and murdered the lot of them, except for Peter who he offered his life to. Unbeknownst to Banner, Peter turned down the chance, and slipped away. Later, when Fury tricked the out-of-time Captain America and knocked him out to bring him back to close up the tear in their universe, Banner spied him through his telescope. He aimed a crossbow at him, explaining to Peter that it didn’t matter what Fury was doing; he had to die. But a dog–actually a transformed Virginia Dare–attacked him and ruined his shot. Banner yelled at Peter to get the dog off while they still had a chance at killing Fury, but Peter hesitated. Peter eventually called the dog off Banner, as it listened to him, but it was too late to kill Fury.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown (as Banner), Unrevealed (as Hulk)\n", 
    "fighting": 1, 
    "firstappearance": "Marvel 1602 #2\n", 
    "groupaffiliation": "Former servant to King James", 
    "hair": "Black (as Banner), Black (as Hulk)\n", 
    "id": "Hulk_(1602)", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Former servant to King James", 
    "origin": "Marvel 1602 #8", 
    "placeofbirth": "Unrevealed", 
    "powers": "As Banner, he has no superhuman powers, but as the Hulk he presumably has massively enhanced physical strength, resistance to injury, and increased healing.", 
    "realname": "David Banner", 
    "significantissues": "Marvel 1602 #2 (intro), Marvel 1602 #8 (transformation into Hulk)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 1602 (Earth-311)"
}