{
    "aliases": "Theodore \"Teddy\" Altman", 
    "citizenship": "U.S.A.", 
    "content": "Teddy used his abilities to fit in at school and became best friends with Greg Norris, the class president and captain of the basketball team. It was to Greg that he first revealed his powers and suprisingly enough Greg, instead of being unnerved, saw the advantages of Teddy's gift. Greg and Teddy pulled many cons and pranks by having Teddy change into popular figures such as Johnny Storm, Hulk and Tony Stark. After hearing that the Avengers had disbanded Teddy was shocked, but Greg had an idea and the two went to the wreckage of the Avengers Mansion. Teddy was in awe of the place and respected it, while Greg went to business with the reason he made the trip by gathering up all he could to sell. Teddy argued that it was wrong to steal and urged Greg to stop but he merely pointed out that Teddy steals peoples identities all the time and that no one would believe Teddy over him if Teddy called the cops. At that point Teddy used his shape-shifting to intimidate Greg who then stepped down and left.After the Patriot quit the team the rest tried to talk him into coming back. While doing so Teddy was abducted by the Super-Skrull who claimed that Teddy was a Skrull himself and he had come to take him back. After a battle the group (minus Eli) escaped to Billy's house where they found Teddy's mother waiting, but before anything could be made clear the Super-Skrull broke in with Eli as a hostage demanding that Teddy comes with him. The Super-Skrull then used a device that was supposedly suppose to reveal that Teddy was a Skrull but instead of Teddy turning into a Skrull his mother did. She stated that she was ordered by the Empress to protect Teddy and shot at the Super-Skrull who retaliated by setting her on fire resulting in her death.The Kree soliders then said that Teddy was the son of Captain Mar-Vell and by law had to join the Kree army, but Teddy refused and and battle broke out. As the Young Avengers made their escape Teddy insisted in taking the Super-Skrull with them.The Young Avengers then found themselves in the middle of another battle as Skrull and Kree Troops both appeared both demanding that Teddy come with them, but they were aided by the New Avengers. The conflict was resolved when the Super-Skrull, posing as Teddy, agreed to a deal in which Teddy (the Super-Skrull) would spend 6 months with the Krees and 6 months with the Skrulls before making a decison on who he would side with. With the help one of the Super-Skrull to trick both races they transformed into each other the Super-Skrull into Teddy and Teddy into the Super-Skrull, the arrangement was still in order when the races left and Teddy revealed himself safe from both races and staying in earth. After all was done Teddy scattered the ashes of his foster mother to the breeze at the Avenger's Mansion.", 
    "durability": 6, 
    "education": "High School Student", 
    "energy": 2, 
    "eyes": "Variable, usually Blue\n", 
    "fighting": 3, 
    "firstappearance": "Young Avengers #1\n", 
    "groupaffiliation": [
        "Secret Avengers", 
        "Young Avengers"
    ], 
    "hair": "Variable, usually Blonde\n", 
    "height": 0, 
    "id": "Hulkling", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Captain Marvel (Mar-Vell) (father, deceased), Annelle (mother), Photon (Genis-Vell) (half-brother, deceased), Phyla (half-sister)", 
    "occupation": [
        "Adventurer", 
        "student"
    ], 
    "placeofbirth": "Skrull Throneworld", 
    "powers": "Hulkling is a shapeshifter of remarkable ability. While he most commonly shifts into a teenage version of the Hulk, he has also been known to impersonate well known superheroes such as the Human Torch, Mister Fantastic, and Tony Stark. He can also metamorph: growing claws, extending his reach, and growing wings in a protoplasmic manner. In addition to shapeshifting, Hulking possesses super-strength which appears independent of any form he might take.", 
    "realname": "Dorrek VIII", 
    "speed": 3, 
    "strength": 6, 
    "universe": "Marvel Universe"
}