{
    "aliases": [
        "Matchstick Johnny", 
        "Doug Brown"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Growing up in suburban Glenville, Johnny Storm was drawn to automobiles despite his mother's death in a car accident, and became quite a mechanic at a young age. While still a teenager he selflessly rescued two of his friends from a burning building. No stranger to adventure, Johnny-son of famous doctor and infamous criminal Franklin Storm-was nearly chosen as the human host of the demonic Zarathos, the Ghost Rider, and was attacked by the legendary St. Germaine, who sought the power for himself. Johnny escaped the lure of Zarathos with the help of archeologist Max Parrish, the uncle of Cammy Brandeis, on whom Johnny had a bit of a crush.Though a member of the world-famous Fantastic Four, Johnny was still a teenage Glenville High student - albeit one who regularly clashed with super-powered menaces. Johnny even tried to conceal his dual identity from most of the locals at first, though this soon proved futile (the true identities of all four FF founders being widely known almost from the start). In solo action, he fought the communist Destroyer (Charles Stanton) and Rabble Rouser; the Wizard (born Bentley Wittman); Zemu, Warlord of the 5th Dimension; Paste-Pot Pete; Acrobat (Carl Zante); Vilhelm von Vile, the enigmatic Painter of 1000 Perils; the Sorcerer of Glenville Woods; the Asbestos Man (Orson Kasloff); the Eel (Leopold Stryke); the Plantman; modern-day pirate Captain Barracuda, whom Johnny defeated in the first of several team-ups with his super-heroic opposite number Iceman; and the Terrible Trio.Super-villains, however, weren't Johnny's only rivals. Mike Snow, a member of the Glenville High wrestling squad, bullied Johnny until an accidental flare-up of the Torch's powers scarred Snow's face. Despite their animosity, Snow concealed the incident, blaming the injuries on a prank gone wrong and maintaining that Johnny had actually saved his life that night by flying him to the hospital. While Mike tried to move on with his life, Johnny did the same, dating fellow student Dorrie Evans, although she eventually grew tired of his constant disappearances and broke it off. Johnny met another teenage hero, Spider-Man, who broke into the Baxter Building hoping to impress the FF. Despite their early misunderstandings, the Torch and Spider-Man eventually became good friends.When the Super-Skrull (Kl’rt), possessing the combined powers of the Fantastic Four, attacked the team, the Human Torch managed to trap him inside a cave, but the Super-Skrull escaped and impersonated Franklin Storm. The Four exposed the Super-Skrull, but the Skrulls strapped a bomb to the real Franklin's chest, and Franklin sacrificed his own life to save his children. A trip to the Skrull homeworld and the death of Warlord Morrat, the Skrull who authorized Franklin's murder, brought some measure of revenge, but this was not the last time the Skrulls would interfere in Johnny's life.After graduating high school, Johnny enrolled in Metro College, where he befriended his roommate, Wyatt Wingfoot. Wyatt joined Johnny and the Fantastic Four on a trip to Wakanda, where they first encountered the Black Panther and helped him defeat Klaw. Around this time, Johnny met the young Inhuman Crystal. It was love at first sight, and Johnny, along with the rest of the FF, helped her overthrow the mad Inhuman prince Maximus. Their love was passionate but short-lived, as Crystal returned to Attilan and married Quicksilver, the son of Magneto - eventually bearing his child. Johnny was crushed, but tried to move on. Hoping to catch up on old times with Dorrie Evans, he found that she had married and had two kids since they had broken up. Despite dropping out of Metro U, Johnny remained friends with Wyatt, who often participated in the Fantastic Four's adventures and was later romantically linked to the She-Hulk. When Johnny's sister Sue and her husband Reed were separated, Johnny joined the Thing, Medusa and Thundra in a staged battle against the rehabilitated Namor in an effort to bring the couple back together. Their ploy worked, and Sue and Reed patched things up for good. Seeking direction in his life, Johnny was tricked into attending the high-class Security College, a front for the Monocle, an agent of the megalomaniacal Enclave, who used him to steal top-secret high-tech weapons. Spider-Man broke the Monocle's control of the Torch. Johnny then joined the rest of the FF in space, where they helped the Champions of Xandar against the invading Skrulls. When Johnny's teammates were dying from a Skrull aging ray, Johnny destroyed the robotic assassin Skrull X, allowing the infirm Reed to use his weapon to reverse the aging.Johnny was briefly abducted by agents of the Messiah (Alden Maas) in his mad plot to expand the Earth by super-heating its core. Brought to Battleworld by the Beyonder and forced to battle various super-villains, Johnny met and was healed by Zsaji, a native of the planet. Physically but not emotionally attracted to Zsaji, Johnny found an unlikely rival in Colossus (Peter Rasputin), who fell in love with the healer. Although Zsaji returned Johnny's affection at first, she eventually chose Colossus over the Torch, but then sacrificed her own life to rescue several dying heroes. Johnny returned to Earth, where he found himself drawn to Alicia Masters, longtime girlfriend of Johnny's then-absent FF teammate, the Thing. Johnny and Alicia's romance helped estrange the Thing from the FF for a lengthy period. Johnny hit his lowest point when Tommy Hanson, a young fan of his, set himself on fire in an attempt to be more like his hero. Hearing of the boy's death, Johnny considered retiring as the Human Torch, but the Beyonder managed to talk him out of it. Eventually Johnny married Alicia, but a jealous Thing offered a spot in the Fantastic Four to Crystal, who was separated from Quicksilver at the time. Johnny's old feelings for Crystal slowly returned, but his love for Alicia enabled him to resist temptation, and Crystal eventually left the team.Despite their long and intimate relationship, Johnny was horrified to discover that the Alicia he loved and married was not the true Alicia Masters, but a Skrull imposter named Lyja. Originally sent to infiltrate and destroy the Fantastic Four, Lyja truly fell in love with Johnny, and joined the Fantastic Four in confronting Paibok, the Skrull who had kidnapped the real Alicia. Lyja seemingly sacrificed her life to protect Johnny, but her former lover Paibok nursed her back to health. Trying to move on from yet another failed relationship, Johnny enrolled at Empire State University; but Devos, Paibok and even Lyja attacked Johnny at ESU, forcing him to go nova, burning down a large section of the campus. Johnny briefly became a fugitive, chased after by Silver Sable's Wild Pack, until Reed agreed to sell some of his patents to pay for the damages. Lyja returned to Johnny's life again, tricking him into believing she was carrying his baby. When this proved a lie as well, Johnny left her again.Johnny briefly joined his nephew Franklin's Fantastic Force team, where he battled his virtually omnipotent extra-dimensional counterpart Vangaard (formerly Gaard), convincing him to abandon his mission of eliminating redundant realities by showing him the hero he could become. Lyja posed as student Laura Green and dated Johnny to stay close to him; Johnny recognized her when they kissed though he didn't share this until later, but the two never had the chance to explore their true feelings. After Franklin Richards created his Counter-Earth and rescued the Fantastic Four, Avengers, and several other heroes from death at the hands of Onslaught (entity), Roma deemed Franklin too powerful to ignore, and sent the Technet and the (Captain Britain) Corps to retrieve him. The Human Torch convinced Roma that Franklin's family, the Fantastic Four, would be able to nurture him so that he would not grow up to be a danger to the Omniverse.Seeking an acting career, Johnny was cast as the Rawhide Kid in a summer blockbuster; but it was eventually decided he wasn't ready for the role, which was given to Lon Zelig (actually the Super-Skrull). Johnny also spent some time as a firefighter at the behest of his former classmate, Mike Snow; but when Snow moved away after his wife turned out to be a psychotic arsonist and seemingly died, Johnny left the job (though he later returned to the profession during a period when the FF was short on cash). Sick of her brother's directionless life, Sue forced him to take a job as the Chief Financial Officer for Fantastic Four, Inc. Although initially in over his head, Johnny was able to stop a manufacturer from stealing the secret of Reed's Unstable Molecule suits, and began to warm up to both the job and his co-worker, Jian Fetta.Unfortunately, after a major battle with Doom, Reed attempted to claim Latveria for the Fantastic Four, an act that turned the United States government against them. To escape trial, the group was forced to sell many of their patents and holdings to the government, which left Johnny's wallet much emptier than usual and sent his popularity plummeting. Seeking help from the least popular person he could think of, Johnny contacted Spider-Man, who tried to cheer Johnny up by bringing him to a water park, where they were attacked by Hydro-Man. Easily defeating the villain and rescuing the park's popular mascot, Johnny found his popularity rising once more. Johnny also began to converse with a new girl over the internet, and hit it off when he finally met her. This girl, Cole, turned out to be the daughter of one of Johnny's oldest enemies, the Wizard; but although she was sent to trick the FF, Cole actually helped lead them to the Wizard's hideout, where they battled him and his new Frightful Four. The Wizard escaped and took Cole with him, but Johnny remained hopeful about meeting her again.Recently, an alien named Zius came to Earth, the location of the one being in the universe who could nullify his Galactus-proof planet-cloaking invisibility shield, Susan Richards. Zius threatened to destroy the planet if Sue did not sacrifice herself, but Reed used his power gun to switch her powers with Johnny's and tricked Zius into leaving the planet. As he left orbit, Galactus destroyed Zius' spaceship and claimed Johnny as his new Herald. Unwilling to lead Galactus to populated worlds, Johnny used his new powers to analyze Galactus and, with the help of the FF and Quasar, managed to transform Galactus back into humanoid form. Johnny's power cosmic faded, but during Reed's subsequent efforts to reverse Sue and Johnny's power switch, a remnant of the power caused a flare-up that temporarily sent the FF's powers into four random New Yorkers.", 
    "durability": 4, 
    "education": "Glenville High graduate; former student at Empire State University and Metro University", 
    "energy": 6, 
    "eyes": "Blue\n", 
    "fighting": 4, 
    "firstappearance": "Fantastic Four #1 (1961)\n", 
    "groupaffiliation": [
        "Fantastic Four", 
        "formerly Secret Avengers"
    ], 
    "hair": "Blond\n", 
    "height": 70, 
    "id": "Human_Torch_(Johnny_Storm)", 
    "identity": "Publicly known", 
    "intelligence": 4, 
    "knownrelatives": "Mary Storm (mother, deceased), Franklin Storm (father, deceased), Susan Storm Richards (Invisible Woman, sister), Reed Richards (Mister Fantastic, brother-in-law), Franklin Richards (nephew), Valeria Richards (niece), Marygay Jewel Dinkins (aunt), \"Bones\" (cousin), Lyja (estranged wife)", 
    "occupation": [
        "Adventurer", 
        "firefighter", 
        "Chief Financial Officer - Fantastic Four", 
        "Inc.", 
        "former actor", 
        "mechanic", 
        "race car driver", 
        "circus performer"
    ], 
    "placeofbirth": [
        "Glenville", 
        "Long Island", 
        "New York"
    ], 
    "powers": "Johnny can cover his body in fire, fly at supersonic speeds, project fireballs or other fire objects, manipulate existing flame, and absorb heat with some mental strain. He can generate a nova-level burst of flame, one million degrees Fahrenheit, although this usually exhausts his powers for some time. Under normal usage, he is able to maintain his flame form for up to 17 hours.\nJohnny briefly gained the powers of the Invisible Woman, which included the ability to turn himself and others invisible, and generate powerful force fields. Cosmically enhanced by Galactus, these powers were greatly amplified, and he could traverse space as well as analyze and manipulate all forms of matter.", 
    "realname": "Jonathan Lowell Spencer \"Johnny\" Storm", 
    "speed": 5, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 170
}