{
    "aliases": "None", 
    "citizenship": "Unrevealed", 
    "content": "He would get his chance to locate the 616 reality, when the future version of Adam Warlock, also known as the Magus would reassemble the Infinity Gauntlet, Hunger again sensed the Earth-616 dimension and managed to locate it this time. But he still could not enter Earth-616 dimension because it was a \"spherical\" reality, and needed an opening on both sides of the dimensional barriers. Hunger could open a portal to this dimension, but someone would need to open it from the other side as well. Hunger observed as Thanos offered his help to the Rigellians in order to make amends for his past misdeeds. Hunger viewed this as the starting point of his diabolical plan. He continued to monitor Thanos as he plotted his plan of retribution with Adam Warlock, Pip the Troll and an irritating Rigellian Recorder. This plan would pit Thanos against Galactus, to prevent his consumption of a Rigellian world. Pip teleported Thanos aboard Galactus' ship, where a brief conflict took place between Galactus and Thanos. This conflict ended with Thanos being turned away, apparently failing his mission.So Hunger used his abilities to convince Galactus into thinking that the vibratory patterns of the Infinity Gems were identical to the kind he consumed from planets. These thoughts sent Galactus on an obsessive mission to sedate his insatiable appetite through the assemblage of the Infinity Gems, just as Hunger had planned. Hunger then mentally influenced Galactus into building a device using the gems which, he thought would take away his need of living planets, but in reality Galactus was creating a doorway into his dimension. Hunger also used his mental abilities to shield Galactus from being able to detect any flaws in this plan.Unbeknown to Thanos while monitoring Galactus' actions, he witnessed Galactus used the core of the Rigellian world to extract the Space Gem from another dimensional plane. While trying to ascertain the motivation for Galactus' change in behavior, Thanos realized that he was attempting to relinquish his role as the world devourer, by using the Infinity Gems to replenish his life force. Hunger watched gleefully as his own desires began to take form. Galactus' sent the Punisher androids to secure the Soul Gem from the brow of Adam Warlock.  Thanos, Warlock and Pip escaped the destruction of his ship, but Warlock was to weak to help stop Galactus. Leaving the fate of the universe to Pip and Thanos, who teleport a board aboard the massive ship of Galactus. Thanos informed Pip that he believes that Galactus was being manipulated by a greater enemy.", 
    "durability": 1, 
    "education": "Self-taught", 
    "energy": 1, 
    "eyes": "Yellow\n", 
    "fighting": 1, 
    "firstappearance": "Thanos #1 (2003)\n", 
    "groupaffiliation": "None", 
    "hair": "None\n", 
    "height": 0, 
    "id": "Hunger_(extradimensional)", 
    "identity": "Hunger existence is unknown to the general populace of Earth", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": "Devourer of realities", 
    "origin": "Unrevealed", 
    "placeofbirth": "Unrevealed", 
    "powers": "Hunger is an inter-dimensional parasite: His powers appear to work on the same premise as the world devourer Galactus, with the exception being that Hunger feeds on entire dimensions. Once Hunger enters a dimension, he begins to absorb it and consume that reality. Thus concluding the fact that, Hunger eats realities. Hunger is temporarily vulnerable to extreme physical and energy attacks, but almost instantaneously adapts to whatever force is being applied to it and begins to absorb that force as well. Hunger also has formidable mental faculties, able to mentally influence even cosmic entities such as Galactus from a reality away.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}