{
    "aliases": "None", 
    "citizenship": "Unrevealed", 
    "content": "Having been told of the exploits of his ancestors in the Fantastic Four, Hyperstorm developed an elaborate plot to toy with them, without their knowledge of him. Learning of Hyperstorm's evil, Mister Fantastic's time-travelling father, Nathaniel Richards, tried to prevent Hyperstorm's coming into being by taking Franklin Richards into the future and raising him to become the teenage warrior Psi-Lord. Nathaniel hoped to help the team in various ways, such as showing the Invisible Woman new ways to access her power.Nevertheless, Hyperstorm knew of Nathaniel's plan and allowed it to continue. Hyperstorm even rescued the villainous Tomorrow Man from being lost in the time-stream and set him to attack the Four, which would eventually lead to the team's alliance with their former enemy Kristoff von Doom. In his most ambitious move, Hyperstorm snatched Mister Fantastic and his archenemy, Doctor Doom, from the moment of their deaths after a battle with an unknown alien entity, imprisoning Doom and exiling Mister Fantastic to a time period without technology. Thinking that Mister Fantastic had died, the team was demoralized and Mister Fantastic's confidence was almost completely shattered.Ultimately, the Fantastic Four were able to trace the Tomorrow Man to Hyperstorm's alternate future, confronting the villains directly. The Four were defeated and exiled, although this allowed them to rescue Mister Fantastic and return to confront Hyperstorm again. Doctor Doom had soon managed to free himself and tried to siphon Hyperstorm's power for himself. Instead, Doom was returned to his proper time period, and Hyperstorm revealed that he allowed all of this to transpire according to his own wishes, to the chagrin of a power-mad man such as Doom. Hyperstorm similarly sent the Four back to their time period, confident that they knew his power and would fear him.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #406 (1995)\n", 
    "groupaffiliation": "Leader of Zarrko the Tomorrow Man", 
    "hair": "Brown\n", 
    "height": 72, 
    "id": "Hyperstorm", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Franklin Richards (father), Rachel Summers (Marvel Girl, mother), Susan Richards (Invisible Woman, paternal grandmother), Reed Richards (Mister Fantastic, paternal grandfather), Jean Grey (Phoenix, maternal grandmother), Scott Summers (Cyclops, maternal grandfather), Nathaniel Richards (paternal great-grandfather), Evelyn Richards (paternal great-grandmother), Franklin Storm (paternal great-grandfather, deceased), Mary Storm (paternal great-grandmother), Christopher Summers (Corsair, maternal great-grandfather), Katherine Anne Summers (maternal great-grandmother, deceased), Philip Summers ( maternal great-great-grandfather), Deborah Summers (maternal great-great-grandmother), Johnny Storm (Human Torch, paternal granduncle), Tara Richards (Huntara, paternal grandaunt), Alex Summers (Havok, maternal granduncle), Gabriel Summers (Vulcan, maternal granduncle), Valeria Richards (paternal alternate reality aunt), Dream Summers (alternate reality sister), David Richards (alternate future brother), Madelyne Pryor (clone of maternal grandmother), Nathan Christopher Summers (Cable, maternal half uncle), Stryfe (maternal half uncle's clone from deleted future timeline), Tyler Dayspring (Genesis, son of maternal half uncle, adopted son of half uncle's clone from deleted future timeline), Nate Grey (X-Man, maternal alternate reality version of half uncle)", 
    "occupation": "Conqueror", 
    "placeofbirth": "Unrevealed", 
    "powers": "Hyperstorm is a mutant with the power to tap the extradimensional realm of  hyperspace for any effect. He can control all forces of nature-- the electromagnetic force, the strong and weak nuclear force, and the gravitational force-- forces that emanate from hyperspace which he \"is one with.\"", 
    "realname": "Jonathon Reed Richards", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Unrevealed", 
    "weight": 259
}