{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "When he himself developed mutant powers, (red, angel-like wings that allow him to fly, strong regenerative abilities, and can vocally mimic any sound he hears or imagines; for example, he can sound like a whole choir when he sings) he hid them from his family. However, when performing in his band he exposed his wings to the crowd as a 'stage gimmick'.Jay fell in love with Julia Cabot, but due to a long feud between the Guthries and the Cabots a fight broke out. Jay was struck down by Julia's father, who had acquired and modified some superpowered armor. Believing Jay to be dead, Julia dragged Jay's body to the river. She wrapped his arms around her, heading for the deepest part of the river. The two sank to the river's bottom and Julia subsequently drowned. Neither Jay nor Julia were aware of Jay's mutant regenerative powers, but when Jay sank to the bottom of the river, these powers manifested. Jay awoke at the bottom of the river with Julia in his arms. He swam to the surface with her and brought her to the riverbank. When he discovered she was dead, he tried (unsuccessfully due to his healing factor) to stab himself in the heart with a sharp piece of wood. Warren Worthington arrived on the scene, found Jay, and helped him carry Julia's body back to the Guthrie house.After Julia's death, Jay attempted to kill himself a few more times, hoping his healing factor would fail. Eventually his mother sent him to the Xavier Institute against his will. Jay speculated this was just so she wouldn't feel guilt if he tried to hurt himself again. Originally placed with the Hellions squad, he traded places with Wither and joined the New Mutants. He is portrayed as a sullen, withered lover who keeps mostly to himself, but he always reminds his teammates how fortunate they are to be a \"family\" when they feud. His team seems to talk to him about their problems, as he isn't usually one to join the fights.After the events of Decimation, Icarus was one of the few of the New Mutants team who didn't lose their powers. However, someone cut off his wings and left him bleeding at the doorsteps of the mansion. Emma Frost has stated that his healing factor was not working to heal these injuries. It was later revealed by Dr. McCoy that his healing powers came from his wings and without them this power won't work.", 
    "durability": 4, 
    "education": "Currently in high school level classes", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "(As Guthrie) Rom Annual #3 (1984); (as Icarus) New X-Men: Academy X #2 (2004)\n", 
    "groupaffiliation": [
        "Formerly Xavier Institute Student Body", 
        "New Mutants squad", 
        "Hellions (squad)"
    ], 
    "hair": "Red\n", 
    "height": 69, 
    "id": "Icarus", 
    "identity": "Known to certain government officials", 
    "intelligence": 1, 
    "knownrelatives": "Thomas Zebulon (father), Lucinda (mother), Lucas Bartholemew (uncle), Sam (Cannonball, brother), Paige (Husk, sister), Joelle (sister), Elizabeth (sister), Melody (Aero, sister), Jebediah (brother), Lewis (brother), two other unidentified siblings, Ray Jr. (adopted brother)", 
    "occupation": "Student", 
    "origin": "Uncanny X-Men #437-441", 
    "placeofbirth": [
        "Cumberland", 
        "Kentucky"
    ], 
    "powers": "Flight via feathered wings; superhuman vocal cords; accelerated healing", 
    "realname": "Joshua \"Jay\" Guthrie", 
    "speed": 1, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 193
}