{
    "aliases": [
        "Impy", 
        "Ottoman", 
        "impersonated Bridget O’Shaughnessy and innumerable others"
    ], 
    "citizenship": "Citizen of Poppup", 
    "content": "When the Poppupians later grew bored with living, the Impossible Man returned to Earth and, disguised as the Invisible Girl, directed the planet-eater Galactus to Poppup, thus sparing the Earth from being devoured. Galactus ate Poppup, but was stricken with near-terminal indigestion. The only surviving Poppupian, the Impossible Man returned to Earth, where his shapeshifting antics soon caused chaos. He visited the Marvel offices, announcing he wanted his own comic, like the one they did based on the FF. Told that readers had disliked him when he appeared in the adaptation of his first visit to Earth because he looked too silly, he had a temper tantrum which ended only when Reed made Stan Lee promise to do a special issue featuring him. When the cyborg Deathlok was sent to attack the U.S. President, Reed had Impossible Man impersonate him, thus rendering the assault ineffective. Impossible Man stayed at the Fantastic Four's Baxter Building, which was attacked by their enemies the Frightful Four immediately after he arrived. While the Fantastic Four were captured, the Impossible Man was oblivious, having become fascinated by television, but when the channel he was watching finished, Impossible Man thought there was a problem with the power; tapping into the building supply, he unwittingly cut off the power to the Fantastic Four’s restraints, freeing them to defeat their opponents.Impossible Man stayed with the Fantastic Four for a while after, picking up the nickname Impy. When Klaw and the Molecule Man attacked the building, they knocked out Impy, but their subsequent ambush of the Fantastic Four was disrupted when he angrily revived. He proved immune to both villains powers now that he was aware of their attacks, and almost accidentally overpowered Klaw, but when Molecule Man possessed Reed’s body, the Fantastic Four stopped Impy attacking him, afraid he might cause serious injury. Deciding that they were no fun, Impy left, eventually ending up in Hollywood, where he amused himself causing chaos on film sets. Becoming bored, he returned to visit the Fantastic Four, but found only the Thing present. He accompanied him in hat form to Alicia Masters sculpture show, where, witnessing Thing and Alicia’s love for one another while helping defeat the Terrible Trio, Impy was inspired to create an Impossible Woman. Following Reed and Sue Richards’s example, the new Impossible couple created children, soon producing dozens of Impossible kids. Using the Baxter Building facilities to find an uninhabited world to replace Poppup, they departed Earth. Soon after Impy returned seeking his missing spouse, approaching private eye Jessica Drew (Spider-Woman), and lending both aid and hindrance when she tried to apprehend some jewel thieves, before being reunited with his wife.To decide whether who should be in charge of the family, Impy returned to Earth on a Scavenger Hunt, beginning by taking the X-Men’s Mansion. With the mutant team in pursuit, Impy nipped round the globe, collecting Nick Fury’s eyepatch, Ka-Zar’s sabretooth tiger ally Zabu, the Fantasticar, Wasp’s costume collection, the window from Dr. Strange’s Sanctum and the Black Queen (Selene)’s costume. However he failed to collect his last item, Stan Lee, and thus lost the contest. Having enjoyed meeting his new “friends”, Impy soon returned to the X-Men Mansion, finding the New Mutants home instead. When they refused to play, he accused them of cowardice, and his challenge was taken up the team’s own alien shapeshifter, Warlock. Pursued by the other New Mutants, the pair competed round the world with one another to prove who was the better shapeshifter, until Warlock, prompted by his teammates, won by doing the one thing Impy couldn’t – he changed color.After trying to purchase the movie rights to Rick Jones autobiography, Impy ran into the Silver Surfer out in deep space while being pursued by an angry alien armada; despite this threat, Impy was more concerned with making the overly serious Surfer lighten up. He secretly followed the Surfer, watching his subsequent encounter with Thanos. Alarmed to hear Thanos’ plan to kill half the galaxy, in case he was in that half, and fearing the Surfer wouldn’t be able to beat Thanos if he was too serious, the terrified Impossible Man again pestered the Surfer to get a sense of humor.Impossible Woman asked Impy to take her and the 4,682 children on vacation to Earth. They split up to see the sights, and while Impossible Man annoyed Spider-Man, Dr. Strange and the Punisher, Impossible Woman asked Quasar to help convince her non-shapeshifting child Impia to shapechange. The kids decided to set up a clubhouse in Dr. Doom’s armor; swiftly realizing he couldn’t force them out, Doom employed psychology to convince them to move to a new clubhouse, Iron Man's armor. After Impy annoyed Impossible Woman she called a halt to the holiday and the Impossibles set off to the Skrull world Satriani, to show Empress S’Byll their vacation pictures. Impy realized they had misplaced a child, and returned to Earth seeking him, checking the Microverse and Asgard. Meanwhile Impossible Woman visited the Savage Land, pursuing tales of a green shapeshifter, but found only the stranded Samuel J. Skrull, whom she adopted. They finally found their son playing in a rock band, which inspired the whole family to go on an intergalactic singing tour.After starting a riot in a \"Bar With No Name\" by taking on the form of a deck of cards with an extra ace, and watching Makkari win the Galactic Marathon, Impy discovered he had not been invited to Rick Jones wedding. Feeling left out, he sent invitations to others who had been similarly “forgotten”, including Drax the Destroyer, Absorbing Man, Mister Hyde, Living Laser, and the Wizard, Kree and Skrulls. When 3 of his kids became slackers, Impy looked up his old friends the New Mutants, now known as X-Force, wanting to put his children on the team so they could learn discipline. Caving in to persistent nagging, Cable agreed to try, but failed to inspire them to action until the island they were on was attacked by the monstrous Barrachus the Kalinator. Encountering an interdimensional imp he called “Mixed Pickles” in a dimensional interface, he entered into a competition with him; they agreed to combine powers to swap heroes from their respective universes to play with. While Pickles annoyed the Silver Surfer, Impy disguised himself as the Super-Skrull to battle Pickles normal opponent, the last survivor of his destroyed planet. Believing he had won, Impy jumped dimensions to where Mixed Pickles was fighting the Surfer, but was angered to see him endangering innocent bystanders, something he had promised not to do. When Pickles stated he had lied, Impy cheated and tricked the imp bringing both heroes together in one reality, one way of winning the contest.Eventually the Impossible Kids all left home. Distraught, the Impossible couple created new kids, but they left too. Unable to cope, the pair traveled to Earth and inundated first the Baxter Building and  then New York with Impossible clones, who, because of their progenitor’s darkened moods, had a nastier streak to their humor than their older siblings; 4 of them even tried to kill and replace the Fantastic Four. While the Fantastic Four were distracted containing this problem, the Impossible couple kidnapped Franklin and Valeria Richards, who they felt wouldn’t run away like their own children. The new writer of Marvel’s licensed Fantastic Four comic book, Roberto Aguirre-Sacasa, having witnessed the Impossible chaos, researched Impy’s history and figured out the couple were grieving for their own children; The Fantastic Four helped the pair accept that all children eventually leave home, and Reed built a tracking device so they could find them. Impy recently returned to Earth uncontrollably changing form due to hiccups, but the Thing cured him with a fright, after which he was invited to attend his Bar Mitzvah and superhero poker game.", 
    "durability": 6, 
    "education": "Unrevealed", 
    "energy": 6, 
    "eyes": "Purple (variable)\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #11 (1963)\n", 
    "groupaffiliation": "His family", 
    "hair": "Black eyebrows, otherwise none (variable)\n", 
    "height": 0, 
    "id": "Impossible_Man", 
    "identity": "No dual identity", 
    "intelligence": 2, 
    "knownrelatives": "Impossible Woman (clone/wife), Lil’ Imp, Impia, Ivana, Donald, #4682 (a.ka. Impy), Imp-Force, Impossible Slackers, Torch Green, at least 4671 others (clones/children), Ralph (clone/dog); Samuel J. Skrull (adopted son)", 
    "occupation": [
        "Impy", 
        "Bridget O’Shaughnessy", 
        "Ottoman", 
        "", 
        "impersonated Bridget O’Shaughnessy and innumerable others"
    ], 
    "origin": "Fantastic Four #11 (1963)", 
    "placeofbirth": [
        "Poppupoopu", 
        "Poppup"
    ], 
    "powers": "The Impossible Man has complete control over his body’s molecules, allowing him to instantaneously change form at will into anything he can imagine; there seems to be very little limit to the size, shape or form, though he cannot duplicate the abilities of uniquely powerful objects such as Thor’s hammer, and he is unable to change color from his native green and purple; as he originally seemed capable of this, it may be that he was formerly able to do this, but lost the ability when Poppup was destroyed. He makes a popping noise whenever he changes. He can travel through hyperspace and survive in a vacuum. He can reproduce himself by dividing into two identical beings. His mind is difficult for human telepaths to fathom.", 
    "realname": "Poppupians have no names; they know who they are", 
    "significantissues": [
        "Vacationed on Earth, encountered Fantastic Four after robbing bank, thought Earth was fun but left after everyone began ignoring him (Fantastic Four #11, 1963)", 
        "during above visit encountered timeslipping New Warrior Turbo, followed her to future, attempted to help New Warriors battle Dr. Yesterday, returned to original time (Marvel Comic Presents #160-163, 1994)", 
        "returned to Earth, saved Earth from Galactus by leading him to Poppup (Fantastic Four #175, 1976)", 
        "caused chaos in Marvel offices until Stan Lee promised to do a comic featuring him (Fantastic Four #176, 1976)", 
        "watching TV while Frightful Four captured Fantastic Four, accidentally released imprisoned Fantastic Four by draining building power when TV ended for the day (Fantastic Four #177-178, 1976-1977)", 
        "impersonated US President to thwart mind-control attempt (Marvel Two-In-One #27, 1977)", 
        "saved Invisible Girl from fatal fall, departed in annoyance to find something fun to do (Fantastic Four #183, 1977)", 
        "discovered movies (Fantastic Four #184-185, 1977)", 
        "knocked out and captured by Klaw and Molecule Man, escaped, helped Fantastic Four battle them, left when stopped from unintentionally hurting possessed Reed Richards (Fantastic Four #186-188, 1977)", 
        "caused chaos in Hollywood (Fantastic Four #193-194, 1978)", 
        "accompanied Thing to Alicia Master’s sculpture show, helped him defeat Terrible Trio, created Impossible Woman to be his mate (Marvel Two-In-One #60, 1979)", 
        "had Thing babysit offspring while he and Impossible Woman searched FF records for new homeworld, left for space (Marvel Two-In-One #86, 1982)", 
        "asked Jessica Drew (Spider-Woman) to find missing Impossible Woman (Spider-Woman #45, 1982)", 
        "engaged in chaos-bringing Scavenger Hunt pursued by X-Men (Uncanny X-Men Annual #7, 1983)", 
        "engaged in shapeshifting competition with Warlock (New Mutants Annual #3, 1987)", 
        "apparently responsible for mad alternate Earth in state of constant combat (Excalibur #14, 1989)", 
        "tried to purchase movie rights to Rick Jones’ autobiography (Avengers Spotlight #25, 1989)", 
        "pranked Silver Surfer (Silver Surfer #33, 1990)", 
        "scared Silver Surfer would lose to Thanos in impending battle due to his lack of a sense of humor, got him to promise to lighten up (Silver Surfer #36, 1990)", 
        "took family on vacation to Earth, caused chaos for Spider-Man, Dr. Strange, Punisher, and Hollywood, departed to Skrull homeworld to show Empress S’byll family’s vacation slides (Impossible Man Summer Vacation Spectacular #1, 1990)", 
        "returned to Earth looking for missing child (Impossible Man Summer Vacation Spectacular #2, 1991)", 
        "encountered Daredevil during hunt for missing child (Marvel Comics Presents #91, 1991)", 
        "sparked off riot in Bar With No Name (Marvel Comics Presents #97, 1992)", 
        "watched Makkari win Galactic Marathon (Quasar #58, 1994)", 
        "invited various villains to Rick Jones’ wedding (Incredible Hulk #417, 1994)", 
        "placed slacker kids in X-Force’s care (X-Force and Cable Annual ’95, 1995)", 
        "entered wager with extra-dimensional imp, swapped opponents (Silver Surfer/Superman #1, 1996)", 
        "after children left home, kidnapped Franklin and Valeria Richards to replace them, returned them after being promised tracking devices to locate errant offspring (Marvel Knights 4 #23-24, 2005-2006)", 
        "developed hiccups, cured by Thing, attended Thing’s Bar Mitzvah and Poker Game (Thing #8, 2006)"
    ], 
    "speed": 7, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 165
}