{
    "aliases": "None", 
    "citizenship": "Inapplicable", 
    "content": "The In-Betweener later placed himself with a group of sorcerers known as the Creators as he planned to alter the fabric of reality by imposing his own concept of balance on the universe, but was opposed by the sorcerer supreme, Doctor Strange.  The two battled, but the In-Betweener ultimately lost when Doctor Strange alerted his masters to his scheme.Afterwards, the In-Betweener attempted to escape subservience to Lord Chaos and Master Order by allying himself with the Elders of the Universe with the plan to replace Galactus’s role in the universe.  However, Galactus did not agree with this plan and defeated the In-Betweener in battle allowing him to be imprisoned by Chaos and Order.  Later, the mad titan Thanos freed him from his prison only to trick the In-Betweener into surrendering his soul gem to him.  Although free for a while, the In-Betweener was captured by his masters once again.", 
    "durability": 7, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "(Right) black, (Left) white\n", 
    "fighting": 2, 
    "firstappearance": "Warlock #10 (1975)\n", 
    "groupaffiliation": "None", 
    "hair": "None\n", 
    "height": 0, 
    "id": "In-Betweener", 
    "identity": "Existence is not known to the general populace of Earth", 
    "intelligence": 6, 
    "knownrelatives": "Lord Chaos and Master Order (creators)", 
    "occupation": "Agent of Lord Chaos and Master Order", 
    "origin": "Unrevealed", 
    "placeofbirth": "Unrevealed", 
    "powers": "The In-Betweener possesses incalculable strength, is totally indestructible and can fly at warp speed.  The In-Betweener has nearly limitless ability to manipulate time, space, matter and energy as well as almost infinite abilities with the entire range of psionic powers.  The In-Betweener also has a telepathic link with its creator’s Lord Chaos and Master Order. However, there are limits to his powers indicating the In-Betweener is not all-knowing or infallible.", 
    "realname": "In-Betweener", 
    "significantissues": "Warlock #10-11, Doctor Strange #26-28, Silver Surfer #17-18, Thanos Quest #1, Avengers #58-60", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": "Variable\n"
}