{
    "aliases": "None known", 
    "citizenship": "Inapplicable", 
    "content": "Long ago the Asgardian all-father Odin added a tiny sliver of infinity's powers to his own powers, which were later stolen and corrupted by the Asgardian death-goddess Hela. Christened Infinity, the sliver threatened to destroy the universe until stopped by Thor. More recently, the newly disembodied Inhuman/Deviant hybrid Maelstrom, whose atoms had been spread across the universe, learned of the existence of the abstract entities. He slew and replaced the cosmic being Anomaly. Aided by Oblivion, he sought to collapse the universe into a single anomalous point, bringing all that is to Oblivion's realm, and secretly planned to become the new Oblivion in the process. As part of his plan, Maelstrom killed Eon's protector Quasar,stealing his quantum bands and Eon's powers. Maelstrom then created a black hole in the center of the universe strong enough to pull all of existence. Quasar's energy-ghost contacted Infinity, who revealed its role in recent events to make him its avatar. Quasar killed Maelstrom and had almost reversed the spatial explosion when Oblivion pitted him against its avatar, the reborn Maelstrom. The two were evenly matched until Quasar realized that an earlier retroactive act by the cosmic entity Origin had made him the superior anomaly and used that knowledge to destroy Maelstrom. Infinity and Oblivion summoned their counterparts Eternity and Death to negotiate a new pact between their forces allowing, amongst other things, Quasar's resurrection.", 
    "durability": 1, 
    "education": "Inapplicable", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "(Cameo) Thor #184 (1971); (fully) Quasar #24 (1991)\n", 
    "groupaffiliation": "Friendless", 
    "hair": "None\n", 
    "height": 0, 
    "id": "Infinity", 
    "identity": [
        "Inapplicable", 
        "the general populace of Earth is unaware of Infinity's existence"
    ], 
    "intelligence": 1, 
    "knownrelatives": "Inapplicable; considers Eternity its mate, and regards Death, Empathy, Entropy, Eon, Epiphany, Eulogy, Expediency, and Galactus as relatives", 
    "occupation": [
        "Abstract entity", 
        "personification of sum total of all that exists along the spatial axis"
    ], 
    "origin": "Born during the cosmic event known as the Big Bang", 
    "placeofbirth": "Inapplicable", 
    "powers": "Infinity is the embodiment of space and possesses near-omnipotent cosmic powers within it, drawing on the energy of all that exists in the spatial axis. Infinity utilizes an M-Body (Manifestation Body) when interacting with physical beings. When merged with Eternity, Infinity possesses the combined power of the space time continuum.", 
    "realname": "Inapplicable", 
    "significantissues": "See Handbook Bibliography", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}