{
    "aliases": [
        "\"Shellhead", 
        "\" \"Golden Avenger", 
        "\" \"Tetsujin\"", 
        "formerly Crimson Dynamo", 
        "Iron Knight", 
        "Hogan Potts", 
        "\"Spare Parts Man\"", 
        "impersonated Cobalt Man (Ralph Roberts)"
    ], 
    "citizenship": "U.S.A.", 
    "content": "At first, Tony found his new life a torment; his armor’s chest plate had to be worn constantly and required frequent recharging. He kept the armor a secret from everyone, including his fiancée, Joanna Nivena. Turning suicidal and drinking heavily, Tony was supported by Joanna, with whom he shared his secret identity. Joanna encouraged him to use his armor as a super hero, but ultimately called off the engagement knowing Tony would not be the family man she desired.Tony worked to improve the Iron Man armor and claimed Iron Man was Tony Stark's personal bodyguard to disguise his identity. Tony played a dual-role with the formation of theAvengers both as the sponsor and, as Iron Man, as a founding member along with Thor, Ant-Man (Henry Pym), the Wasp (Janet van Dyne), and the Hulk. While pursuing Namor the Sub-Mariner, Iron Man came across the comatose body of Captain America (Steve Rogers) Rogers), the famous World War II super hero, preserved on ice. Revived, Captain America joined the Avengers and became an important teammate and friend to Tony. Later, Tony helped establish the international super-spy agency SHIELD to combat terrorist threats.During these early years as a super hero, Iron Man battled Mandarin, Hawkeye, and the Black Widow(Natasha Romanova).Tony found himself drawn to the beautiful Whitney Frost, but she proved to be the daughter of the Avengers’ foe Count Nefaria and a high-ranking member of the Maggia crime syndicate. Seeking to steal Tony’s inventions, she pitted agents such as  Whiplash (Mark Scarlotti) and  Gladiator (Melvin Potter) against him. After using one of his Life Model Decoys (LMDs) to deceive the Mandarin and protect his identity, Tony was horrified when the LMD developed an independent personality and usurped his identity. The LMD, believing itself superior to Tony, obtained a suit of Iron Man armor and began running Stark Industries while the real Tony was away. Unable to prove his identity, Tony fell into the clutches of Madame Masque (a newly garbed Whitney Frost), agent of the gold-loving Mordecai Midas, who attempted to force Stark to turn over his fortune. Tony used his original Iron Man armor to destroy the LMD imposter, but suffered another heart attack in the process. The Avengers rushed him to a hospital where Dr. Jose Santini transplanted a synthetic heart into his chest so that Tony no longer required his chest plate to live.Following the Avengers’ involvement in the interstellar Kree-Skrull War, Iron Man joined Mr. Fantastic, Black Bolt of the Inhumans, Professor Xavier of the X-Men, sorcerer Dr. Stephen Strange and Namor in founding the Illuminati, a secret organization designed to share knowledge and pool resources against major threats.Renaming his corporation Stark International, Tony resolved to abandon munitions production in favor of electronics and computer engineering after witnessing firsthand the impact his company’s weapons had on innocent lives.Despite seeming to have everything a man could want, Tony was under much stress. The machinations of rival industrialist Justin Hammer and SHIELD’s constant pressure drove Tony further into drinking. His girlfriend at the time, Bethany Kabe, kept Tony from continued succumbing to his alcoholism. Their relationship ended when Bethany’s presumed-dead husband was discovered alive.In opposing Obidiah Stane's attempts at forming a major multinational conglomerate, Tony unwittingly made Stane a driven enemy. Obadiah Stane set up games of psychological warfare against Tony, which included physical attacks by his Chessmen super-operatives, outbidding Stark International for key contracts and having his lackey Indries Moomji romance Tony, all in an attempt to drive Tony to resort to drinking. As Stane’s pressure increased, Tony responded as anticipated, and after Indries rejected Tony, he virtually gave up trying to oppose Stane. When the villain Magma (Jonathan Darque) attacked Stark International, Tony proved too drunk to wage a competent battle and instead revealed his double identity to Rhodes. With Tony passed out, Rhodes donned the armor and defeated Magma. Tony told Rhodes to keep the armor and turned his back on Stark International while he proceeded to drink himself out of his company, property and fortune until all of his assets were frozen. Obadiah Stane stepped in and claimed Stark International, renaming it Stane International, but Rhodes prevented Stane from obtaining the Iron Man armors.Tony had hit rock-bottom, homeless and perpetually drunk. However, helping deliver a baby put life into perspective and he began his path of recovery and sobriety joining Alcoholics Anonymous.Tony, James, and James’ friends, Morley and Clytemnestra Erwin set up a California-based new corporation: Circuits Maximus. Obadiah planted a bomb in their laboratory, killing Morley and badly injuring Rhodes. Tony constructed his most advanced armor yet at the new West Coast Avengers Compound and confronted Stane, who had designed his own armored identity as the Iron Monger. When Tony defeated the Iron Monger, Stane committed suicide.After joining the West Coast Avengers, Iron Man provided sanctuary from reformed villain Force (Clay Wilson), an agent of Justin Hammer. Examining Force’s armor, Tony recognized familiar circuitry patterns based on his own Iron Man armor designs. Tony discovered that his old foe Spymaster had stolen his designs and sold them to Hammer who armored several of his super villain clients, including the Beetle (Abner Jenkins), the Controller, the Mauler (Brendan Doyle), the Raiders and Stilt-Man (Wilbur Day). Enraged by the thought that innocent people might have been killed with his technology, Tony resolved to eliminate all traces of his technology that had fallen into outside hands. However, Iron Man falsely accused federal agent Stingray of possessing Stark’s technology, forcing Tony to publicly fire his alter-ego. Steve Rogers was stripped of his Captain America identity, and became the Captain; Tony supplied him with a force shield. Unable to trust anyone using his armor technology, Tony targeted the Guardsmen at the Vault prison. The Captain tried to stop Iron Man, severely straining their friendship. Iron Man next attacked the Crimson Dynamo in Russia, and accidentally killed the Titanium Man, leading to Iron Man’s expulsion from the Avengers. Tony faked Iron Man’s death, and later rejoined the Avengers as the “new Iron Man.” Eventually, the Avengers saw through Tony’s facade.After being shot and paralyzed by former love interest Kathleen Dare, Tony installed a biochip into his body to regain mobility. The biochip gained the attention of corporate foe Kearson DeWitt, who held grievances against Tony. DeWitt hijacked the biochip and took control of Tony’s nervous system. Though Tony regained control of his body using his armor, but by the time he had defeated DeWitt his body was so damaged he could barely move. Tony donned a skintight neuronet suit to help him function, but his armor became the only certain way to keep himself alive. After defeating the Mandarin, and using a rogue team of Avengers to seemingly destroy the Supreme Intelligence (against Avengers’ leader Captain America’s command), he expressed his regret to Captain America and the two began trying to repair their fractured relationship. As Tony’s health continued to deteriorate, he designed his variable threat assessment armor (model 11, also called the “War Machine”) and won back Stane International’s assets from its last owner, Justin Hammer. Succumbing to total nervous system failure, Tony seemingly died on an operating table. In his will, he made Rhodes the new CEO of Stark Enterprises and left the War Machine armor for him to carry on as Iron Man. Rhodes respected his wishes.Tony was secretly in cryogenic storage while his body’s entire nervous system was essentially rebuilt. Revived, Tony had to undergo intense physical therapy. Rhodes, who was infuriated at being deceived, immediately quit Stark Enterprises. Tony allowed Rhodes to keep the War Machine armor and launched a new model of armor, the Neuromimetic Telepresence Unit 150 (NTU-150),which he could control remotely while he recovered. He also used artificial intelligences to aid him in his work, including HOMER and PLATO.Outfitted in his new modular armor, Tony agreed to end the West Coast Avengers, but formed Force Works. Providing his team with full access to his cutting edge technology.Teenage Tony Stark continued to fight with the Avengers and took control of Stark International. The mutant Onslaught manifested, threatening life on Earth. The young Tony and many of the world's super heroes fought Onslaught in New York City's Central Park where young Iron Man, the Fantastic Four, Thor, the Hulk, and other heroes seemingly lost their lives defending the Earth. However, they were actually brought into a pocket universe created by Reed and Sue Richards' son, Franklin. Events soon forced Franklin to choose a world to survive; he restored the original world. Upon returning, the still-adult Tony found he had the collective memories and experiences of the original Tony Stark merged with those of the Earth-96020 Tony and the person he had been on Counter-Earth.When Iron Man defeated the villain Mentallo, Tony took advantage of the situation and used Mentallo’s global mind control device to erase all knowledge of his often-compromised secret identity from every person on Earth. He then revealed it to those people he deemed trustworthy, causing them to remember the memories he had buried.Former Avenger Jocasta, a creation of the villainous robot Ultron, was forced to prepare the Iron Man armor to become Ultron’s new home; the process accelerated when Iron Man was hit by a lightning bolt, causing Tony to suffer a heart attack at the same time. Thinking that the armor had been granted its own consciousness, Tony attempted to teach the armor; the benign Ultron-12 aspect of its personality was receptive, but the cruelty of most past Ultron models corrupted the armor and it murdered Whiplash during a fight. However, the armor ultimately sacrificed its “life” to save Tony, whose heart was failing. After implanting a robotic “heart” in Tony’s chest that saved him, the armor deactivated.Tony later decided to reveal his secret identity to the world, and was offered work as a contractor for the US Department of Defense. Though turning down that opportunity, he accepted the post as the President's Secretary of Defense to monitor the use of his technology by the United States military. Tony’s tenure as Secretary of Defense ended in scandal when the insane Scarlet Witch caused him to engage in drunken and belligerent behavior at the United Nations. Disgraced, Tony was quickly drummed out of his position. The Scarlet Witch’s growing insanity led to the dissolution of the Avengers when her out-of-control powers wrecked Avengers Mansion and killed several teammates. Tony was further smeared when one-time corporate rival Clarence Ward stole Iron Man armor, using it to kill the Stark Industries board and Rumiko, Tony’s girlfriend. Iron Man defeated Ward and recalled all of the Iron Man armors he had granted to the military. He then publicly “resigned” as Iron Man but secretly intended to continue operating, again claiming it was another man wearing the armor.", 
    "durability": 6, 
    "education": "Ph.D.s in physics and electrical engineering", 
    "energy": 6, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "Tales of Suspense #39 (1963)\n", 
    "groupaffiliation": [
        "The Avengers", 
        "Initiative", 
        "Hellfire Club (outer circle)", 
        "S.H.I.E.L.D.", 
        "Illuminati", 
        "Thunderbolts", 
        "Force Works", 
        "Queen's Vengeance", 
        "Alcoholics Anonymous"
    ], 
    "hair": "Black\n", 
    "height": 73, 
    "id": "Iron_Man_(Anthony_Stark)", 
    "identity": "Publicly Known", 
    "intelligence": 6, 
    "knownrelatives": "Howard Anthony Stark (father, deceased), Maria Collins Carbonell Stark (mother, deceased), Morgan Stark (cousin), Edward Stark (uncle, deceased), Isaac Stark, Sr., Isaac Stark, Jr. (ancestors, deceased)", 
    "occupation": [
        "Adventurer", 
        "president emeritus of Stark Industries", 
        "founder of Maria Stark Foundation", 
        "formerly director of S.H.I.E.L.D.", 
        "CEO of Stark Industries", 
        "Stark Solutions", 
        "Stark Enterprises", 
        "Circuits Maximus & Stark International", 
        "US Secretary of Defense", 
        "computer technician"
    ], 
    "origin": "Tales of Suspense #39 (1963)", 
    "placeofbirth": [
        "Long Island", 
        "New York"
    ], 
    "powers": "None; Tony's body had been enhanced by the modified techno-organic virus, Extremis, but it is currently inaccessible and inoperable.", 
    "realname": "Anthony Edward \"Tony\" Stark", 
    "significantissues": [
        "Red and gold armor debuted (Tales of Suspense #48, 1963)", 
        "traveled to Camelot with Dr. Doom (Iron Man #149-150, 1981)", 
        "succumbed to alcoholism (Iron Man #167-182, 1983-1984)", 
        "Jim Rhodes became Iron Man (Iron Man #169-199, 1983-1985)", 
        "Tony Stark returned as Iron Man in red & silver armor (Iron Man #200, 1985)", 
        "fought Armor Wars against armored villains (Iron Man #225-231, 1987-1988)", 
        "traveled to Camelot again with Doom (Iron Man #249-250, 1989)", 
        "manipulated by Kearson DeWitt in \"Armor Wars II\" (Iron Man #258-266, 1990 -1991)", 
        "James Rhodes took over as Iron Man (Iron Man #284, 1992)", 
        "Tony Stark became Iron Man again (Iron Man #289, 1993)", 
        "helped form Force Works (Force Works #1, 1994)", 
        "time traveled with Dr. Doom (Iron Man #11, 1997)", 
        "returned from Counter-Earth (Iron Man #1, 1998)", 
        "revealed as member of Hell Fire Club (X-Men #73, 1998)", 
        "armor became sentient, killed Whiplash (Iron Man #26-30, 2000)", 
        "Ultron took control of armor (Iron Man #46-49, 2001-2002)", 
        "became Secretary of Defense (Iron Man #73-78, 2003)", 
        "infiltrated the Thunderbolts as Cobalt Man (Avengers/Thunderbolts #1-6, 2004)", 
        "helped form new group of Avengers (New Avengers #1, 2005)", 
        "became Director of S.H.I.E.L.D. (Civil War #7, 2007)"
    ], 
    "speed": 5, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 225
}