{
    "aliases": "None", 
    "citizenship": "Celestial Heliopolis", 
    "content": "This did not leave Isis and her family safe forever for Seth did return and took her family captive once more. Seth planned to sacrifice Horus to gain control of a demon called the Devourer, but the demon turned on Seth instead. Isis, along with Osiris, was at the mercy of Seth’s armies while Thor fought Seth and the Devourer with his ally, the Thing. In the end, Seth was defeated and Isis and her family were freed once more. This did not stop the god of death from returning again to plague the Gods of Heliopolis, but this time he stole their powers so that he may wage war against the universe itself. Wanting the extinction of all life, Seth first attacked his greatest threat, the Asgardians and Thor. Even though Seth and his armies were great in number, the Asgardians, Thor, and even Seth’s own creation, Earth Force fought back and eventually emerged triumphant. The powers were restored to Isis and the other Heliopolitan gods, and their first act upon regaining their powers was to heal the dying mortals in Earth Force and send them back home.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Thor #240 (1975)\n", 
    "groupaffiliation": "Gods of Heliopolis", 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Isis", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Osiris (husband), Horus (son), Nepthys (sister), Seth (brother), Geb (father), Nut (mother)", 
    "occupation": "Goddess of fertility and domestication", 
    "origin": "Unrevealed", 
    "placeofbirth": "Heliopolis", 
    "powers": "Isis is a goddess with the ability to control elemental forces as well as having the attributes of a god of Heliopolis such as superhuman strength, immunity to all terrestrial disease and immortality. Isis also possesses extensive knowledge of Egyptian magic and can raise the dead.", 
    "realname": "Isis", 
    "significantissues": "Thor #240, Marvel Two-in-One #23, Thor #398, Thor #400 (no actual appearance, but presumably she was there with the other Gods of Heliopolis)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}