{
    "aliases": [
        "J.J.J.", 
        "Jolly Jonah", 
        "Flat-Top", 
        "Prune Face", 
        "others used by employees"
    ], 
    "citizenship": "U.S.A.", 
    "content": "In recent years, when the superhuman performer Spider-Man became a crimefighter, Jameson vowed to expose him as a publicity-seeking scofflaw, and not even the rescue of John from a space flight disaster dissuaded him. He relied on photos from Peter Parker, not knowing he was employing Spider-Man himself. Jameson heralded the Spacemen as superior heroes, but this gambit failed when Spider-Man exposed them as criminals; support for Mysterio yielded similar results. Despite his many achievements, Jameson's harsh self-analysis weighed upon him, for his hatred of Spider-Man was motivated by fear that he was indeed the selfless hero Jameson could never be. Jameson hired Dr. Farley Stillwell to mutate investigator Mac Gargan into the Scorpion to defeat Spider-Man, but the debacle left Stillwell dead and the insane Scorpion hating Jameson. Plagued by guilt, the publisher confessed his actions to his friend Norman Osborn. Scientist Spencer Smythe soon offered Jameson the first of many Spider-Slayer robots, with which he battled Spider-Man to a standstill before the web-slinger escaped. Jameson rallied New York against the Kingpin's crime wave; abducted for his insolence, he remained defiant before being rescued by Spider-Man.Months later, Osborn, the Green Goblin, seemingly died in battle with Spider-Man; Jameson suspected Spider-Man of outright murder, hiring Luke Cage to bring the wall-crawler in, but desisted when John became the Man-Wolf. Jameson's obsession paled before concern for his son, but his own safety became an issue when he was attacked by the Grizzly, a violent wrestler he had blacklisted a decade before. Spider-Man rescued Jameson but chided him for the grudge; in response, Jameson hired Daniel Berkhart to harass Spider-Man as Mysterio's supposed ghost. When this failed, he contracted Farley Stillwell's brother Harlan to mutate a new operative, but fugitive Rick Deacon usurped the process and became the criminal Fly, killing Stillwell and becoming an enemy of Spider-Man and Jameson alike. Jameson mysteriously received photos depicting Spider-Man with the body of Peter Parker; the photos, sent by Osborn's drug-maddened son Harry, were actually of a clone. Jonah nevertheless kept them quiet but stepped up his traditional campaigns. He approached Dr. Marla Madison to construct her own Spider-Slayer but met no better success. Finally confronting Parker, whom he imagined had been slain and replaced by Spider-Man, Jameson believed his story of faked photography. His relationship with Madison turned romantic, and he proved his principles anew by denouncing the terrorists of the People's Liberation Front. The PLF responded by hiring the Hitman, but even in the face of death Jameson ridiculed his abductors, who were defeated by Spider-Man and the Punisher.Meanwhile, Smythe, whose obsession had outgrown even Jameson's, learned he was dying and resolved to take Jameson and Spider-Man with him to the grave. He mesmerized the Man-Wolf into abducting Jameson and fighting Spider-Man; Jameson believed John dead when he saw his son teleported away. Smythe suddenly shackled Jonah and Spider-Man with a bomb, dying afterward. Jameson broke down, admitting his obsession had harmed him far more than its subject, but Spider-Man deactivated the bomb, leaving Jameson devastated at his confession. Scientist Jonas Harrow targeted Jonah, driving him mad, but his tenacity challenged even Harrow, and after being rescued by Spider-Man, Jameson was soon his typically paranoid self. Months later, John resurfaced alive, barely remembering his extradimensional adventures, and Jameson was overjoyed with his son's cure. Longtime colleague Ian Fate resurfaced as a sorcerer in the company of the monstrous Man-Thing; naively expecting Jameson to help reshape the world, Fate lashed out when refused, but while Spider-Man fought the Man-Thing, Jameson calmed Fate and set him on a more peaceful path. Jameson himself returned to basics by investigating waterfront extortion, interrogating no less than the Kingpin and risking his life to uncover the perpetrators, albeit with unexpected assistance from Spider-Man. Perhaps in unconscious gratitude, Jameson's subsequent scheme to discredit Spider-Man with impostors proved half-hearted at best.The Hobgoblin, secretly Jameson's Century Club crony Roderick Kingsley, learned Osborn's secrets and tried to blackmail Jameson over the Scorpion's mutation. Spider-Man ended this scheme, but the conscience-stricken Jameson publicly revealed his guilt anyway, then married Marla Madison. Soon afterward, he hired the alleged mutant hunters X-Factor and the mercenary Wild Pack to bring in Spider-Man but, more at peace than he had been in years, he seemed content to restrict his castigations to the printed page. However, his vendetta literally took new form when the Chameleon imprisoned and impersonated him, bringing anti-Spider-Man sentiments to new heights. Inevitably rescued by Spider-Man, he found a new crisis awaiting him, for Thomas Fireheart, secretly the mercenary Puma, acquired the Bugle to build up Spider-Man's reputation. Jameson sought solace in his lifelong convictions, denigrating neo-Nazi Eric Hartmann in print; when Hartmann's forces invaded the Bugle, for once Jameson played the rescuer when he downed Hartmann before the madman could shoot the intervening Spider-Man.Fireheart eventually returned the Bugle to Jameson, but his control was wrested away by Norman Osborn, alive after all, but Jameson nonetheless investigated the mutant-hunting Operation: Zero Tolerance. Hoping to placate the publisher, the android-human Bastion offered him the outlaw X-Men's secrets, but Jameson refused, as his distaste for prejudice outweighed even his dislike of costumed heroes. The X-Men defeated Bastion, but Jameson was scarcely short of enemies when Osborn hired Daniel Berkhart, who had joined Mysterio's cousin Maguire Beck in the identity of Mad Jack, to force Jameson to sell the Bugle. Soon afterward, when Venom was ordered to put a scare into him, the madman mistook his instructions for a kill order, and even Jameson winced at the beating Spider-Man took in his defense.Jameson regained the Bugle when Osborn went mad in a mystic ritual, which also empowered teenager Mattie Franklin, who became a new Spider-Woman and was, ironically, entrusted to the care of the Jamesons. A different legacy hounded Jameson as Spencer Smythe's even madder son Alistair threatened Jameson's family before receiving his latest defeat. Berkhart and Beck, now Mysterio and Mad Jack, abducted Jameson but were outwitted by Spider-Man and Daredevil. Unencumbered by gratitude, he sought to capitalize on the revelation of Daredevil's secret identity but was undercut when reporter Ben Urich refused to participate. Jameson hired superhuman investigator Jessica Jones to break a similar story on Spider-Man, but Jones merely put his money to work for charity, making her later rescue of Mattie from drug dealers all the more biting.Even Jameson began to face his vendetta's futility, and his invective grew sparse. After fresh humiliation in a libel trial, he agreed to a new Bugle feature with a theoretically objective focus on super heroes, co-managed by Urich and Jones, but he was stunned by seeming proof that his son John had, inexplicably, been Spider-Man all along. Jameson's hatred of Spider-Man can only intensify when he inevitably learns the truth.", 
    "durability": 2, 
    "education": "High-school dropout; later G.E.D. and college work", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Amazing Spider-Man Vol. 1 #1 (1963)\n", 
    "groupaffiliation": [
        "Century Club", 
        "Daily Bugle staff"
    ], 
    "hair": "Graying black, white at temples\n", 
    "height": 71, 
    "id": "Jameson,_J._Jonah", 
    "identity": "No dual identity", 
    "intelligence": 2, 
    "knownrelatives": "David (father, presumed deceased); Betty (mother, presumed deceased); Joan (first wife, deceased); John (Man-Wolf, son); Dr. Marla Madison-Jameson (second wife); Martha \"Mattie\" Franklin (Spider-Woman, foster daughter)", 
    "occupation": [
        "Owner", 
        "publisher", 
        "and executive editor of the Daily Bugle and Now Magazine", 
        "CEO of Jameson Publications", 
        "philanthropist", 
        "former publisher of Jameson News Digest", 
        "publisher of Woman Magazine", 
        "editor-in-chief", 
        "city editor", 
        "reporter", 
        "copy boy", 
        "paperboy"
    ], 
    "placeofbirth": [
        "New York City", 
        "New York"
    ], 
    "powers": "none", 
    "realname": "John Jonah Jameson", 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 181
}