{
    "aliases": "None", 
    "citizenship": "Unrevealed", 
    "content": "Nicholas Fury, the Queen of England’s spymaster, came to visit Javier at his school and warn him of the danger posed by Elizabeth’s death and the eventual rise to power of King James of Scotland; who had no love for witchbreed. Javier acknowledged the threat, but did nothing about it, though he showed Fury his team of super-powered youths. Fury also asked a favor, and requested that Javier use his powers to read the thoughts of a captured assassin. All Javier could tell him what that he was one of three; another was to kill a girl from the colonies, and the third, the queen. Fury later sent his protégé, Peter Parquagh, to Javier’s school, to warn him that Fury would be coming for him in the name of King James soon, and that Javier should go quietly, rather than risk a war that would have series consequences. Javier agreed, and when Fury arrived with an army of men, he and his students went without a fight.While captive, Javier joined a discussion with Fury and Doctor Strange-the physician and magician of Queen Elizabeth. Strange told them that the world was coming to an end and the only way to save it would be to launch an attack on the castle of Count Otto von Doom, and steal away the treasure of the Templars and the survivors from the Fantastick. Fury disbelieved him, thinking his friend Sir Richard Reed dead, but Javier read Strange’s mind, revealing that Strange thought he was telling the truth; and so it was decided. They traveled upon a ship that Javier’s student Jean Grey lifted into the air with her mind, while Javier bolstered her powers with his own, and they flew to Latveria. Javier and Jean remained in meditation the whole way; keeping the ship afloat, for if they set down they would not get airborne again.As the battle commenced, Javier led his men. He sent Angel and Scotius down to silence the cannons, while he ordered Roberto to deflect cannonballs, which he himself would try to steer off course via the cannoneer’s minds. His beast-like student Henry he asked to protect the ship from the flying minions of Doom that soon boarded the ship from the air. When the Captain of the Fantastick raged against his stone prison beneath Castle Doomstadt, it freed the members of the Captain’s crew, along with Donal and Matthew Murdoch. Donal quickly used the staff that was his greatest treasure, and turned himself into the Thunder God, Thor. When Thor created a massive storm to use against Doom, Roberto used the sudden moisture in the air to freeze the cannons and save their ship. Doom also used Thor’s storm to electrify the golden globe he held-a distraction given to him by Donal-but it exploded in his face; scarring him and bringing him to the brink of death. Victorious, Thor and the members of the Fantastick joined Javier’s crew, and with Thor’s help they got the boat to sea, as Jean Grey had collapsed.The band of heroes set sail for the New World to fix the tear in time that had created the weather anomalies circling the globe, as well as endangering the universe itself. On the way, Jean Grey’s body finally gave up under the strain of the use of her powers, and as per her final wish, she was flown into the air and vaporized by Scotius’ eye blasts, falling to the sea as ash; but not before Angel saw an image of an immense, flaming bird in the air. Almost to the Roanoke Colony, Javier sensed a trio of ships making their way to the New World; the first, Virginia Dare returning to the colonies with her time-traveling friend; the second, containing James’ men, set to kill Fury; and the third, the witchbreed Enrico with his two children. Enrico was an old friend of Javier’s, later set against him. Javier’s group intercepted Enrico’s boat first, and Roberto encased it in ice to imprison them, while Javier demanded to know what they were doing. Enrico explained that the winds had taken them to the New World, but Javier didn’t trust him.Javier soon participated in another group discussion; this led by the severed head of Doctor Strange, brought from England by his wife, Clea. Strange told them through his head that the faux-Indian Rojhaz was actually a visitor from the future, Captain America, whose arrival had jeopardized the universe itself. In order to fix it, the heroes would have to return him to the rift. They soon found the rift, and Javier had no choice but to make a deal with his old friend, Enrico, who was the only one with the power to open the rift to put the man back. Enrico agreed without hearing the proposal, but demanded that his own terms be meet when his job was done. As Javier had no other choice, he agreed. Together with Enrico, Thor, and Fury, they opened the rift enough for Fury to drag Captain America through, and it closed, healing the universe permanently. Though instead of reverting things back to the way they should have been, it separated the universe from the original, creating a pocket universe where the out-of-time heroes continued to exist.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Marvel 1602 #2\n", 
    "groupaffiliation": "Leader of his students", 
    "hair": "Gray\n", 
    "id": "Javier,_Carlos_(Earth-311)", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Teacher of the College for the Sons of Gentlefolk", 
    "placeofbirth": "Unrevealed", 
    "powers": "Javier is a powerful telepath, able to use his mind to sense people, read their thoughts, and speak into their minds from very far away.", 
    "realname": "Carlos Javier", 
    "significantissues": "Marvel 1602 #2 (intro)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 1602 (Earth-311)"
}