{
    "aliases": [
        "A-Bomb", 
        "formerly Bucky", 
        "the Hulk"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Rick was instrumental in the creation of the Avengers, as after the evil Loki took control of the Hulk, Rick was the person who sent out the radio call to assemble the heroes there. He later went on to become Captain America's sidekick.  However, after some time Rick started to resent being on the side-lines, however this was cured when he discovered a pair of alien bracelets that let him trade places with Captain Mar-vell, an imprisoned Kree warrior.Jones was a key player in the Kree-Skrull War where the Supreme Intelligence released Jones' latent Destiny Force. Jones used the Destiny Force to conjure up heroes from Earth's past to battle Ronan the Accuser and his Kree army, as well as to bring about a halt of galactic hostilities between the two races.After the death of Mar-vell, Jones returned to the side of the Hulk, and also briefly became an ally of the Galadorian spaceknight Rom.  He later met and married Marlo Chandler, but not before he had an encounter with the Ecdysiast.Rick was also a key player in the Destiny War, where Avengers from past, present and future were united to prevent the Time Keepers from destroying a significant number of timelines where humanity was deemed a threat to all existence. Jones' Destiny Force had led to a destructive, expansive human race in many timelines. Jones later sacrificed himself to prevent the destruction of all reality, but was saved when he merged with the son of Mar-Vell, Genis-Vell. This created a new Captain Marvel.Rick Jones was also revealed to be the monetary backer of the ex-superheroes team, the Loners.Jones has recently acquired powers causing him to transform into a massive creature calling itself A-Bomb. How this has occurred has yet to be revealed, but Rick has already tangled with the evil Red Hulk and helped the original Hulk - who somehow knew A-Bomb was Rick - temporarily stop his sinister twin. Rick also has some crucial information on who this Red Hulk is, but before he could say anything, Doc Samson stunned him with a blast from behind and carried him away. Rick was taken to secret A.I.M. facility, disguised as an abandoned S.H.I.E.L.D. base, and placed into the hands of the sinister M.O.D.O.K.. It was soon revealed M.O.D.O.K. had used cell patterns stolen from Bruce Banner at the end of his war with the heroes of Earth to create Rick's monstrous side known as A-Bomb. During a fight between Hulk and Red Hulk, the A.I.M. facility was destroyed and Rick helped a powerless Banner escape the explosion.A-Bomb stayed with Banner in the same shelter where they would cage Banner for the night when he first became the Hulk, and Rick had finally exerted control over the A-Bomb personality to the point where the monster possessed Rick's intelligence. Norman Osborn wanted to see if the claims about Banner no longer cursed with his gamma-powered alter ego were accurate, so he sent Ares to investigate. Ares attacked Banner, but it was A-Bomb to the rescue. Between A-Bomb's strength and Banner's intellect, Ares was defeated, and the two left him locked in the shelter. Rick and Bruce went their separate ways, and even though Rick is unable to transform back to his human state, he isn't unhappy about it, claiming he likes to be among Earth's heaviest hitters.A-Bomb was on hand when Banner decided it was time to teach his son, Skaar, the importance of teamwork by organizing a somewhat friendly game of football, but an unscheduled visit by the new Harpy forced them to oppose each other as Rick found out she was none other than Marlo. When the Harpy was finally subdued, A-Bomb took her away from the others to keep her safe. He returned after General Ross was killed by the Red Hulk and attended the memorial service.Rick went on to help Bruce Banner and the Red Hulk in their war against the Intelligencia, but he mainly acted as a chaperone to the red goliath in order to keep tabs on his whereabouts. Using his amazing camouflage ability, Rick trailed Red Hulk to an A.I.M. facility where the Cosmic Hulk was stored, but in an unfortunate turn of events, Rick and Red Hulk were pummeled by the powerful robotic copy. Following that incident, A-Bomb watched as Red Hulk gave aid to Thundra, sending her back to her time and burying a time machine for her people to find in the future. After the warrior woman was gone, A-Bomb attacked, hoping to uncover some of the blurred facts behind his metamorphosis. His mind still hazy from being experimented on, Rick knew Red Hulk had the answers. He just had to trick him into giving them up, and the best way to do that was by making him feel confident from triumph in battle.", 
    "durability": 3, 
    "education": "High school dropout", 
    "energy": 1, 
    "eyes": "Brown; (A-Bomb)Yellow\n", 
    "fighting": 5, 
    "firstappearance": "Incredible Hulk #1\n", 
    "groupaffiliation": [
        "honorary member of the Avengers", 
        "financier of the Loners", 
        "former leader of Teen Brigade"
    ], 
    "hair": "Brown; (A-Bomb) None\n", 
    "height": 69, 
    "id": "Jones,_Rick", 
    "identity": "Publicly known", 
    "intelligence": 4, 
    "knownrelatives": "Marlo Chandler Jones (wife), Polly (aunt), Mrs. Chandler (mother-in-law), Kieth Chandler, Ray Chandler, three unidentified others (brothers-in-law), unidentified father (deceased), Jackie Schorr (alleged mother; unconfirmed)", 
    "occupation": [
        "Musician", 
        "adventurer", 
        "author", 
        "former talk show host"
    ], 
    "placeofbirth": [
        "Scarsdale", 
        "Arizona"
    ], 
    "powers": "No superhuman powers; formerly possessed powers similar to the Hulk, causing him to transform into a gamma-powered behemoth of great strength and limited intellect.\nUnder special circumstances, Rick has been able to tap into the Destiny Force, a mysterious and near-infinite power source inherent in all of humanity. Rick has used this ability to materialize figures from his imagination and from other time eras, to paralyze thousands of Kree and Skrull warriors simultaneously, to overwhelm an Atlantean army, to heal his own broken body, to amplify his physical abilities and to levitate. The limits of the Destiny Force's uses, if any, have not been revealed.\nAt a time when Rick was bonded with Captain Marvel, he was able to release minor jolts of energy from the Nega-Bands. Through the bands, he possessed a telepathic link to Captain Marvel. At one point he trained himself to usurp control of Genis' body, and to afflict him with psychic pain.\n\nAs A-Bomb, Rick once again has superhuman strength and durability. His hide is similar to an armadillo's plated armor, giving A-Bomb bulletproof skin. Camouflage glands from cuttlefish experiments give him the ability to blend into his surroundings at will, making him virtually undetectable. He is also able to track both Hulk and Red Hulk by zeroing in on their gamma signature.", 
    "realname": "Rick Jones", 
    "significantissues": [
        "Avengers #1 (helps form the Avengers)", 
        "Avengers #4 (meets Captain America)", 
        "Avengers #89-97 (Kree-Skrull War)", 
        "Incredible Hulk #418 (married girlfriend Marla Chandler)", 
        "Avengers Forever #12 (merges with Genis-Vell)", 
        "Hulk #3, 2008 (Fought the Red Hulk, destroyed Gamma Base and released the original Hulk)", 
        "Incredible Hulk #600, 2009 (Saved Banner from an explosion in an A.I.M. facility)", 
        "Hulk #13, 2009 (Fought Ares, God of War)", 
        "Fall of the Hulks: Gamma, 2010 (Attended funeral of General Ross)", 
        "How Rick became A-Bomb (Fall of the Hulks: Red Hulk #3, 2010)"
    ], 
    "speed": 3, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 165
}