{
    "add": {
        "doc": {
            "aliases": "Formerly Exemplar of Physical Power", 
            "citizenship": "U.S.A.", 
            "content": "Kurt seemingly preferred Charles to his own son, which consumed Cain with jealousy and he took to bullying his stepbrother. Cain's father continued to beat him, but Cain did not suffer the abuse alone. Inexperienced at the use of his emerging mutant telepathic powers, Charles shared the pain and inadvertently learned of Cain's jealousy towards him. This only ensured that Cain would forever hate Charles for his unwitting betrayal.After an argument with his father, Cain accidentally caused a fire to engulf his father's home laboratory. Kurt saved Charles first, and then went back for Cain, reinforcing Cain's belief that his father loved Charles more than he. Kurt died of smoke inhalation, but not before warning Charles to always beware of Cain.Soon after, both Cain and Charles were drafted into military service and served in same unit. When Cain deserted under fire during a mission in Asia, Charles pursued, hoping to convince his stepbrother to return of his own accord. Charles followed Cain into a cave that housed the lost temple of Cyttorak, a powerful mystical entity. Therein, Cain unearthed the Crimson Gem of Cyttorak and, upon touching it, was transformed by its mystical energies into a human juggernaut. A subsequent cave-in buried Cain, and Charles believed his stepbrother dead.After many years of villainy, Cain was teleported to an alternate universe where he helped form the team of costumed adventurers known as the eXiles. Cain was eventually returned to his own universe, whereupon he encountered the psionic being known as Onslaught who used his enormous powers to physically hurl Cain from Canada to New York. There, he encountered the X-Men once more and was taken to Charles’ mansion for medical treatment. On waking, Cain sought out Charles to warn him of Onslaught. To his horror, Cain discovered that Onslaught was Charles who tore the Ruby of Cyttorak from Cain’s chest and trapped him within it. Therein, Cain discovered an entire plane of existence and encountered a corrupt aspect of Cyttorak. The mystic named Gomurr the Ancient sought to help free Cain from the jewel, imbuing him with the gem's power. Using his newfound strength, Cain destroyed the aspect and was freed from the gem, returning with more power than ever before. Ignoring Gomurr's warning that he was fated to destroy everything and everyone in his path, Cain returned to his villainous ways.Cain eventually discovered that his becoming the Juggernaut was no accident. He had been compelled to enter the temple of Cyttorak, who was one of a pantheon of eight gods that each had an avatar on Earth. These avatars, named the Exemplars, enlisted Cain’s aid in constructing a machine that would remove humanity's free will, thus allowing their gods to rule the Earth. With Charles’ help, Cain regained control of his psyche and foiled the Exemplars’ plan.Cain was again cast as a hero when the sentient spaceship Prosh returned to Earth to gather a group of costumed adventurers for a journey through time to uncover the keys to preserving human evolution. Whilst in the past, Cain was shown that despite all his yearning for power, he had squandered his mystical abilities. When the team reassembled in the present, they fought and defeated the alien entity named the Stranger who sought to control the natural evolution of mankind.After Sammy was returned home to Canada, Cain defied a restraining order to visit the boy. When he learned that Sammy’s father was physically abusing him, he flew into a rage and accidentally injured Sammy’s mother. Alpha Flight arrived to defuse the situation and, on seeing a terrified young Samuel, Cain surrendered himself and was taken into custody. Incarcerated in a holding facility designed to contain superhuman criminals, Cain was appointed a lawyer in the form of Jennifer Walters, the She-Hulk. Whilst Charles discussed a plan of legal action with Walters, another of the facility's inmates - the Rhino - broke free, setting Cain loose in the process. Rather than escape, Cain stayed and defeated the Rhino in order to save the life of a guard. This heroic act, combined with the Canadian government's less than ideal incarceration methods, was enough to make a case for Cain and endear him to Walters.Soon after, Cain and Walters began a romantic relationship that was cut short by the arrival of Cyttorak's new avatar. With Walters’ aid, Cain defeated the new Juggernaut, but the damage he had caused during the battle forced Walters to rethink her feelings for him. An impassioned plea from Sammy’s mother led to Cain receiving a reduced sentence, as well as extradition back to the United States. Cain continued to serve as a member of the X-Men whilst undertaking community service and anger management therapy.After the recent decimation of the mutant population following \"M-Day,\" Cain journeyed to England where he joined a new incarnation of the British super-team Excalibur. Following an incident involving the Captain Universe entity, Juggernaut was left in a weakened state and has been assigned to the Thunderbolts program under the supervision of Luke Cage.", 
            "durability": 7, 
            "education": "Military boarding school", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 3, 
            "firstappearance": "X-Men #12 (1965)\n", 
            "groupaffiliation": [
                "Thunderbolts", 
                "Formerly Excalibur", 
                "X-Men", 
                "former partner of Black Tom Cassidy", 
                "formerly Commission for Superhuman Activity", 
                "Exemplars", 
                "New World Order", 
                "Exiles", 
                "U.S. Army"
            ], 
            "hair": "Red\n", 
            "height": 113, 
            "id": "Juggernaut_(Cain_Marko)", 
            "identity": "Known to authorities and certain government officials", 
            "intelligence": 2, 
            "knownrelatives": "Kurt Marko (father, deceased), Marjory Marko (mother, deceased), Sharon Xavier Marko (stepmother, deceased), Charles Francis Xavier (Professor X, stepbrother), Cassandra Nova (stepsister, deceased), Lilandra (ex-sister-in-law), David Haller (Legion, stepnephew, deceased)", 
            "occupation": [
                "Adventurer", 
                "Professional criminal", 
                "former teacher", 
                "mercenary", 
                "soldier"
            ], 
            "origin": "X-Men #12 (1965)", 
            "placeofbirth": [
                "Berkley", 
                "California"
            ], 
            "powers": "The Juggernaut originally possessed untold mystical power which enhanced his strength to an unknown degree and made him a seemingly irresistible, unstoppable being.  Once he began to walk in a given direction, no obstacle or force on Earth was able to stop him.  Some obstacles, for example many tons of rock, or forces such as plasma-discharge cannons slowed his pace considerably, but nothing stopped him permanently from advancing. The Juggernaut was, however, vulnerable to magical forces of sufficient strength.\nBesides giving him vast superhuman strength, the mystical energy of Cyttorak gave the Juggernaut an extraordinary degree of resistance to all forms of injury.  The Juggernaut could also shield himself even further from injury by mentally surrounding himself with a force field.  Enveloped by this field, the Juggernaut had been seen to survive the fiery explosion of a truck transporting a huge quantity of oil without any injury whatsoever.  The Juggernaut could survive indefinitely without food, water, or oxygen thanks to his being sustained by his mystical energies alone.\n\nIn the past, the Juggernaut has temporarily possessed telepathic abilities and certain mystical powers, all of which he has since lost. Recently, however, the Juggernaut has been stripped of this mystical energy, including his personal force field.  He still possesses superhuman strength, endurance and durability due to years of absorbing the mystical energies of Cyttorak, but the current upper limit of these traits is as yet unknown.", 
            "realname": "Cain Marko", 
            "significantissues": [
                "First fought X-Men (X-Men #12, 1965)", 
                "first fought Hulk (Incredible Hulk #172, 1974)", 
                "first partnered with Black Tom (X-Men #101, 1976)", 
                "first fought Spider-Man (Amazing Spider-Man #229-230, 1982)", 
                "first fought Thor (Thor #411-412, 1989)", 
                "transported to alternate universe (Wolverine #93, 1995)", 
                "returned to own universe (All New Exiles #5, 1996)", 
                "trapped in Ruby by Onslaught (X-Men Unlimited #12, 1996)", 
                "joined Exemplars (Thor #17, 1999)", 
                "betrayed Exemplars (Juggernaut: The Eighth Day #1, 1999)", 
                "sought Avengers aid against Exemplars (Avengers #24-25, 2000)", 
                "employed by CSA (X-Men Forever #6, 2001)", 
                "with X-Men, vs Black Tom (Uncanny X-Men #410-412, 2002)", 
                "took up residence at mansion (Uncanny X-Men #413, 2002)", 
                "faced abusive past (Uncanny X-Men #416, 2003)", 
                "joined X-Men (Uncanny X-Men #425, 2003)", 
                "placed on trial, fought new Juggernaut (Uncanny X-Men #435-436, 2004)", 
                "joined new Excalibur (New Excalibur #5, 2006)"
            ], 
            "speed": 4, 
            "strength": 7, 
            "universe": "Marvel Universe", 
            "weight": 1
        }
    }
}