{
    "aliases": "None", 
    "citizenship": "Citizen of the United States", 
    "content": "After the X-Men left, Desdemona Synge, Lytton’s sister, sold Junkpile to an Alchemax Bioshop.  But while he was drugged and restrained on the way to the bioshop, La Lunatica, a psychic vampire who had escaped from the Theatre of Pain, hijacked Junkpile’s truck and freed him.  Luna was on the run and needed Junkpile’s help against the Theatre.  She later convinced Timothy Fitzgerald, soon called Skullfire, to keep her from the Theatre’s trackers, as well.  But she lied to Skullfire, and surprised both him and Junkpile by bringing them together and asking for their combined help.  The two fought at first, but Luna convinced them to put aside their differences to help her.  Soon, the three met up with Xi’an, who forgave Junkpile his betrayal, as Xi’an’s old criminal personality had resurfaced.  Following Xi’an, they left to track down the mutant savior, Driver.  They found him in a hidden garage in the middle of Sulphur Springs Valley, Arizona.  After breaking into his garage, the Driver captured them and attempted to upload Junkpile’s personality into his database, where he kept outcast mutants in order to revive them in the future when humankind would accept them.  But the leader of the Theatre of Pain, Brimstone Love, appeared and stopped the transfer.  Freed, Junkpile attacked the Driver to exact his revenge, but the Driver used the neurotechnology in his head to activate his car, Nitroburn, and drove it, intangible, through Junkpile, disrupting his mechanical circuits.  His body immediately began to pull scrap metal towards it in order to heal him, but the Nitroburn had created a sort of seizure in his systems, and Junkpile was unable to control the healing process.  Soon, Junkpile’s mutant power pulled the Driver’s database apart, killing the uploaded mutants.  Once Xi’an had agreed to Brimstone’s offer to join the Theatre, he healed Junkpile’s body in order to extend his suffering, and Xi’an, Brimstone, and the X-Men left him in the wreckage of the Driver’s garage.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 1, 
    "firstappearance": "X-Men 2099 #1\n", 
    "groupaffiliation": [
        "Former member of X-Men", 
        "former member of S.H.I.E.L.D."
    ], 
    "hair": "None\n", 
    "id": "Junkpile_(2099)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Former member of S.H.I.E.L.D.", 
    "placeofbirth": "Unrevealed", 
    "powers": "Junkpile has a techno-organic metabolism that allows him to armor his body with scrap metal, giving him increased strength, stamina, and immunity to physical damage.  When Junkpile is injured, his body automatically draws scrap metal towards it to replace his damaged parts.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}