{
    "add": {
        "doc": {
            "aliases": [
                "Blue Man", 
                "Victor Timely", 
                "Blue Totem", 
                "Scarlet Centurion", 
                "Rama-Tut", 
                "King of Kings", 
                "Master of Men", 
                "Lord of the Seven Suns"
            ], 
            "citizenship": [
                "Other Earth", 
                "31st and 40th centuries"
            ], 
            "content": "En route to the future, a \"time storm\" diverted Rama to the modern era and an encounter with a space-lost Dr. Doom.  Damaged by the time storm, Rama-Tut's control module skipped several years into the future and briefly crashed in Egypt, where he fought fellow time-travelers Blaquesmith and Cable. Inspired by Doom, he took the armored identity of the Scarlet Centurion, traveled to another timeline (Earth-689) and duped its Avengers into neutralizing all their fellow heroes so he could rule; but he was defeated by the visiting Avengers of Earth-616 and cast outside time.Richards sought to return to his native time, but temporal disruptions hurled him into Other Earth's 40th century. As Kang, he conquered that entire world, sparing only the tiny kingdom of Carelius due to his interest in the king's daughter, Ravonna. Kang's life became progressively non-linear, as each foray in time produced at least one divergent-timestream counterpart; it is extremely difficult to identify which Kang counterpart was involved with each encounter. Conquering everything within 100 light years, Kang next attacked his ancestor's world in the modern age of marvels, but the Avengers forced him to flee. Seeking a new power base, Kang established himself in 1901 AD as Victor Timely, a brilliant inventor and industrialist who founded the city of Timely, Wisconsin, became its first mayor, and transformed it into a technological marvel over the next century; \"Victor\" appeared to age and be replaced by his children (Kang in new guises). The city also housed a portal to his base Chronopolis where he gathered warriors from various eras to serve as his strike force, the Anachronauts. Kang's continued efforts saw his Spider-Man robot (Timespinner) destroyed by the Avengers and Spider-Man, and his conquest of Camelot foiled by the time-traveling Thing and Human Torch. He also assaulted the Reed and Sue Richards wedding, unknowingly drawn there by Dr. Doom's Emotion Charger device.Returning to the 40th century, Kang completed his galactic conquest and even invaded other dimensions. In Kosmos, he gained technology to create his powerful Growing Men. Kang then brought the Avengers forward in time, intending to subjugate them or defeat them in front of Ravonna. When both the Avengers and Ravonna defied him, the furious Kang easily conquered her small kingdom; however, when he tried to force Ravonna to marry him, he caused unrest in his troops for failing to follow his own edict of slaying all conquered rulers. Kang's troops, led by General Baltag, turned on him, but he allied with the Avengers to defeat them.  Impressed that Kang had risked his life for her, Ravonna leapt in the path of a blast from the defeated Baltag, saving Kang, but apparently dying in his place. The devastated Kang sought to restore Ravonna. Later, the cosmic Grandmaster challenged him to a contest of champions, offering him the power of life or death as the prize. Using the Avengers as pawns, Kang was victorious, but he chose the power of death, intending to slay the Avengers.  Foiled by the Black Knight, Kang had to live with the knowledge that he had squandered his chance to save Ravonna. Disturbed at having lost and feeling sympathy for Ravonna, the Grandmaster removed Ravonna from stasis, revived her, and told her of Kang's betrayal. Moving on, Kang tried to use the Hulk to destroy Bruce Banner's ancestor to prevent the Avengers from ever forming, but the Hulk foiled this plot. Kang then sent a robot double of himself to capture the Avengers during a war with rival time lord Zarrko the Tomorrow Man.One of Kang's most relentless campaigns was his quest for the Celestial Madonna, a woman fated to give birth to the most powerful being in the universe. Wanting to be that being's father, Kang narrowed the Madonna's identity to Agatha Harkness, Mantis, and the Scarlet Witch, abducting all three. Rama-Tut, actually Kang's own future self, arrived to help the Avengers thwart his plot. Mantis was finally revealed as the Madonna, and when Kang could not claim her, he tried to kill her; but his fatal blast was intercepted by the Swordsman, who died instead. Kang and Rama-Tut were then pulled into Limbo by Immortus, a potential future self of both men, but Kang imprisoned Immortus and used his technology to create the Legion of the Unliving, a team of reportedly deceased pawns drawn from past eras. The Avengers defeated the Legion and Kang fled. Kang soon returned, allied with a trio of Kangs from different time periods, and tried to abduct Mantis at her wedding, but Immortus foiled him by substituting a Space Phantom as his captive.Kang next made a base in Tombstone, Arizona, circa 1873 AD, intending to use it as a stepping stone to conquer the modern age. Opposed by cowboy heroes, as well as time-traveling Avengers, Kang disintegrated when his force field shorted out in battle with Thor. However, a failsafe device transported Kang's consciousness to an alternate body, as it had during many other near-death experiences. Though taking place in rapid succession in the modern era, these last two campaigns accounted for ten years of Kang's life. Less time-intensive efforts included seeking the reality-altering power of a Cosmic Cube, facilitating an attempt by the Inuit (Eskimo) Aningan Kenojuak to reclaim Captain America as the \"God in the Ice\" worshipped by his people years ago, conquering an alternate 40th-century Earth, battling the legendary First Line, and participating in the hero vs. villain war on the virtually omnipotent Beyonder's Battleworld.Kang then found his 40th-century base ravaged by rebels loyal to Baltag. To recover his base, he sought out a Growing Man stored in the modern era and battled Thor, who banished him to Limbo. There Kang chanced across Immortus' stronghold, Tenebrae, and learned of his own multitude of divergent counterparts. Unwittingly manipulated by Immortus, Kang formed the Council of Kangs, choosing a few of his most capable counterparts as allies, and began eliminating redundant Kangs from each alternate reality. One of these sought to pair with an alternate Ravonna and wipe out all other realities, but was eliminated after accidentally killing his lover. Kang prepared robot duplicates to replace the slain counterparts to rule the empires of every Kang in existence. At the same time, Kang re-took his 40th-century base via his Growing Man. After the rest of the counterparts were eliminated, the prime Kang slew the rest of the Council.Immortus then appeared, explained that he was Kang's future self, and showed Kang a psyche-globe containing the memories of all of the slain divergent Kangs. Kang tore the globe from his hands, only to go mad as the minds of all of the other Kangs merged with his. The last Kang-now every Kang, since he possessed all of his counterparts' memories-fled into Limbo. To save himself, Kang used his helmet's temporal circuitry to create an additional divergence/counterpart, dividing his madness between two Kangs. One made his way to Chronopolis to recuperate, while the other, still addled, was recruited by the Cross-Time Kangs, a group of beings who had defeated or slain alternate Kangs and usurped the Kang identity. That Kang learned of a plot by Kang-Nebula (actually a power-hungry Ravonna) to obtain the \"ultimate weapon\" within the Time Bubble, a period of time in Earth-8810 surrounded by an impassable temporal barrier. A trio of Kangs followed Kang-Nebula into the Time Bubble where they were cast into the vortex surrounding it and ultimately destroyed, though the divergent Kang also sent his Growing Man to help foil the demonic Inferno invasion of Earth.Taking control of Chronopolis, the prime Kang sought revenge on Mantis in the modern era, joined Dr. Doom during the Infinity War, took over the Cross-Time Kangs, learned an assassin was stalking him, and exposed his would-be killer as Ravonna, now calling herself the Terminatrix. Intrigued by her warrior nature, Kang battled her, but sacrificed himself to save her from an assault by the Avengers. Overcoming her hatred for Kang, Ravonna impersonated him and took over the Cross-Time Kangs. When Chronopolis was attacked by the immensely powerful temporal entity Alioth, Ravonna revived Kang, and with the aid of the Avengers they sacrificed the Cross-Time Kangs, using their energy to imprison Alioth.The reunited Kang and Ravonna (who posed as Victor Timely's fiancée Rebecca Tourmenet for a time) soon ruled Chronopolis side by side. However, Kang, now almost sixty, grew weary of administrative matters. Missing the days when he was worshipped in a small land, Kang returned to ancient Egypt circa 2930 BC as Rama-Tut and smashed his chrono-sphere. As Rama-Tut, he spent ten years benevolently enjoying his people's adulation. In 2920 BC he encountered the Avengers, who had been trapped in the past by a time machine that could only travel backwards in time. Determined not to become Immortus (whose subtle manipulations he despised), the later Rama-Tut tried to break the cycle by placing himself in suspended animation, reviving in the modern era to battle his past Kang self during the Celestial Madonna struggle. Failing to change the course of events and feeling resigned to his fate, Rama headed for Limbo, but upon glimpsing a chrono-flash of Immortus bowing to the powerful Time-Keepers, he was infuriated by the idea of becoming anyone's lap-dog, and vowed to overcome his destiny. Rama-Tut returned to Chronopolis, resumed his Kang identity and used his rivals to destroy each other. He then destroyed the mind-transfer failsafe device he had so often used to cheat death, feeling that it took the risk-and thus the enjoyment-out of conflict. After a brief battle with the X-Men and an enterprising starship crew, Kang formed an alliance with Libra (Gustav Brandt), the Kree Supreme Intelligence and the Avengers against Immortus and the Time-Keepers.  Ravonna and the Anachronauts were apparently slain and Chronopolis was destroyed, but Kang managed to destroy the Time-Keepers and forcibly diverge himself from Immortus, leaving his future uncharted.Renewed by this victory, Kang engineered a series of successors, each of whom he named Marcus. These infants were sent back in time and trained to be warriors worthy of inheriting Kang's empire. Following a failed effort to conquer the realm Otherworld, Kang, alongside Marcus XXIII (outfitted as the Scarlet Centurion), used Damocles Base, his massive armada, and alliances with various criminal forces (including rogue Atlanteans and Deviants) to conquer Earth; but the Avengers led a rebellion that ultimately defeated and imprisoned Kang. Marcus freed Kang in hopes of restoring their dominion, but Kang knew that Marcus had held back during the war more than once because of his attraction to Avengers member Warbird. Unable to forgive this betrayal, Kang slew Marcus. Disheartened, Kang told his computer to postpone development of Marcus XXIV. Regaining his focus, Kang plotted against Iron Lad, his younger self created by his meddling in his own past, and his allies in the Young Avengers.", 
            "durability": 5, 
            "education": "Unrevealed", 
            "energy": 6, 
            "eyes": "Brown\n", 
            "fighting": 3, 
            "firstappearance": "(As Rama-Tut) Fantastic Four #19 (1963); (as Kang) Avengers #8 (1964)\n", 
            "groupaffiliation": [
                "None", 
                "Formerly Council of Kangs", 
                "Cross-Time Kangs"
            ], 
            "hair": "Brown\n", 
            "height": 75, 
            "id": "Kang_The_Conqueror", 
            "identity": "Secret", 
            "intelligence": 4, 
            "knownrelatives": "Nathaniel Richards, Cassandra Richards, their unnamed son, and matriarch of the Eyriennes; Tara Richards, Reed Richards, Franklin Richards, Valeria Richards (all ancestors); various Eyriennes (common ancestry); Victor von Doom (alleged ancestor); Ramades (son), Marcus Kang I-XXIII (sons, deceased); Immortus, Iron Lad, and numerous other alternate dimensional counterparts and their offspring", 
            "occupation": "Conqueror", 
            "placeofbirth": [
                "Other Earth", 
                "31st century"
            ], 
            "powers": "Kang ages at a slightly slower rate than modern humanity.\nKang typically carries various weapons, such as an anti-matter defense screen generator, a \"vibration-ray\" projector, an electromagnetic field-amplifier, neutrino-ray warheaded missile launcher (hand-gun size), electrical paralysis generator, nerve gas sprayer, and a molecular expander.  Kang commands a vast armada of warriors from across the galaxy of his future era.  He uses numerous robots, most notably his Growing-Man stimuloids, packed with the \"Growth Pollen\" of the world Kosmos, which causes them to grow in size and strength by absorbing kinetic energy.\n\nKang's primary base in 40th-century Other Earth is the Center, but he also maintains a secret dwelling in the realm known only as Purgatory, as well as strongholds in various alternate realties.  His former base Chronopolis, powered by the Heart of Forever, served as a crossroads into virtually every era in human history, but lay just out of phase with the timestream and was therefore undetectable.  Its palace and inhabitants were unaffected by temporal divergence or the passage of time.  Kang formerly employed a 20' long space-worthy vehicle housing his time machine, which could reach all eras of all timelines by accessing the transtemporal realm of Limbo.  Kang has used a number of other vessels, such as his Sphinx ship and Damocles Base, an immense sword-shaped orbiting headquarters.", 
            "realname": "Nathaniel Richards", 
            "speed": 7, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 230
        }
    }
}