{
    "aliases": "The Shatterer", 
    "citizenship": "Attilan", 
    "content": "Karnak was with the Inhuman royal family when Crystal brought the Human Torch to their hidden headquarters, from where they searched for their queen, Medusa. When he met the youth he introduced himself by throwing him over his shoulder in a display of Inhuman skill. When Johnny awoke, Gorgon had returned with Medusa, and it was revealed that the Torch was not an Inhuman as Crystal had thought. After Gorgon and Triton fought with him, Johnny burned his way out of the hideout to alert the other members of the Fantastic Four.Along with the rest of the Inhumans, led by Black Bolt, Karnak fought with the Fantastic Four-initiating the first attack by chopping off a piece of wall and throwing it at the Thing-until Crystal appeared and announced that Triton had been taken by the Seeker. Karnak and his fellow Inhumans soon surrounded Lockjaw, who teleported them back to Attilan: where Black Bolt faced off against his traitorous brother, Maximus. Black Bolt quickly took his crown back by force and reclaimed leadership of the Inhumans.But the Fantastic Four appeared moments later, having followed the Seeker back to the refuge. While Johnny Storm and Crystal ran to each other, and Black Bolt and Mister Fantastic argued, Maximus fired his atmo-gun, intending to destroy all of humanity. Though when his weapon didn’t work, Medusa deduced that it proved Inhumans and humans were of the same race, which infuriated Maximus. He went out of control and reversed his machine, creating a Negative Zone around Attilan that trapped Karnak and the rest of the Inhumans in, while the Fantastic Four narrowly escaped. While they remained trapped, Karnak became obsessed with breaking the barrier using his skills, but he only succeeded in injuring his hand. Eventually, Black Bolt revealed his secret: that the use of his voice was lethally destructive, and he soon used its power to destroy the barrier that imprisoned them. The Inhumans' Council of Elders soon decreed that the royal family would disperse and go into human society to learn more of it, while the rest of the Inhumans rebuilt Attilan. Black Bolt agreed, and led them out.", 
    "durability": 1, 
    "education": "Royal tutors of Attilan", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #45 (1965)\n", 
    "groupaffiliation": "Royal Family of the Inhumans", 
    "hair": "Black\n", 
    "height": 67, 
    "id": "Karnak", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Mander (father), Azur (mother, deceased), Triton (brother), Black Bolt, Maximus, Crystal, Gorgon, Medusa, Ahura, Luna (cousins), Quicksilver (cousin-in-law), extensive extended family", 
    "occupation": "Priest / philosopher", 
    "origin": "Inhumans: The Untold Saga #1 (1990)", 
    "placeofbirth": [
        "Island of Attilan", 
        "Atlantic Ocean"
    ], 
    "powers": "Karnak possesses a degree of superhuman strength derived from his eugenically superior Inhuman heritage and his intensive regimen of regular exercise. Karnak can lift (press) about 1 ton under optimal conditions. Besides strength, Karnak possesses certain physical skills superior to those of human athletes. His Inhuman metabolism affords him slightly greater reaction time, endurance, and speed than the human race's most perfect physical specimen, Captain America.\nKarnak has physically conditioned his body and mind to their peak levels of efficiency. He has voluntary control over most of his body's autonomic functions: breathing, heartbeat, bleeding, reaction to pain, rate of healing, etc. He is extremely lithe and flexible, able to expand and contract his muscles and contort his body into seemingly painful positions. He has toughened all the striking surfaces of his body in general, particularly his hands, so that they are covered in dense callus. Karnak is capable of shattering wood, cinderblock, even mild steel.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 150
}