{
    "add": {
        "doc": {
            "aliases": "Antichrist", 
            "citizenship": "Citizen of Hell", 
            "content": "Kid Blackheart settled in New York, but he couldn't stay hidden forever. Subjected to another assassination attempt, he would have perished if not for Jaine Cutter and her Breathing Gun. Jaine and the Antichrist fled but were again trapped by a group of mindless minions. Hellstorm, also tracking the boy so he might kill him, ended up having no choice but to defend him from his attackers. Kid Blackheart ran but didn't get far because the arrival of Daniel Ketch. Snatching the boy from the streets and delivering him back to his saviors, Ketch wasn't surprised to see his brother, Johnny Blaze, and his Caretaker already in their company. Ketch explained how he made a deal with the devil to keep the boy safe in exchange for the keys to Heaven to stop Zadkiel.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Black\n", 
            "fighting": 1, 
            "firstappearance": "Ghost Riders: Heaven's On Fire #1 (2009)\n", 
            "groupaffiliation": "None", 
            "hair": "Black\n", 
            "id": "Kid_Blackheart", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Satan (adoptive father), unidentified birth parents", 
            "occupation": "Bringer of the apocalypse", 
            "origin": "Ghost Riders: Heaven's On Fire #1 (2009)", 
            "placeofbirth": "Unrevealed", 
            "powers": "As the Antichrist, Kid Blackheart potentially has unlimited power, however, he is still not strong enough to survive a battle with God's greatest weapon, the Ghost Rider", 
            "realname": "Unrevealed", 
            "significantissues": "On the run from Zadkiel's minions, forged an alliance with the Blaze and Ketch, sought to overthrow Heaven, forced to flee from an army of Ghost Riders (Ghost Riders: Heaven's On Fire #1-6, 2009-2010)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}