{
    "aliases": "Hyperion", 
    "citizenship": "Unrevealed", 
    "content": "Eventually Hyperion came upon a world where he wanted to remain and he slaughtered all of the American heroes in New York City on that Earth. The Exiles were sent in to take Hyperion down, and were given the ultimatum to kill all but six combined members of Weapon X and the Exiles. The Exiles allied themselves with Weapon X leader Gambit and took the fight to Hyperion. In the ensuing melee Morph killed Ms. Marvel, and Firestar killed Spider while Hyperion killed Hulk, Firestar, and Magik. After decimating the Exiles team in combat, Hyperion was finally injured by Blink who using her powers to cause Hyperion to blast himself with his heat vision. This crippled Hyperion allowing Gambit to use the fallen Magik’s sword to destroy him. The resulting explosion killed Gambit and Hyperion and the Exiles moved on to the next reality. However the bodies of the deceased members (including Hyperion) were teleported to the Crystal Palace where the Timebreakers (the true cause for the Exiles existence) had been putting the bodies of fallen members of both Weapon X and the Exiles on display. Hyperion’s body was also put on display and his body’s cells began storing solar energy to allow him to recover from his wounds. Eventually recovering from his injuries, King Hyperion broke out of the crystal stasis he was being held in and took over the Timebreakers operations.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 1, 
    "firstappearance": "Exiles #38 (2004)\n", 
    "groupaffiliation": "(Formerly) Weapon X", 
    "hair": "Brown, shaved bald\n", 
    "id": "King_Hyperion_(Earth-4023)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "King of Earth", 
    "origin": "Unrevealed", 
    "placeofbirth": "Unknown", 
    "powers": "Has superhuman strength so that he can lift in excess of 100 tons. He can fly and is superhumanly fast, able to travel at near light speed given enough room to accelerate. He is incredibly durable and can heal from almost any wound. He can also emit rays of heat from his eyes. Every cell in his body is a solar battery that absorbs solar energy. Even when his body is dismembered his cells will still absorb and store solar energy.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Earth-4023"
}