{
    "add": {
        "doc": {
            "aliases": [
                "The Human Cobra", 
                "Cobra"
            ], 
            "citizenship": [
                "U.S.A.", 
                "(formerly Holland)"
            ], 
            "content": "After numerous attempts at crime, the Cobra teamed up with Mister Hyde to gain revenge on Thor, and despite their defeat, they began a long partnership together. Their next team-up was on behalf of Loki. On his urging, the two kidnapped Blake’s nurse and love interest, Jane Foster but were again defeated by Thor. The pair crossed the paths of many heroes, most notably Daredevil and Spider-Man.The Cobra and Mister Hyde, working on behalf of the Purple Man, suffered yet another defeat from Daredevil, were remanded to Ryker’s Island prison. The Cobra used his powers to escape, but willingly left Hyde behind when they ran into difficulties. Enraged, Hyde swore vengeance on his former partner. Mister Hyde would later return to stalk the Cobra, who was at this time was seriously fearing for his life. Hyde was stopped by Spider-Man, after a long and ferocious battle, by getting stunned after being knocked out a high window.The Cobra was recruited by the Sidewinder to become a member of his new organization, the Serpent Society. The Cobra remained with this organization for a long time, rising to become one of Sidewinder's most trusted lieutenants. When Viper returned to take over the Society, the Cobra (among with Society members Anaconda and Cottonmouth) decided to support her as the new leader. He began to question Viper, however, when she revealed her plan to mutate everyone in Washington DC into serpent-like creatures. Eventually, the Cobra rebelled and single-handedly defeated Viper, who he later turned over to Captain America. With Viper's takeover thwarted, the Serpent Society was reorganized. Bitter over his betrayal by various Society members, Sidewinder resigned from his position as team leader, leaving the Cobra in his stead.This began a new period of Voorhees’ life, as his recent successes lent him a determination to re-invent himself for his new position of leadership, The Cobra sought out the one person that he still feared above all-- Mister Hyde. After going one-on-one with his former partner, the Cobra succeeded in besting him. Flushed with new confidence, he renamed himself King Cobra, and the long grudge match between the two seemed to be over.Under King Cobra’s leadership, the Society first tried to put Diamondback on trial for betraying them by developing a relationship with Captain America. The trial was a disaster. Not only did Diamondback escape (with the help of Sidewinder), but he lost the support of her friends within the group, and Diamondback led Captain America and Paladin to the team to take them down. With its members scattered, the Serpent Society remained too fragmented to be considered a significant threat as it was under Sidewinder’s direction. Indeed, it was only after creating new “Sidewinders” with similar teleportaion technology as their namesakes that the team could once again operate at full capacity.King Cobra appeared as one of the many villains who were freed upon a massive breakout of the Raft staged by Electro. Although many were thwarted by the new Avengers, King Cobra managed to get away but became the first such escapee who the new hero Toxin hoped to bring to justice. Toxin used Mister Hyde as an informant on his former partner, successuflly tracking him down, and King Cobra was brought back to prison.", 
            "durability": 3, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 4, 
            "firstappearance": "Journey into Mystery #98\n", 
            "groupaffiliation": [
                "Thunderbolts", 
                "(formerly) Serpent Society", 
                "Serpent Squad", 
                "partner to Mister Hyde"
            ], 
            "hair": "Bald\n", 
            "height": 0, 
            "id": "King_Cobra_(Klaus_Voorhees)", 
            "identity": "Publicly known", 
            "intelligence": 2, 
            "knownrelatives": "Unrevealed", 
            "occupation": [
                "criminal", 
                "(formerly) laboratory assistant"
            ], 
            "origin": "Journey into Mystery #98", 
            "placeofbirth": [
                "Rotterdam", 
                "Holland"
            ], 
            "powers": "Due to the irradiated cobra venom in his veins, Voorhees has developed great contortionist  abilities. He can dislocate and snap back into place his shoulders and hips at will and has phenomenal mastery of his musculature. He can move at phenomenal speeds via muscular contractions, which resemble the slithering of snakes. His bones are also flexible and nearly impossible to break. These powers enable him to slither through things as narrow as a one foot diameter pipe, recover from falls or other major impacts, and grapple victims with a nearly unbreakable “cobra grip.”", 
            "realname": "Klaus Voorhees", 
            "significantissues": [
                "Poisoned employer, became the Cobra, defeated by Thor (Journey Into Mystery #98)", 
                "first joined with Mister Hyde (Journey Into Mystery #105)", 
                "joined first Serpent Squad (Captain America #163)", 
                "joined second Serpent Squad (Captain America #180), abandoned Viper, shot in the back for his cowardice (Captain America #1830", 
                "escaped Ryker’s, leaving Hyde behind (Spectacular Spider-Man #46)", 
                "joined Serpent Society (Captain America #310)", 
                "elicited Captain America’s help against Viper (Captain America #344)", 
                "sought out Mister Hyde, defeating him and taking name of King Cobra (Captain America #365-367), joined Thunderbolts (Thunderbolts #104, 2006)"
            ], 
            "speed": 3, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 160
        }
    }
}