{
    "aliases": [
        "Ayesha", 
        "She Who Must be Obeyed", 
        "J'Ridia Starduster", 
        "She Whose Trail Dusts Hope", 
        "Her", 
        "Paragon"
    ], 
    "citizenship": "None", 
    "content": "While in the cocoon, Paragon adapted itself into a female form and slowly moved towards New York City. When dockworkers fished the cocoon from the harbor, Paragon hatched as Her. Adopting her creators' goal of parenting a perfect race, Her sought Him as her ideal mate. Her's search began with Alicia Masters, who had briefly known Him, but this brought Her into conflict with Alicia's boyfriend Ben Grimm, the Thing. Moondragon sensed Her's presence and sought her out, informing Her of Him's evolution into Adam Warlock and subsequent death at the hands of Thanos. Believing that she could revive Warlock, Her sought Warlock's burial site on Counter-Earth, accompanied by Alicia, Moondragon, the Thing, and Starhawk/Aleta. When Counter-Earth proved to be missing, Her resurrected its creator, the High Evolutionary, and located the thieves. On Counter-Earth, Her resurrected Warlock, only to discover his soul missing (actually confined within the Soul Gem, since stolen). She reburied Warlock's body, but was moved when offered solace by Grimm, to whom she had only contempt. Unable to deal with these new emotions, she fled.Her's search for enlightenment led her near the planet of U'sr'pria, which was being ravanged as its technological advancement destroyed its environment. Investigating, Her found the planet had been conquered by a mutant member of its own race, the U'sr'pr, who forced the planet into a technological boom, striking a deal with the Consortium, an intergalactic business conglomerate, for his own comfort. Her angrily depowered U'sr'pr, and then aided the natives in their clean-up. The populace named her J'Rida Starduster, or She Whose Trail Dusts Hope. When the Consortium found their profits from U'sr'pria dwindling, they sent agents to correct this. The Consortium proved too powerful, so J'Ridia fled to Earth seeking aid, carefully drawing the Consortium after her and away from U'sr'pria. The Consortium caught J'Ridia near Earth and attacked; she fell out of control into Toronto, mistaking it for New York. The Consortium followed, and Alpha Flight aided J'Ridia in battling them. The  Avengers also came to the city's aid, but neither side proved victorious. As the battle was demolishing the city, J'Ridia decided to surrender herself to the Consortium, but before she could, the alien Quwrlln coincidentally teleported away J'Ridia and half of Alpha Flight and the Avengers, seeking their aid in defending their world from Galactus. The Quwrlln had moved their planet into another dimension; the different physical laws allowed the defeat of Galactus there. Unwilling to kill Galactus but not wanting to leave him stranded on the Quwrlln's planet with no recourse but to eventually devourer it, a solution was found when the Quwrlln teleported Galactus to the planet that powered the Consortium's mother ship. Galactus devourer the planet, sparing the Quwrlln, and the Consortium was crippled freeing U'sr'pria.Struck by the selflessness of the humans who aided her, J'Ridia remained on Earth, forgoing her U'sr'prian name. Again known as Her, she discovered that Adam Warlock had been resurrected with his soul restored, but Warlock, occupied with the universe-threatening menace of the Infinity Gauntlet, Dismissively rebuffed Her's advances. At loose ends, Her remained in New York City, protecting it against threats of Eon's expanding corps and Edifice Rex. Her soon realized that she and Warlock would make a poor parental couple as they possessed virtually identical genetic material, and decided to seek the best mate from within humanity. She created pods of genetic material designed to draw the best of herself and a mate, and attached these to the back of six males: Wonder Man, Hyperion, Hercules, Doc Samson, Ikaris, and Gilgamesh. When Quasar (Wendell Vaughn) opposed her, she placed a pod on him as well, drawing the ire of Moondragon, who had decided Quasar was her own perfect (if unwilling) mate. While the three battled, the Avengers succeeded in removing the pods from the others, and her decided Quasar was indeed her ideal mate, as he was the only being to evidence concern for the contents of the pod over himself. However,  Quasar pointed out that her desire to parent children was arising solely from her creators' wishes and not from herself, challenging her to find her own purpose in life. Uncertain, Her removed the pod from Quasar, but decided to remain close to him as a companion, observing his humanity.Her worked beside Quasar for a short period of time, battling both Binary and the Super Skrull as she defended Earth during Operation: Galactic Storm. She then accompanied Quasar to the Kree homeworld, Hala, where she was moved by its recent devastation and fought to free the souls of its population from the Soul Eater. Her accompanied the aliens Mourners to the planet Scadam, but found herself unable to watch this planets destruction. Though she had not sought out combat, she saw it as her kismet to be unable to avoid it, and so adopted Kismet as her new name. She fought the invading Black Fleet on Scadam, but was wounded and witnessed from afar the destruction of the invading fleet by extradimensional energies. Seeking these energies, she returned to Earth, where she found them originating from Quasar's girlfriend, Kayla Ballantine, who bore the extra-multiversal Star Brand. When Kismet's questioning of Kayla inadvertently turned into battle, Kayla lashed out, rupturing Kismet's cells and forcing her to withdraw into a regenerative cocoon. Quasar later moved the cocoon to Project PEGASUS for safe storage.When Wiadyslav Shinski suffered a serious stroke, the remaining members of the Enclave stole the cocoon from PEGASUS and removed Kismet from it. They placed Shinski within it to regenerate but also took pains to protect Kismet, who was nearing recovery. Striking on the idea of using Kismet's genetic material to hasten the recovery, they withdrew a sample from her. This was stolen by Frank, an A.I.M. Adaptoid spy who had been observing the Enclave. The Adaptoid injected itself with the sample and adapted Kismet's powers as a new Paragon, but the recuperating Shinski injected Paragon with a genetic weapon they had developed for use against Kismet, destroying him. Grateful that Shinski had saved her, though uneasy they had developed a weapon to destroy her, Kismet wove regenerative cocoons for all three of the Enclave members (they had been injured during the battle) and placed them within, watching over them as \"mother\" while she tried to determine what it met to be their \"daughter.\"After some months, an energy blast from space disrupts the cocoons, and the Enclave members hatched, transformed into lesser versions of Kismet with similar powers. With these abilities, the Enclave began what they had always wanted to do: curing the world's ills. However, their short term solutions frequently created worse long-term problems, and Kismet convinced them to leave the planet while they learned how to use their powers and where they had come from. Kismet led them in search of the energy blast that had triggered their change and discovered Khatylis, an alien life form which harvested the flotsam of destroyed systems and created new matrices for life. When the Enclave disrupted this matrix, they were absorbed by it, but Kismet and the Silver Surfer merged their life essences with that of Khatylis to restore its life matrix, freeing the Enclave.The Enclave apparently lost their powers, returning to Earth. Shinski and Morlak Shared the identity of Crucible, and enslaved Kismet (under the name \"Ayesha\") against the Fantastic Four. Showing new powers of mind control, Ayesha defeated the Four, but was eventually banished when a black hole grenade transported her and Shinski into another dimension. Shinski has since returned to Earth, while Kismet - restored to her classic form - fought against the Heart of the Infinite - powered Thanos.", 
    "durability": 1, 
    "education": "Self-taught; initially programmed by Enclave during creation", 
    "energy": 1, 
    "eyes": "White\n", 
    "fighting": 1, 
    "firstappearance": "(As Paragon) Incredible Hulk Annual #6 (1977); (as Her) Marvel Two-in-One #61 (1980); (as J'Ridia Starduster) Marvel Comics Presents #35 (1989); (as Kismet) Quasar #40 (1992); (as Ayesha) Fantastic Four #11 (1998).\n", 
    "groupaffiliation": "None", 
    "hair": "Blonde\n", 
    "height": 78, 
    "id": "Kismet", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "The Enclave (creators); Adam Warlock, female \"Warlock (Janie Chin)\" (genetic twins)", 
    "occupation": "Adventurer", 
    "origin": "Incredible Hulk Annual #6 (1977)", 
    "placeofbirth": [
        "Beehive", 
        "Shard Island", 
        "Atlantic Ocean"
    ], 
    "powers": "Kismet's cells serve as cosmic batteries, allowing her to absorb, store, and use cosmic energies.", 
    "realname": "None", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 390
}