{
    "add": {
        "doc": {
            "aliases": [
                "Control", 
                "Maya Corday", 
                "others"
            ], 
            "citizenship": "U.S.A.", 
            "content": "Misty first met Iron Fist when Colleen, who had already befriended him, was abducted by his enemies; erroneously believing Iron Fist responsible, Misty attacked him but soon learned the truth, then helped him against his enemies. Misty and Iron Fist became romantically involved. When he founded Heroes for Hire with Luke Cage, she and Colleen, known as the Daughters of the Dragon for their martial arts skill, frequently aided them.Despite their close relationship, Misty eventually became estranged from Iron Fist; she began dating police officer Tyrone King, who unknown to her was actually Iron Fist's mystical enemy Master Khan in disguise. Unknown to either, Iron Fist was subsequently replaced by the extradimensional plant race known as the H'ylthri, and Khan arranged for the disguised alien Super-Skrull to murder the surrogate Iron Fist; the grief-stricken Misty soon broke ties with \"King.\" Later, the Super-Skrull impersonated Iron Fist himself, and although his deception was exposed, the non-human nature of Iron Fist's corpse was also revealed, as was Khan's scheme. Accompanied by Namor the Sub-Mariner, Misty and Colleen traveled to Iron Fist's home city in the dimension of K'un Lun, where they rescued him from imprisonment by the H'ylthri. Misty and Iron Fist renewed their relationship, and she aided him during his efforts to rebuild Heroes for Hire, but afterward drifted apart.Hiring secretary Penny O'Neal, Nightwing Restorations took on several low-profile clients. Wing worked undercover as a performer at Circus Vandenberger to expose Rudy Vandenberger's scheme to take over the family business through acts of terrorism. Knight and Wing next reunited kidnapping victim Shana \"Tok\" Peters with her parents. Knight and Wing also apprehended Ron Tatum, a former heavyweight boxer living in Brooklyn who physically assaulted his wife Ann, a childhood friend of Knight. With business slow, Knight began working as a paralegal for the law firm of Nelson, Murdock & Sharpe, while Wing offered Cage work as an operative for Nightwing Restorations, but Cage declined. Knight then teamed with Spider-Man, Cage, and Iron Fist to defeat Scorpion, who had kidnapped J. Jonah Jameson. After the battle, a distraught and disillusioned Iron Fist disappeared on a world-spanning quest to find meaning for himself. The Daughters followed him to the Himalayas, saving him from a wolf pack. Along with his mentor, Lei Kung the Thunderer, the Daughters accompanied Iron Fist to K'un-Lun, where he defeated a resurrected Steel Serpent and regained direction in his life.Shortly after Iron Fist reestablished Heroes for Hire as a larger mercenary organization funded by Namor's Oracle, Inc., the Daughters were hired to help the team apprehend biotechnician/geneticist Professor Wolfgang Hessler, a powerful bio-weapon creator operating out of St. Eboar’s Monestary in Symkaria. Unwittingly manipulated by the Master, the Daughters and their allies soon battled Silver Sable's Wild Pack, which was protecting Hessler. Although the Master ultimately obtained Hessler’s technology, the Heroes for Hire defeated him, but at a great cost to Iron  Fist. Soon after, the Daughters participated in a mystic ceremony conducted by Brother Voodoo to replenish Iron Fist's lifeforce. Alongside Iron Fist and Cage, the Daughters were next hired by CEO Getulio Villa-Lobos to protect DaCosta International's San Francisco office from Reignfire, whom Villa-Lobos believed to be Roberto DaCosta (Sunspot). Knight was later attacked by the New Men's White Tiger, Iron Fist's Heroes for Hire teammate, who was jealous of Knight's relationship with Iron Fist, but Knight convinced the Tiger she could not win Iron Fist's love by eliminating the competition. Next, Wing accompanied Heroes for Hire to Madripoor to investigate allegations of piracy in the South China Seas and helped defeat Lionmane (Lo Chien), the Chinese general secretly in charge of the piracy operation, and his associates -- the Cat and Sai. Later, the biochemist Nightshade (Tilda Johnson) broke into Nightwing Restorations, defeated Wing and obtained the cremated remains of Black Dragon’s head, which she used to resurrect the monster. When Cage was critically injured during Nick Fury's Secret War, Knight and Wing provided protection alongside Iron Fist while Cage recuperated at the Night Medical Center, a treatment facility for street level superheroes.Knight and Wing have since become bail bonds-women, lending bail money to apprehended street level super-villains until their cases work their way through the criminal justice system. If the super-villains miss their scheduled court dates, Knight and Wing become bail enforcement agents, also known as bounty hunters, concerned solely with bringing their fugitive clients back to justice. Nightwing Restorations recently hired indestructible mutate Otis Johnson as an administrative assistant. Knight and Wing recently investigated Ricadonna, a wealthy New York publishing mogul and rising crime lord suspected of involvement in the deaths of several Nightwing Restorations' clients who inadvertently stole a microchip containing a computer virus capable of destroying the world economy. In a sword fight between Knight and Ricadonna, Misty lost her bionic arm. Tony Stark outfitted her with a state-of-the-art arm. Aided by Iron Fist and the insect-controlling criminal Humbug, Knight and Wing raided a secret auction for the microchip, and brought Ricadonna to justice.Knight went on to form a new version of the Heroes for Hire, along with Colleen, for the purpose of apprehending those who refused to comply with the Superhuman Registration Act. They were backed by Stark and their roster included old faces as well as some new ones like the Black Cat, Shang-Chi, Orka and the new Tarantula. Together, the group found themselves face-to-face with those they considered allies like Captain America as well as enemies such as the Headmen. Ultimately, the Heroes for Hire suffered more than they triumphed due to betrayals, death and losing themselves somewhere along the line, so the team disbanded. After a rocky relationship with Iron Fist, she eventually reconciled with him and even saved his life on a few occasions. Once Iron Fist returned from a near-fatal journey to The Eighth City, Misty revealed to him she was pregnant with his baby.During the time Daredevil decided to lord over New York City's Hell's Kitchen as leader of the Hand, Misty investigated several Hand-related murders. The victims were all known felons, but she wanted to make sure Daredevil wasn't using the ninjas as a hit-squad. Silver Sable, Paladin and the Shroud were all involved in similar investigations, so they decided to pool their resources. They discovered that several police officers led by Misty's old partner, Rafael Scarfe, were posing as ninjas, framing the Hand for the murders they were committing. Misty was hospitalized for injuries she received and was told she had a false pregnancy, causing her to end her relationship with Iron Fist.", 
            "durability": 3, 
            "education": "Police academy graduate, otherwise unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 7, 
            "firstappearance": "Marvel Team-Up #1 (1972)\n", 
            "groupaffiliation": [
                "Heroes for Hire", 
                "formerly Nightwing Restorations/Daughters of the Dragon", 
                "ally of Iron Fist and Cage", 
                "New York Police Department"
            ], 
            "hair": "Black\n", 
            "height": 69, 
            "id": "Knight,_Misty", 
            "identity": "No dual identity", 
            "intelligence": 7, 
            "knownrelatives": "None", 
            "occupation": [
                "Private investigator", 
                "bail bonds-woman", 
                "bounty hunter", 
                "former police officer"
            ], 
            "origin": "Iron Fist #6 (1976)", 
            "placeofbirth": "Unrevealed", 
            "powers": "Misty Knight's bionic right arm possesses superhuman strength, which she can use in a vise-like grip; however, since the rest of her body has not been bionically altered, she cannot use her strength to lift heavier weights than she could with normal human strength.", 
            "realname": "Mercedes \"Misty\" Knight", 
            "significantissues": [
                "First met Iron Fist (Marvel Premiere #15, 1975)", 
                "first teamed with Colleen Wing as Daughters of the Dragon (Deadly Hands of Kung Fu #32-34, 1977)", 
                "helped X-Men and others against Moses Magnum (X-Men #118-119, 1979)", 
                "with Colleen Wing, fought Angie Freeman and other vampires (Bizarre Adventures #25, 1981)", 
                "with Namor the Sub-Mariner and others, journeyed to K'un Lun, reunited with Iron Fist (Namor the Sub-Mariner #21-24, 1991-1992)"
            ], 
            "speed": 1, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 136
        }
    }
}