{
    "aliases": [
        "Bright Lord", 
        "Clockwork Lord", 
        "The Enemy", 
        "Jaboa Murphy", 
        "impersonated Uatu the Watcher", 
        "Kang"
    ], 
    "citizenship": "Luna (Earth's moon) in the alternate future of Earth-691", 
    "content": "The cosmic gamesman Grandmaster and the robot strategist Prime Mover transported Korvac to the modern era of the Earth-616 reality, where he served as one of the various pawns pitted against each others in a contest of champions. The Prime Mover’s pawns including Korvac, fought the Gamemaster’s pawns, the heroic Defenders, who ultimately triumphed. During the game, the Defenders leader Doctor Strange had bested Korvac, who later claimed he had allowed himself to be defeated so that he might secretly analyze and partially replicate the Grandmaster’s cosmic knowledge and power. Having accomplished this, the newly enhanced Korvac returned to the 31st Century Earth-691 and adopted a desolate planetoid as his base, transforming it into a high-tech wonderland. He then used his time probe (a time-spanning teleportation device) to accumulate resources and servants, such as his alien underlings Brahl, Dumog, Grott, Teju and Tork (also known as the Minions of Menace). Korvac devised a plan to force Earth’s sun to go nova in hopes of tapping its power, Korvac was opposed by his era’s leading heroes, the Guardians of the Galaxy and the legendary thunder god Thor, whom Korvac had accidentally transported from the past. Defeated by Thor and the Guardians, Korvac fled.", 
    "durability": 1, 
    "education": "Unrevealed, presumably extensive; later cybernetically assimilated vast amounts of knowledge", 
    "energy": 1, 
    "eyes": "One blue eye (right), one cybernetic implant (left)\n", 
    "fighting": 1, 
    "firstappearance": "Giant-Size Defenders #3 (1975)\n", 
    "groupaffiliation": "Formerly leader of the Minions of Menace and servant of the Brotherhood of the Badoon", 
    "hair": "Blonde (variable)\n", 
    "height": 0, 
    "id": "Korvac", 
    "identity": [
        "Secret to the general populace of present-day Earth", 
        "publicly known in his future timeline."
    ], 
    "intelligence": 1, 
    "knownrelatives": "Jordan Korvac (father), Myra Korvac (mother), Jaboa Murphy, Varley (first name unrevealed), Marshach, Kareela (ancestors), Carina Korvac (wife), Collector (father-in-law)", 
    "occupation": [
        "Self-proclaimed God", 
        "would-be universal conqueror", 
        "former computer technician"
    ], 
    "origin": [
        "Thor Annual #6 (1977)", 
        "Avengers #175 (1978)", 
        "Guardians of the Galaxy Annual #1 (1991)"
    ], 
    "placeofbirth": "The Blue Area of Earth's moon in 2977 AD in the alternate future of Earth-691", 
    "powers": "In his cyborg form Korvac possessed the ability to tap and synthesize any form of energy. Korvac was also able to infuse himself with Power Cosmic; this feat was made possible by hacking into the computers of Galactus' worldship. His mastery of his powers and abilities could manifested to resuscitate a life force, time travel, an emitting devastating force blast power enough to disintegrate an Elder of the Universe. Korvac is also capable of absorbing power from any source, including the abilities of his foes; he has the potential to wield infinite power. Korvac also possessed abnormal mental powers that included telepathy, astral projection, and telekinesis.", 
    "realname": "Michael Korvac", 
    "significantissues": [
        "Korvac used the Grandmaster as a pawn against the defenders (Giant-Size Defenders #3, 1975)", 
        "He recruited the Minions of Menace, and attempted to cause Earth's sun to go nova, but was defeated by Thor (Thor Annual #1 (1975)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": [
        "Earth-691", 
        "Marvel Universe"
    ]
}