{
    "aliases": [
        "Kraven the Hunter", 
        "World's Greatest Hunter", 
        "the Grim Hunter"
    ], 
    "citizenship": [
        "Russia (deceased)", 
        "international criminal record"
    ], 
    "content": "For a time, he gave up hunting Spider-Man, but his manipulative lover, Calypso Ezili, tricked him into believing Spider-Man set his caged animals free. Goading Kraven into resuming his pursuit, both she and Kraven were arrested. Convinced he would never be worthy of Calypso's love until he humbled Spider-Man, Kraven once again hunted Spider-Man. This time, Calypso muted Spider-Man's spider-sense, while the two battled. When Kraven realized Calypso had drugged Spider-Man with a hallucinogenic dart, he stopped the fight out of honor. The police captured the two again.After numerous battles in which Kraven was bested by the Wall Crawler, he finally defeated Spider-Man by shooting him and burying him for what would be his last hunt. He then donned Spider-Man's black costume and set out to prove that he was a greater Spider-Man than Spidey himself. He hunted down and defeated the creature known as Vermin who previously was only able to be defeated after Spider-Man enlisted the help of Captain America.", 
    "durability": 4, 
    "education": "College educated", 
    "energy": 5, 
    "eyes": "Brown\n", 
    "fighting": 7, 
    "firstappearance": "The Amazing Spider-Man #15 (1964)\n", 
    "groupaffiliation": "(formerly) The Sinister Six", 
    "hair": "Black\n", 
    "height": 72, 
    "id": "Kraven_(Sergei_Kravinoff)", 
    "identity": "No dual identity", 
    "intelligence": 6, 
    "knownrelatives": "Nikolai &  Anna Makarova Kravinoff (parents, deceased), Sasha Aleksandra Nikolaevich (alleged wife), Dmitri Smerdyakov (Chameleon, half-brother), Vladimir Kravinoff (Grim Hunter, son, deceased), Aloysha \"Al\" Kravinoff (Kraven the Hunter, son), Ned Tannengarden (son, deceased), Ana Kravinoff (alleged daughter)", 
    "occupation": [
        "Professional game hunter", 
        "mercenary"
    ], 
    "origin": "Web of Spider-Man #31 (1987)", 
    "placeofbirth": [
        "Volgograd (formerly Stalingrad)", 
        "Russia"
    ], 
    "powers": "By ingesting mystical potions Kraven was able to grant himself superhuman strength (capable of lifting approximately 2 tons under optimal conditions) and speed (able to sprint short distances up to 60 miles per hour). These same potions greatly slowed his aging process. At the time of his death he was over 70 years old and he appeared to be in his prime, though age was beginning to affect him. His agility, reflexes, stamina, and endurance were also enhanced. As he constantly ingested these potions he usually had these abilities, but without the effects of these potions he still possessed physical strength and agility of the level of an Olympic athlete.", 
    "realname": "Sergei Kravinoff", 
    "significantissues": [
        "Joined Sinister Six (Amazing Spider-Man Annual #1, 1964)", 
        "impersonated Spider-Man (Amazing Spider-Man #34,1966)", 
        "in the Savage Land, kidnapped Gwen Stacy (Amazing Spider-Man #103, 1971)", 
        "goaded by girlfriend Calypso into resuming the hunt for Spider-Man (Amazing Spider-Man #209,1980)", 
        "defeated Spider-Man, committed suicide (Amazing Spider-Man #294, 1987)"
    ], 
    "speed": 7, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 235
}