{
    "add": {
        "doc": {
            "aliases": "Valgoth", 
            "citizenship": [
                "Svartalfheim", 
                "Asgard"
            ], 
            "content": "The magma's tremendous heat left Algrim on the brink of death. He would have been killed outright except that his enchanted armor protected him from the magma's full effects, and that his desire for vengeance for Thor gave him the will to live. In fact, the shock of the intense pain the magma caused him rendered Algrim amnesiac; not remembering the real reason why he fell into the lava, he knew only that Thor was somehow to blame. Algrim's hatred of Thor was sensed by the incredibly powerful In New York City, Kurse mistook Beta Ray Bill for Thor and attacked him. Bill escaped death at the far stronger Kruse's hands by reverting to his original, non-super-powered form, in which he no longer resembled Thor. Driven by insane hatred, Kurse wreaked havoc in Manhattan as he searched for Thor.In the process he severely injured Margaret Power, mother of the superhuman children known as Power Pack, who had since recovered. Power Pack sought out Kurse and succeeded in burying him alive by causing the collapse of a building under construction. But Kurse succeeded in freeing himself that very same day, found Thor, and attacked him. Kurse was now stronger than Thor, so Thor donned his belt of strength, which doubled his strength.The observing Beyonder then vastly increased Kurses' strength so that it again greatly surpassed Thor's. Beta Ray Bill and Power Pack then arrived to join the battle. Thor used his hammer to project intensive heat at Kurse. The heat, reminding Kurse of the lava pit, reawakened his memories of how he came to fall into it. AT last Kurse realized that it was not Thor but Malekith who was responsible and his hatred therefore shifted from Thor to Malekith. On Thor's instructions, Energizer, a member of Power Pack, absorbed energy from both Thor's and Beta Ray Bill's enchanted hammers and then fired a tremendously powerful ball of energy at Kurse, which rendered him unconscious. Thor then suggested to the Beyonder that Kurse be transported to Hel, the realm ruled by the Asgardian death goddess Hela, to search for Malekith, who might be there. Thor was hoping that Kurse would cause trouble for Hela while he was there. The Beyonder agreed, and teleported Kurse to Hel.Kurse wreaked havoc in Hel looking for Malekith, who was not there, and Hela had Kurse driven into Asgard itself. There Kurse finally found Malekith, who had used his shape-changing powers to become a double for the Asgardian Balder. Kurse slew Malekith and then, his mission of vengeance finally fulfilled, he became peaceful and submissive.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Yellow\n", 
            "fighting": 1, 
            "firstappearance": "(as Algrim) Thor #347, (as Kurse) Secret Wars II #4\n", 
            "groupaffiliation": "The dark elves of Svartalfheim", 
            "hair": "None\n", 
            "height": 84, 
            "id": "Kurse", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "None", 
            "occupation": [
                "Seeker of vengeance", 
                "(former) Servant of Malekith the Accursed"
            ], 
            "origin": "(as Kurse) Secret Wars II #4", 
            "placeofbirth": "Svartalfheim", 
            "realname": "Kurse (formerly Algrim)", 
            "significantissues": [
                "Thor #347:  as Algrim the Strong, ordered to battle Thor by Malekith, who then attempted to destroy both combatants by plunging them into a pool of magma, Secret Wars II #4, 6:  revealed to have survived plunge into lava, although shock had wiped out his memories except for his obsessive desire to gain revenge on Thor", 
                "encountered Beyonder, who restored him to health and transformed into a being with the physical power to destroy Thor", 
                "Beyonder transported him to Earth to battle Thor", 
                "mistook Beta Ray Bill for Thor", 
                "battled Beta Ray Bill, Power Pack #18:  battled Power Pack, Thor #363:  battled Thor", 
                "strength further enhanced by Beyonder", 
                "regained memory of betrayal by Malekith", 
                "transported back to Asgard by Beyonder, Thor #367-368:  killed Malekith, who at that time was masquerading as Balder the Brave", 
                "having gained vengeance, Kurse became docile and childlike."
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 840
        }
    }
}