{
    "add": {
        "doc": {
            "aliases": "Leader", 
            "citizenship": "U.S. Citizen", 
            "content": "Weeks later, Sam underwent a physical transformation as well, when his skin turned green and his skull expanded upwards. Calling himself the Leader, he organized a spy ring to steal scientific secrets, only to find the Hulk an impediment to his plans. Desiring to study his foe, he sent first the Chameleon and then synthetic Humanoids to capture the green behemoth, starting what would become a long-standing feud between them. Time and again, the Leader would use others to battle his foe, employing the Rhino, the Glob, Jackdaw and Arsenal, and even working with General Thunderbolt Ross on one occasion. One time he forced the Hulk to raid the Watcher’s home in the Blue Area of the Moon for the advanced technology within. The Hulk successfully retrieved the Ultimate Machine (a.k.a. the Globe of Ultimate Knowledge), but when the Leader accessed the millions of years’ worth of information within the Machine, even his advanced mind was overwhelmed and he collapsed to the ground, seemingly dead. Another plan saw him impersonate Glenn Talbot and take over Gamma Base using robot doubles, planning to similarly replace the President and Vice-President when they inspected the facility the following day.A lab accident later left the Leader paralyzed for a prolonged period. During this time he initially used a mind-controlled Rhino to do his bidding. Later he entered into a wager with Kurrgo, the “Master of Planet X,” where they pitted the Thing and the Hulk in battle against one another, with the winner gaining the right to use both “champions” in their future machinations. Instead the champions destroyed Kurrgo’s ship. The Leader finally regained the use of his limbs by deliberately reverting back to the form of Sterns, whose amnesiac form then followed subconscious orders to infiltrate Gamma Base where he exposed himself to radiation to transform back into the Leader. This usurping of the Base, like the previous time, was brought to an end by the combined forces of the Hulk and Doc Samson.Many of the Leader’s schemes have involved plots to transform others into gamma-mutates under his control. One time, on the pretext of seeking a cure for the Hulk, he duped Dr. Rikki Keegan, a school friend of Banner’s, into obtaining blood samples from his foe. He used these to contaminate Manhattan’s water supply, causing a “Green Flu” which would mutate those it didn’t kill. However, Keegan mutated into a Leader-like being more powerful than her creator, and in order to prevent her from telekinetically wrecking all his equipment, the Leader was forced to administer the antidote, which was then used to cure the rest of the victims. Subsequently he traveled back in time to Earth’s primeval past to alter mankind’s evolution so that all humanity would become gamma people. This latter plan brought him into conflict with the Avengers as well as his old adversary, and he apparently plunged to his death into a prehistoric volcano. However thanks to a hidden teleportation device, he managed to survive.Eventually the Leader’s mutation destabilized, and he reverted to his human form. Seeking to regain his heightened intellect, he drained gamma radiation from Rick Jones who at that point was suffering from Hulk-like transformations. Stern became the Leader again, albeit with a new appearance and a psychic link to Jones. Using new operatives Half-Life, Rock, and Redeemer, the Leader lured the gray Hulk to Middletown, Arizona, where he detonated a gamma bomb while the Hulk was holding it above his head. Believing his enemy dead, the Leader gathered together the handful of Middletown survivors and formed them into the Riot Squad. Sometime later, after discovering the Hulk had survived, the Leader assisted him in battling Sterns’ brother, now the superhuman known as Madman.The Leader created a town called Freehold, an isolated community hidden beneath the Columbia ice-fields of Alberta, Canada, and filled it with people who were dying of radiation poisoning. The Leader claimed that Freehold would form the basis of a new society after pollution and war wiped out the rest of humanity, but in actuality he used some of the radiation victims for experiments, as when he created the cyborgs known as the Headshop. When Hydra threatened his city, the Leader sought the Pantheon’s aid and struck a deal with Agamemnon, leader of that organization. Agamemnon sent the Pantheon’s newest recruit, the Hulk, to “help”.But Hydra’s attack coincided with another event; the Leader, linked emphatically to Rick Jones since regaining his powers, was being affected by the grief Jones felt over the recent death of Marlo Chandler, his girlfriend. The Leader approached Rick and offered to restore her to life, using the power of Soul Man, one of his followers. While the Leader was honest in his intent to restore Marlo, he also planned to use the chance to analyze Soul Man’s powers so that he could become immortal and invincible. However, he apparently underwent an epiphany while witnessing Marlo’s resurrection, just seconds before the Hulk, who had dealt with the Hydra forces attacking Freehold, came looking to settle old scores. Apparently fatally wounded when the Hulk used him as a shield to stop Redeemer’s bullets, the Leader appeared to die minutes later in a massive explosion.The Leader survived the explosion in non-corporeal form. He apparently controlled Omnibus, one of the Freehold gamma mutates, and created a terrorist organization, “The Alliance,” with which he sought to destabilize the world and plunge it into war, only to have the Hulk thwart him once again. The people of Freehold, refusing to believe Omnibus’ claims that the Leader made him do it, exiled him to die in the snowy wastes. Still later, when Banner was dying of ALS, the Hulk received a mental summons that drew him out into the desert. There he found the Leader who had re-formed his body using cells from dead animals and local flora. Sterns informed his old enemy that he had gained enlightenment and was about to transcend this mortal plane. After giving the Hulk the cure for Banner’s illness, he asked his former nemesis to witness his ascension. However, something appeared to go wrong at the critical juncture and the Leader’s new body exploded. A subsequent vision of Banner’s in which the Leader begged for his help suggests that he may have encountered something quite unpleasant wherever his mind ended up.What appeared to be a tragedy was only a temporary setback as the Leader returned in a new body and made himself a home in Gammaworld where he encountered Hulk's former allies, the Warbound. Wanting the Oldpower of Hiroim, Leader used the townspeople to create a new monster called Horde to battle them. Ultimately, Hiroim sacrificed himself to stop the Leader, and the Oldpower was kept out of his grasp.", 
            "durability": 2, 
            "education": "Unfinished high school education", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 2, 
            "firstappearance": "Tales to Astonish #62\n", 
            "groupaffiliation": "Intelligencia", 
            "height": 70, 
            "id": "Leader_(Samuel_Sterns)", 
            "identity": "Public", 
            "intelligence": 6, 
            "knownrelatives": "Madman (brother)", 
            "occupation": [
                "Would-be world conqueror", 
                "former laborer"
            ], 
            "origin": "Mutated by gamma radiation", 
            "placeofbirth": [
                "Boise", 
                "Idaho"
            ], 
            "powers": "Superhuman intelligence, telepathy, psychokinesis", 
            "realname": "Samuel Sterns", 
            "speed": 2, 
            "strength": 2, 
            "universe": "Marvel Universe"
        }
    }
}