{
    "add": {
        "doc": {
            "aliases": [
                "Balance", 
                "Hooded One", 
                "Master of the Balance", 
                "Lloyd Willoughby"
            ], 
            "citizenship": "Germany", 
            "content": "He then returned to America where he was approached by Cornelius Van Lunt who offered him a position in his crime organization known as Zodiac. Gustav accepted and took his position as Libra in Honolulu, Hawaii. Months later Libra attended a meeting with other Zodiac leaders when Nick Fury posed as Scorpio and \"captured\" the Avengers. Soon the Avengers managed to break free and a quarrel started between the two teams. Libra and the other Zodiac leaders managed to escape.Months later under the leadership of Aries Libra and the other members of Zodiac attacked the Avengers and tried to take over Manhattan. However due to the combined forces of Daredevil, the Black Panther, and the Avengers the team was transported to the Ankh Dimension in order to restore power to the Zodiac Key.Using Spymaster as one of their operatives they hypnotized Nick Fury into sending heroes into the Ankh Dimension to help re-power the Zodiac Key. Several Zodiac members also went into the Ankh Dimension in the hopes of destroying the Avengers and other heroes. During the battle that followed the Zodiac members lost and were jailed. However Libra was not one of these members and continued to operate with the Zodiac Cartel.Months later Cornelius came up with a plot to murder all the Geminis in New York City using a device called the Star-Blazer. However the Avengers kidnapped a member of the team. Soon afterward the members of Zodiac broke into the Avengers Mansion and freed their imprisoned member. During this break in Gustav met Mantis. Having recognized Mantis as his daughter he told her of their plan to kill all the Geminis in New York. Days after the break in at the mansion the Cartel made their threat public. Aware now to the Cartels' whereabouts thanks to Mantis, the Avengers attacked the Zodiac Cartel and were captured. While in captivity Libra freed the Avengers who in return defeated the Zodiac Cartel. Libra then told Mantis that she was indeed her daughter. Mantis was in disbelief and enraged that he suggested the idea. In order to prove that she was his daughter, Libra led the Avengers and Libra to the Priests of Pama and they came into conflict with Khruul confirming that Mantis was his daughter. Together they faced and stopped the Star-Slayer, who killed Khruul. Libra and the Avengers then returned to America where Libra willingly went to prison.While in prison Libra began studying the Balance and mysteriously disappeared from his cell. He then returned to Vietnam where he met the leader of the Cotati and witnessed the actions of Mantis and the Avengers. He then stood at Mantis side when she was married by Immortus to the reanimated body of the Jacques DuQuesne, now possessed by the alien Elder Cotati. Gustav then returned to America and once again willingly went to prison where he continued to study and do research on the Balance.After some time Libra escaped and resumed his criminal activities and was once again contacted by a member of the Zodiac Cartel. He then met other Zodiac members in a meeting in Texas where Scorpio revealed himself to be an LMD and had all the members killed. However due to his study of the Balance he was able to fool the LMDs into thinking he was dead.Years passed and Libra began a correspondence with the Supreme Intelligence in a S.H.I.E.L.D. installation on the Blue Area of the Moon. They discussed the upcoming confrontation with Immortus and how Rick Jones would play a part in it. Soon the time came and the two helped the Avengers, Kang, and Rick Jones fight Immortus and the Time-Keepers. After the ordeal was settled Libra vanished back into a place called the Between to continue his research.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Formerly Blue\n", 
            "fighting": 1, 
            "firstappearance": "Avengers #72\n", 
            "groupaffiliation": [
                "Former member of the Zodiac Cartel", 
                "friend of Supreme Intelligence"
            ], 
            "hair": "Blond\n", 
            "height": 72, 
            "id": "Libra_(Gustav_Brandt)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Mantis (daughter), Elder Cotati (Swordsman) (son-in-law), Lua Nguyen Brandt (wife, deceased), Khruul (brother-in-law, deceased)", 
            "occupation": [
                "Student of the Balance", 
                "formerly a crime syndicate leader", 
                "mercenary", 
                "soldier"
            ], 
            "origin": "Avengers #123", 
            "placeofbirth": "Unrevealed", 
            "powers": "Gustav possesses some unidentified psychic abilities and the ability to instantly disappear and reappear whenever and wherever he chooses.", 
            "realname": "Gustav Brandt", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 195
        }
    }
}