{
    "aliases": "None", 
    "citizenship": "Attilan", 
    "content": "When the rest of the Inhumans, led by Black Bolt, fought the Fantastic Four, Lockjaw appeared as his leader’s command and trapped the Thing with a steel girder. Even though the Thing bent the girder, he was unable to pry it from Lockjaw’s mouth until the Human Torch flew by and melted it. But Crystal appeared shortly afterwards and announced Triton’s capture by the Seeker, and so Lockjaw teleported the Inhumans back to Attilan while Johnny Storm and Crystal tried to stay together but were torn apart.Lockjaw was in Attilan when Black Bolt took his crown back from his brother, Maximus, and reclaimed his leadership of the Inhumans. Later, Maximus tried to kill all of humanity with his atmo-gun, which failed because both Inhumans and humans were of the same race. And Lockjaw was seemingly trapped within Attilan, along with the rest of the Inhumans, when Maximus reversed his machine’s energies in a rage, creating a Negative Zone around the city. But his powers of teleportation allowed him to roam free, and he left the city, wandering the countryside and inadvertently terrorizing the populace; eventually running into the Human Torch and Wyatt Wingfoot. The pair tried to train him while he took them on a teleporting trip around the planet, and presumably off it, before sensing danger and returning them to New York in time to join the fight against Doctor Doom; who had stolen the power cosmic from the Silver Surfer.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #45\n", 
    "groupaffiliation": "None", 
    "hair": "Brown (fur)\n", 
    "id": "Lockjaw", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Helper of the Inhuman Royal Family", 
    "placeofbirth": "Unrevealed", 
    "powers": "Lockjaw is able to teleport himself and a group of people up to a extensive distance, even from the Earth to the Moon. He also has an increased sense of smell and a strength in his jaw which may be due to his immense size.", 
    "realname": "Unrevealed", 
    "significantissues": "Fantastic Four #45 (intro)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}