{
    "aliases": [
        "Luna", 
        "Querida"
    ], 
    "citizenship": "Citizen of the United States", 
    "content": "When Xi’an’s criminal personality took over his body, and he and Skullfire left the X-Men to find out more about the being known as the Driver, Luna again came face to face with her liberator.  This time, Luna was on the run and asked for Skullfire’s help against the Theatre of Pain, and its leader, Brimstone Love, which were tracking her down.  After a struggle that ended in the two kissing, Skullfire agreed to help her, and even had his face permanently painted white to match hers.  But later, once Xi’an had rendezvoused with his old partner, Broken Haiku, Skullfire discovered that Luna was deceiving him, and had also enlisted the help of the X-Men’s betrayer, Junkpile.  Only after Luna explained that Junkpile owed her for saving him from a trip to an Alchemax Bioshop did Skullfire relent and allow him to come along.  Then, along with Xi’an, the four found the Driver’s headquarters where he transported mutants and uploaded them into a database until it was safe to revive them all.  Though Xi’an’s ex-partner had warned the Driver of their approach, and he captured them, preparing them for upload into the database.  But Brimstone Love attacked and stopped the Driver, and saved them, intending to take Luna back.  Though after seeing the potential in Xi’an, Brimstone offered him a place at the Theatre.  Much to the surprise of the X-Men present, Xi’an agreed and left to become the Theatre’s head controller, Controller X.Luna returned with Skullfire to the X-Men to tell them about Xi’an’s betrayal, and with Skullfire’s new bold personality, he was made the leader.  He also offered Luna a spot on the team, though both her and the other X-Men were uneasy about a former member of the Theatre of Pain being part of the team.  But in time, her dedication to the X-Men, and her devotion to Skullfire, earned her a place among the X-Men.  She even got a chance to get back at the Theatre as a group of the X-Men who broke into the Floodgate, the gathering center for the Theatre’s victims, where Luna eventually faced her old sisters, the Norns.  Though she lost a fight with the leader, Felicity, and was chained up and finally given another obedience collar, until Skullfire once again used his powers to tear it off of her.  Then, when Xi’an used the Mindfire Machine to weaken Brimstone and send him running, Luna used her powers on him to dredge back up his repressed memories, which shocked him out of his violent state.She returned with the rest of the X-Men after President Doom finished mopping up the Theatre, and joined them in Halo City, which Doom created as a refuge for all of the Theatre's victims.  Luna became part of the city’s Protectorate, its security force.  As a member of the Protectorate, Luna fought the Graverobber, who killed revived her lover, Skullfire, pushing him further towards his mutant power’s evolution.  Luna was also part of the group that invaded the Quetzalcoatl Corporation to free the mutant Book.  Finally, she was pivotal in stopping the Foolkiller, the last member of a religious group bent on ridding the world of “fools,” who was on a revenge mission against Xi’an’s old group, the Lawless.  It was only when she used her powers to bring up the Foolkiller’s painful childhood memories that his rampage was stopped and his only remaining choice was to commit suicide by detonating a bomb he had embedded into his chest.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "X-Men (2099) #4\n", 
    "groupaffiliation": [
        "X-Men", 
        "X-Peditioners", 
        "former member of the Norns/Theatre of Pain and Halo City Protectorate"
    ], 
    "hair": "White\n", 
    "id": "Lunatica,_La_(2099)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Brimstone Love (unknown relation)", 
    "occupation": "None", 
    "placeofbirth": "Unrevealed", 
    "powers": "Lunatica has the ability to trigger traumatic, and often repressed, memories in her victims, and then feed off of them to increase her strength, invulnerability, speed, and reflexes.  Her physical abilities can be increased to incredible levels.", 
    "realname": "Unrevealed", 
    "significantissues": "X-Men (2099) #4 (intro, gains freedom)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}