{
    "add": {
        "doc": {
            "aliases": [
                "Savage She-Hulk", 
                "She-Hulk from Earth-8009", 
                "Agent SH-8009", 
                "Greenwitch"
            ], 
            "citizenship": "citizen of The United Sisterhood Republic", 
            "content": "When Lyra came of age and took control of the armies of The United Sisterhood Republic, she was respected, loved and considered the greatest warrior among her people, but because she was the only woman on Earth with a father, she was not well liked. Having a father made her different - tainted by a man's genes. Even when leading an assault against a suspected munitions depot of the male armies, her troops followed but didn't completely trust her. It turned out the depot was actually a breeding facility, and Lyra discovered the men reproduce in the same fashion as the women. Only a small boy stood in her way of dealing a severe blow to her enemies, but even though the boy did not pose a threat, Lyra couldn't bring herself to kill the children inside and lied to her forces about her discovery. She blamed her father for her compassion and restraint before regrouping with her allies on the battlefield.Arming her with that knowledge, the Gynosure sent Lyra back in time to find Earth’s greatest male hero – a task easier said than done. Once she arrived at her destination, Lyra was attacked by A.R.M.O.R. soldiers followed by She-Hulk. The jade giantesses brawled throughout the city, and when She-Hulk made reference to Lyra's mother, it only fueled her anger that much more. Lyra felt Thundra abandoned her to the fear and hatred of the Sisterhood, and her rage only made Lyra weaker, making her vulnerable to She-Hulk's next attack. Lyra was saved from humiliation, however, when the Sentry arrived and removed She-Hulk from the equation. He'd heard Lyra was looking for the Earth's greatest hero and wanted to know what she wanted with him. Lyra told Sentry he was mistaken. She was looking for none other than Norman Osborn. This led to an encounter with the Avengers. Initially abandoning her quest to save her people, Lyra discovered her companion from the future would complete the task single-handedly. Once in A.R.M.O.R. custody, Boudicca revealed to Lyra their mission was a success when she reprogrammed a robot at one of Osborn's facilities to place the part needed to repair the Cradle somewhere the Sisterhood would find it in the future. Lyra then told Charles Little Sky, head of the organization, Boudicca stole all of Osborn's secrets from Avengers' database. In return for the intel, Lyra was allowed to stay in the past and become an agent of A.R.M.O.R.!When She-Hulk went missing, Lyra set out to find her with the help of another A.R.M.O.R. agent. A spy within the organization told an old foe of the Hulk's where to find her, and soon General John Ryker, now taking his orders from Norman Osborn, made his move. Ryker sent his new team – Gamma Corps: Black – to intercept and capture Lyra and retrieve Boudicca for Osborn. The operative called Axon murdered Lyra's partner, and the creature called Morass was the first to feel Lyra's vengeance. With only Aberration to actually challenge Lyra on a purely physical level, the fight could go either way, but Lyra was determined to carry out her threat to kill the women of Gamma Corps: Black. Axon and Aberration found some leverage in the form of hostages of a nearby town to hopefully keep Lyra in check, but her reaction wasn't as they planned. Unfazed by the innocent lives at stake, Lyra quickly terminated Aberration, leaving only Axon to deal with. However, Lyra had a change of heart, remembering her mission to find the She-Hulk. Knowing Jennifer Walters would never willingly allow others to come to harm, Lyra surrendered to Axon until such a time where she could outwit her, and take her down. General Ryker wasn't as forgiving and killed Axon for failing her mission. Lyra continued on her way to the last known sighting of the She-Hulk and found the destroyed A.I.M. base.Lyra had agreed to help the Intelligencia, and was offered a place in the newly reformed Frightful Four. She accompanied them on a mission to the Baxter Building to kidnap Mister Fantastic. Lyra went one-on-one with the Human Torch and defeated him by snuffing out his flame. Playing her part well, Lyra gained the trust of her companions which revealed the true reason she allied herself with them. Never abandoning her mission to find the She-Hulk, Lyra explored the Hellcarrier until she found and freed her. Soon after in a staged battle on the same vessel, with her half-brother Skaar, Lyra revealed she was on the side of the angels all along. When the Intelligencia set their plan in motion, unleashing an army of Hulks on the nation's capital, Lyra and She-Hulk stood against them along with a previous enemy in the form of the Red She-Hulk. The combined efforts of the She-Hulks, Hulks and numerous allies ensured the Intelligencia's defeat although not all were captured.", 
            "durability": 1, 
            "education": "Tutored by the Gynosure", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 1, 
            "firstappearance": "Hulk: Raging Thunder (2008)\n", 
            "groupaffiliation": [
                "A.R.M.O.R.", 
                "formerly Frightful Four", 
                "The United Sisterhood Republic"
            ], 
            "hair": "Red\n", 
            "height": 78, 
            "id": "Lyra", 
            "identity": "Known to authorities", 
            "intelligence": 1, 
            "knownrelatives": "Thundra (mother), Hulk (Bruce Banner) (father), Skaar, Hiro-Kala (half-brothers), Brian Banner, Rebecca Banner (paternal grandparents, deceased), Jennifer Walters (first cousin, once removed), extended family via father", 
            "occupation": [
                "Warrior", 
                "A.R.M.O.R. agent", 
                "Intelligencia agent"
            ], 
            "origin": "Hulk: Raging Thunder (2008)", 
            "placeofbirth": [
                "presumably Milago", 
                "Earth-8009"
            ], 
            "powers": "Lyra is a product of two of the mightiest mortals of their time, therefore she has inherited numerous superhuman attributes from both. She has the speed and agility of her mother coupled with the strength and durability of her father. Lyra can also use her superhumanly strong leg muscles to leap great distances - over 600' high and 1000' across. It is entirely possible that Lyra also has the Hulk's resistance to extreme temperatures, poisons, and diseases but that, too, has yet to be revealed. In her time, Lyra had been covered in pheromones that repel the Venom symbiote, and they are just as effective against the villain of Earth-616. Lyra can transform back and forth at will because of a serum Banner developed based on S.P.I.N. (Super-Power Inhibiting Nanites) technology. \n\n\nLyra does have one failing not typical of her parents – the madder she gets the weaker she gets. Also, an overdose of gamma rays will trigger her weakness no matter what her emotional state may be. On the flip side, Lyra has another attribute neither of her parents possesses. It's something called the Autotrance – or \"Gamma Sight\". This is when Lyra recites the Lambda-CDM Concordance Model of the Big Bang as a mantra to center herself and trigger a trance-like state where Lyra can become one with the  gamma radiation which flows everywhere in the physical world. While in the Autotrance, Lyra doesn't know where she ends and the gamma rays begin, her movements become more fluid, and as a result, she becomes almost impossible to defeat.", 
            "realname": "Lyra", 
            "significantissues": [
                "Origin of how Lyra came to be (Hulk: Raging Thunder, 2008)", 
                "Lyra leads a raiding party on an enemy outpost (Hulk Family: Green Genes, 2009)", 
                "Lyra travels to the past in search of a something to save her future (Savage She-Hulk #1, 2009)", 
                "Lyra fights She-Hulk as she searches for Norman Osborn (Savage She-Hulk #2, 2009)", 
                "Lyra fights Noh-Varr and is captured until she reveals why she wants Osborn (Savage She-Hulk #3, 2009)", 
                "Abandoning her mission, Lyra takes on the Avengers and becomes an agent of A.R.M.O.R. (Savage She-Hulk #4, 2009)", 
                "Defeated Phinn Mac Mram and the Cyber-Sidhe (Incredible Hulk #600, 2009)", 
                "Ambushed by Gamma Corps: Black and fought to avenge a fallen comrade (Incredible Hulk #601-605, 2009)", 
                "At odds with the Red She-Hulk (Fall of the Hulks: Gamma, 2010)", 
                "Joined the Frightful Four and kidnapped Reed Richards (Hulk #19, 2010)", 
                "Fought Thundra and found She-Hulk on the Hellcarrier (Fall of the Hulks: The Savage She-Hulks #1 ,2010)", 
                "Revealed to be an ally of Bruce Banner (Incredible Hulk #608, 2010)", 
                "Freed She-Hulk and fought against Hulk army (Fall of the Hulks: The Savage She-Hulks #3, 2010)", 
                "Enrolled in high school, tracked down members of the Intelligencia, humiliated by Wizard (She-Hulks #1-4, 2011)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 220
        }
    }
}