{
    "aliases": [
        "The Crooked Man", 
        "Lord Jim"
    ], 
    "citizenship": "U.K.", 
    "content": "Merlyn had been aware of this threat. Worse, he knew Earth-616’s Jaspers, who was beginning his rise to power, was equally insane and vastly more powerful; even destroying his reality could not end that Jaspers’ threat. During the hero purge on Earth-238, Merlyn allowed his champion on that world, Captain U.K., to escape to Earth-616; he also arranged for Earth-616’s Captain Britain (Brian Braddock) to visit Earth-238 and encounter 238’s Jaspers. Though this forewarned both heroes of Earth-616’s Jaspers, Merlyn’s true purpose was to lure the Fury to Earth-616 pursuing them. The Earth-616 Jaspers became Prime Minister, ordering STRIKE (Special Tactical Reserve for International Key Emergencies) to round up the U.K.’s superhumans. As Jaspers enveloped the world in a reality storm, Captain Britain confronted him, but proved helpless against him; however, the Fury, which had been pursuing the hero, arrived soon after. Reasoning that this Jaspers was not the creator it had been programmed to leave unmolested, the Fury attacked. After a prolonged battle, the Fury transported them to the void where its world once was. Lacking any external reality to manipulate, Jaspers was rendered helpless, and the Fury killed him, frying his brain.Recently, during the Scarlet Witch’s “House of M” reality warp, Jaspers reformed alive, well, and apparently merged with the Fury. It is unclear whether this is Earth-238’s Jaspers or 616’s, or if his revival stems from the Witch’s warp or another cause. Whatever the truth, while Jaspers lives, the entire multiverse is in danger.", 
    "durability": 7, 
    "education": "Unrevealed, presumably extensive", 
    "energy": 7, 
    "eyes": "Blue (variable)\n", 
    "fighting": 2, 
    "firstappearance": "The Daredevils#9 (1983)\n", 
    "groupaffiliation": [
        "Conservative Party", 
        "Crazy Gang", 
        "possibly Hellfire Club (London Branch)"
    ], 
    "hair": "Black, white temples\n", 
    "height": 0, 
    "id": "Mad_Jim_Jaspers", 
    "identity": "Secret", 
    "intelligence": 6, 
    "knownrelatives": "None", 
    "occupation": [
        "Former Politician", 
        "U.K. Prime Minister"
    ], 
    "placeofbirth": [
        "Finchley", 
        "England"
    ], 
    "realname": "Sir James Jaspers", 
    "speed": 7, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 155
}