{
    "aliases": "None known", 
    "citizenship": "USA", 
    "content": "Distraught by the death of his family and friends, he threw himself in the path of an oncoming car after fleeing the hospital. To his surprise his wounds from being hit by the car healed within seconds and he had felt no pain at all. He quickly concluded his bus accident was the cause of his new found powers which drove him further into madness. He could not understand why he should benefit from an accident that killed forty people including his friends and family. He finally rationalized that things happen without cause and effect and there is no purpose in anything.He soon discovered he could cause whoever looked him in the eye to act crazily. Bored and delusional he bought a toy soap bubble-making gun from a dime store and stole a harlequin outfit from a costume shop. Inventing the persona Madcap, he decided to wander New York City and randomly cause people to go crazy in order to demonstrate to them the meaninglessness of existence.", 
    "durability": 1, 
    "education": "Unknown", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Captain America #307 (1985)\n", 
    "groupaffiliation": "None", 
    "hair": "Brown\n", 
    "height": 0, 
    "id": "Madcap", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Katy (Madcaps sister) sister-deceased", 
    "occupation": "Prankster", 
    "placeofbirth": "Unknown", 
    "powers": "He has the ability to rapidly heal and regenerate wounds.  The extents of his healing powers are unknown.  He has been seen to recover almost instantaneously from gunshots, lacerations and punctures.  Madcap is unable to heal his nervous system which explains his inability to experience pain.  \nMadcap possesses a psionic ability to stimulate others inhibition centers of the brain.  He cannot control the type of behavior his subjects will exhibit; that is dictated by the subjects' own psyches.  Direct eye contact must be made in order for him to use this ability.", 
    "realname": "Unknown", 
    "significantissues": "Captain America #307 (1985), Daredevil #234 (1986)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 145
}