{
    "add": {
        "doc": {
            "aliases": [
                "Madman has the ability to shift into anyone he chooses", 
                "so it is possible he has had numerous identities over the years"
            ], 
            "citizenship": "U.S.A.", 
            "content": "Madman to Phillip was much like Hulk is to Bruce. A separate personality that wanted control, only Madman was much smarter and more aggressive than his alter-ego. It was very easy for Madman to manipulate Sterns into doing his bidding for him. Such was the case when Bruce came to work at a nuclear research facility disguised as a janitor. Phillip immediately recognized Bruce, and Madman devised a plan to kill him. A poison was to be injected into Banner, and that would be his end. Unfortunately for Sterns, after he injected the poison, the Abomination attacked the building and forced Banner to transform into the Hulk. It was the Hulk's healing factor that ultimately gave him time to slow the effects of the poison. The two behemoths fought leaving Hulk as the victor after dropping the Abomination into several vats of toxic waste. Banner, in his gray incarnation, retained his intelligence and knew he was dying, so he sought the help of Reed Richards to determine what was killing him. Reed was at a conference with the rest of the Fantastic Four when Bruce found him. The Hulk, being the Hulk, entered in a threatening manner which caused a brawl between he and Ms. Marvel in her mutated personification of a She-Thing. Hulk suffered a heart attack and collapsed during the fight, and eventually Reed examined him only to find the poison was unlike any he had seen before. The toxin constantly mutated in order to keep his immune system from fighting it off. In other words, Madman was going to succeed in killing the Hulk.The Hulk returned to the facility where he last saw the Abomination, thinking he knew who was behind the evil plot, but before the Abomination could answer, Hulk was transported to another place by his archenemy, the Leader. Hulk was not too happy to see his foe, but his attacks were thwarted by the Leader's Riot Squad, a group of gamma powered individuals that served as his guardians. Tremendously weakened, Hulk had no choice but to listen to reason and soon found out who the mad man behind his current situation was. The Leader told Banner of the sad story of his brother, Phillip Sterns, but he made Bruce believe that Phillip and Madman were two separate entities instead of one being. The Leader also revealed that he was responsible for sending the Abomination to attack the research building, so he would force Banner's change into the Hulk, ultimately saving his life. All of this was done so the Leader could ask the Hulk to kill Madman because he feared Madman would come for him too. Leader transported Banner to Madman's location, and the final battle had begun. Hulk found out about Stern's grudge against Banner, and that he and Madman were actually the same person. Madman brutally assaulted his enemy, but the Hulk wasn't about to lie down and die just yet. Sterns gained control of his other personality and told Hulk where he could find the ring that poisoned him, but Madman reasserted himself when Phillip was about to expose the antidote's hiding place. The struggle between the two separate personalities was fierce, but the Madman persona won out, and the man who was Phillip Sterns ceased to exist. While Madman was distracted, Hulk injected Sterns with the poison before he could revert back to his superhuman form, and now the two of them were in the same boat. Hulk feigned unconsciousness while Madman retrieved the cure, and then Bruce stole it for himself. As Hulk transformed back to Banner, he administered the remedy and was healed. As for Madman, he was now dying and pleaded for Bruce to save him. Bruce left the antidote several feet away from him and walked away, leaving Madman's fate in his own hands.", 
            "durability": 1, 
            "education": "Although not nearly as smart as Bruce Banner, Phillip attended the same graduate school but completed his courses near the bottom of his class, still earning him a Ph.D. in nuclear physics", 
            "energy": 1, 
            "eyes": "Blue (as Sterns); Brown (as Madman)\n", 
            "fighting": 1, 
            "firstappearance": "(Sterns) Incredible Hulk #362 (1989); (Madman) Incredible Hulk #364 (1989)\n", 
            "groupaffiliation": "None", 
            "hair": "Blond (as Sterns); None (as Madman)\n", 
            "height": 60, 
            "id": "Madman_(Phillip_Sterns)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Leader (brother)", 
            "occupation": [
                "Megalomaniac", 
                "former research center employee"
            ], 
            "origin": "Incredible Hulk #367 (1990)", 
            "placeofbirth": "Unrevealed", 
            "powers": "Madman possesses durability and stamina on the same level of the Hulk. He also has superhuman strength, but Madman can change his size at will growing larger than the Hulk, and at his maximum size, he is nearly twice as strong as the Green Goliath. However, Madman can only last that way for a few seconds. Finally, Madman is a shape shifter allowing him to alter his form into anyone he chooses.", 
            "realname": "Dr. Phillip Sterns", 
            "significantissues": [
                "Madman poisoned the Hulk in an attempt to kill him, but his alter-ego, Phil Sterns, helped Hulk to cure himself (Incredible Hulk #364-367, 1898-1990)", 
                "Madman returned to assist Piecemeal in doing what he could not accomplish alone, but when Piecemeal was defeated, Madman escaped to England only to have the Hulk pursue and stop him again (Incredible Hulk #407-409, 1993)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 182
        }
    }
}