{
    "add": {
        "doc": {
            "aliases": "God of Strength", 
            "citizenship": "Asgardian", 
            "content": "From this Magni was able to grow as any child would, and as he grew older he started exhibiting more and more of the traits his father had such as; his love of the people of Midgard, to which he would make regular trips, helping those who were in trouble He also had his sense honor, which often caused him and his father to disagree because he felt that their place was in Asgard and not on Earth, he also disagreed mightily with Loki’s treatment of humans who he thought were a threat. In spite of this all he still followed his father with great loyalty, thus exhibiting another of his father traits.That all changed when he met Jordahl, a young mortal who was rescued by Thialfi from Asgardian guards. After helping her escape from the clutches of Loki, the two spent the day together on mainland Earth, where Magni soon learned that not all humans were happy with his fathers rule, and in fact most humans feared the gods. Later as he joins Thialfi on a trip to a village to stop a rebellion he is shocked to find several Asgardian militants, and the Warriors Three savagely attacking the people. When asked why they aren’t giving the people the option of surrender, Hogun is attacked by an armed man, and in a fit of anger, he bashes the man to death with his mace then claims they are not fit for surrender. Infuriated Magni steps in and calls the men down asking Thialfi to confiscate all weapons, when a man draped in explosives sets himself to explode. Magni in an act of salvation wraps up the man in his arms absorbing the explosion. As the smoke clears Magni finally realizes that the humans really do hate them. He and the others are back at the palace where Thor has found out about his actions, and chastises him, when Magni seeks to speak out against what the others had done. Thialfi stops him, and speaks with Thor over several actions taken. Soon after Magni leaves and having found out Loki’s treachery and his abduction of Jordahl with the intent of clearing her mind of anything that isn’t in reverence to Asgard, Magni rushes to save her. After a brief skirmish with several guards who try in vain to stop Magni, he rescues Jordahl and rushes off to meet a shadowed figured in the mountain, which later turns out to be Sif.During his time on the mountain top Magni has a long talk with Sif, who tells him a great deal of which includes the person his father used to be, and the reasons he is the man he is. She tells Magni that he is the one person who can make Thor reconcile his position, and urges him to talk with his father, to which Magni replies he will, after he talks with Thialfi, whose council he holds in high regard.When Magni comes back to New Asgard, he is alarmed to find that someone has made an attempt on his father’s life while he took to the Odinsleep to replenish his powers, what more he is subject to an inquisition by Loki once it is revealed the traitor is Thialfi, Magni was dismayed by this news and begged to speak with his father, who lay resting.Amora insists that he cannot, and tries to usher him along to watch the execution of the assailants who were in league with Thialfi, several human and a mutant, who turns out to be the daughter of Scarlett Witch. Angered, Magni tells them of his disapproval of this, and the fact that Asgardian law does not condone the murder of prisoners, but it is to no avail as Loki and the others stand witness to the hanging.On the gallows the mutant girl Kya and Magni make eye contact, and as he intends on saving her she mystically tells him not to. Upon her death she takes Magni on a journey that leads them into the streets of where New York used to lay, every step of the way explaining to him that his destiny awaits, and before him is Mjolnir. As Magni sees that she is not lying he realizes now that he must be the one to overthrow his fathers regime, and lifts Mjolnir high above his head knowing that he is worthy, and that his father is not.That didn’t come without a price as the reawakening the power within Mjolnir also woke another, Desak. Magni journeyed back to the palace knowing that his cause was right, and if his father was right, then he would be able to lift the hammer once more. When he asked his father too do so, Thor stalled, telling his son he was the Lord of Asgard, and holder of the Odinforce, and that his cause was right. There confrontation was cut short by the arrival of Desak who killed many of the Asgardians say for Thor, Loki, Sif, Amora, and Magni. Angered at the mans arrival, and accusations against his father, Magni attacked him, only to get promptly put in his place, and after a long battle that involved Thor in a great moment of desperation as he saw his sons life nearly taken from him he realized the failings of his actions, and lifted Mjolnir and slew Desak who now resided in the Destroyer armor, and was power with the essence of the Designate Tarene.", 
            "durability": 1, 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Thor #50 (as a premonition)\n", 
            "hair": "Red\n", 
            "height": 80, 
            "id": "Magni_(Earth-3515)", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Thor (father), Enchantress (mother), Loki (uncle)", 
            "occupation": "Prince of Asgard", 
            "origin": "Thor #68", 
            "placeofbirth": "Asgard", 
            "powers": "Magni has incalculable physical strength, plus superior stamina, agility, and reflexes like other Asgardians. Magni’s Asgardian physiology has granted him a muscular and skeletal structure that is considerably denser than that of normal humans granting him a greater degree of resistance to injury, and an immunity to all Earthly diseases. He is also extremely long lived, though not immortal like the gods of other pantheons, such as the Olympians. Also being the god of strength has granted him vast superhuman strength that is possibly greater than that of his father Thor.", 
            "realname": "Magni", 
            "significantissues": "Thor #50, 68, 75-79 (Magni gains control of Mjolnir and attempts to use it to force Thor to rescind his control over Earth and return to Asgard.)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Earth-3515", 
            "weight": 650
        }
    }
}