{
    "aliases": [
        "Grand Inquisitor", 
        "Enrique"
    ], 
    "citizenship": "Italy", 
    "content": "The sunrise came quickly, and the counterfeit Angel was strapped to a stake, prepared to burn for being born. The Inquisition offered him a quick death if he renounced his existence; but he refused. Though before they could set him alight, the torch grew cold, and Javier’s men, Scotius Summerisle and Robert Trefusis appeared, using their own natural powers to free the boy. Wanda soon began to doubt her own powers, questioning Enrique if, in fact, they were also gifts of the Devil; but Enrique merely pointed out that, as a Grand Inquisitor, he would make sure that her and her brother would never be targeted by them. Her brother appeared moments later, giving word that James was ready to side with Enrique. Shortly afterwards, a man named Brother Tomas came from his Holiness, questioning whether the rumor that Enrique had been talking with King James was true. Whether it was or wasn’t, Tomas’ job was to kill Enrique, and he prepared to do so by cutting his throat and pushing him into one of the pits below the Inquisition’s Fortress. Before he could, Enrique revealed his own powers by turning the man’s metal dagger back upon himself, using his mind to slit his throat and drop him into the pit, instead.When Count Otto von Doom murdered Queen Elizabeth I, King James assumed that Enrique had, as Petros has suggested to him that it was a possibility. He was grateful, and so Enrique didn’t correct him. James was prepared to continue sending him witchbreed. But when James captured Javier and his students, he refused to be restrained by his agreement with Enrique, and told Petros as much. Things began to get uncomfortable for Enrique, as the Papal envoy, Brother Tomas, was missed. Though Enrique’s servant in the Vatican felt that with Doom’s rise in power, the Inquisition would be overlooked. Thing were not overlooked, however, by James, who discovered Enrique’s dealings through Enrique’s Vatican minion, Toad. One of James’ men soon captured Enrique and his children, and ironically intended to burn them at the stake. Enrique first asked that his books and belongings he hid under the floor in his study be spared, knowing that the King’s man would burn them out of spite. The man then taunted Enrique with the fact that he was born a jew, named Enrico, but sheltered by Christians, then he burnt Enrico’s beard off with his torch. When his belongings were brought, Enrico lifted the helmet that Javier had given him to his head with his mind, and then broke free from the metal chains, along with his children. Together, they neutralized the guards and escaped from England by boat.Enrico let his boat be taken by the winds, though he had planned to travel to where the rest of his newly christened Brotherhood hid. The boat eventually found its way to the New World, and Javier’s men soon attacked the boat and crew. Robert used his ice powers to freeze the outside of the boat, trapping Enrico and his children inside. Javier then spoke into Enrico’s mind, finding out why he was headed to the New World. He did not believe Enrico’s explanation: that he had simply drifted there. Javier later opened a hole in the ice and entered to make a deal with Enrico. He needed his help to patch up the hole in their universe, and Enrico agreed without knowing the circumstances, but offered in return that Javier would have to agree to his own set of demands, later. Though Javier distrusted agreeing to something he hadn’t even heard yet, he knew there was no choice.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Marvel 1602 #1\n", 
    "groupaffiliation": "Formerly the Inquisition", 
    "hair": "White\n", 
    "id": "Magneto_(1602)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Petros (son), Sister Wanda (daughter)", 
    "occupation": "Former Grand Inquisitor of the Inquisition", 
    "placeofbirth": [
        "Venice", 
        "Italy"
    ], 
    "powers": "Enrico has the ability to manipulate electro-magnetic fields, giving him a superb control over anything metal.", 
    "realname": "Enrico", 
    "significantissues": "Marvel 1602 #1", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 1602 (Earth-311)"
}