{
    "aliases": [
        "Lurky Man", 
        "Madness Monster", 
        "Him"
    ], 
    "citizenship": "Formerly the Empire of the Universal Church of Truth", 
    "content": "When he broke free, the Magus, as he now called himself, conquered the planet he found himself on, and thus becoming a god to the inhabitants as he proceeded in establishing the Universal Church of Truth. Over the next 5,000 years, the Magus expanded the Church via holy war into a tyrannical intergalactic empire spanning a thousand worlds. Having caught up with his past self, the Magus confronted Adam Warlock, who opposed the empire and its tyrant. This was the confrontation that sparked the time paradox that allowed the Magus to be taken by Chaos and Order. This time, Thanos intervened, protecting Warlock from the Magus, sending Warlock into a realm where his kismet trail was a literal path he could follow. Warlock terminated the path which would have led to the Magus' creation, seemingly wiping the Magus from existence and diverging the Magus' reality (Earth-7528) from Earth-616's.Years later, Adam Warlock gained virtual omnipotence from wearing the Infinity Gauntlet. Hoping to wield its power fairly, he subconsciously purged himself of both good and evil to purify his thoughts. Unknown to him, however, his evil self took form as the Magus reborn.  \nThe Magus, making his base far along a dimensional corridor, soon began a complex plot: acquiring several alternate dimensional reality-altering “Cosmic Containment Units” similar to the Cosmic Cube. Knowing direct exposure to the Units' energies could cause madness, the Magus employed instrumentation to control their power, using it to begin merging another reality with Earth-616's and thus create a reality under his control.At the same time, the Magus sought the virtual omnipotence of the Infinity Gauntlet. The Living Tribunal, the multiverse's cosmic judge, had ruled the Infinity Gauntlet too dangerously powerful for any single being to wield and had rendered its Infinity Gems unable to be used in unison. Allowing various beings to sense the Containment Units' powers under his control, the Magus made his threat clear to the likes of Galactus, Adam Warlock, and Thanos. The Magus rendered Eternity itself catatonic, and he further allied with the Dimension of Manifestation's Anthropomorpho to obtain numerous Manifestation Bodies (M-Bodies) under his control. Having the M-Bodies assume evil doppelganger (or shade) forms of Earth's heroes and allies, who were attacked by their doppelgangers, the Magus also created a Thanos shade to serve as his ally. Via the Thanos shade and his own resemblance to Warlock, the Magus duped the heroes of Earth into blaming and assaulting Warlock and his Infinity Watch (holders of the individual Gems), distracting them and slowing their pursuit of the Magus.Even mighty Galactus fell victim to the Magus manipulations: after narrowly surviving an assault by the Magus, Galactus petitioned the Living Tribunal to allow the Gauntlet to function again. The Magus abducted Warlock and the non-functional Infinity Gauntlet just prior to the Tribunal's decision. A pair of wildcards entered the game as Doctor Doom and Kang the Conqueror -- neither of whom the Magus had planned for or monitored -- tracked down the Magus and his power source. In addition, the Cosmic Containment Units had been covertly stolen by the Goddess, Warlock's \"good\" self. Kang and Doom nearly overpowered the Magus, but, holding the Gauntlet as the cosmic judgment was proclaimed and the Gems allowed to function together, the Magus easily overpowered all of his foes, binding them in an energy field. Victory seemed certain for the Magus, but then Thanos appeared, resisting the Magus' power long enough for Warlock to be freed and to grapple with the Magus for control over the Gauntlet. As they struggled, Warlock revealed that he had allowed the Magus to steal a false component of the Gauntlet, the Reality Gem (with Thanos secretly holding the true version). Warlock further summoned an Eternity/Infinity composite (Infinity being Eternity's partner in representing the entire space/time continuum of the universe). As the Magus had neglected to neutralize Infinity, Eternity had regained consciousness using its inherent link to Infinity. Lacking the Gauntlet's true power, the Magus succumbed to Eternity and Infinity's combined power, and his spirit was sent into Warlock's Soul Gem.Even in defeat, the Magus began scheming anew, plotting to amass a rebellion within the Soul Gem's pocket realm, through which he might eventually take over the Soul Gem and then gain possession of Warlock's form. However, the Magus found that as he was only a fragment of a spirit, he could not even interact with or be detected by any of the other spirits in the Soulworld.Warlock once sought the Magus' aid against the Goddess, but the Magus attempted to kill Warlock and take over his form. After pitched battle, Warlock left him trapped in the Soulworld. The Goddess was eventually banished to Soulworld, too, but while the Goddess and the Magus could see and communicate with each other, their differing fragments were unable to interact physically, preventing them from either destroying one another or even from working in tandem to escape should they wish to.When the evil being Syphonn briefly usurped Warlock's Soul Gem, the Magus escaped. Reduced to a shadow of his former self, he traveled to the planet Calculex's Halvacenter, where he began absorbing the life force of hundreds of victims, each one bringing him closer to regaining his solid form. To hasten the process, he targeted the cosmic power of Captain Marvel (Genis-Vell), but Genis' cosmic power linked his soul to the universe, overwhelming the Magus. Genis blasted him across the universe, but he survived, targeting Genis' friends and allies, critically wounding Moondragon and forcing her to swear allegiance to him in exchange for saving her.", 
    "durability": 6, 
    "education": "Trained by Lord Chaos and Master Order", 
    "energy": 7, 
    "eyes": "White (no visible irises)\n", 
    "fighting": 4, 
    "firstappearance": "Strange Tales #178 (1975)\n", 
    "groupaffiliation": [
        "Formerly led an army of doppelgangers", 
        "former head of the Universal Church of Truth"
    ], 
    "hair": "White\n", 
    "height": 0, 
    "id": "Magus_(Adam_Warlock)", 
    "identity": [
        "No dual identity", 
        "the general populace of Earth is unaware of Magus’ existence"
    ], 
    "intelligence": 6, 
    "knownrelatives": "Adam Warlock (progenitor), Goddess (“sister”)", 
    "occupation": [
        "Parasite", 
        "would-be galactic tyrant"
    ], 
    "origin": "Warlock #9 (1975)", 
    "placeofbirth": [
        "Unidentified interdimensional realm", 
        "(reborn) interdimensional crossroads"
    ], 
    "powers": "Superhuman strength, reflexes, and durability. He could tap into his own cosmic energy to further enhance these traits. He could also project cosmic energy bolts, become immaterial, wrap himself in illusions, and teleport himself and others. He also possessed “astral senses” and could communicate telepathically (even over interstellar distances).", 
    "realname": "Magus (formerly Adam Warlock)", 
    "significantissues": "See Handbook Bibliography", 
    "speed": 6, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 240
}