{
    "aliases": [
        "Gene Kahn", 
        "Zhang Tong", 
        "Chu"
    ], 
    "citizenship": "Chinese national", 
    "content": "In recent years, seeking assistance to master the Makluan rings’ full power, the Mandarin became the patron of the Sin-Cong revolutionary Wong Chu, who abducted the Chinese genius Ho Yinsen and American industrialist Tony Stark. However, Yinsen sacrificed his life to enable Stark to escape and overwhelm Wong Chu’s forces using his first Iron Man armor. After disciplining Wong Chu for his failure, the Mandarin had the opportunity to stop Iron Man from departing but, intrigued, allowed him to pass unhindered, little realizing the armored hero would become his most persistent nemesis.Several months later, Iron Man visited China to investigate the Mandarin for the U.S. government. Using the rings and his own combat skills, the Mandarin nearly defeated Iron Man, who nonetheless outwitted him and escaped. Soon after, the pair again clashed when the Mandarin pulled Stark surveillance missiles from the sky to use for his own purposes, then manipulated the Chinese government into test-firing a missile which, unknown to them, was intended to trigger world war, but Iron Man defeated him both times. Affected by Doctor Doom’s Emotion Charger, the Mandarin next joined many other super-villains in attacking the Fantastic Four’s Richards-Storm wedding; later, he recruited the Swordman, whose sword he equipped with greater technological weaponry, to serve as his spy within the Avengers, but the Swordsman ultimately balked at destroying the Avengers and betrayed him.Finally activating Ultimo, the gloating Mandarin teleported Stark to his citadel to observe the supposed triumph, but Iron Man lured the giant back into the volcano, temporarily imprisoning him. Later, Iron Man again prevented his foe from provoking world war with a second missile scheme. Reactivating Ultimo and rehiring the Swordsman, along with Living Laser, Power Man (later Atlas of the Thunderbolts), Enchantress, and the Executioner, the Mandarin launched an effort to empower a world-wide hate-ray, only to be foiled by the Avengers. He next mentally controlled the Hulk and used him to wreak havoc, thinking each nation would blame the other for the behemoth’s attacks, but his control was disrupted by Nick Fury and Yuri Brevlov of S.H.I.E.L.D. Undaunted, the Mandarin, now accompanied by the adult Mei-Ling, used a Hulk robot to abduct Stark’s lover Janice Cord while framing Stark himself for enemy conspiracy, but Mei-Ling, touched by Cord’s love for Stark and disillusioned by the Mandarin’s cruelty, sacrificed her life helping Iron Man defeat him. A second attempt to control the Hulk with the help of the Sandman also failed, as did efforts to foment unrest by abducting peacemaker Dr. Robert Hoskins, who was rescued by Captain America.Hoping to enhance his rings’ already phenomenal power, the Mandarin manipulated the Royal Family of Inhumans into obtaining the mystic Eye of Yin, created centuries ago by Makluan-trained sorcerers, but he was overpowered by Black Bolt, who absconded with his rings. After allying himself with the former Russian super-operative Unicorn, the Mandarin regained the rings via a Makluan headband device and returned his attention to Tony Stark. In the identity of Gene Kahn, he stirred unrest among Stark’s employees, then, when exposed, fought Iron Man alongside the Unicorn. However, careless use of the headband inadvertently switched the Mandarin’s consciousness with that of the terminally ill Unicorn, and he quickly abandoned the fight to rectify the situation. Adding insult to injury, he discovered that a rival mastermind, the Yellow Claw, had, at the prodding of the extradimensional Black Lama, seized his current base, one of his Chinese castles, in his absence. Retiring to an underwater base, the Mandarin captured Sunfire and forced him to power the machinery that restored him to his rightful body, but even with Ultimo’s aid, regaining his castle was not so simple. Iron Man and Sunfire intervened in the conflict, which ended with the Mandarin seemingly slain by the Yellow Claw’s robot surrogate, the Makluan rings claimed by the Claw’s servant Loc Do.However, the Mandarin’s new control of his consciousness enabled him to transfer his intellect into the rings themselves, and he remade Loc Do’s body into a younger version of his own. Despite his new body, his customary schemes to foment world war were once more thwarted by Iron Man. Efforts to obtain Wakanda’s Vibranium via the resurrected Killmonger proved no more successful, and his attempt to destroy China’s rice crops, intended to drive the Chinese government into invading other nations, was disrupted by an alternate Iron Man (Stark’s temporary replacement Jim Rhodes). Later, while experimenting with his rings, the Mandarin was rendered comatose; although he recovered physically, he was left amnesiac when elderly Chen Hsu, the millennia-old captain of the disguised Makulans, stole and replaced one of his rings, still tied to his consciousness and thus necessary to restore his memory fully. As Zhang Tong, the Mandarin, still driven by a need for conquest, became a criminal overlord in Hong Kong, allowing ten underlings to use his rings as his operatives in the so-called Hand. Having no memory of his grudge against Stark, he sought to force a business alliance but was again foiled by Iron Man, who nonetheless found himself unable to interfere with his opponent’s criminal network. Soon afterward, the Mandarin joined several other masterminds in the so-called “Acts of Vengeance” anti-superhero conspiracy, then allied with Matsuo Tsurayaba of the ninja Hand, but these endeavors were disrupted by the Avengers and the X-Men, and subsequent worldwide attacks on crime prevention specialists were ended by Nick Fury’s intervention.Eventually recognizing Chen Hsu’s theft, the Mandarin confronted the old man, who returned both his ring and his memory, then guided him in commanding the gigantic Makluan dragon Fin Fang Foom, with whom the Mandarin soon seized control of one-third of his native land. Tony Stark and James Rhodes, both armored as Iron Man, intervened, but the Mandarin turned against Hsu and Foom upon learning that the Makluans wanted to rule Earth themselves; with Stark channeling his own armor’s power through the rings, the Mandarin seemingly destroyed the Makluans, but his hands were burned off in the process. Eventually recovering, he grew new reptilian hands and recovered his rings, then discovered the Thuviskaroth of Cataphylaxis, a.k.a. the Heart of Darkness, a centuries-old talisman of cosmic evil. Forced through a psychological gauntlet in which he overcame personifications of his earlier schemes, he emerged near-mad with supernatural power and, in a departure from his usual methods, mystically reverted China to its medieval state, supposedly saving the world from the corruption of the technology he had commanded so long, with the assistance of the superhuman Avatars. While War Machine (Jim Rhodes) and Force Works fought the Avatars, Iron Man penetrated the Mandarin’s defenses and infected him with a techno-organic virus, nullifying his Heart’s mystic bond and again rendering him amnesiac as the janitor Chu.", 
    "durability": 4, 
    "education": "Multiple College Degrees", 
    "energy": 7, 
    "eyes": "Blue-Black\n", 
    "fighting": 7, 
    "firstappearance": "Tales of Suspense #50 (1964)\n", 
    "groupaffiliation": [
        "Avatars", 
        "\"Acts of Vengeance\" Prime Movers", 
        "Hand"
    ], 
    "hair": "Black\n", 
    "height": 74, 
    "id": "Mandarin", 
    "identity": "Secret", 
    "intelligence": 7, 
    "knownrelatives": "Unidentified father, mother, paternal aunt (all deceased). Mei-Ling (fiancée, deceased), Temujin (son), Genghis Khan (alleged ancestor, deceased)", 
    "occupation": [
        "Would-be conqueror", 
        "former janitor", 
        "businessman and crimelord", 
        "government administrator"
    ], 
    "placeofbirth": "China", 
    "realname": "Unrevealed", 
    "speed": 4, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 215
}