{
    "add": {
        "doc": {
            "aliases": [
                "Blackwing", 
                "Joe Manfredi", 
                "Joe Silvermane", 
                "Guiseppi Manfredi"
            ], 
            "citizenship": "U.S.A.", 
            "content": "In fact, Blackwing was a division leader of HYDRA when it was under the leadership of Silvermane, and he retreated to HYDRA’s secret base. When the organization arranged the kidnapping of Foggy Nelson, at the time one of New York’s District Attorneys, Daredevil tracked the culprits to their headquarters. Silvermane revealed his role as Supreme Hydra, and his son tried to stop Daredevil but was unsuccessful.Later, when Silvermane’s mansion was taken over by the Red Skull, Blackwing teamed up with Jack O’Lantern to stake it out. When Captain America also came to investigate, the two villains jumped him, viciously attacking him even when he was on the ropes due to Jack O’Lantern’s hallucinogenic gas. The Red Skull had been observing the battle and was impressed enough to order Mother Night to recruit the two for his Skeleton Crew. Mother Night arranged for Captain America to see an illusion that the Scourge of the Underworld killed the villains, and Blackwing and Jack O’Lantern agreed to join the Skull’s Crew.Blackwing served as a member of Crew, fighting off Crossbones and Diamondback before the two joined them as well. He also tried to fight off Captain America and the Falcon when the heroes came to rescue Diamondback. He was defeated by the Falcon and remanded to custody along with many others of the Crew.Blackwing next appeared as a member of the Crimson Cowl’s Masters of Evil, joining the team’s attempt to extort the world’s governments with the use of a weather manipulation machine. The team was tracked down by the Thunderbolts and defeated, with Blackwing and most of its members captured.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "fighting": 1, 
            "firstappearance": "Daredevil #118\n", 
            "groupaffiliation": [
                "Heavy Mettle", 
                "(formerly) Masters of Evil", 
                "Skeleton Crew", 
                "Circus of Crime", 
                "(formerly) division leader of Hydra"
            ], 
            "id": "Manfredi,_Joseph", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Silvio Manfredi (Silvermane, father), Caterina Manfredi (mother, deceased)", 
            "occupation": "Criminal", 
            "placeofbirth": [
                "Orlando", 
                "Florida"
            ], 
            "powers": "None", 
            "realname": "Joseph Manfredi", 
            "significantissues": [
                "Appeared with the Circus of Crime, foiled by Daredevil (Daredevil #118)", 
                "revealed family connections and HYDRA involvement, defeated by Daredevil (Daredevil #121-123)", 
                "recruited into Skeleton Crew (Captain America #397-398", 
                "1992)", 
                "defeated by the Falcon (Captain America #410", 
                "1993)", 
                "appeared as member of Masters of Evil (Thunderbolts #24-25", 
                "1999)", 
                "ordered Firestrike of Heavy Mettle to capture Turbo’s suit (New Warriors #2, 4", 
                "1999, 2000)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}