{
    "aliases": [
        "Celestial Madonna", 
        "Goddess of Life", 
        "This One (Mantis habitually refers to herself in this third-person fashion)", 
        "formerly Mandy Celestine", 
        "Lorelei", 
        "Willow"
    ], 
    "citizenship": "Vietnam", 
    "content": "Believing Mantis might grow to be the Celestial Madonna and mother the genetically perfect Celestial Messiah, the Priests of Pama trained Mantis in their martial arts, which she mastered, and gave her the name \"Mantis,\" in recognition of her skill in defeating male opponents. They also taught her telepathic communication with the Cotati, which gave her empathic abilities. On Mantis' eighteenth birthday, the Priests removed Mantis' memories, implanting false memories of an orphaned life in Ho Chi Minh City, and sent her to experience life among normal humans. Meanwhile, the Shao-Lom monks of Titan, whose teachings also stemmed from the pacifist Kree's beliefs, mentored another possible Celestial Madonna: Earth-born orphan Heather Douglas, later known as Moondragon, but her sheltered life denied her insight into human existence, making her a less-rounded candidate. Moondragon would eventually return to Earth, becoming involved with the Avengers.As a bar girl coincidentally employed by her unwitting uncle, Monsieur Khruul, Mantis met the Swordsman, an adventurer turned alcoholic mercenary who worked for Khruul. Sensing a spark of nobility in the Swordsman and seeking a better life for herself, Mantis romanced and rehabilitated Duquesne, convincing him to return to America and rejoin the Avengers. She accompanied him, but had difficulty gaining the Avengers' trust after she deceived them, single-handedly taking down both Thor and Captain America as part of her plan to help the Avengers defeat the Lion God. Still, her abilities served the Avengers well; she aided the team during its Loki/Dormammu-masterminded Avengers-Defenders War; and against foes including the Collector, Klaw, and Ultron. Her empathic abilities helped save the universe when she deduced how Captain Marvel could defeat the Cosmic Cube-empowered Thanos.During her association with the Avengers, Mantis became disenchanted with the Swordsman and began a slow seduction of the Vision, which further damaged Mantis' standing with the team. When the Avengers fought and defeated Zodiac, Libra was captured and revealed his identity as Mantis' father, telling her some portion of her history. Returning to the Pama temple, Mantis found the Priests slain by her uncle, who was in turn slain by the Star-Stalker, who had been kept imprisoned by the Priests. Though she still lacked her true memories, Mantis began doubting what she'd believed.Knowing the Celestial Madonna to be among them and hoping to father the Celestial Messiah himself, Kang attacked the Avengers. Defeated, he identified Mantis as the Celestial Madonna and attempted to kill her, but the Swordsman took the blast himself and died. Mantis, guilt-ridden and grief-stricken, buried the Swordsman in the garden of the Priests of Pama; however, the eldest Cotati reanimated the Swordsman's body and confirmed that Mantis was the Celestial Madonna. Immortus, Libra and the Cotati revealed the full history of Mantis, who accepted her destiny as the Celestial Madonna (to Moondragon's irritation). In a ceremony conducted by Immortus, Mantis and the Eldest Cotati wed (as did the Scarlet Witch and the Vision), after which the celestial couple transformed into energy and departed Earth. Before she departed, the Avengers declared Mantis an official member of their ranks.Merged with the Cotati's essence, Mantis gained Cotati abilities as well as her own, and began to evolve into \"the essence of life,\" a change which physically manifested as a greenish hue in her skin. Conceiving the future Celestial Messiah, she left our universe, but even in other universes she found herself pursued -- on one alternate Earth she was aided by a league of justice-serving heroes against a mechanical construct which sought to prevent her child's birth. Eventually her son, Sequoia, was born, and Mantis attempted to raise him as normally as possible in the town of Willimantic, Connecticut. Dark forces rose against her, attempting to create an evil counterpart to her child, but she aided those who fought them; nothing eclipsed her attempts to raise the boy peacefully.When the fast-growing child reached an age when the Cotati race chose to parent him alone, Mantis again took to the stars, where she uncovered a plot by the Elders of the Universe to acquire the six Infinity Gems and destroy Galactus. Fearing this would destroy reality, Mantis located the Silver Surfer and traveled with him as he fought the Elders, bonding romantically with him. When the Gardener attacked her using the Soul Gem, she barely escaped and transferred herself to Shalla-Bal, the Surfer's former beloved on his homeworld. She and Shalla-Bal were both subsequently captured by the Elders. When the Elders attempted to destroy them both, Mantis sacrificed herself, allowing the Surfer to rescue Shalla-Bal.The power of the Elders' Infinity Gems proved too much for Mantis, who could not fully reconstruct herself, and fragments of her essence formed several \"shadow\" Mantises. One shadow form awoke on Earth as an amnesiac, lacking powers. Seeking help, she aided the Avengers against the Voice and the High Evolutionary, and they in turn aided her in regaining her memories. The Fantastic Four then helped her try to return to her son, but Kang and Necrodamus interfered; after foiling them, Mantis returned to the stars as pure energy. The Silver Surfer encountered a shadow Mantis on Verdant, a plant world threatened by Galactus, and this Mantis aided the Surfer, the Fantastic Four, and the Avengers in defeating Galactus and saving the Shi'ar homeworld. Over time, most shadow Mantises ceased to exist, fading even from the memories of those they'd encountered. During the Immortus-guided conspiracy known as The Crossing, the Avengers fought a Mantis seemingly allied with Kang, but this Mantis was ultimately revealed to be a Space Phantom, with no relation to either the true Mantis or her \"shadows.\"", 
    "durability": 1, 
    "education": "Trained by Priests of Pama", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "Avengers #112 (1973)\n", 
    "groupaffiliation": [
        "Guardians of the Galaxy", 
        "formerly Avengers"
    ], 
    "hair": "Black\n", 
    "height": 60, 
    "id": "Mantis", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Sequoia (Celestial Messiah, \"Quoi\", son), Elder Cotati (Swordsman)(husband, separated), Gustav Brandt (alias Lloyd Wiloughby, Libra, father), Lua Nguyen Brandt (mother, deceased), Khruul (uncle)", 
    "occupation": [
        "Adventurer", 
        "formerly barmaid"
    ], 
    "placeofbirth": "Unknown village in Vietnam", 
    "powers": "The powers she adapted from the Cotati enabled her to communicate telepathically with plants, survive in space, and transfer herself (and her son) from plant life to plant life across interstellar distances or interdimensionally. Once reborn, she could fire powerful energy blasts, form energy fields, communicate directly with cosmic beings such as Eternity and Death, and gained complete control of her personal energies as well as her physical form. Her mind, a human/plant hybrid, is largely immune to mental or metaphysical assault, and her physical durability is greatly enhanced. She can achieve a meditative state in which she is largely immune to physical, mental or spiritual harm. She also seems to have limited powers of flight, though it is possible these function only in the vacuum of space.", 
    "realname": "Unknown (last name presumably Brandt)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 115
}