{
    "add": {
        "doc": {
            "aliases": "Hescamer (one of Odin’s ravens)", 
            "citizenship": "Asgard", 
            "content": "Comic Image = http://www.marvunapp.com/Appendix/marnotts1\nMarnot appeared again when Thor was seeking aid from the possessor of the Infinite Eye, Orikal. Thor wanted to hear the fate of his homeland, Asgard, and Marnot would be the one to tell the tale. The story began when Thor was a boy, and news of a disturbing find found Odin’s ears. His scout, Lonkarr, journeyed past the Nine Worlds and found a world almost totally opposite of Asgard. The world was called Narcisson and the gods there ruled over their subjects with an iron fist. Lonkarr set foot on this world and was almost immediately attacked by one of the Dark Gods, Tserron. The two battled for nearly a day, but it was Lonkarr that emerged victorious. Tserron happened to be the bride of the god Perrikus, but he allowed Lonkarr to escape so that he may bring war to Asgard. The Dark Gods did attack and after several weeks, the Dark Gods had won. Their leader, Majeston Zelia, had given Odin the choice of being her partner, but when he refused she ordered Perrikus to kill him. The young Thor was there and inspired his father to battle on, and Odin did just that. The Asgardians eventually won the war and Odin banished the Dark Gods to another part of the universe. The war was so terrible and so many had died that Odin removed the memory of it from everyone but himself. Thor also learned that the Dark Gods had recently returned and it was Thor’s own hammer that accidentally released Perrikus when he hurled it into the ruins of Asgard. Marnot finished his story by telling him that the Dark Gods inhabit Thor’s home, and they know that Thor is alive and on Earth. It was then that Thor declared war on the Dark Gods.After the war with the Dark Gods was won, Marnot revealed himself again and, even though he claimed that his creation was Odin’s doing, Odin had no recollection of him. Marnot transformed himself into that of Odin’s raven, Hescamer, and informed Odin that the magic behind this transformation was his. Just as Odin took away the memory of the first war with the Dark Gods, Odin also took away the memory of his contingency plan, even from himself. In the event of another attack by the Dark Gods, Hescamer was to be transformed into Marnot where he would retain the memories of all that came before, inherit the powers of Odin, and seek out every Asgardian that was not captured and conceal them so the Dark Gods could not find their location in the hopes an army could be raised to one day liberate Asgard. This was also when Thor was told that he was merged with Jake Olsen to conceal him from Perrikus and not to reclaim his honor.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "No visible irises (as Marnot), Black (as Hescamer)\n", 
            "fighting": 1, 
            "firstappearance": "Thor #2 (1998)\n", 
            "groupaffiliation": "Gods of Asgard", 
            "hair": "None (as Marnot), Black feathers (as Hescamer)\n", 
            "id": "Marnot", 
            "identity": "Only the Asgardians and Hercules know Marnot’s true form", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Savior", 
            "origin": "Thor #13 (1999)", 
            "placeofbirth": "the realm of Asgard", 
            "powers": "Marnot claimed that as he transformed from raven to man he was infused with the aura, the power and the invincibility of Odin, and he may have been accurate as he was able to remove the mouth of Volla with a snap of his fingers, make the Goddess of death, Hela, tremble in fear just by looking at her, and he had the power to merge Thor with the mortal, Jake Olsen", 
            "realname": "Marnot", 
            "significantissues": "Thor #2-4, 9-10, 13", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}