{
    "aliases": "Leviathan", 
    "citizenship": "Canada (naturalized)", 
    "content": "Once, Marrina was kidnapped from Alpha Flight by the Master of the World. The Master was determined to destroy Marrina, as he was an innocent victim transformed by the alien Plodex, while Marrina, she was the one of the last surviving Plodex on Earth! He revealed her origins to her: The Plodex populated new worlds by seeding eggs with beings of variable genetic structure. These beings would imprint the genetic material of the dominant species and thus survive in the new environment. Marrina had imprinted herself to become a human female, but her Plodex coding was flawed-- she did not inherit the Plodex' natural inclination for conquest and belligerence. Marrina was rescued by Alpha Flight and Namor the Sub-Mariner, and in so doing, freed the Master from his connection to Plodex technology.Later, Namor invited Marrina to accompany him to Atlantis, and the two soon became lovers. However, the Master found the other surviving member of the Plodex on Earth, which had a monstrous form and was fully given over to its instincts to kill. The Master permitted the creature to commit a series of murders which Marrina investigated. As she approached the creature, it triggered her savage instincts. She attacked Puck and the Sub-Mariner, who had followed her, but they were all captured by the Master. At his base, Marrina confronted the other Plodex and was horrified to believe it was her intended mate. When the Master's submarine exploded, Marrina allowed Namor to think she had been killed in the blast. The human part of her was overcome with shame over her savage instincts and the way she had wanted to give in to them. Believing herself to be a monster, Marrina left everyone to lead a solitary life at sea.However, having apparently overcome her savage tendencies and ennui, Marrina returned to marry the Sub-Mariner and became queen of his new undersea kingdom of Beluvia. When Beluvia failed and the Sub-Mariner returned to the surface world as an outcast, Marrina left with him. The Sub-Mariner then accepted membership with the Avengers, and Marrina became an associate of the team. Unaware that she was pregnant, Marrina's condition triggered a transformation into a huge, savage sea creature resembling the mythical Leviathan. After sinking several fleets of ships and ravaging Atlantis, the Avengers hunted her down. Ultimately, it was the Sub-Mariner who mortally wounded her with the Black Knight's Ebony Blade. Marrina, whose body had changed back into its normal form, was then buried by the Sub-Mariner with the honor fitting one who had been his mate and an associate of the Avengers.Later, the Avengers uncovered a nest made of the remnants of the Leviathan's destruction and eggs, which had already hatched. Presumably an unknown number of offspring had fled into the vastness of the Atlantic Ocean.When Earth was recently attacked by Kang, the Master of the World saw him as a potential threat and launch his own counterattack, claiming the Earth as his own to protect. The Avengers were caught in a three-way struggle, ultimately confronting taking control of the Master's base and equipment. The Avengers wondered where the Master had received the genetic information needed to create an army of Plodex-creatures, and they failed to find the body of Marrina in one of the Master's genetic laboratories. Unfortunately, the Master's base and equipment disappeared into the Earth once the conflict was over.", 
    "durability": 1, 
    "energy": 1, 
    "eyes": "Black\n", 
    "fighting": 1, 
    "firstappearance": "Alpha Flight #1 (1983)\n", 
    "groupaffiliation": [
        "(formerly) Alpha Flight", 
        "Beta Flight", 
        "Gamma Flight"
    ], 
    "hair": "Green\n", 
    "height": 72, 
    "id": "Marrina", 
    "identity": "Publicly known", 
    "intelligence": 1, 
    "knownrelatives": "Tom Smallwood (foster father), Gladys Smallwood (foster mother), Dan Smallwood (foster parents' grandson), Namor (husband), unnamed offspring", 
    "occupation": [
        "Adventurer", 
        "(formerly) queen of Beluvia"
    ], 
    "origin": "Alpha Flight #2-4 (1983)", 
    "placeofbirth": [
        "Newfoundland", 
        "Canada"
    ], 
    "powers": "Alien nature that mimics both human and aquatic life, making her amphibious, with gills and webbed hands/feet. Superhuman swimming speeds. Survival at intense ocean pressures. Visibility in most watery conditions. Secretion of an oil that causes temporary blindness. Also, during periods of mating and birthing, Marrina would undergo intense physiological and psychological changes, become a savage, bestial killer with claw-like weapons, and later, a monstrously-sized serpent creature.", 
    "realname": "Marrina Smallwood MacKenzie", 
    "significantissues": "Dark Reign: The List - X-Men #1 (2009)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 200
}