{
    "aliases": [
        "Sire Hate", 
        "Demoiselle Hate", 
        "Hate"
    ], 
    "citizenship": "Inapplicable", 
    "content": "Another meeting of cosmic entities was called in order to decide if Warlock would be able to keep the gauntlet. Master Hate and Mistress Love attended the hearing and watched the outcome. The gauntlet was split up into the original Infinity Gems. After the hearing Hate parted ways with Love.Soon Mistress Love came into contact with a girl who had fallen in love with the Silver Surfer and granted her cosmic powers in order to be his equal. In doing so Love created Avatar, who would be Love's new avatar. However Master Hate watched from a distance and offered Avatar more power if she became his newest avatar as well. She accepted and became even more powerful. Avatar then confronted the Surfer and tried to force him to love her. However the Surfer was able to subdue her and place her in a pocket dimension. There she still waits for Master Hate and Mistress Love.", 
    "durability": 7, 
    "education": "Experience", 
    "energy": 6, 
    "eyes": "Variable\n", 
    "fighting": 1, 
    "firstappearance": "Infintiy Gauntlet #3\n", 
    "groupaffiliation": "Former master of Avatar", 
    "hair": "Variable\n", 
    "height": 0, 
    "id": "Master_Hate", 
    "identity": "Known to few people on Earth", 
    "intelligence": 3, 
    "knownrelatives": "Mistress Love (\"sister\")", 
    "occupation": "Abstract Entity", 
    "placeofbirth": [
        "Inapplicable", 
        "possibly the Dimension of Manifestations"
    ], 
    "powers": "Master Hate has been said to be one of the most powerful entities in the universe. He can control the emotions related to hate in any being, even on a cosmic scale. He can also influence beings who are in a state of rage or hate, affecting their actions and the decisions that they make. He appears to those in a form in which is appealing to them, which is called an M-Body. He can also manipulate and control cosmic energy to various degrees on a massive scale. He can use this cosmic energy to create barriers, hurl bolts of cosmic energy, grant powers to others, and various other tasks.", 
    "realname": "Inapplicable", 
    "speed": 2, 
    "strength": 4, 
    "universe": "Marvel Universe"
}