{
    "aliases": "None", 
    "citizenship": "Inapplicable", 
    "content": "One Day Lord Chaos and Master Order sensed the threat of Thanos of Titan and began to manipulate the lives and events of Spider-Man, the Avengers, the Thing, and Adam Warlock in order to bring about Thanos' downfall. After Thanos was defeated Spider-Man freed Adam Warlock from the Soul Gem and had fulfilled his purpose which the two beings had apparently been planning and manipulating his life since birth for that one purpose.Some time later the two, along with several other cosmic entities observed a chess game between Odin and Dormammu. Lord Chaos and Master Order were then seen with several other \"omnipotent\" beings within the Dimension of Manifestations plotting against the Beyonder several months later. Later, when the Fantastic Four attempted to transport six Infinity Gems from the Magick Realm to their own universe to save Galactus's life, the In-Betweener infected them with the essence of Chaos and Order causing them to fight over the gems. Lord Chaos and Master Order were then summoned by the Silver Surfer and Doctor Strange in order to gain control of their agent, the In-Betweener. After learning of the In-Betweener's plan to restore the cosmic balance by creating universal insanity the two imprisoned him for his ploy. During this battle Galactus devoured the Elders of the Universe who attacked him with the Infinity Gems. This caused a shift in the cosmic balance which gained the attention of Lord Chaos and Master Order. However shortly afterwards Master Order and Lord Chaos resurrected the Elders and restored the balance. Angered at the In-Betweener's deeds they cast him back into the Magick Realm.After some time the entity known as Eon died. Lord Chaos and Master Order attended Eon's funeral along with many other abstract beings. Then after a long time Thanos had resurfaced and acquired the Infinity Gauntlet, boosting his powers to that of an omnipotent god. Disturbed by the increase in his power a meeting of abstract and metaphysical beings was called. Lord Chaos, Master Order, Galactus, Eternity, Infinity, Master Hate, Mistress Love, and many other beings arrive and decide to join Adam Warlock in opposing the mad Titan. Soon the group of beings attacked Thanos and his consort Nebula. They failed and were all turned into stone, but were freed once Adam wrested the gauntlet from Thanos.Determined to not let the gauntlet be possessed by Warlock, Eternity called upon the Living Tribunal to have Adam set on trial. All of the beings who fought Thanos arrived and were all in awe of the Tribunal's power as he determined that Adam was not worthy of the gauntlet and must give one of the Infinity Gems to a being he trusted. The trial was adjourned and Lord Chaos, Master Order, and the other cosmic entities leave. Master Order then arrived with other beings and question the Beyonder and a being called Dave in the Dimension of Manifestations.When Nicholas Grant, former head of Mys-Tech's Warheads (Kether Troop), was transformed into Audit, he confronted Master Order under the false presumption that Order had created him to bring balance to the universe by \"auditing\" dangerous souls; but Order denied any part in Audit's creation and killed him, with Chaos later revealing he had created Audit as a gesture of reconciliation with Order.", 
    "durability": 1, 
    "education": "Inapplicable", 
    "energy": 1, 
    "eyes": "Inapplicable\n", 
    "fighting": 1, 
    "firstappearance": "Marvel Two-In-One Annual #2\n", 
    "groupaffiliation": "None", 
    "hair": "Inapplicable\n", 
    "height": 0, 
    "id": "Master_Order", 
    "identity": [
        "Inapplicable", 
        "Existence is not known to the general populace of Earth"
    ], 
    "intelligence": 1, 
    "knownrelatives": "Inapplicable; Partner of Lord Chaos, In-Betweener (creation)", 
    "occupation": "Force of Nature", 
    "placeofbirth": "Inapplicable", 
    "powers": "Can manipulate and control events in its sphere of influence. May possess the Power Cosmic, and is able to manipulate vast amounts of cosmic energy. He along with Lord Chaos created beings with cosmic powers. It is either immortal or very long lived and it has a telepathic link with Lord Chaos and their creation, the In-Betweener. Since Master Order is rarely called into conflict its powers are widely unknown and untested. Master Order represents the collective forces of order in the universe. Order possesses no true physical form and uses \"Manifestation Bodies\" created from the Dimension of Manifestations to give himself a physical appearance.", 
    "realname": "Master Order", 
    "significantissues": "Marvel Two-In-One Annual #2, Thor Annual #9, Secret Wars II #6, Silver Surfer Vol.3 #17-18, Quasar #26 & 38, Infinity Gauntlet #3-6, Warlock & The Infinity Watch #1", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}