{
    "add": {
        "doc": {
            "citizenship": "Teraxtola", 
            "content": "After regaining consciousness Maya explained her origin, which enraged the already suspicious Gamora, who lunged forward to attack Maya. Gamora's actions were met with the strange Dance of Unreality, which disrupted the balance of everyone present except Adam Warlock.Realizing that it would be best to talk to Maya alone, Warlock as the the Watch member to allow him to speak with her alone. During this time Maya manage to take the antidote and convinced Warlock to drink the potion. After drinking the potion both Warlock and Maya developed very strong feeling for each other and began kissing. Drax, Maxam and Gamora managed to pry the two of them apart. Moondragon some how was able to identify that they were under some kind of magical spell. Warlock called on the mystic Anthony Druid to reverse the spell, but he was unable to undue to other worldly magic of the Zalkor. Despite the protest of the jealous Gamora, Maya remained on Monster Island.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Warlock and the Infinity Watch #14 (1994)\n", 
            "groupaffiliation": "The royal family of Teraxtola", 
            "hair": "Blond\n", 
            "id": "Maya_(Maya_Teraxtola)", 
            "identity": "Unknown to the general populace of Earth", 
            "intelligence": 1, 
            "knownrelatives": "Unidentified parents, Darklore (husband)", 
            "occupation": [
                "Queen", 
                "former princess"
            ], 
            "placeofbirth": "An unidentified location in the Egolix-7 dimension", 
            "powers": "Maya has the power to alter reality by using a power, which she calls the Dance of Unreality.", 
            "realname": "Maya Teraxtola", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}