{
    "aliases": "None", 
    "citizenship": "Citizen of the United States", 
    "content": "When his old friend Boone was in trouble, Meanstreak headed to New York against the wishes of Xi’an to find him.  Krystalin and the new member, Timothy Fitzgerald agreed to help him.  On the way, they were captured by La Lunatica and taken to the Theatre of Pain to be tortured.  But when Luna used her powers to dredge up the repressed memories of Timothy, in order to feed upon, it unleashed his uncontrollable powers, and the resulting shock freed the X-Men, along with their torturer, Luna.  Together the X-Men left the Theatre and traveled to Boone’s apartment, where a hidden journal led them to investigate the man-beast Ravage, in his guise as Paul-Phillip Ravage.  When they confronted him about their friend, Ravage had no information to give them, but instead directed them towards Alchemax’s floating city, Valhalla, which Boone had also been researching.  Along with Ravage, they headed to the city and found Meanstreak’s friend Boone, transformed into the Asgardian trickster, Loki, along with a group of similarly engineered heroes.  They were attacked by one, Heimdall, and were able to destroy him when Loki gave Meanstreak a device to turn off his powers.  Then the new incarnation of Thor showed up, but 2099’s Doom appeared along with Timothy, and fought him.  The rest of the X-Men worked to evacuate the city before the vigilante heroes, 2099’s Spider-Man, Punisher, Doom, and Ravage brought the falling city under control.Meanstreak traveled with the rest of the X-Men to seek out the underground leader, Mama Hurricane, to discover if she was actually the same Hurricane from the time of the Great Purge.  They found that she was, but was now the leader of a group of degens called the Freakshow.  After a squabble between the two groups, they parted as friends, leaving the X-Men Metalhead, who had been infected by the Freakshow’s Contagion and become stuck in his metal state, behind.  Meanstreak also fought the new version of Zhao’s X-Men, a group of mutants whose growth Zhao unnaturally accelerated and transformed into a twisted version of Charles Xavier’s original team.  But after Xi’an defeated Zhao within Xi’an’s own mind, and reverted to his old, selfish self, Meanstreak stayed with the remaining X-Men while Xi’an and Timothy left to find the Driver and the mutant paradise, Avalon.Timothy, then known as Skullfire, returned with Luna and informed the team that Xi’an had left them for the Theatre of Pain.  Meanstreak was on the verge of declaring to Skullfire that either he left, or Luna left, when Jordan Boone, now calling himself Halloween Jack, confronted him.  Jack then suggested they go take over Vegas, and Meanstreak agreed.  They started by holding hostage the new head of the Synge Corporation, Desdemona Synge, and disabling her Rat Pack.  Jack then called a meeting of the Syndicate leaders, and threatened their bank accounts unless they stayed out of his way.  Then, in a move that Meanstreak strongly disagreed with, Jack let Desdemona leave, wanting to make his takeover more challenging.  Which Desdemona did, turning her brother Lytton into a massive, muscled monster, and controlled his mind to send him after Meanstreak and Jack.  Jack was ready to turn on his virtual unreality machine, which would transform Vegas into another dimension, when Lytton attacked.  Meanstreak and Halloween Jack were unable to stop him, until Meanstreak realized that Desdemona was still in the building, and he used his super speed to search the entire building until he found her, and then shut down her brother.  Jack later left Desdemona and her brother in the middle of the high desert.  Then Jack turned his unreality generator on, distorting the reality of Las Vegas.  Doom, who had recently become President, appeared and fought with Jack, then programmed a series of EMPs to contain the unreality in Vegas, and left Jack as the head of a warped city.  Krystalin appeared at the same time and encouraged Meanstreak to come back with her to the X-Men, and so he left Halloween Jack to his twisted kingdom.Meanstreak and Krystalin later contacted Bloodhawk and asked for his assistance in saving the rest of the X-Men from the Theatre of Pain.  They broke in to the Floodgate, the holding center for the Theatre’s victims, and helped to break out some of their fellow mutants.  The revived, surviving members of Zhao’s X-Men appeared, and Meanstreak and the others fought them and beat them.  Then they worked to stop Brimstone Love, the leader of the Theatre, and his new second in command, Controller X, the former X-Men leader, Xi’an.  Soon Xi’an, who wanted to take control of the Theatre, bested Brimstone Love, and Luna used her powers to snap Xi’an out of his villainous rampage.  Then President Doom took over the Theatre, using his newly installed S.H.I.E.L.D. group to round up the remaining victims and criminals.  Doom announced that he had created a place called Halo City, where all of the Theatre's victims would be able to take refuge.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "X-Men (2099) #1\n", 
    "groupaffiliation": [
        "Formerly X-Men", 
        "Halo City Protectorate", 
        "Alchemax Corporation"
    ], 
    "hair": "Brown\n", 
    "id": "Meanstreak_(2099)", 
    "identity": "Publicly Known", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "None", 
    "placeofbirth": "Unrevealed", 
    "powers": "Meanstreak is able to move at superhuman speeds, close to mach speed.  He also has increased reflexes, stamina, and thought processes.  His metabolism is equally enhanced to keep up with his speed, allowing him to heal faster than normal.", 
    "realname": "Henri Huang", 
    "significantissues": "X-Men (2099) #1 (intro), X-Men (2099) #33 (disappearance)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}