{
    "aliases": "None", 
    "citizenship": "Shi'ar", 
    "content": "Mentor was later amongst those few Imperial Guard members who opposed the treacherous Shi'ar High Council member Lord Samédàr who was aiding an attempted coup of the Shi'ar throne by Deathbird. Even after many of the Guard chose to side with Samédàr, Mentor remained steadfast in his loyalty to then-Empress Lilandra.When the Empress Lilandra, having regained her throne, learned of the many Earth heroes that had sacrificed their lives to stop the malevolent psionic being named Onslaught, she dispatched eight members of the Imperial Guard, including Mentor, to protect Earth. While on Earth, the Guard uncovered a plot by a militant Kree faction to simulate a radical political activist group in revenge for Earth's involvement in the Kree/Shi'ar war. In reality, the group created a \"nega-reactor\", similar to the bomb that was used on the Kree. However, this plot was stopped by the Guard, but not before the reactor was used by the Kree's leader, the Supreme Intelligence, to re-incorporate itself after being presumably killed at the end of the war.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "White\n", 
    "fighting": 1, 
    "firstappearance": "X-Men #107 (1977)\n", 
    "groupaffiliation": "Imperial Guard (Superguardians)", 
    "hair": "None\n", 
    "height": 69, 
    "id": "Mentor_(alien)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unknown", 
    "occupation": "Peacekeeper", 
    "placeofbirth": "Unrevealed planet in the Shi'ar Empire", 
    "powers": "Mentor is a member of an unidentified alien race who possess vast intelligence. Mentor's expanded mental faculties allow him to process vast amounts of information almost instantaneously. As a result, he is able to predict the most likely outcome of a particular future event with a great degree of accuracy. Mentor is also able to calculate the weakest point in a structural formation or a living being. With his opponents, this ability allows Mentor to defeat them speedily and with little wasted exertion.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 150
}