{
    "aliases": [
        "Thomas", 
        "Thorton", 
        "Junichi", 
        "The Wizard", 
        "others"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Years later, Mesmero started his criminal career by working for Magneto, using his power on Polaris to make her believe she was Magneto's daughter. During a Sentinel attack this version of Magneto was proved to be a robotic duplicate. Mesmero then attacked the X-Men and made them believe they were circus performers. However, the Beast managed to free the X-Men and Mesmero was defeated. Mesmero then tried to make money legally as a hypnotist in England. The Fenris Twins tracked Mesmero down and tried to force him into working for him. Mesmero used his powers on Excalibur, forcing the team to protect him from Fenris. Shadowcat freed the team from Mesmero's powers and Excalibur defeated Fenris. Mesmero then went to New York where he tried to hypnotize the city into doing his bidding. This endeavor was stopped by Spider-Man.Mesmero was then sent to a special prison where he was specially bound, until a doctor unwittingly freed him. Mesmero then hypnotized the doctors and tried to escape. Soon the U.S. Government sent Sentinels to capture Mesmero. Mesmero panicked and took several hostages at a local convention. The Canadian super team Alpha Flight soon arrived and attacked both the Sentinels and Mesmero. During the battle, Mesmero was overpowered by Alpha Flight and taken into custody.Later on, the Dark Riders attacked Mesmero, wanting to kill him. Mesmero used his powers on Gauntlet and the team were led to believe they had successful in killing Mesmero. Free from their pursuit, Mesmero travelled to to Canada. Using his powers to score free food in a small diner, he was again confronted by Alpha Flight. Though he did manage to dominate the team's minds, they broke free of his control and defeated him. Mesmero once again hypnotized local citizens at a mall but this time came back into conflict with the X-Men. Mesmero hypnotized them into believing that they were medieval warriors. However, the X-Men soon saw through the charade.The secret North American governmental agency Weapon X then contacted Mesmero and offered to enhance his powers if he worked for them. He agreed and he was used to control Sabretooth and keep track of Marrow. During this time, he became involved with Marrow, seducing her using his hypnotism. Enraged when she found out, she severely beat him, and the relationship has since been one of constant tension. Testing his enhanced power, Mesmero commanded a whole army of soliders to commit suicide. During several missions with Weapon X, his actions were the sole reason that the team achieved its goals.Mesmero's mother became very ill and summoned him. He arrived and tried to help her feel better, but he realized that her time had come. He then tried a last ditch effort to save her life by trying to hypnotize her into staying alive. However, she was immune to his hypnotic powers and died. Losing his mother, he lost confidence in himself and his powers began to slowly disappear. Weapon X's Director believed that Mesmero was no longer needed, and sent him to Neverland. During the transport, Agent Brent Jackson saved Mesmero's life   and helped him regain his confidence and thus his powers. Later, during a fight between the three Weapon X factions, the events of \"M-Day\" caused him to lose his powers.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Red irises surrounded by yellow\n", 
    "fighting": 1, 
    "firstappearance": "X-Men #49 (1968)\n", 
    "groupaffiliation": [
        "Formerly Weapon X", 
        "Demi-Men"
    ], 
    "hair": "Green\n", 
    "height": 70, 
    "id": "Mesmero", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unidentified mother (deceased), unidentified father (deceased)", 
    "occupation": [
        "Former agent of Weapon X", 
        "terrorist", 
        "professional criminal", 
        "carnival manager", 
        "stage hypnotist", 
        "psychoanalyst"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "Mesmero is capable of hypnotic mind control on a vast scale. His mind control powers are so powerful and advanced that he once took control of the Phoenix. It is unknown how many people he can hypnotize at one time, however he has hypnotized a entire army of men. His powers were enhanced by Weapon X and he is considered to be one of the most powerful mutants alive with almost unlimited mental power.", 
    "realname": "Vincent (full name unrevealed)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 180
}