{
    "aliases": [
        "August Star of Heaven", 
        "Ama-No-Kagaseo"
    ], 
    "citizenship": "Amatsu-Kami", 
    "content": "Armed with the weapon, Mikaboshi Conquered Yomi (the underworld) and its demons, using these to destroy many of the kami and absorb their powers. The survivors fled from Ama or went into hiding (Hotei Osho, one of seven gods of happiness, took refuge in China as Ho Ti), and Mikaboshi sought to conquer the Olympian gods. He kidnapped Alexander Aaron, the son of the war god Ares, and influenced the son to to try to usurp his father's mantle as Olympian war god. During his raid of Olympia, Mikaboshi mortally wounded Zeus. Ares ultimately brought his son to his senses, and the messenger gods of two pantheons, Mercury (Olympian) and Inari (Japanese), tricked the Greeks and surviving Japanese into allying despite their pride; the combined efforts of the water deities Poseidon and Ame-No-Mi-Kumari flooded Mikaboshi's underworld, defeating him.", 
    "durability": 1, 
    "education": "Extensively self-educated", 
    "energy": 1, 
    "eyes": "Gold (variable)\n", 
    "fighting": 1, 
    "firstappearance": "Thor: Blood Oath #6 (2005)\n", 
    "groupaffiliation": [
        "Amatsu-Kami (the Shinto gods)", 
        "ruler of the Skrull slave gods", 
        "formerly God Squad"
    ], 
    "hair": "Black (variable)\n", 
    "height": 0, 
    "id": "Mikaboshi", 
    "identity": "The general populace of Earth was unaware of Mikaboshi's existence.", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": "God Of Evil", 
    "placeofbirth": "Ama (The Primordial Void)", 
    "powers": "Mikaboshi is a demonic entity native to the Japanese, \"Land of the Dead,\" known as Yomi. He possessed demonic attributes with others of his race such as superhuman strength to an unknown degree, resistance to injury and an ability to tap into and manipulate magical energies. His most commonly used power is his metamorphic ability; although he can alter his shape, he is almost always represented as a being of black, shadowy energy with a mask for a face. He can reshape his limbs into razor-sharp blades, and assume the form of a fire-breathing serpent.", 
    "realname": "Amatsu Mikaboshi", 
    "significantissues": [
        "Thor: Blood Oath #6 (2005)", 
        "Ares #2- 'Ares: God of War, Part 2-5 (2006)", 
        "Incredible Hercules #117-120 'Secret Invasion: Part 1-4 (2008)."
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": "Variable\n"
}