{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A.", 
            "content": "While he awaited sentencing, Calvin was visited by Professor Charles Xavier and offered a path to redemption. Xavier extended an invitation to join his X-Men. Mimic took the offer. As an X-Man, Mimic became one of the best. The rest of the students were nervous around him at first because of his mimicking powers, but eventually they realized that by sharing their powers he could help them understand themselves better. He eventually became the X-Men’s leader and was an instrumental part of a golden age of peace between mutants and humans. Mimic’s home reality was a place where mutants became celebrities and used their powers for good.Taken from his reality, Mimic became unhinged from time. He was joined by his fellow Exiles and told by the Timebroker they were needed to fix the broken chains of reality. If they didn’t, their own realities would be changed and their lives destroyed. In Mimic’s case, the kidnapping attempt on Senator Kelly went horribly wrong - Kelly and 47 innocent bystanders were killed. Mimic would sit on death row, awaiting execution.On their first mission, the team looked to Mimic for guidance. As leader of the X-Men, he felt prepared for the role. Unfortunately in this reality Professor Xavier had become a revenge-driven homicidal maniac and Mimic was forced to kill him. Devastated by the event, Mimic realized his emotional attachments to his reality would hinder him in leading this team. He turned the reins over to Blink and acted as her second-in-command.This constant contact with one another led to a romance between them. Mimic taught Blink about the different worlds and heroes they might encounter - heroes who were never allowed to surface in Blink’s Age of Apocalypse. They eventually fell in love and constantly looked to each other for support. As the team went on more missions, Calvin began to become more and more embittered towards his situation. He hated the fact that he was constantly forced to fight people he had only known as heroes in his reality. Mimic eventually took this out on Blink and the two separated.Unfortunately, this separation came at an inappropriate time. Blink was almost killed in battle by a techno-organic virus. Mimic realized he still loved Blink but at the end of the mission the Timebroker sent her away and the Tallus was passed to Mimic. With Blink gone, Mimic resumed his role as leader. The toll on him was immense. Following the completion of a mission against a vampire version of the Avengers, the team was hit by a chaos spell, which sent them all spiraling into different realities. Mimic was sent to an Earth conquered by the Brood and spent four years there during which he was implanted with Brood eggs on three different occasions. The healing factor he mimicked from Wolverine, was able to fight off the infection for the most part.The team was reunited and sent on their next mission. Mimic still had a Brood egg in his system but his healing factor was able to prevent it from taking him over. Unfortunately, in the course of battle with this reality’s enraged Thing, Mimic was beaten severely. With his healing factor in overdrive, Mimic was unable to fight off the infection. The Brood egg took control and Mimic fell under the sway of the Brood Queen within him. He fought his team with all of their abilities.During the conflict, Mimic knocked a building over onto some innocent bystanders. In an effort to save them, Sunfire was crushed by the falling rubble. Mimic continued to fight until an antidote to the Brood infection was given to him. He reverted to normal.Morph found the body of Sunfire and was enraged. He told Mimic that if he knew he was infected and a danger to the team, he should have killed himself. Mimic was devastated by what he had done. At the same moment Blink returned to the team as a replacement for the deceased Sunfire.In the next reality, the Exiles were told they would have to fight their reality-hopping counterparts, Weapon X. Morph was still angry with Mimic for his carelessness and the two walked away from each other. The returned Blink followed Mimic, comforted him and reminded him he had no control while he was under the Brood's influence. In the ensuing battle with the Weapon X team Mimic fought the evil Hyperion. The battle was brutal and Mimic was almost beaten to death before being saved by his teammates. The Exiles survived the conflict and Morph forgave Mimic for what happened to Sunfire, realizing the Brood influence was responsible for his actions.The team moved on, as they always have, and Mimic adopted a new mindset. He confided in Blink that he needed to change his ways. He was becoming too brutal and too quick to use violence to solve the team's situations. His mentor Charles Xavier taught him a different way and he was going to start living it. Mimic decided to make a difference in the realities the team traveled to - he swore to never ever take another life. While it may be difficult for him to change his ways with the tasks the Exiles are given, it appears he will give it a try.After the battle the team realized that Mimic was so badly injured that his healing factor wasn't strong enough to take care of the damage done to his body. Luckily he was mimicking Colossus' form at the time he was injured and could survive in that form indefinitely. Trying to buy Mimic more time while they searched for a cure, Blink had Mimic put into stasis while the team went to a reality known as “Monster World” to retrieve a genetic healing serum from the Dr. Curt Conners of that reality. Blink, Sabretooth, and Morph traveled to this reality and managed to get the serum but only after a lengthy scuffle with Fin Fang Foom. Meanwhile Heather Hudson had enlisted the help of an alternate Stephen Strange to help determine a cure for the injured Mimic. Doctor Strange noticed that the former Weapon X operative Deadpool, who was being held in stasis, had just recently registered as living again. Freeing him out of curiosity and a sense of goodwill, Deadpool almost immediately killed the good doctor and had one of the Timebreakers free the Weapon X She-Hulk. Beak had the Timebreakers free Mimic as well, and he then mimicked Deadpool's healing factor and with the help of She-Hulk defeated Deadpool. The downside was that Mimic was left horribly disfigured due to the nature of Deadpool' healing factor.Seeking to return Beak to his home reality the Exiles again arrived on Earth-616 only to find it had been altered into the House of M reality. Beak, desperately searching for his girlfriend Angel, inadvertently entangled the Exiles into a confrontation with the reality-warping Proteus. After several scuffles Proteus took over the body of Mimic and fled to the New Universe reality. The Exiles followed and left Beak behind. Shortly after the Exiles left, Beak and Angel were changed into humans due to an insane Scarlet Witch attempting to get vengeance on Magneto and Quicksilver.Following Proteus the Exiles encountered Starbrand, D.P.7, and Nightmask. Proteus left Mimic’s body, which he had burnt out. He was then placed inside the wall of Exile casualties in the Crystal Palace.", 
            "durability": 6, 
            "education": "College graduate", 
            "energy": 6, 
            "eyes": "Blue\n", 
            "fighting": 6, 
            "firstappearance": "Exiles #1\n", 
            "groupaffiliation": [
                "Formerly Exiles", 
                "X-Men", 
                "Brotherhood of Evil Mutants"
            ], 
            "hair": "Blond\n", 
            "height": 0, 
            "id": "Mimic_(Exiles)", 
            "identity": "Publicly known", 
            "intelligence": 6, 
            "knownrelatives": "Ronald Rankin (Father, deceased)", 
            "occupation": [
                "Adventurer", 
                "reality traveler"
            ], 
            "placeofbirth": [
                "New York", 
                "New York"
            ], 
            "powers": "Mimic can copy the powers of other mutants around him. This ability is limited to five powers at a time, and at only half the potency of the original possessor of that power. Mimic was using the powers of Cyclops, Colossus, Northstar, Wolverine, and Deadpool. He also has some residual telepathy from when he mimicked the abilities of Jean Grey. \nHe has copied the abilities of these people in the past: Beast, Angel, Professor X, Jean Grey, Iceman, and numerous others.\n\nSpecial Limitations: The powers Mimic copies are half the strength of their originator's abilities. He can also only copy five powers at a time.", 
            "realname": "Calvin Rankin", 
            "speed": 6, 
            "strength": 6, 
            "universe": "Earth-12", 
            "weight": 225
        }
    }
}