{
    "add": {
        "doc": {
            "aliases": "Love", 
            "citizenship": "Inapplicable", 
            "content": "She first appeared to the asgardian known as the Enchantress who was seeking true love. However in order to deem Amora worthy of her gifts Love tested her which pitted the Enchantress against the Defenders. Having failed the test, Love abandoned the Enchantress and returned to the cosmos.Sometime later when Thanos of Titan had the Infinity Gauntlet in his possession Love, and Master Hate were among several other cosmic entities who wished to remove the power from Thanos. During the battle that followed both Master Hate and Mistress Love were turned to statues alongside the other cosmic entities. However after Nebula gained control of the glove, Love and the other entities again foguth and were once again defeated. However once Adam Warlock managed to wrest control of the glove from Nebula they were returned to normal once more. Again Love and Master Hate attended a hearing presented by Eternity and the Living Tribunal and other cosmic beings to decide whether Adam should continue to have the gauntlet or to take it away from him. The Tribunal decided to instead to spread the Infinity Gems to others. After the hearing ended Love and her counter-part Master Hate left.Later a girl had fallen in love with the Silver Surfer and Love appeared to her. Sympathetic to her plea Love turned her into Avatar, an avatar of love. However Loves opposite Master Hate was watching and offered Avatar additional strength. She accepted and became even more powerful. She confronted the Silver Surfer and was eventually defeated by him.Later still Thanos again gained immense power when he gained control of the Heart of the Infinite and was confronted by Love, Hate, and other cosmic entities. However due to his emense power she along with the other cosmic entities were easily defeated. Thanos then destroyed the universe, but then had a change of heart and recreated it and everyone in it. Love and the other cosmic entities were among those who where recreated.", 
            "durability": 7, 
            "education": "Experience", 
            "energy": 6, 
            "eyes": "Variable\n", 
            "fighting": 1, 
            "firstappearance": "Defenders #107\n", 
            "groupaffiliation": "Former mistress of Avatar", 
            "hair": "Variable\n", 
            "height": 0, 
            "id": "Mistress_Love", 
            "identity": "Known to few people on Earth", 
            "intelligence": 3, 
            "knownrelatives": "Master Hate (\"brother\"), Avatar (Alaisa Pethnan) (creation)", 
            "occupation": "Cosmic Entity who embodies love", 
            "placeofbirth": [
                "Inapplicable", 
                "possibly the Dimension of Manifestations"
            ], 
            "powers": "Mistress Love has been said to be one of the most powerful entities in the universe. is able to control emotions which relate to love in any form in any being, or even on a cosmic scale. She can even manipulate those who are experiencing the emotion of love or infatuation. She can influence their actions and the decisions that they make. She appears to those in a form in which they find appealing, which is called an M-Body. She can also manipulate and control cosmic energy to various degrees on a massive scale. She can use these cosmic energies to create barriers, hurl bolts of cosmic energy, grant powers onto others, and various other tasks.", 
            "realname": "Inapplicable", 
            "speed": 2, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": "Variable\n"
        }
    }
}