{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "Hyde first joined with Cobra to gain revenge on Thor, but despite their defeat, they began a long partnership together. The next teamed together on behalf of Thor’s archenemy, Loki. On his urging, the two kidnapped Blake’s nurse and love interest, Jane Foster but were again defeated by Thor. The pair crossed the paths of many heroes, most notably Daredevil and Spider-Man. Hyde only parted company once, teaming with the Scorpion against Captain America and the Falcon. After yet another defeat from Daredevil landed the pair in Ryker’s Island prison, the Cobra used his powers to escape, willingly leaving Hyde behind. Enraged, Hyde swore vengeance on his former partner.He later was seen in the employ of Batroc the Leaper.  They succeeded in hijacking a Roxxon Oil supertanker and capturing Captain America, whom they chained to the prow of the ship. The tanker was filled with 50,000 tons of liquefied natural gas. As it cruised through the harbor, Batroc and Hyde set it on a collision coarse with the docks of New York City. The resulting explosion would likely lead to the total destruction of the entire metropolis. Batroc only wanted a huge ransom for the ship and Captain America. Hyde, however, wanted to go through with the plan and cared nothing for the money: he simply wanted Cap and the rest of New York City's population (particularly Cobra) dead. When Batroc realized this, he secretly loosened the chains holding Captain America, who freed himself and dove into the harbor. As Hyde was busy steering the ship, Batroc attacked him from behind. The former partners began a fight to the death. As Hyde began to squeeze the life out of Batroc, Captain America boarded the ship and attacked Hyde. During the fight, Hyde broke a pipe and was hit by a high-pressure stream of liquefied gas. Covered by a thick coating of the freezing liquid, Hyde fell over the side and sank in the harbor. Captain America tried to find him, but Hyde was gone. Cap caught Batroc, who tried to escape during the confusion, and returned the supertanker to Roxxon officials.He returned again to stalk the Cobra, who was at this time seriously fearing for his life. Hyde was stopped by Spider-Man, after a long and ferocious battle, by getting knocked out a high window, plummeting to the street below. The indomitable Mister Hyde was not killed, but merely stunned. He and the Cobra were then easily captured and taken into police custody. Another similar rampage was stopped yet again by Spider-Man with the help of the Black Cat.Baron Zemo later recruited Mister Hyde for his Masters of Evil. While the Avengers were away, Zemo led the Masters of Evil in a successful take-over of the Avengers' Mansion and captured Jarvis, the butler. Zemo, in particular, was used to savagely beat Hercules into a coma. Zemo also turned the hostages (Jarvis, the Black Knight, and Captain America) over to the cruel hands of Mister Hyde, who started beating the butler to death. Hyde was having great fun, until the Black Knight managed to free himself and Cap, fighting Hyde until the rest of the Avengers arrived and brought the Masters of Evil down.In the meantime, Cobra had become the leader of the Serpent Society. As part of re-inventing himself for this new position, Cobra sought out the one person that he still feared above all-- Mister Hyde. After going one-on-one with his former partner, Cobra succeeded in besting him. Flushed with new confidence, he renamed himself King Cobra, and the long grudge match between the two seemed to be over.When Mister Hyde ran afoul of the monstrous Hulk, he received a head wound and Calvin Zabo found himself unable to transform into Hyde. Zabo made his way to a Manhattan bar, where he happened to insult a waitress. The huge leader of a biker gang saw the incident, and he threw Zabo out of the bar. Determined to have revenge, Zabo reentered the bar and hit the biker over the head with a bottle. This time Zabo threw himself out the window in an attempt to escape the enraged bikers. Zabo fled to a nearby parking garage and hid. Meanwhile, Dan Ketch (then, Ghost Rider) arrived at the garage. Zabo was able to become Mister Hyde once more, but Ghost Rider was on hand to save the bikers and innocent bystanders from his rampage. As the police arrived, both Hyde and the Ghost Rider vowed revenge, going their separate ways.At some point earning the enmity of the criminal Eel, Hyde unknowingly found himself a target of revenge. Hyde had befriended a young runaway, Angela Paris, but the Eel secretly murdered her, framing Hyde.  Mister Hyde was given counsel by the lawyer Matt Murdock (a.k.a. Daredevil, whose powers told him Hyde was innocent but whose conscious refused to allow the villain to be convicted of something he didn’t do. As Daredevil investigated, he uncovered the Eel’s involvement and managed to take the Eel into court to clear Hyde’s name. Hyde was released, but Daredevil confronted him and warned him that he would be forever watched by the vigilant hero.", 
    "durability": 5, 
    "education": "Unspecified doctorate of medicine", 
    "energy": 3, 
    "eyes": "Brown\n", 
    "fighting": 4, 
    "firstappearance": "Journey into Mystery #99 (1963)\n", 
    "groupaffiliation": [
        "(formerly) Masters of Evil", 
        "partner to Cobra", 
        "Jester", 
        "Scorpion"
    ], 
    "hair": "(Zabo) Grey; (Hyde) Brown\n", 
    "height": 0, 
    "id": "Mister_Hyde", 
    "identity": "Publicly known", 
    "intelligence": 3, 
    "knownrelatives": "Daisy Johnson (daughter)", 
    "occupation": [
        "Criminal", 
        "former medical scientist"
    ], 
    "origin": "Journey into Mystery #99-100 (1963)", 
    "placeofbirth": [
        "Trenton", 
        "New Jersey"
    ], 
    "powers": "By consuming different mixtures of his transformation potion, Calvin Zabo can transform back and forth from his alter-ego of Mister Hyde. The chemical process is hormonal in nature, causing the cells of his anatomy to instantly manufacture mutated hormones that induce a physical transformation encompassing his entire figure. Miraculously, over 200 pounds of bone and muscle tissue are added to Zabo's body. After about 30 seconds of excrutiating pain, the entire metamorphosis is complete. Hyde and Zabo have different finger prints, while Hyde's facial structure is distorted to the point that he is frozen in a perpetual sneer. Zabo's personality is also distorted. As Hyde, he is overcome with savage anger and bestial ferocity. His body’s dense flesh provides some degree of protection and he possesses vast superhuman strength and stamina.", 
    "realname": "Calvin Zabo", 
    "speed": 3, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 185
}