{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Unknown", 
            "content": "Janet Lyton and Grant Whitaker accidentally revived Modred in recent years: When a landslide trapped them all inside the mountain, Modred used his powers to clear a path to freedom. Though he hoped to make a fresh start, the mystic found the modern world strange and confusing and ended up fighting the police. The Other, realizing Modred was distracted and weakened, revealed itself and attacked, but the mystic was able to defeat the Other, temporarily freeing himself from Chthon's influence.For a brief time Modred's good nature overruled his dark side. He assisted Spider-Woman and the Thing in battling creations of the false Merlin and worked with Canadian adventurer Puck (Eugene Judd) to defeat the Brass Bishop. However in spite of his beast intentions, Modred's mind and soul succumbed once again to Chthon's influences and he misled the Scarlet Witch in order to lure her into Chthon's prison under Mount Wundagore. Modred then subdued the Scarlet Witch and gave her body to Chthon. The Scarlet Witch had been born on Mount Wundagore, which linked her to Chthon. Because of this link, the Elder God was able to partially possess the Witch's body and began to manifest on the material plane. Several of the Witch's teammates from the Avengers arrived and managed to banish Chthon. The battle left the Witch's adoptive father, Django Maximoff, dead and left Modred with the intellect of a child. For a brief time before they were given to the Romani (\"gypsies\"), the Scarlet Witch and her brother were cared for by a cow that had been involved into an intelligent humanoid by the High Evolutionary. Bova, as she was called, was still living on Wundagore Mountain, and she volunteered to care for the helpless mystic. Modred was content to stay with Bova and play with his toys. Though he remained in this child-like state during encounters with the Thing, the Puppet Master, Alicia Masters, he unconsciously retained a fraction of his magical power. He even unconsciously helped the Scarlet Witch by sending a mystic warning to her about the immanent arrival of her father Magneto.Soon after that incident, Bova was injured and Modred wandered away. He was mystically drawn back to his native England. As he approached his homeland, his intellect and power returned, as did his desire to complete the very task that had led to his down fall. He wanted to defeat Merlin. Since Modred assumed that the \"Mad Merlin\"\" and the \"True Merlin\" were one in the same, he targeted the real Merlin's servant on Earth: Captain Britain (Brian Braddock) Modred defeat Merlin's champion and took possession of Captain Britain's magically empowered costume. With the costume's power enhancing his own, Modred also defeated the visiting Captain America (Steve Rogers). Working together, the two beaten Captains defeated the misguided mystic by turning Modred's own power against himself. The true Merlin arrived and took Modred to Otherworld for safekeeping. Though his body was not able to leave Otherworld, Modred was able to briefly gain psychic control over Captain Britain's Excalibur teammate,Phoenix. Excalibur and the cosmic hero Quasar defeated Modred and cast him off into a distant dimension.With the seeming death of the true Merlin, the dimensional barriers weakened and Modred was able to return to his home dimension. The time and distance had restored Modred's original integrity and the mystic was determined to confront Chthon and regain his lost soul. After observing the Darkhold Redeemers, a group of normal humans and mystics who were fighting against the power of the Darkhold, Modred was inspired to join them. He declared himself the \"leader\" of the Redeemers and helped the group fight the N'Garai demons and the feral villain Sabretooth. Though he seemed intent on doing the right thing, Modred's sense of right and wrong had been impaired by his mind wipe and his years of servitude to Chthon. When a misunderstanding resulted in a battle between the Darkhold Redeemers and Doctor Strange, Strange bound Modred to the island of Maui. This prevented Modred from countering the Darkhold's \"Demogogorge\" spell, which transformed the hero Blade into the monstrous Switchblade. Escaping Strange's spell by teleporting sand from Maui with him, the mystic hoped to destroy Switchblade, but instead Switch killed Modred. When the Darkhold Redeemer Louis Hastings cast the Demogorge's counter-spell from the Darkhold, she returned Blade to normal and restored the lives of all of Switchbalde's victims; thus Modred's death was short lived.After Modred's resurrection, the Other's servant, the Dwarf, offered him a chance to regain his own soul if he would obtain a pure replacement soul for Chthon. Modred agreed, and in an abbey in Bath he discovered a blind ancient holy woman with the pure soul he needed to trade with Chthon. He offered to restore the old woman's youth and to return her lost love to her in exchange for her soul. The old woman agreed, and Modred thought he had beaten Chthon until he saw the old woman's now-youthful face and realized that she was his long-lost love Janice. With her eyes restored, Janice realized that this man was her lost love, Modred. The Other appeared to take Janice's soul, but Modred gave his own soul instead and Modred, was enslaved by Chthon once again. Modred held Janice as she died in his arms. Modred returned to the Darkhold Redeemers and began training Louise Hastings' son Jinx in the magical arts.When the demonic Lilin attacked the Darkhold Redeemers and their magically powered allies, the Midnight Sons, Modred defended them, but his teammates had become distrustful of his erratic behavior. When the Lilin's mother, demon-goddess Lilith, and her consort Zarathos joined in the battle; Modred's former \"friends\" were convinced he was secretly behind the attacks. Jinx even accused his former mentor of killing Louise Hastings, though the vampire Morbius had actually committed the crime. Wishing to avenge his mother, Jinx attacked Modred. When the two battled each other into mutual unconsciousness, Lilith took them captive. Modred managed to escape and led the Redeemers to the home of an ancient and powerful clairvoyant called the Truthsayer. Just as Truthsayer revealed to Modred that Chthon was about to enter the Earthly realm, she was attacked by her evil shape shifting sibling, Metarchus. Modred worked with the Redeemer to defend Truthsayer, but when Metarchus took on Modred's form to confuse the heroes, Modred took advantage of the confusion and killed Truthsayer himself. The Redeemers thought the shape shifted Metarchus had killed Truthsayer, never realizing that Modred, once again in the thrall of Chthon, had murdered the wise women. Modred wanted to prevent the Redeemers from learning that the Elder God was about to be reborn on the Earth through the womb of their fellow Redeemer, Victoria Montesi. Following Louise's funeral, Modred abandon Jinx and the rest of his allies.", 
            "durability": 1, 
            "education": "Unknown", 
            "energy": 1, 
            "eyes": "Blue (white when using magic)\n", 
            "fighting": 1, 
            "firstappearance": "Marvel Chillers #1 (1975)\n", 
            "groupaffiliation": "Formerly the Darkhold Redeemers", 
            "hair": "White\n", 
            "height": 71, 
            "id": "Modred_the_Mystic", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Lady Janice (betrothed, deceased)", 
            "occupation": [
                "Mystic", 
                "unwilling servant of Chthon"
            ], 
            "origin": "Unrevealed", 
            "placeofbirth": "6th Century England", 
            "powers": "Before his encounter with the Darkhold, Modred was an apprentice mage able to use only minor magic spells. Once the Darkhold had corrupted him and he had become connected with Chthon, Modred's mystical abilities increased exponentially. Modred has displayed the power of telepathy and the ability to dominate the minds of others. He has acute mystical senses that can detect the presence of another wizard or the presence of a magically enchanted place or item. He seems to be especially aware of magic that is in some way connected with his native country of England or connected to Chthon and the Darkhold. Modred has also displayed the powers of flight and teleportation. At times, he has also displayed the powers of flight and teleportation. At times, he has even been able to transport himself interdimensionally. Modred has the ability to cast realistic illusions, fire bolts of mystical energy and create magical energy shields. Since his contact with the Darkhold, Modred has become especially adept at manipulating the elements of fire, earth, wind and water. Modred is also capable of casting any of the vast number of powerful spells within the Darkhold. On rare occasions, he has utilized spells that tap into the energies of mystical entities other than Chthon, such as Cyttorak and Munipoor.", 
            "realname": "Modred", 
            "significantissues": "Official Handbook Bibliography", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 175
        }
    }
}