{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "Washing up on the shores of Monster Island, he explored a series of caverns until he at last discovered Subterranea, a network of tunnels running beneath the surface of much of the Earth; however, he was caught in an earthquake and almost blinded in the mysterious Valley of Diamonds. Undaunted, Elder explored the vastness of Subterranea and carved out a kingdom of his own. His early activities may have influenced various subterranean monster incursions that plagued the U.S. and other nations during the late 1950s and early 1960s. He discovered and mastered Deviant technology, proving himself a rival to the underground reigns of the monstrous Two-Headed Thing and the immortal Tyrannus, and later fighting Spragg the Living Hill. Slowing his own aging through unknown means, the Mole Man eventually won rulership of the so-called Moloid race, docile servants abandoned by the Deviants, as well as of many of the Mutates once used for conquest or sport by their former masters.In recent years, having achieved a satisfactory power base, the Mole Man launched his first known attack on the surface world, dispatching his Mutates to destroy power plants in preparation for an all-out invasion; however, his campaign had only begun when he attracted the attention of the newly-formed Fantastic Four, who entered Subterranea via its Monster Island entrance and defeated the Mole Man and his monsters, destroying the entrance in the process. Regrouping, he led the Fantastic Four into a trap while he prepared to continue his assault on humanity by sinking entire cities, but was again defeated. He next sank buildings in New York City, successfully taking the Invisible Girl hostage to prevent the Fantastic Four from opposing his intended world conquest; the Fantastic Four rescued her, though she suffered a head injury and was only saved by emergency surgery.He was also one of the villains that Doctor Doom used to attack Reed and Sue's wedding. He burst through the floor with his Moloids, but was driven back when Professor X called his X-Men to fight them, along with the Thing's help.The Mole Man subsequently battled the Avengers, both alongside the communist Red Ghost and assisted by his giant Minotaur. A closer enemy was his rival Tyrannus, who ruled a second servant race, the Tyrannoids, and sought the Mole Man's territory for himself. Both underground rulers used surface heroes, such as the Hulk and X-Men, as pawns in their war, but the Mole Man soon turned his dimmed eyes back to conquest; he sought to blind humanity as he imagined it had been blinded to his accomplishments. Mistakenly assuming Project: Earthdig, intended to bury nuclear waste deep within the planet, was an assault on him, the Mole Man joined forces with Dr. Erik Gorbo (the Monster-Ape) against Captain America and plotted another surface assault before learning the truth. The Mole Man formed an alliance with the Netherworld's Queen Kala, whom he hoped to romance, and even managed to enslave Tyrannus; but Kala ultimately betrayed him to Tyrannus, who betrayed her in turn, leaving the Fantastic Four to triumph over the trio.Seeking to spare others the scorn he had suffered, the Mole Man united his old and new worlds by welcoming some of surface society's rejects into Subterranea as his Outcasts, empowering four of them - Boulder, Digger, Landslide, and Water Witch - as Super-Outcasts. When Kala led the fiery Lava Men in an attack on his kingdom to regain access to the Fountain of Youth, the Mole Man agreed to a contest between his Outcasts and her operatives, Olympic athletes whom she granted high-tech weaponry and forced to assist her. The conflict drew the Hulk and Spider-Man into the fray, fighting for Kala and the Mole Man, respectively. Kala failed and was abandoned by her army, but the Mole Man took pity upon her and renewed their relationship. His struggles continued against the likes of the Galadorian Spaceknight ROM and the alien Dire Wraiths, as well as Heroes for Hire Power Man (Luke Cage) and Iron Fist. Mellowing somewhat, he soon took Tyrannus' abandoned Tyrannoids under his wing as well. He and Kala ruled peacefully until would-be Messiah Alden Maas, in his mad attempt to expand the Earth, unleashed magma flows in Subterranea, killing many of its inhabitants. Abandoned by Kala and half-mad with grief and rage, the Mole Man sought to raise a new continent for his people, regardless of the devastation such a tectonic shift would cause. The Thing briefly joined the Outcasts during a period of extreme depression, befriending the Mole Man and remaining unaware of his secret agenda, but he left with the Fantastic Four after learning the truth. Lost in holographic illusions of the surface society that had rejected him so long ago, the Mole Man barely noticed when the Fantastic Four halted the tectonic procedure, burying him and his equipment beneath tons of rock.Months later, having regained his sanity, the Mole Man decided it was time for peace with the surface world, only to be attacked by Fantastic Four clones created by Aron the Rogue Watcher, renewing his desire for war. Following an encounter with the Skrull De'Lila and the replacement Fantastic Four - Ghost Rider, Hulk, Spider-Man, and Wolverine - he found his Moloids and Tyrannoids under attack by the Lava Men, all of whom had been attacked in his absence and partially sterilized by the High Evolutionary's forces; with the Fantastic Four's help, he put an end to the hostilities and eventually united the tribes under his rule. During a battle with old foe Spragg, he sought to claim She-Hulk as his bride, but was instead briefly turned into an actual mole. When the Deviants began to exert their power in Subterranea once more, he protected his domain alongside the returned Tyrannus and Grotesk, last survivor of the Gor-Tokians, yet another underground race. Disaster was averted by the Avengers, and Kala returned to the Mole Man's side as his fiancée. Hoping to win more allies, he offered Monster Island as sanctuary to the misfit heroes of the short-lived Infinity Watch, but an immense tidal wave caused him to withdraw from Monster Island, severing his ties with the Watch.", 
    "durability": 1, 
    "education": "Unrevealed; self-educated in Deviant technology", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #1 (1961)\n", 
    "groupaffiliation": [
        "Former ally of Tyrannus", 
        "Grotesk", 
        "Red Ghost"
    ], 
    "hair": "Gray\n", 
    "height": 58, 
    "id": "Mole_Man", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Kala (fiancée)", 
    "occupation": [
        "Ruler of Subterranea", 
        "former explorer"
    ], 
    "origin": [
        "Fantastic Four #1 (1961)", 
        "Marvel Universe #4-7 (1998)"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "The Mole Man possesses heightened senses of hearing, smell, and touch; although almost blind, he has somehow developed a compensatory radar sense enabling him to detect objects within his vicinity. Almost a century old, he has the appearance of a man roughly half his age and the vitality of one even younger.", 
    "realname": "Harvey Rupert Elder", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 165
}