{
    "aliases": [
        "Jake Lockley", 
        "Steven Grant", 
        "Fist of Khonshu", 
        "Yitzak Topol"
    ], 
    "citizenship": "U.S.A. with criminal record (pardoned)", 
    "content": "Disgusted, Marc helped Dr. Alraune's daughter Marlene escape Selima, but Bushman caught Spector in the act. After Bushman executed the people of the town, Spector attacked him, only to be defeated by Bushman, who deposited the unconscious Spector in the desert and left him to die. Spector dragged himself through the sands to the tomb unearthed by Dr. Alraune and was found by Marlene and her servants. They brought him into the tomb, placing his body at the foot of a statue of the moon god, Khonshu. Marc was pronounced dead, but as Marlene wept over his body, he suddenly arose, alive. Spector believed that Khonshu had restored him to life to serve as the moon's knight of vengeance. Donning a cloak taken from Khonshu's statue, Spector destroyed Bushman's forces in Selima, but Bushman escaped when Marc was distracted by Marlene, who had followed him back to the town. Frenchie arrived to help them, and Spector collapsed into Marlene's arms, exhausted.Aided by Marlene and Frenchie, Spector honed his abilities to wage war on crime. Using his mercenary profits, Marc created the identity of New York millionaire Steven Grant to help him mingle with influential people. He also created the identity of Manhattan cab driver Jake Lockley to make contacts with people on the streets. As Lockley, he befriended the homeless Bertrand Crawley, his main street contact, and Gena Landers, a coffee shop owner whose sons Ricky and Ray helped perform investigative work for him. Marc eventually shared his secrets with Crawley and the Landers family. Marlene, now Marc's lover, came to regard him as Steven Grant, and he suppressed his life as Spector. Although his multiple identities threatened Marc's sanity, Marlene helped ground his psyche. She also designed the Moon Knight costume for him, while Frenchie designed the first Mooncopter, serving as Moon Knight's pilot. Marc brought the statue of Khonshu back to New York, still believing in the moon god's power.Moon Knight faced his brother again when Randall went on a killing spree in New York, slaughtering nurses with a hatchet. Marlene bravely posed as a nurse to draw him out for Marc, and Randall nearly killed her. Moon Knight stalked Randall, who was seemingly impaled upon a broken tree, but Randall had actually left an imposter to take his place. Marc eventually learned that his friend Amos Lardner had died trying to escape from the CIA's Operation: Cobra. While investigating, Spector was attacked by Amos's brother James, whom the project had brainwashed into becoming \"Cobra\". Moon Knight was able to short-circuit the technology controlling Lardner, who then turned on his controllers, killing them along with himself.Moon Knight faced other menaces such as the Slasher, a man slaying homeless people in an effort to find his father (who turned out to be Crawley); the Midnight Man, an art thief; Morpheus, a man able to control people through their dreams; Stained Glass Scarlet, a nun who became a vigilante after being forced to kill her criminal son; Daredevil's enemy the Jester; Arsenal (Nimrod Strange) and his Third World Slayers; and the satanic cult the Left Hand Path and its leader, Morning Star, whose goals led to another encounter with the Werewolf. Bushman returned to torment Spector by capturing the statue of Khonshu and destroying it. With the statue gone, Spector went insane, believing he needed Khonshu's guidance. When Marlene told him she had hidden the original statue and that Bushman had only destroyed a copy, Spector regained his sanity and defeated Bushman. It was only afterward that he thought to ask Marlene if she had told him the truth, but she observed that either way, it didn't matter.Moon Knight suffered another internal crisis when he faced Carson Knowles, a candidate for mayor who used the identity of Black Spectre to forcibly coerce people of influence in New York to support his campaign. Knowles had been inspired by Moon Knight to don his costume, noting how Moon Knight was feared by others because of his mask. In his first encounter with the Black Spectre, Moon Knight unmasked him, but was subsequently unable to prove that Knowles was the Black Spectre. As even Marlene began to doubt him, Moon Knight's sanity began to fray, until he turned again to the statue for guidance; he was able to draw the Black Spectre into another fight and unmask him on television, vindicating himself.Moon Knight stayed with the Avengers for awhile, and was gradually accepted into their ranks; but Khonshu was responsible for influencing Spector to join the team, as Spector had no interest in being an Avenger. Marc became romantically involved with Tigra, much to the disgust of Khonshu, who viewed her as a creature of the day. After Hawkeye's wife, Mockingbird, tried and failed to conceal her role in the death of the Phantom Rider (who had raped her), the couple broke up their marriage, and Moon Knight joined Tigra and Mockingbird in leaving the Avengers since all three of them believed the team's rules against killing were wrong. The three ex-Avengers formed a group of their own for a time, and helped Giant-Man (Bill Foster) escape the High Evolutionary. When the Phantom Rider's vengeful ghost haunted Mockingbird, the trio turned to Hellstorm, who revealed that Khonshu's spirit had inhabited Moon Knight's body, and drove him out to help defeat the Phantom Rider. Khonshu left the earthly plane to battle rival god Seth thereafter, leaving Moon Knight without a reason to return to the Avengers.Returning to New York, Spector reconciled with Marlene and embarked on new adventures, encountering the thief Midnight, son of the Midnight Man. Midnight tried to become Moon Knight's partner, but Moon Knight never took him seriously. Spector's past came back to haunt him when he was captured by the mercenary Silver Sable and brought back to Bosqueverde, now a democracy. Spector was to be tried for Dominguez's murder, but he convinced the new president, Silva, to release him in exchange for hunting down Rodrigo Raposa. Moon Knight succeeded in bringing Raposa to justice, finally exorcising a demon from his past. Returning from Bosqueverde, Spector learned that Midnight had impersonated him in his absence and run afoul of the Secret Empire, who seemingly slew Midnight and transformed him into their cybernetic agent. Moon Knight joined Spider-Man, the Punisher, Darkhawk, Nova, and Night Thrasher in opposing the Secret Empire, and Midnight apparently died when the Empire's base was destroyed.Learning that Randall was still alive, Moon Knight joined the Punisher in hunting him. Randall, now called Shadowknight, fought his brother in an effort to claim the mantle of the Moon Knight. Marc finally slew Randall by knocking him off of a building. During this encounter, Marc learned that Khonshu was a god of justice, not only vengeance. He reinvented his Moon Knight identity, creating a new corporate image for himself through the company Spectorcorp. He moved his base to a high-tech office tower called \"Shadowkeep\", where he would meet with holographic representations of various special agents in what he called the \"Shadow Cabinet\". He also donned protective adamantium armor, and upgraded his weaponry.But as before, death could not claim Marc Spector for long. Apparently again awakened by Khonshu, Spector was reunited with Marlene and Frenchie, and set out to oppose Morpheus, Bushman and Black Spectre, who had all become affiliated with the Egyptian god Seth, enemy of Khonshu. Black Spectre and the others tried to destroy the United Nations, but Khonshu guided Moon Knight against them, thwarting Seth's plan. Subsequently, Moon Knight learned Daredevil was assembling a team of heroes to capture the Punisher. Eager to help, he offered to finance a headquarters for the unnamed team (\"Marvel Knights\"). He joined the group against Cloak (controlled by Nightmare) and a teaming of Bengal, Tombstone, Big Ben and Bullet. Finally, the team's base was invaded by Shang-Chi's enemy Zaran, who struck down Moon Knight with several of his miniature sais. Moon Knight's teammates brought him to safety while their base was blown up by agents of Fu Manchu. Seriously wounded by Zaran, and having lost significant money in the base's destruction, Spector was forced into retirement.However, Moon Knight has since recovered from his wounds and resumed his activities. He was among many former Avengers who briefly rejoined the team to fight the effects of the Scarlet Witch's out-of-control hex power.", 
    "durability": 4, 
    "education": "High-school graduate", 
    "energy": 1, 
    "eyes": "Dark brown\n", 
    "fighting": 3, 
    "firstappearance": "Werewolf by Night #32 (1975)\n", 
    "groupaffiliation": [
        "Secret Avengers", 
        "formerly Daredevil's Unnamed Super-Hero Team", 
        "Avengers (West Coast)", 
        "Defenders associate", 
        "the Committee", 
        "CIA", 
        "U.S. Marines"
    ], 
    "hair": "Brown\n", 
    "height": 74, 
    "id": "Moon_Knight", 
    "identity": "Known to S.H.I.E.L.D. authorities", 
    "intelligence": 3, 
    "knownrelatives": "Elias Spector (father, deceased), Mrs. Spector (mother, deceased), Randall Spector (brother, deceased), Seth Phalkon (alleged great-great grandfather)", 
    "occupation": [
        "Vigilante", 
        "Adventurer", 
        "entrepreneur", 
        "former cab driver", 
        "mercenary", 
        "CIA liaison", 
        "U.S. Marine commando", 
        "and heavyweight boxer"
    ], 
    "origin": "Moon Knight #1 (1980)", 
    "placeofbirth": [
        "Chicago", 
        "Illinois"
    ], 
    "powers": "Moon Knight gains enhanced strength, endurance, and reflexes at night, reaching his pinnacle during a full moon, and sometimes has prophetic visions.", 
    "realname": "Marc Spector", 
    "speed": 3, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 225
}