{
    "aliases": [
        "Meteorite", 
        "Kate Sorenson", 
        "Ms. Marvel"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Karla worked briefly for the Corporation, controlling the Hulk and manipulating General \"Thunderbolt\" Ross into a nervous breakdown. She continued to pursue greater power, stealing Curt Connors' Enervator and searching the moon's surface for further moonstone fragments. First Egghead and then Baron Zemo recruited Moonstone for their Masters of Evil, and she aided each against the Avengers. After the last of these fights, she decided to serve out her prison term and give up her criminal life. However, when Zemo formed a group of villains to masquerade as heroes, he broke Moonstone out of the Vault and she returned to villainy as the Thunderbolt Meteorite.Upon encountering a young victim of Arnim Zola's genetic manipulations, a youngster by the name of Jolt, Moonstone nudged Zemo into accepting her in the team. She soon became a mother figure to Jolt and used her enthusiasm to create a power-base inside the team, rallying the others behind her. Zemo exposed the true nature of the team, but Moonstone opposed him, followed by MACH-1, Songbird, and Jolt. Zemo had brainwashed the Fantastic Four and the Avengers, but the small team of Thunderbolts, with the help of Iron Man, was able to defeat Zemo and Techno, his ally. After the battle the Thunderbolts had decided to pay for their crimes, but they were unwittingly teleported to an alternate dimension.In this world, known as Kosmos, Moonstone led the team to safety from the Kosmosian army and eventually executed the Kosmosian Primotur to ensure their return to Earth. Inspired by Jolt, she made the Thunderbolts see that it would be preferable to work for their redemption as heroes, rather than to be in jail. After gaining fake identities for the team, she led them away from S.H.I.E.L.D. and the Lightning Rods, and she managed to defeat Graviton using her psychological skills, making him see that he did not truly have a goal, that he lacked vision. However, the Thunderbolts disagreed with her, for she merely thought of the present and did not care for the future consequences of her actions. When the former Avenger known as Hawkeye joined the team, claiming they would be pardoned if they followed him, she stepped down as leader and allowed him to get the position.Soon after the Thunderbolts fought the new Masters of Evil, a veritable army of supervillains, and Moonstone decided to betray the team. But something inside of her snapped, and she defeated Crimson Cowl and returned to the team.Weeks after, Graviton returned, having pondered the words of Karla. He took over the city of San Francisco, turning it into an island in the skies. Thunderbolts attempted to stop him, but they were captured. Graviton offered Moonstone a place at his side, as his queen, but she laughed in his face. As the youngest members of the team saved them, Moonstone wondered why she didn't take Graviton's offer.During a mission against the Secret Empire, she become romantically involved with Hawkeye. But as time went by, she became haunted by nightmares of an ancient alien warrior woman, who whispered in her thoughts. Soon after, the team was targeted by Scourge, who killed Jolt. The death of the youngster hit Karla deeply. Subsequently, Citizen V asked for help against her own team, the V-Battalion, and the Thunderbolts agreed to do so, engaging the V-Battalion's operatives in battle. Karla was torn about fighting them, for they were heroes. She released a surge of her powers to stop the fight, making them all intangible, and fled, trying to find out what was wrong with her. Her first stop was Attilan, but the Inhumans were gone. She then searched the Fantastic Four's computers and found the answer she was looking for.She flew under her own power to the Blue Area of the Moon, where she sought the Kree Supreme Intelligence and demanded the truth. The Supreme Intelligence revealed to her that the fragment she referred to as the \"Moonstone\" was part of a Kree Lifestone, which used to empower the Guardians of the Galaxy centuries ago. The alien warrior woman that haunted her dreams was the previous owner of the moonstone, whose memory was etched into it, and kept steering Karla into the path of heroism. The Thunderbolts managed to catch up with her, and so did Captain Marvel, who offered her help. Led by Captain Marvel, the Thunderbolts went to Titan, where Mentor and ISAAC attempted to remove the moonstone from Karla's body. After a serious discussion about Karla's potential to do good, Mentor allowed her to keep the gem but erased the memory of the previous owner, leaving Karla's mind, and by consequence, her decisions, to herself.The team returned to Earth, only to find Jolt alive. She exposed Hawkeye, revealing the pardons Hawkeye promised would not be honored. Soon, the Thunderbolts chased Scourge, who was being manipulated by Henry Peter Gyrich. Thunderbolts fought the V-Battalion's Redeemers but eventually teamed up with them to defeat Gyrich, who was being manipulated as well. Valerie Cooper offered the Thunderbolts pardon for saving the world from her own people, with the condition that they would hang up their heroic identities forever.Karla Sofen was soon contacted by Graviton, who hired her as a tutor. In the following weeks Karla helped Graviton understand and control his powers in ways he had not even dreamed, making him fall in love with her. Graviton soon attacked the Redeemers, slaughtering the team. He also managed to keep many of Earth's heroes unmoving in the sky, as he lifted hundreds of cities all over the world as well, for he wanted to reshape the face of Earth into a semblance of his face. The Thunderbolts re-formed to stop him, only to find Karla at his side. In the end, she hesitated fighting them and helped them stop Graviton. However, his power imploded, sending most of the Thunderbolts to Counter-Earth.While trapped on Counter-Earth, the Thunderbolts became true heroes at last, rescuing thousands in their flying city, Attilan. Karla was given the task of reshaping the minds of the world's leaders, creating a new way of thought to ensure the survival of all. Soon after, Karla removed a second moonstone from that world's Lloyd Bloch (known there as the Phantom Eagle), dramatically increasing her own powers. The Thunderbolts eventually returned to Earth, leaving Jolt and the Young Allies to complete their task of saving Counter-Earth.", 
    "durability": 4, 
    "education": "Ph.D. in Psychology", 
    "energy": 5, 
    "eyes": "Blue\n", 
    "fighting": 4, 
    "firstappearance": "Captain America #192 (1975)\n", 
    "groupaffiliation": [
        "Thunderbolts", 
        "formerly Avengers (Osborn's team)", 
        "Masters of Evil", 
        "Corporation"
    ], 
    "hair": "Blonde\n", 
    "height": 71, 
    "id": "Moonstone_(Karla_Sofen)", 
    "identity": "Publicly known", 
    "intelligence": 5, 
    "knownrelatives": "Karl Sofen (father, deceased), Marion Sofen (mother)", 
    "occupation": [
        "Former criminal", 
        "psychologist"
    ], 
    "origin": [
        "Incredible Hulk #229 (1978)", 
        "Thunderbolts #25 (1999)"
    ], 
    "placeofbirth": [
        "Van Nuys", 
        "California"
    ], 
    "powers": "Moonstone can fly, become intangible, create laser bursts from her hands, and emit blinding light flashes. When Karla possessed two moonstones, her powers were diversified and geometrically increased.", 
    "realname": "Karla Sofen", 
    "significantissues": [
        "First Moonstone (Incredible Hulk #228-229, 1978)", 
        "first Meteorite and Thunderbolts (Incredible Hulk #449, 1997)", 
        "origin of the moonstone revealed (Thunderbolts #45-46, 1999)", 
        "acquired second moonstone (Thunderbolts #68, 2002)", 
        "lost both Moonstones (Avengers/Thunderbolts #6, 2004)", 
        "joined Dark Avengers (Dark Avengers #1, 2009)"
    ], 
    "speed": 5, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 130
}