{
    "aliases": [
        "The Living Vampire", 
        "formerly Morgan Michaels"
    ], 
    "citizenship": [
        "Citizen of unknown European country", 
        "criminal record in the U.S.A."
    ], 
    "content": "Morbius' subsequent attacks on innocents brought him into conflicts with  Spider-Man, the  Lizard, and the Human Torch. His adventures led to other worlds and dimensions, including the dimension of the Cat People and a planet orbiting Arcturus. He traveled the country, foiling the plots of the coven Demon-Fire and its master, Apocalypse (Kazarian). He also encountered the otherworldly Caretakers, destroying their Children of the Comet, intended to replace humanity, as well as the Brotherhood of Judas vampire cult.Martine's search for her fiancé had not ended, and she convinced him to return to her after he had encountered  Jack Russell, the Werewolf. Using the last of his Nobel Prize monies, Martine purchased the Mason House, located just outside Boston. Though reputedly haunted, Martine felt that it would afford them privacy while Morbius sought a cure. CIA agent Simon Stroud, seeking a vampire killer in Boston, came to view Morbius as the prime suspect. While Morbius discovered that he had a psychological need to drink blood from living victims, Stroud invaded the Mason House and arrested Martine. While the police questioned his fiancée, Morbius discovered his new home was a portal to a world ruled by the demonic entity Helleyes. Stroud, still in pursuit of Morbius, worked with him to escape Helleyes, discovering the demon's weakness and fleeing Mason House.During their time away, Martine had been attacked by the vampire killer and transformed into a pseudo-vampire like Morbius. She was eventually cured of her condition when Morbius created an antidote that was a derivative of his own blood. Frustrated at both his inability to cure himself and the perpetual danger to Martine, Morbius ended their relationship. Once more on his own, the Living Vampire had more confrontations with Spider-Man, and even a short-lived alliance with the Ghost Rider, Man-Thing and Werewolf. This \"Legion of Monsters\" unwittingly slew the benevolent Starseed before going their separate ways. Morbius later used the Living Eraser's palm bands to flee Earth entirely, hoping to avoid feeding on more innocents. He became the unwilling host to an extradimensional being known as the Empathoid, who forced him back to Earth and into conflict with Spider-Man once more. After being freed from the alien's control, Morbius resumed his search for a cure.Eventually, Morbius clashed with Spider-Man atop a Long Island mansion. He was struck by a bolt of lightning while draining Spider-Man's blood, catalyzing its radioactive elements and reversing much of his vampiric condition. He no longer required the blood of others to survive, but he retained a physiological need to drink it. Fleeing to Los Angeles, Morbius found work in a neuroradiology lab at the University of California. While working on a serum to cure himself of his continued craving for blood, Morbius met Jennifer Walters, the She-Hulk. Morbius gave Walters his serum, curing her of a degenerative disease and allowing her to control her transformations into She-Hulk. Walters later served as Morbius' defense attorney during his trial for the murders he'd committed as a pseudo-vampire. The jury, convinced that Morbius had been unable to control his urges, convicted him only of involuntary manslaughter and sentenced him to five years in prison, to be served after completing his cure. After succeeding, Morbius went to prison willingly and was soon paroled for good behavior. Moving back to Los Angeles, Morbius aided Jack Russell in his attempts to control his Werewolf transformations. He also assisted the West Coast Avengers, who sought him out for information on the Cat People.Eventually, however, the urges returned and Morbius slowly regressed into pseudo-vampirism. Failing to get the help he desired from Doctor Strange, Morbius allowed himself to fall in with the Subhumans, a group of homeless people living in the Morlock Tunnels. These people brought him victims, which led to another confrontation with Spider-Man. Sickened to discover that the victims upon whom he'd fed were innocents, Morbius once more fled into the night. By this time, the Ghost Rider and  John Blaze had begun pursuing Morbius, in preparation for the coming war with the Demon Queen, Lilith, and her children, the Lilin. He was reunited with Martine, who had also decided to help Michael once more. She had contacted Dr. David Langford, who had created a new serum from Morbius' notes. Unbeknownst to Martine, Langford was employed by Dr. Paine who wanted to kill Morbius so that he might lay claim to and profit from his research. One of Lilith's children, Fang, added his own blood to the serum, transformed it, and it altered Morbius on the cellular level. Blinded by pain, Morbius sought out an old friend, Dr. Jacob Weisenthal, for help. When Martine was slain by Langford after discovering his plans, Morbius went berserk and slew Langford in turn. Realizing that he felt no guilt for this murder, Morbius swore to Ghost Rider that he would only drink the blood of the guilty in the future.With Weisenthal's help, Morbius refined his serum, combining it with dialysis treatments and periods spent in a hyperbaric chamber. Now able to return himself to a normal appearance, Morbius adopted the identity of Dr. Morgan Michaels and worked in the hematology department of St. Jude's. He also began a relationship with a co-worker, Mandy Tyler. While some aspects of his life seemed to be stabilizing at last, Morbius found himself battling Dr. Paine, the Basilisk, Simon Stroud and his vampiric \"son,\" Vic Slaughter. Blaming himself for Slaughter's transformation from mercenary to undead killer, Morbius fought him alone and alongside the Nightstalkers. Morbius asked Nightstalker Frank Drake to use his necrotechnology on him, hoping it would cure his condition. Demoralized over this failure, Morbius was easy prey for Lilith's control during the so-called Midnight Massacre. He was slain by a Darkhold-empowered Blade, but was soon reborn.Bolstered by the return of his friend Jack Russell to his life, Morbius continued seeking a cure. Dr. Strange informed him that he was now a soulless being, which brought about further depression. Using a page of the Darkhold himself, Morbius revived Martine, but found she was now the host for a Lilin named Parasite. The dark part of his soul tainted by Fang's blood began to emerge, as well, calling itself Bloodthirst and attempting to alter Morbius in both body and mind. The Werewolf and the Ghost Rider (Ketch) both sought to capture him, but in the end it was Morbius himself who drove the demon out. Martine was slain yet again, but an immortal Blood named Embyrre resurrected her spirit. The couple was denied happiness, however, as Martine was now emotionless and increasingly frustrated with the fact that Morbius would not allow her the peace of death. After battles with Deathlok, the Wraith, and Bloodthirst (now in his own body), Morbius met the young Lena Ivana. Rescuing her from a life of forced prostitution, the two began a tumultuous romance. Still distraught over his failed relationship with Martine and his ongoing existence as a living vampire, Morbius killed himself, only to be revived by Weisenthal, who had created a serum to reanimate his friend.Morbius then began a period of wandering, leaving behind his life as Morgan Michaels. He crossed paths with Blade in New Orleans, during Ulysses Sojourner's plot to unite the East Coast vampires under his rule, and later fought X-Man and Spider-Man. A few weeks later, Morbius sought out Dr. Andrea Jansen's help in finding a cure, only to discover that she was in league with Hydra and the villain Crown. Morbius seemingly sacrificed himself to destroy Crown, but was actually taken prisoner and experimented upon. After Crown's transformation into the vampiric Hunger, Morbius was freed by Blade and Spider-Man. Nearly mindless with bloodlust, Morbius bit Blade and fled the scene. Months later, Morbius attempted to feed on a paralyzed young man named Joey Beal, but was foiled by Spider-Man. The Living Vampire continues to search for a cure, hoping to somehow regain the humanity he lost so long ago.", 
    "durability": 5, 
    "education": "Ph.D in Biochemistry", 
    "energy": 3, 
    "eyes": "Blue\n", 
    "fighting": 4, 
    "firstappearance": "Amazing Spider-Man Vol. 1 # 101 (1971)\n", 
    "groupaffiliation": [
        "Midnight Sons", 
        "the Nine", 
        "Legion of Monsters"
    ], 
    "hair": "Black\n", 
    "height": 70, 
    "id": "Morbius", 
    "identity": "Publicly known", 
    "intelligence": 4, 
    "knownrelatives": "Martine Bancroft (ex-fiancée)", 
    "occupation": [
        "Former biochemist", 
        "former hematologist"
    ], 
    "placeofbirth": "Unknown", 
    "powers": "Morbius is a human mutate possessing a variety of powers akin to a supernatural vampire: he maintains super-human strength (the extent of which depends on the amount of blood he has ingested and the type of blood), speed, reflexes, agility, senses, and an accelerated healing factor; he has sharp claws and fangs, and the ability to glide on air currents via his hollow bones.", 
    "realname": "Doctor Michael Morbius", 
    "speed": 4, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 170
}