{
    "add": {
        "doc": {
            "aliases": [
                "Morgana Le Fay", 
                "Morgaine Le Fay", 
                "Vivian Morgan", 
                "Sea Priestess"
            ], 
            "citizenship": "Sixth-century Britain", 
            "content": "Morgan became a queen by marrying King Uriens of Gorre, though she secretly kept many lovers. Seeking to rule Britain herself, Morgan was opposed by King Arthur, whom she already hated for being the product of Uther's illicit affair with Igraine. Morgan also resented Arthur's promotion of Christianity over her own Celtic goddess-worship. She replaced Arthur's enchanted sword, Excalibur, and scabbard with hell-spawned replicas, giving the originals to her lover, Sir Accolon, whom she tricked into battling and nearly killing Arthur. The Lady of the Lake (Niamh/Nimue, not to be confused with Vivienne), who had first given Arthur Excalibur, magically disarmed Accolon, and Arthur reclaimed his sword and defeated him. Enraged by Arthur's survival, and by her own son Ewain thwarting her subsequent attempt to murder Uriens, Morgan again stole the scabbard and hurled it into a lake, robbing Arthur of its magical protection from injury.Morgan repeatedly plotted against Arthur and Camelot with her nephew Mordred; their relationship often seemed more than familial, and some texts portray Morgan as his mother or wife. Morgan's magic may have concealed Mordred's treachery from Arthur. Later, gathering occult students to assist her, Morgan assembled the magical scrolls created by the Elder God Chthon, binding them together as the Darkhold. One of her students, Magnus, became her lover until he saw the evil within her. Leading her Darkholders to Europe, Morgan summoned Chthon himself but the demon proved too powerful to control, and she imprisoned him within what would become Mt. Wundagore. Rebelling, Magnus stole the Darkhold and placed it within a tower on the Isle of Wight, protecting it with spells warding off beings of evil intent. Morgan slew Magnus for his betrayal, though his spirit survived. Having sensed Chthon's evil, Merlin had added his power to help imprison him, then led the Black Knight (Sir Percy of Scandia) to oppose Morgan's further schemes; during this time, an imposter (Merlin Demonspawn) acted as Merlin in Camelot.Morgan later tried to seduce Sir Lancelot, one of the great Knights of the Round Table, but he spurned her. Enraged further by Lancelot's affair with Arthur's wife Guinevere, Morgan helped expose their romance, plunging England into civil war. Morgan and Mordred then began to war against Arthur openly. In the final year of Arthur's reign, the Black Knight led the defeat of Mordred's armies, and Merlin magically trapped Morgan inside her own castle with a spell that would kill her if she exited. Merlin then had a trio of knights physically bind Morgan in iron, preventing her spirit or magic from escaping the castle, but these restraints were unwittingly undone by the Black Knight. Morgan's former pupil Nimue (Vivienne) later entombed Merlin within a crystal cave.A time-traveling Doctor Doom allied with Morgan, who agreed to help save his mother's lost soul if he would lead her army--victims of Excalibur reanimated by a fragment of the sword--against Camelot; but the time-traveling Iron Man forced Morgan to abandon her army, after which Doom and Iron Man returned to their own time. Morgan then sought the Darkhold to break Merlin's spell; realizing the book would someday be transported out of its tower, she plotted to claim it from the future. When modern era criminal \"Slapper\" Struthers stole Morgan's false Excalibur from a museum, she sent the spirit of her loyal Knight forward in time, transforming Struthers into the villain Excaliber. She sent him to force Magnus to reveal the Darkhold's location, but the heroine Spider-Woman defeated Excaliber. Recognizing Chthon's power in Drew (who had grown up on Mt. Wundagore), Morgan plotted repeatedly to claim the heroine, hoping to drain her energies and break the spell. Magnus ultimately led Spider-Woman's spirit back to the 6th century, where she knocked Morgan through a window, and Merlin's spell caused her body to crumble to dust.Morgan's spirit survived on the astral plane as well, and she cast a spell preventing Drew's spirit from reentering her body. When Arthur and Mordred slew each other, Morgan transported Mordred to the astral plane, too. At some point Morgan trapped a portion of the spirits of Arthur and his Knights beneath a castle in Gwillyn Dale, Wales, where they would be freed centuries later to help the Spaceknight Rom defeat an outpost of the alien Dire Wraiths. Morgan is said to have helped the Lady of the Lake and the Sisters of Glastonbury Tor transport the dying Arthur to Avalon (part of Otherworld), though her motives and the timing of such activity are unclear.Recovering her power over the centuries, Morgan transported her castle to the Netherworld, though its cornerstone remained and was eventually built into London Bridge. She tried to usurp Spider-Woman's body in the modern era, but she was foiled by the Avengers, Doctor Strange, Shroud, and Magnus, who sacrificed himself restoring Drew's spirit to her body. Morgan next possessed Lissa, sister of the werewolf Jack Russell, but Iron Man and the Werewolf drove her out. She subsequently used Mordred as her masculine familiar in a plot to restore her castle to Earth, which would resurrect them both and transform the planet into a dark reflection of Camelot. Despite the assistance of the Celtic Fomor, they were banished by the Black Knight (Dane Whitman), Dr. Strange, Captain Britain, and the Valkyrie.Next, believing that the undersea Atlantis was formerly the isle of Avalon, Morgan reincarnated within oceanographer Vivian Morgan and prepared to bring the island to the surface. Aided by a mysterious Priest of the Moon and by a new group of Darkholders, Morgan invoked the power of several goddesses and, using the near sacrifice of the Inhuman Triton with the ancient Atlantean Sword of Kamuu, she successfully raised Atlantis, killing 80% of the water-breathing Atlanteans in the process. Though further empowered by the Ebony Blade, Morgan lost her new home when the Inhuman city Attilan was transported atop it.Morgan later wielded the Asgardian Norn Stones, sending a number of Asgardian monsters rampaging across the Earth. She captured the Scarlet Witch, using her to tap into the power of the Twilight Sword and transform the entire planet into a facsimile of the 6th century, with Morgan as ruler and the Avengers as her Queen's Vengeance royal guard. Despite her virtual omnipotence, Morgan was foiled when the Scarlet Witch resurrected Wonder Man and channeled the Avengers' power into him; he tore the Twilight Sword from her grasp, restoring reality to its previous state.Morgan recently used her unnamed loyal Knight to manipulate the Wrecking Crew so that the Avengers would use Thor's magical arrows to stop them. Morgan overpowered Captain Britain, intending to slay him with those magic arrows, which would then, with his mystic connection reversed by her magic, destroy all of Britain; however, Braddock had foreseen Morgan's plot and had passed on the mantle of Captain Britain to a successor, Kelsey Leigh. Assisted by the Avengers, Leigh used her new Sword of Might to disperse Morgan's essence, though Morgan re-formed soon after.", 
            "durability": 4, 
            "education": "Pupil of Merlin", 
            "energy": 6, 
            "eyes": "Green\n", 
            "fighting": 4, 
            "firstappearance": "Black Knight Comics #1 (1955)\n", 
            "groupaffiliation": "The Darkholders", 
            "hair": "Magenta\n", 
            "height": 72, 
            "id": "Morgan_Le_Fay", 
            "identity": [
                "No dual identity", 
                "widely regarded as a fictional character"
            ], 
            "intelligence": 5, 
            "knownrelatives": "Gorlois (apparent father), Igraine (mother), Uther Pendragon (stepfather), Uriens (husband), Sir Ewain (son), Morgause, Elaine (sisters), Anna (possible half-sister), Guinevere (half sister-in-law), Gawain, Agravaine, Gaheris, Gareth, Galeshin (nephews), Lot, Nentres (brothers-in-law), Ider (grandson), Amlawdd (maternal grandfather), Gwendolyn (maternal grandmother)--all deceased; Arthur Pendragon (half-brother), Mordred (nephew); distant relations to Sir Percy of Scandia and his descendants, and possibly to Dafydd ap Iowerth", 
            "occupation": [
                "Sorceress", 
                "would-be world conqueror", 
                "former High Priestess", 
                "former Queen of Gorre"
            ], 
            "placeofbirth": [
                "Tintagil Castle", 
                "Gorre (now part of modern Cornwall", 
                "England)"
            ], 
            "powers": "Morgan is one of the most powerful sorceresses in Earth's history, thanks to extensive training and her faerie heritage. Her abilities include flight, shape-changing, mind control, astral projection, healing, illusion casting, energy projection, forming shields, manipulating her environment, removing spirits from their bodies, and transportation across time, space, and dimensions. Morgan can cast various spells invoking magical entities (such as the Earth goddess Gaea or the angel of death, Azrael). Her faerie heritage amplifies her powers, allowing her to access both Celtic and Asgardian magic, but it also renders her vulnerable to \"cold iron\" or steel. Otherwise, Morgan is virtually immortal, having survived physical death and destruction of her astral form.", 
            "realname": "Morgan Le Fay", 
            "speed": 3, 
            "strength": 3, 
            "universe": "Marvel Universe", 
            "weight": 140
        }
    }
}