{
    "add": {
        "doc": {
            "aliases": "None known", 
            "citizenship": "Mephitisoid", 
            "content": "The new Corps members confronted a fraction of the villainous Serpent Society that had barricaded themselves inside a compound in Danzig, Ohio. The Serpent Society were holding several hostages. During the rescue of the hostages Morrow made quick of Anaconda. He would also battled Taboo and Dragon Man while on Earth.Morrow and his allies quickly return to space and found themselves stationed on Nu-Xandar, which was Ego the Living planet. Ego had been monitoring the cosmic conflict known as the War of Kings, an epic battle between the Inhumans that had allied with the war ridden Kree, against the mighty Shi'ar that were led by the psychopathic mutant, Emperor Vulcan. Morrow along with a massive number of Nova Corpsmen were sent into the Gulf of Sarenta colonies to help keep down the number of casualties in this galaxy wide war.After the massacre of Cohort 86 and surrender of Nova Prime, Malik Tarcel on the Kree planetoid of Nil-Rast, Robbie Rider and Qubit left the command base of Nu-Xandar to search for survivors on Nil-Rast. Morrow joined Richard Rider in the search for his younger brother. Their quest brought them into conflict with the New Inhuman Elite that were using Echo-Weapons that fired the voice of their king Black Bolt. The Elite was led by Triton of the Royal Family. This altercation was quickly squashed when Ra-Venn asked Triton and the others to stand down, after she realized that Richard Rider was among the intruders that they were battling. Marrow and Rider were allowed to continue their search for his brother in a medical station were the Kree had moved all the casualties of war. Marrow and Rider discovered the ravaged body of their automated friend Qubit, but Robbie was nowhere to be seen.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "fighting": 1, 
            "firstappearance": "Nova #19 (2009)\n", 
            "groupaffiliation": "Nova Corps", 
            "hair": "White\n", 
            "id": "Morrow_(Nova_Centurion)", 
            "identity": "The general inhabitants of Earth were unaware of Morrow's existence", 
            "intelligence": 1, 
            "knownrelatives": "None known", 
            "occupation": "Peace Keeper", 
            "placeofbirth": "Unrevealed", 
            "powers": "As a member of the Nova Centurions Morrow possessed the ability to absorb energy, the creation of gravimetric pulse and the electromagnetic static burst.", 
            "realname": "Morrow (last name unrevealed)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}