{
    "add": {
        "doc": {
            "aliases": "Warlord Morrat", 
            "citizenship": "Citizen of the Skrull homeworld", 
            "content": "When Mister Fantastic and the Invisible Girl planned their wedding, Susan remained uneasy. She was troubled that-somewhere in the galaxy-the murderer of her father was able to live freely. And because Reed loved her so, he promised her that he would take on the Skrull Empire itself to bring her father’s killer to justice. After a brief discussion with the rest of the Fantastic Four, they agreed to join them on their mission of justice and vengeance. They launched a ship into space and used a time warp drive to take them to the Skrull’s homeworld where they found their powers gone and were quickly captured by Morrat’s men and brought onto his space yacht.Morrat had been spending time on his yacht, shooting defenseless game in order to show his prowess and power off to the Princess Anelle, who was smitten by him despite herself. When his men brought him the Fantastic Four he promised her that he would turn them over to her father, the King, but once she left he ordered his men to kill the four. He had planned to use the fame of their capture to take over the Skrulls’ throne, himself. Reed Richards quickly pleaded with his captors for their lives, and offered Morrat ultimate power if he set them free, in the form of his power ray. Morrat agreed, greedy for the ability to conquer his homeworld.But Reed tricked him and made a show of attacking his own team members with the power ray when they disagreed with him, which gave them back their powers. The Fantastic Four then turned on the Skrulls and fought them until the Skrull King arrived. Morrat tried to ingratiate himself with his ruler by declaring them the King’s prisoners, but he wasn’t fooled, and stripped Morrat of his rank and privilege. Morrat immediately turned on the King, but his men refused to join him, and the King ordered Morrat killed. Princess Anelle tried to throw herself in front of the lasers to save his life but Susan used her force field to save her. Morrat was shot and died, begging Anelle to stay back.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Red\n", 
            "fighting": 1, 
            "firstappearance": "Fantastic Four #37\n", 
            "groupaffiliation": "None", 
            "hair": "Black\n", 
            "id": "Morrat", 
            "identity": "Publicly Known", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Warlord of the Skrull Empire", 
            "placeofbirth": "Skrull homeworld", 
            "powers": "None", 
            "realname": "Morrat", 
            "significantissues": "Fantastic Four #37 (intro/death)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}