{
    "add": {
        "doc": {
            "aliases": [
                "Formerly Suprema", 
                "\"Night Mother\""
            ], 
            "citizenship": "U.S.A.", 
            "content": "As time went on Suprema’s influence over her men grew, and she soon revealed that she possessed witch craft and intended to become the “Queen of Crime.” Her first order of business was to use her hypnosis to take control of the gambling operations of Ace Wilde. She continued on this path by gaining mind control over the other crime bosses of New York City. Believing her actions as a success Suprema targeted S.H.I.E.L.D., by taking control of agent Dum-Dum Dugan’s mind and forcing him to revealed the location of top agent Nick Fury, who Suprema quickly overpowered and took control of S.H.I.E.L.D... However, the patriotic Captain America was there and he was able to elude their hypnotic attack, with his shield. Realizing that he was overpowered and outmanned, Captain America stole the Wolverine Jet and escaped. As researching Suprema background Captain America returned and bombarded Suprema and her men with knock gas releasing the S.H.I.E.L.D. from her control.", 
            "durability": 1, 
            "education": "Trained in Witch Craft, although the extent of her training and education are unknown.", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 1, 
            "firstappearance": "(As Suprema) Captain America #123 (1968), (as Mother Night) Captain America #356 (1968)\n", 
            "groupaffiliation": [
                "Formerly Skeleton Crew", 
                "mentor of the Sisters of Sin"
            ], 
            "hair": "Black\n", 
            "height": 67, 
            "id": "Mother_Night", 
            "identity": "Known to authorities", 
            "intelligence": 1, 
            "knownrelatives": "Melvin Scarbo (Minister Blood, brother)", 
            "occupation": [
                "Operative of the Red Skull", 
                "former stage performer"
            ], 
            "placeofbirth": [
                "Teaneck", 
                "New Jersey"
            ], 
            "powers": "Susan was a talented Hypnotist, Mesmerist and illusion caster, she is also an adept hand to hand combatant.", 
            "realname": "Susan Scarbo", 
            "significantissues": "First appearance (Captain America #123 (1968)), first appearance as Mother Night (Captain America #356 (1968)), hired Cutthroat to replace Crossbones (Captain America #395 (1968)), hired Taskmaster to train (Captain America #396 (1968)), began relationship with (Captain America #402 (1968))", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 133
        }
    }
}