{
    "add": {
        "doc": {
            "aliases": [
                "Ace", 
                "Binary", 
                "Lady Marvel", 
                "Warbird", 
                "others used during her espionage career"
            ], 
            "citizenship": "United States of America with no criminal record", 
            "content": "While on special assignment with Nick Fury, Carol met the Canadian agent called Logan. The two were eventually paired up and shared a number of adventures together. During one of their infamous escapades, they clashed with the brutal Sabretooth who was working for the Hellfire Club. During their time together, Logan and Carol became close friends, perhaps even lovers. Both have saved each other’s lives numerous times.When Carol was captured by the KGB and imprisoned at Lubyanka prison, Logan was among those who defied orders to save her. Following her affiliation with the C.I.A., Carol took a position with N.A.S.A. as the security director for Cape Canaveral. It was in this capacity that Carol first met Captain Marvel, the Kree warrior, Mar-Vell. In her official capacity, Carol was challenged with unraveling the mystery of this alien soldier. During her investigation, the two forged a unique bond, first as friends and then as lovers. It was this relationship that would change Carol forever.Captain Marvel's mortal enemy, Colonel Yon-Rogg kidnapped Carol, using her as bait in his conflict with Mar-vell. In the course of the battle, Carol and Mar-vell were caught in the explosion of a Kree Psyche-Magneton device. The energy bombardment somehow caused Carol’s genetic structure to be melded with Mar-vell's. While Mar-vell was apparently unaltered by the event, Carol was now a perfect hybrid of Kree and human genes. In addition, she possessed all of Mar-vell's Kree knowledge and training. Through this transformation, Ms. Marvel was born.Because of her failure to capture Captain Marvel, Carol lost her job at N.A.S.A. She recovered quickly, writing a successful novel about her experience in the space industry. This lead to her landing a position as the editor of WOMAN magazine, a subsidiary of the Daily Bugle. Carol’s viewpoints as a staunch feminist created tensions with her boss J. Jonah Jameson, but made her the perfect choice to be WOMAN magazine’s editor.Just as Carol was beginning this new chapter of her life, the powers and persona of Ms. Marvel began to emerge. At first, Carol experienced blackouts triggered by Ms. Marvel’s precognitive seventh sense and the two personas were very distinct, both mentally and physically. As time went on and Carol came to accept her new role as Ms. Marvel, the two personalities merged. A second exposure to the energies of a Kree Psyche-Magnetron also imbued Ms. Marvel with some of the properties which formally resided in her Kree uniform (namely flight and the ability to change into costume at will).Carol fought many villains during her career as Ms. Marvel, including Deathbird, MODOK, A.I.M., the Brotherhood of Evil Mutants, the Hellfire Club, and Mystique. She also joined the Avengers for a brief period, and it was this affiliation which drew Carol to the attention of Marcus. The son of Immortus, Marcus observed the Avengers from afar and became obsessed with Ms. Marvel. Marcus kidnapped Carol using Immortus' technology to manipulate her mind and seduce her into loving him. Marcus impregnated Carol with a child who would rapidly grow up into Marcus himself, enabling him to escape Limbo. He returned Carol to the Avengers, unaware of her time and seduction in Limbo. Carol was shocked when she learned that she was pregnant and devastated since she was completely unaware of the identity of the father. The pregnancy ran its course in a matter of days, leaving Carol shaken - both as a woman and a hero. The child grew within a day into a full-grown man, one who was determined to win his \"mother’s\" love. Carol, still bewildered by the entire experience, agreed to accompany Marcus back to Limbo. The Avengers wished the pair well. In Limbo, Marcus continued to age rapidly and quickly died of old age, leaving Carol alone in Limbo and free of his mind control. Carol was sickened by Marcus' manipulations and felt betrayed by the Avengers who failed to question Marcus` actions or motives.Carol mastered Immortus' technology and returned to Earth, choosing to settle in San Francisco instead of returning to the Avengers. Carol’s return to Earth was sensed by the precognitive Destiny. Destiny had previously prophesied that Ms. Marvel would be involved in an event that would destroy the life of Mystique's foster daughter, Rogue. Mystique had vowed to destroy Ms. Marvel before this could happen and developed an obsessive hatred for Ms. Marvel. Rogue, overhearing Destiny’s concerns and Mystique's ranting, decided to take the battle to Carol herself. Rogue attacked Carol in San Francisco and the pair fought atop the Golden Gate Bridge. When Rogue tried to use her power-absorbing abilities on Carol, something went terribly wrong, and she absorbed too much of Carol’s persona, making the transferal permanent. Driven mad by Carol’s thoughts and memories, Rogue threw Carol’s body from the bridge. Amazingly, Carol was rescued by Spider-Woman. At the hospital, Carol was identified and diagnosed as a tabula rasa - a blank slate. Jessica Drew called in Professor Xavier of the X-Men, who was able to pull forth Carol’s memories and personality from her subconscious. However, he was unable to restore her emotional connection to those memories and experiences. Carol and Jessica spent some time at the X-Mansion while Carol recovered from her ordeal.During this time, a now-powerless Carol confronted the Avengers and vented her anger for their betrayal of her. Carol remained with the X-Men for a brief time, during which she often accompanied them on missions. One such mission led to Carol’s capture by the alien Brood. Fascinated by her Kree/Human physiology, the Brood performed experiments on Carol’s genetic structure. This unleashed the full potential of Carol’s Kree/Human physiology transforming her into the cosmic-powered Binary. Carol now possessed more power than ever due to her link to a white hole.Carol returned with the X-Men and was strongly considering joining them on a permanent basis when the desperately troubled Rogue came to Xavier for help. Upon seeing Rogue, Carol flew into a rage and punched her into orbit. The X-Men reluctantly informed Carol that Xavier had allowed Rogue to join the X-Men. Unable to accept this, Carol opted to join the space pirates known as the Starjammers and to leave her troubles on Earth behind. As Binary, Carol was a valued member of the Starjammers and fought alongside them to restore Lilandra to the Shi'ar throne. In space, Carol was able to escape her loss and rebuild her life. The stars were her escape and offered her a whole universe in which to escape the emptiness her former life represented. Carol remained with the Starjammers for a number of years. During this time, she lived out her lifelong dream of exploring the stars. She formed a close friendship with Raza Longknife, the sullen cyborg member of the Starjammers. Despite fighting the Shi'ar forces and her former enemy Deathbird, Carol found herself frustrated at the lack of challenge among the Starjammers' adversaries. When Earth's sun was threatened, Carol chose to abandon her mission for the Shi'ar Majestrix Lilandra Neramani and aid the Avenger Quasar in saving it. This effort left Carol in a depleted state, and she spent months recuperating at the Avengers Mansion. During this time, she reconciled with the Avengers. When the Starjammers came to Earth and into conflict with the Avengers, Carol helped resolve the conflict and decided to try and rebuild her life on Earth.Recently, Carol rechristened herself Warbird and rejoined the Avengers, following a reality-warping conflict with Morgan Le Fay. She brought with her a whole new set of problems. First, her powers were slowly depleting, and she attempted to hide this fact from the Avengers, leading to a conflict with Captain America. Carol had also developed a drinking problem, which was immediately noticed by recovering alcoholic and fellow Avenger, Iron Man. Her drinking, coupled with her determination to prove herself a worthy addition to the Avengers and her secretiveness about her power loss, led to reckless grand-standing and sloppy teamwork. This eventually endangered the lives of her teammates and led to a formal court-martial before her fellow Avengers. Rather than face her problems and a forced demotion to reserve status, Carol quit the team. This all occurred amidst the Avengers' conflict with a rebel faction of Kree. Seeking to join the battle despite leaving the team, Carol realized that she no longer had the capability to reach escape velocity in order to join the battle on the Moon between the Avengers and the Kree Lunatic Legion.Disheartened, Carol realized that she’d hit rock bottom, and moved to Seattle to work on rebuilding her career as a freelance writer and novelist. She started to make some progress in accepting her alcoholism but refused to accept that she had a serious problem for months. After her drinking almost led to disaster in a number of combat situations, Carol was hospitalized for alcohol poisoning. Carol’s doctor warned that she had done considerable damage to her internal organs and that another drink might kill her. This diagnosis combined with the knowledge that she had nearly killed a plane full of people during a drunken rage have forced Carol to admit the severity of her drinking problem. Carol has now accepted that she is an alcoholic and has started attending Alcoholics Anonymous meetings on a regular basis. She has since been accepted into the ranks of the Avengers once more and taken the name “Ms. Marvel” once again.", 
            "durability": 4, 
            "education": "B.A., extensive espionage training", 
            "energy": 5, 
            "eyes": "Blue\n", 
            "fighting": 4, 
            "firstappearance": "Marvel Super-Heroes #13 (1967)\n", 
            "groupaffiliation": [
                "Avengers", 
                "formerly Queen's Vengeance", 
                "Starjammers"
            ], 
            "hair": "Blonde\n", 
            "height": 71, 
            "id": "Ms._Marvel_(Carol_Danvers)", 
            "identity": "Secret", 
            "intelligence": 3, 
            "knownrelatives": "Joseph Danvers, Sr. (father), Marie Danvers (mother), Joseph Danvers, Jr. (brother) Steven 'Steve' Danvers (brother, deceased)", 
            "occupation": [
                "Adventurer", 
                "Chief of tactical operations for the Department of Homeland Security", 
                "(Formerly) intelligence agent", 
                "NASA security chief", 
                "magazine editor", 
                "freelance writer"
            ], 
            "origin": [
                "Marvel Super Heroes #18", 
                "Ms. Marvel #1(2006)"
            ], 
            "placeofbirth": [
                "Boston", 
                "Massachusetts"
            ], 
            "powers": "Ms. Marvel's current powers include flight, enhanced strength, durability and the ability to shoot concussive energy bursts from her hands.", 
            "realname": "Carol Danvers", 
            "speed": 5, 
            "strength": 4, 
            "universe": "Marvel Universe", 
            "weight": 124
        }
    }
}