{
    "aliases": "None", 
    "citizenship": "Ireland", 
    "content": "The Queen of England’s head spymaster, Nicholas Fury, later paid him to hunt down and protect Donal, the Templar keeper of Thor’s staff. On the way he encountered Natasha, whom he called the most dangerous woman in England. Ironically, she soon turned on him and smashed a bottle over his head and pushed him off a bridge into a canyon below. But Murdoch survived, and appeared in time to attack Natasha’s men, and attempt to rescue Donal from her, though she soon surrounded him with a garrison worth of men, sent by Count Otto von Doom of Latveria to capture the old man’s treasure; the old man himself; and Matthew Murdoch. Doom imprisoned them in one of his castle’s cells and worked to uncover the secrets of the golden bauble that Donal gave to him to distract him from the true treasure: the staff. Donal was also in contact with Dr. Strange, the former Queen’s court magician and physician, who informed them that a group of heroes were on their way to the castle.When the imprisoned Captain of the Fantastick railed against his stone prison, it shook the castle from its foundations and freed Murdoch and Donal. Murdoch used his abilities to carry the old man and leap from wall to wall to the courtyard many feet below. When Doom’s men cornered them, after Donal demanded to find his staff, the old man used it to transform himself into the Thunder God, Thor. Thor used his immortal powers to stop Doom’s men and assist Carlos Javier’s witchbreed in their attack on Doom’s castle, finally allowing Doom to use Thor’s electricity to explode the golden sphere that Donal had given him, scarring Doom and bringing him to the brink of death. Then, while Donal-as Thor-joined the group aboard their ship, headed to the New World to fix the tear in their universe, Murdoch used his own means to leave Latveria.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 1, 
    "firstappearance": "Marvel 1602 #1\n", 
    "groupaffiliation": "None", 
    "hair": "Red\n", 
    "id": "Murdoch,_Matthew_(Earth-311)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Paid Mercenary", 
    "origin": "Marvel 1602 #2", 
    "placeofbirth": "Ireland", 
    "powers": "Murdoch's loss of sight is replaced with an extra-sensitivity in all his remaining senses, making them super-humanly acute.", 
    "realname": "Matthew Murdoch", 
    "significantissues": "Marvel 1602 #1 (intro)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 1602 (Earth-311)"
}