{
    "aliases": [
        "Jack O'Lantern", 
        "Mad Jack", 
        ""
    ], 
    "citizenship": "U.S.A with a criminal record", 
    "content": "He kept on working for Norman for sometime and teamed with Conundrum against Prodigy (Peter Parker). As Prodigy was fighting the two villains he realizes that he has a better change to win if he relies on his spider-sence, because Mad Jack used Mysterio's illusion tricks. He managed to knock Conundrum out and saw when one of Norman's bodyguards shot Mad Jack and he apparently killed him. Later it is revealed that Mad Jack didn’t die. The death was staged, because it served the purposes of both Mad Jack and Norman Osborn.Upon learning of Beck's death, Berkhart again took up the Mysterio identity, giving his Mad Jack identity to his protégé Maguire Beck, Quentin's cousin. He joined in with the Sinister Seven, ostensibly to get vengeance on Doctor Octopus, but in reality to use them for his own ends. He and Electro gained control of Senator Stewart Ward, who had been permeated with a strange energy. Before they could make use of him though, they had to deal with Venom, who was hunting down the rest of the Sinister team members. Berkhart abandoned the group and instead kidnapped those who had the most contact with Spider-Man, subjecting them to an artificial scenario in which Flash Thompson was a super hero in an attempt to learn Spider-Man's identity. Flash finally broke free of the illusion but Berkhart escaped. Most recently, Berkhart was involved with Maguire in a plan to kill Spider-Man, Daredevil, Joe Smith and Betsy Schneider. He crossed paths with Spider-Man couple of times till Spider-Man managed to capture him with help of civilian.", 
    "durability": 1, 
    "education": "High-school level", 
    "energy": 1, 
    "eyes": "blue\n", 
    "fighting": 1, 
    "firstappearance": "(As Mysterio) Amazing Spider-Man #141 (1975); (As Jack O’lantern) Spectacular Spider-Man Vol. 1 #241 (1996)\n", 
    "groupaffiliation": [
        "None", 
        "Former Sinister Seven", 
        "Sinister Six"
    ], 
    "hair": "brown\n", 
    "height": 70, 
    "id": "Mysterio_(Daniel_Berkhart)", 
    "identity": "Known to authorities", 
    "intelligence": 1, 
    "knownrelatives": "unrevealed", 
    "occupation": "former criminal", 
    "origin": [
        "(As Mysterio) Amazing Spider-Man #141 (1975)", 
        ""
    ], 
    "placeofbirth": "unrevealed", 
    "realname": "Daniel \"Danny\" Berkhart", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 160
}