{
    "aliases": "None", 
    "citizenship": "Luphomoid", 
    "content": "Nebula hoped to conquer the Skrull empire, at the time in the throes of chaos as their throneworld was destroyed by the planet-destroyer Galactus. Not knowing how to return home, Captain Marvel pretended to go along with Nebula's scheme but actually helped the Skrulls evacuate the outpost world Nebula was intent on destroying. The Avengers eventually located their missing member and allied themselves with the Skrulls to oppose her. Before the Avengers were able to catch up with Nebula, she annihilated both the Skrull outpost and the planet Xandar, home planet of the Avengers' ally Firelord. In battle with Nebula, the Avengers’ Starfox, brother of Thanos, learned that Nebula claimed to be Thanos' granddaughter, and thus his great-niece. Shortly thereafter, the virtually omnipotent Beyonder, curious about the Avengers, arrived, and in an attempt to help the Avengers vanquish Nebula, helped her and her minions to escape them by teleportlng them out of the Andromeda Galaxy.Nebula was later summoned to the side of Thanos, who had at the time assembled the Infinity Gems to create the Infinity Gauntlet and thereby give himself omnipotent power. Thanos scoffed at Nebula's claims to be his granddaughter, and as a gift to the embodiment of Death, transformed her into a hideous \"living sculpture\" of pain and living death. Unfortunately for Thanos, he allowed himself to be distracted by an assemblage of the universe's heroes and thus failed to notice Nebula until she stole the Infinity Gauntlet for herself. Now omnipotent herself, she faced an entourage of cosmic beings that included Galactus, Master Order, and Lord Chaos. Soon, however, the original Soul Gem owner, Adam Warlock, subverted the Infinity Gauntlet for himself. Starfox elected to take Nebula into custody of the Eternals on the moon Titan.Somehow, under circumstances to be revealed, Nebula escaped and resumed her piracy career with her crew. They infiltrated a device known as the Infinity Union from the planet of the enigmatic alien Stranger. She then somehow learned of a scientist on earth who was developing a powerful energy source known as the Atomic Compressor. The Atomic Compressor succeeded in negating all of reality, which led her into conflict with the Avengers once again.The Avengers, with their ally Spider-Man, defeated and captured the space pirate Nebula but an enraged Stranger burst in, searching for the Infinity Union, which had since absorbed the energies created from the negation of reality. Fearing that neither the Stranger nor anyone else was worthy of wielding such a dangerous device, the Avengers decide to track down the Infinity Union themselves. An increasingly unnerved Spider-Man, unaccustomed to dealing with cosmic menaces, found the device first-- and then accidentally set it off. Nebula had arranged to absorb the power of the Infinity Union and become a supreme being. The Avengers and the Stranger managed to thwart her regardless, stripping her of the Infinity Union's power, though Nebula managed to escape capture with her crewman Gunthar.Nebula's next appearance was a sudden attack on the young hero Nova. Nebula claimed that Nova had previously murdered her father Zorr, an archemeny of Nova Prime, the hero of Xandar whose powers Nova had inherited. (This was the same reason that led her to destroy the planet Xandar before.) Zorr had, in fact, been accidentally killed when he activated an energy device when battling Nova. Nova succeeded in driving Nebula off, and she returned to deep space.", 
    "durability": 3, 
    "education": "Unrevealed", 
    "energy": 6, 
    "eyes": "Blue\n", 
    "fighting": 4, 
    "firstappearance": "Avengers #257 (1985)\n", 
    "groupaffiliation": [
        "Graces", 
        "former Leader of a band of mercenaries including Skurge", 
        "Kehl", 
        "Gunthar", 
        "and Levan"
    ], 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Nebula", 
    "identity": [
        "No dual identity", 
        "her existence is unknown to the general populace of Earth"
    ], 
    "intelligence": 4, 
    "knownrelatives": "Unrevealed (rumored to be granddaughter of Thanos)", 
    "occupation": [
        "Pirate", 
        "mercenary", 
        "conqueror"
    ], 
    "placeofbirth": "Planet of Luphom (destroyed)", 
    "powers": "None", 
    "realname": "Unrevealed", 
    "speed": 2, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 185
}