{
    "aliases": [
        "King of the Sea", 
        "Nethuns", 
        "Earthshaker"
    ], 
    "citizenship": "Oplympian", 
    "content": "Poseidon was the son of the Titan deities Chornus and Rhea, he was also referred to as Neptune. Poseidon sided with his younger brother Zeus in slaying their father and freeing their siblings from a prison in the dark underworld known as Hades. After defeating their father, Zeus became ruler of Olympus and he granted each of his sibling’s dominion over the regions of the Earth. Pluto was asked to rule over the underworld and guard its prisoners, Poseidon was given dominion over Earth's seas, Demeter was assigned to watch over the land, and Vesta was to watch over the people.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "Tales to Astonish #70 (1965)\n", 
    "groupaffiliation": "Olympian Gods", 
    "hair": "White\n", 
    "height": 75, 
    "id": "Neptune", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Chronus (father, Titan), Rhea (mother, Titan), Zeus, Pluto (brothers), Amphitrite (wife), Triton (son), Rhode, Benthesicyme (daughters), Heracles, Ares, Hephaestus, Apollo, Hermes, Dionysus (nephews), Aphrodite, Pallas Athena, Artemis, Eileithyia, Hebe, Discord, Pandia, Helen, Persephone (nieces)", 
    "occupation": "God of the Seas", 
    "placeofbirth": "Olympus", 
    "powers": "Poseidon was thought to be omnipotent just like his brother Zeus, he had divine powers which allowed him to resurrect the dead. Poseidon possessed superhuman strength, agility, stamina and reflexes. He was immune to conventional diseases and aged very slowly. He along with the other members of his race are thought to be immortal. They can be injured mortally or even die and survive the attack.", 
    "realname": "Poseidon (Neptune)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 625
}