{
    "aliases": "None", 
    "citizenship": "Shi'ar", 
    "content": "D'ken coveted the power of the M'kraan Crystal, called the \"Crystal Heart of Reality,\" to use as the ultimate weapon. His sister, Lilandra, tried to stop him and was branded a traitor, joining with the Starjammers. Narrowly escaping death, she traveled to Earth and enlisted Professor X and the X-Men's aid, despite the efforts of D'ken and his agents (most notably Eric the Red) to thwart this outcome.D'ken led the Imperial Guard to the Crystal's location, but the X-Men's Phoenix (the Phoenix Force in the form of Jean Grey) transported the X-Men there to oppose him. D'ken, the Imperial Guard, the X-Men, and the space pirates Starjammers were all transported to a world within the Cyrstal, and the battle threatened to destroy all reality if it were not for the saving power of the Phoenix. D'ken was left incurably insane and nearly catatonic as a result of a pyschic attack on him within the Crystal. Once everyone returned to reality, the X-Men traveled back to Earth, and Lilandra took D'ken's place as empress of the Shi'ar Galaxy.Garbriel Summers had since become a hero known as Vulcan, although he seemingly perished in his first mission as an X-Men and all information about him and his team was expunged. Reviving after the Scarlet Witch had re-structured reality, he remembered the truth of his parentage and swore revenge on D'ken. He commandeered a Shi'ar vessel, but upon learning of D'ken's catatonic state, transferred his thirst for revenge upon the whole Shi'ar empire.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 1, 
    "firstappearance": "Uncanny X-Men #107 (1977)\n", 
    "groupaffiliation": "None", 
    "hair": "(feathers) Black\n", 
    "id": "Neramani,_D%27Ken", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Deathbird (Al'svee Neramani (sister), Lilandra Neramani (sister), Vulcan (Gabriel Summers, son), Adam-X (X-Treme, alleged son)", 
    "occupation": "(Formerly) emperor of the Shi'ar Galaxy", 
    "origin": "Unrevealed", 
    "placeofbirth": "The Aerie (native world of the Shi'ar)", 
    "powers": "None, aside from the natural physiology of the Shi'ar race", 
    "realname": "D'ken Neramani", 
    "significantissues": [
        "Attempted to gain the power of the M'kraan Cyrstal but de-stabilized it, saved by the X-Men (X-Men #107-108/Classic X-Men #14, 1977/1987)", 
        "killed by Vulcan (Uncanny X-Men #485, 2007)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}