{
    "aliases": [
        "\"Fuzzy Elf\"", 
        "formerly Gainsborough"
    ], 
    "citizenship": "Germany", 
    "content": "Margali took baby Kurt to the small Bavarian circus where she worked as a fortune teller as a cover for her activities as a sorceress.  Kurt was never legally adopted by anyone, but was raised by all the members of the circus, who had no prejudices against \"freaks\".  Kurt grew up happily in the circus with his two closest friends, Margali's natural children Stefan and Jimaine.  Stefan feared that his magical heritage may one day corrupt him, and so he had Kurt promise that if he ever killed without reason for Kurt to stop him. During his formative years Kurt exhibited tremendous natural agility, and quickly became the circus's star acrobat and trapeze artist with audiences assuming that he was simply a normal human dressed in a demon costume.  Kurt worked closely with Jimaine, and the pair soon became involved in a romantic relationship.Kurt agreed to join the group, but before they left for America, he and Xavier went to the Bavarian circus so that Kurt could explain to Margali about Stefan's death.  However, Margali was not there, and for years she held Kurt responsible for murdering Stefan.  Later, she learned the truth and she and Kurt were reconciled.  Kurt was also happily reunited with Jimaine, who had been living in the United States under the assumed name of Amanda Sefton.After many adventures with the X-Men, including a clash with the Brotherhood of Evil Mutants during which Kurt first met his mother Mystique (although he didn't know it at the time), discovering his ability to be invisible in shadow, traveling through dimensions with Kitty Pryde's dragon Lockheed, and more, Kurt was finally severely wounded during the attack on the underground colony of mutants known as the Morlocks by Riptide, a member of a team of mutant assassins named the Marauders.  Kurt was taken to the mutant research facility on Muir Island off the coast of Scotland where he recuperated, but discovered that he could no longer teleport as he originally could, and that teleporting others caused a great strain.  After hearing of the apparent \"death\" of the X-Men in Dallas when the team fought the Adversary, Kurt, Pryde, Rachel Summers, Captain Britain, and Meggan became the founding members of the British super-team Excalibur.After an encounter with the monarch of Latveria, the armored despot Dr. Doom, Kurt's powers were fully restored after Doom used an electromagnetic scrambler in an attempt to disrupt Kurt's teleportating abilities which instead accidentally realigned them.Following a misunderstanding with Captain Britain over his relationship with Meggan that resulted in a broken leg, Kurt reformed the team of alien bounty hunters known as the Technet into a team of costumed superhuman adventurers dubbed the N-Men.  Following the Technet's departure, Kurt became Excalibur's leader after the team gained several new members, including the alien Shi'ar named Cerise.  Kurt helped Cerise become accustomed to her new life on Earth, which led to the pair forming a romantic relationship.  This was to be short-lived, however, after Cerise was found guilty of war crimes and returned to the Shi'ar Empire.After Captain Britain and Meggan were married, Kurt along with Shadowcat and Colossus decided it was time to return to the X-Men.  Kurt once more served as a dedicated member of the team until after the battle with  the mutant despot Apocalypse that resulted in the seemed death of the first X-Man, Cyclops.  Soon after, the ever-devout catholic Kurt left the team to pursue aspirations of becoming a priest.  During his studies, Kurt was attacked and wounded by Rax, the hunter of the group of evolved mutants known as the Neo.  Fleeing, Kurt encountered mutant doctor Cecilia Reyes, and together the two faced the Neo until the X-Men arrived to swing the tide of battle.Kurt subsequently rejoined the X-Men while continuing his priesthood studies, but soon after took a leave of absence to mourn the death of his friend and team mate, Colossus.  When he returned to the X-Men, it was as a fully ordained priest after apparently undertaking a ceremony at St. Michael's Church in Brooklyn which was overseen by Kurt's mentor, Father Whitney.  Kurt even took to wearing a priest's collar as part of his X-Men uniform.Soon after, Kurt found himself unable to resist the compulsion to travel to the Isla des Demonas off the coast of Florida.  There, Kurt was manipulated into a ceremony with other teleporters like himself that opened a dimensional portal through which came an army of mutant demons.  The X-Men arrived to recover their teammate and clashed with the army.  During the battle, Kurt was forcibly removed from the ceremony which collapsed the portal, trapping all present into the other dimension.  There, Kurt learned that the leader of the army, Azazel, was his natural father and the father of the other teleporters present.  A mutant from biblical times, Azazel sought to use his children's combined powers to return to Earth and enslave humanity.  However, Kurt rejected him and, with the aid of his newly-found half-brothers Abyss and Kiwi Black, Azazel was defeated.Nightcrawler has since gone on several missions of an occult nature, culminating in a battle against the demonic Hive who was revealed to be responsible for Stefan's rampage. Nightcrawler would be visited by Mephisto on his birthday shortly after that event, who told Nightcrawler that a war was brewing, and if Nightcrawler would take Mephisto's side, he could have any reward he wanted. Kurt rejected the offer, however. Recently, Nightcrawler has also met the dimensionally-stranded Nocturne, daughter of a Nightcrawler from an alternate timeline, who has taken to calling him \"dad.\"", 
    "durability": 5, 
    "education": "College-level courses at Xavier's School for Gifted Youngsters", 
    "energy": 7, 
    "eyes": "Shining yellow, no visible pupils\n", 
    "fighting": 7, 
    "firstappearance": "Giant-Size X-Men #1 (1975)\n", 
    "groupaffiliation": [
        "X-Men", 
        "formerly Neyaphem", 
        "Excalibur", 
        "N-Men"
    ], 
    "hair": "Indigo\n", 
    "height": 69, 
    "id": "Nightcrawler", 
    "identity": "Secret (known to British authorities)", 
    "intelligence": 5, 
    "knownrelatives": "Azazel (father), Raven Darkholme (Mystique, mother), Graydon Creed (half-brother, deceased), Nils Styger (Abyss, half-brother), Kiwi Black (half-brother), other half-siblings (deceased), Margali Szardos (foster mother), Rogue (foster sister), Jimaine Szardos(Magik, Amanda Sefton, foster sister), Stefan Szardos (foster brother, deceased), Talia Wagner (Nocturne, alternate timeline daughter)", 
    "occupation": [
        "Adventurer", 
        "former priest", 
        "circus performer"
    ], 
    "origin": [
        "Uncanny X-Men #428 (2003)", 
        "Uncanny Origins #8 (1997)"
    ], 
    "placeofbirth": [
        "Bavaria", 
        "Germany"
    ], 
    "powers": "Nightcrawler is a mutant who can teleport by opening a portal into another dimension, travelling through it via an unconscious direction-finding sense, and returning to his own dimension. When teleporting, Nightcrawler leaves behind a small portion of the atmosphere of the other dimension that escapes with a muffled “bamf” sound and smells of brimstone. On returning, his power automatically displaces any extraneous liquids and gases.\nNightcrawler can easily teleport north south along Earth's magnetic lines of force. However, teleporting east west against them or teleporting vertically is more difficult. Under optimal conditions, Nightcrawler can teleport 2 miles east west, 3 miles north south, and 2 miles vertically if he exerts himself. Nightcrawler's momentum is retained when teleporting, so he arrives with the same inertia he left with. He can reduce this by teleporting short distances in the opposite direction.\nNightcrawler has a limited unconscious extrasensory ability that prevents him from teleporting into any area that he cannot see or has not seen in the past, as doing so runs the risk of injury or death by materializing partially or entirely within a solid object.\nThrough practice, Nightcrawler has increased the mass he can teleport with him, though the limit to the amount of weight he can carry when teleporting and the distance over which he can teleport with such additional loads are unknown. Teleporting with Nightcrawler often leaves a passenger feeling weak and nauseous.\n\nNightcrawler is also able to cling to solid surfaces via his hands and feet. He can also render himself nigh-invisible in shadows by manipulating the ever-present portal to the dimension he teleports through so as to bend light around himself.", 
    "realname": "Kurt Wagner", 
    "significantissues": [
        "Killed foster brother (X-Men Annual #4, 1980)", 
        "first joined X-Men (Giant-Size X-Men #1, 1975)", 
        "first used image inducer (Classic X-Men #4, 1986)", 
        "first blended with shadows (X-Men #102, 1976)", 
        "first encountered Mystique (X-Men #141, 1981)", 
        "injured by Marauders (Uncanny X-Men #211, 1986)", 
        "co-founded Excalibur (Excalibur: The Sword is Drawn, 1988)", 
        "regained full powers (Excalibur #37, 1991)", 
        "formed N-Men (Excalibur #45, 1991)", 
        "learned Mystique is mother (X-Men Unlimited #4, 1994)", 
        "rejoined X-Men (Uncanny X-Men #360/X-Men #80, 1998)", 
        "first seen studying for priesthood (X-Men #100, 2000)", 
        "first encountered Supreme Pontiff (Uncanny X-Men #400, 2001)", 
        "quit priesthood (Uncanny X-Men #419, 2003)", 
        "learned Azazel is father (Uncanny X-Men #432, 2003)", 
        "died (X-Force #26, 2010)"
    ], 
    "speed": 7, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 161
}