{
    "aliases": [
        "Edvard Haberdash", 
        "impersonated Hamir and countless others"
    ], 
    "citizenship": [
        "Nightmare World", 
        "Dream Dimension"
    ], 
    "content": "Nightmare has also faced many other foes such as Clea, Spider-Man, the Micronauts, Dazzler, Ghost Rider (John Blaze and Dan Ketch), the Hulk, Cloak & Dagger, Excalibur, Daredevil, Straw Man, Doctor Doom, Wolverine, Sleepwalker, the Enchantress, Heimdall, Morbius, Emma Frost, Captain America, Black Panther and Moon Knight. Nightmare has worked to corrupt unstable super-beings such as the Hulk and Cloak, each of whom have gone on mad Nightmare-inspired rampages, but his influence usually proves temporary. For a time, Nightmare was allied with rival fear-sowing entities such as the Fear Lords, but the group was thwarted by Dr. Strange and his allies.", 
    "durability": 7, 
    "education": "Unknown", 
    "energy": 7, 
    "eyes": "Blue-black\n", 
    "fighting": 3, 
    "firstappearance": "Strange Tales #110 (1963)\n", 
    "groupaffiliation": "Fear Lords", 
    "hair": "Gray\n", 
    "height": 0, 
    "id": "Nightmare", 
    "identity": "Existence not consciously known to general public", 
    "intelligence": 4, 
    "knownrelatives": "Daydream,  Dreamqueen (daughters), Dweller-In-Darkness (“cousin“), other distant relations", 
    "occupation": [
        "Ruler of the Nightmare World", 
        "former nightclub owner"
    ], 
    "placeofbirth": "Everinnye dimension", 
    "powers": "A demon of great mystical power, Nightmare usually targets his victims while they sleep by drawing their psyches into his Nightmare World, the substance and contents of which he can manipulate and reshape at will. He can trap psyches indefinitely but usually only torments souls temporarily lest he permanently deplete the psychic energies he consumes. While inside his own realm, Nightmare is virtually omnipotent; however, he is less powerful and more vulnerable when he manifests outside his kingdom, and was particularly diminished when he assumed mortal form as Edvard Haberdash.", 
    "realname": "Unknown", 
    "speed": 7, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": "Variable\n"
}