{
    "aliases": [
        "Cassandra Nova", 
        "Mummudrai", 
        "Anti-Self", 
        "Immensity"
    ], 
    "citizenship": "U.S.A. (legally deceased)", 
    "content": "In Charles’ body, Cassandra publicly outed him as a mutant. After the Beast discovered her secret, Cassandra telepathically coerced the young student Beak to bludgeon him into a coma, and then left Earth with the alien Shi’ar. Cassandra mentally coerced the Shi’ar Empress Lilandra into ordering the Imperial Guard to Earth to destroy all mutants under the premise they were infected with a mental plague. After the truth was revealed, the Imperial Guard joined with the X-Men in an attempt to stop Cassandra after she returned to Earth. As they all fell before her power, Jean Grey used the Cerebra computer to place a piece of Charles’ consciousness into the mind of every living mutant on Earth. When Cassandra used Cerebra in an attempt to kill all mutants, Charles’ consciousness was re-connected and he forced Cassandra out of his body. Now fleshless, the mummudrai desperately sought another body. Emma Frost presented it with what appeared to be its old body; however, it was a trap laid by Emma and her students, the Stepford Cuckoos, who forced the Imperial Guardsman Stuff to transform its alien bio-computer body into a synthetic copy of Cassandra’s body. On entering the body, the mummudrai found itself trapped in a child-like state and forced to undertake pre-programmed tutelage.", 
    "durability": 1, 
    "education": "Various courses at Xavier Institute", 
    "energy": 1, 
    "eyes": "(True form) Inapplicable); (human form) Blue\n", 
    "fighting": 1, 
    "firstappearance": "New X-Men #114 (2001)\n", 
    "groupaffiliation": "Hellfire Club (Inner Circle)", 
    "hair": "(True form) Inapplicable); (human form) None\n", 
    "height": 0, 
    "id": "Nova,_Cassandra", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Brian Xavier (father, deceased), Sharon Xavier (mother, deceased), Charles Francis Xavier (Professor X, brother), Cain Marko (Juggernaut, step-brother)", 
    "occupation": [
        "Terrorist", 
        "former student"
    ], 
    "origin": [
        "New X-Men #121 (2002)", 
        "New X-Men #126 (2002)"
    ], 
    "placeofbirth": [
        "New York City", 
        "New York"
    ], 
    "powers": "The mummudrai are able to copy the DNA of sentient beings and use it to construct physical bodies for themselves. The mummudrai can also manipulate the DNA it copies to act as a rapid healing factor or to phase through solid matter. Further, they can manipulate the DNA of others, breaking it down at the molecular level. After copying the DNA of Charles Xavier, the mummudrai Cassandra Nova accessed the full spectrum of latent mutant functions in his genome, granting itself vast psionic powers.", 
    "realname": "Cassandra Xavier", 
    "significantissues": [
        "Copied Charles Xavier’s DNA, created physical form in-utero, attacked by unborn infant Xavier (New X-Men #121, 2002)", 
        "revealed to have been stillborn, survived as cellular matter, rebuilt physical form (New X-Men #126, 2002)", 
        "used Donald Trask to usurp control of “wild” Sentinels, telepathically confronted Charles (New X-Men #114, 2001)", 
        "sent Sentinels to decimate Genosha, allowed herself to be captured by X-Men (New X-Men #115, 2001)", 
        "escaped, vs X-Men, switched minds with Charles, publicly outed him as a mutant (New X-Men #116, 2001)", 
        "secret discovered by Beast, telepathically coerced Beak to bludgeon him, left Earth with Shi’ar (New X-Men #117, 2001)", 
        "mentally enslaved Lilandra, coerced her into sending Imperial Guard to attack X-Men (New X-Men #122-124, 2002)", 
        "returned to Earth, vs Imperial Guard & X-Men, forced out of Charles’ body, tricked into possessing synthetic form pre-programmed to re-educate it (New X-Men #125-126, 2002)", 
        "seemingly returned as member of Hellfire Club (Astonishing X-Men #12-13, 2005-2006)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 115
}