{
    "aliases": [
        "All-Father", 
        "Atum-Re", 
        "Farma-god", 
        "Hanga-god", 
        "Hapta-god", 
        "Harbard", 
        "Infinity", 
        "One-Eye", 
        "Orrin", 
        "Sigtyr", 
        "Val-Father", 
        "Wad", 
        "Woden (Anglo-Saxon name)", 
        "Wotan (Old German name)", 
        "Wulf the Wanderer"
    ], 
    "citizenship": "Asgardian", 
    "content": "Odin later had the dwarfs Eitri and Brokk forge the enchanted Uru hammer Mjolnir, which Thor inherited. In approximately 1000 AD, Odin help found the Councils of God Heads, who interceded when the extraterrestrial Celestials threatened to cut the gods off from Earth; Odin constructed the unstoppable armored Destroyer and the Odinsword should he face the Celestials in battle upon their return. Odin engaged the \"mad titan\" Thanos in a battle that ended in a stalemate, after Odin mistook Thanos' efforts to cure Thor of warrior madness as an attack upon his injured son.", 
    "durability": 7, 
    "education": "Extensively trained in combat", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 7, 
    "firstappearance": "Journey Into Mystery #85 (1962)\n", 
    "groupaffiliation": [
        "Gods of Asgard", 
        "Sky-Fathers"
    ], 
    "hair": "White, formerly blond\n", 
    "height": 81, 
    "id": "Odin", 
    "identity": "Believed fictional by general Earth populace", 
    "intelligence": 7, 
    "knownrelatives": "Buri (Tiwaz, paternal grandfather); Bolthorn (maternal grandfather, deceased); Bor (father, deceased); Bestla (mother, deceased); Ve (brother, deceased); Vili (brother, deceased); Frigga (wife); Balder, Hermod, Thor, Tyr, Vidar (sons); Loki (foster son); Sigyn (former daughter-in-law); Mimir (uncle); Hoder (nephew)", 
    "occupation": "Former Sky Father and monarch of Asgard", 
    "origin": [
        "Journey Into Mystery #97 (1962)", 
        "Thor Annual #5 (1976)", 
        "Thor #294 (1980)", 
        "Thor Annual #11 (1983)", 
        "Thor #349 (1984)"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "Odin possessed a variety of superhuman attributes common to the superhuman race of beings known as the Asgardians.  Odin was superhumanly strong and was capable of lifting about 60 tons.  Odin, despite his advanced age at the time of his death, was much stronger than the average Asgardian male, which could lift roughly 30 tons.  \nLike all other Asgardians, Odin was extremely long lived and aged at a much slower pace than humans, but was not immortal in the same sense as some other races of gods who ceased to age upon reaching adulthood. Odin was highly resistant to physical injury and he couldn't die under conventional circumstances. It would take an injury that resulted in a spreading of a significant portion of his bodily molecules over a great distance, thus preventing the mystical lifeforce common to all Asgardians from regenerating areas essential to his survival, to cause him to physically die. The tissues of Odin's body; his flesh, bone, and muscle possessed about three times the density of the tissue of a human body.  This helped to contribute to Odin's superhuman strength and weight. Odin's advanced musculature generated considerably less lactic acids than the musculature of human beings, granting him superhuman levels of stamina in all physical activities.\n\nOdin possessed vast energy manipulating abilities called the Odinforce and could manipulate tremendous amounts of mystical energies for a variety of purposes, only some of which were seen. Odin could temporarily increase his own superhuman physical attributes, fire powerful bursts of energy for destructive purposes, teleportation between dimensions, grant living beings or inanimate objects a variety of superhuman abilities, control the lifeforce of other Asgardians, etc. He was periodically required to enter week-long Odinsleep to preserve his immortality and renew his godly energies.", 
    "realname": "Odin Borson", 
    "significantissues": [
        "First battled Surtur (Journey Into Mystery #99, 1963)", 
        "adoption of Loki (Journey Into Mystery #112, 1965)", 
        "defeated Infinity his evil self brought to life by Hela (Thor #188, 1971)", 
        "died in battle with Mangog (Thor #198, 1972)", 
        "restored to life by Hela to prevent Pluto from claiming his soul (Thor #201, 1972)", 
        "controlled by Egyptian gods, became Atum-Re (Thor #240-241, 1975)", 
        "sacrificed his right eye to Mimir for wisdom to forestall Ragnarok (Thor #274, 1978)", 
        "absorbed spirits of all Asgardians save Thor, animated the Destroyer, killed in a battle against Celestials (Thor #300, 1980)", 
        "with other Asgardians, resurrected by Thor, using power obtained from other pantheons (Thor #301, 1980)", 
        "engaged in chess match with Dormammu, as champions of Master Order and Lord Chaos, respectively (Thor Annual #9, 1981)", 
        "origin of his powers and fate of his brothers recounted (Thor #349, 1984)", 
        "seemingly perished in battle with Surtur (Thor #353, 1985)", 
        "survival and imprisonment by Seth revealed (Thor #398-399, 1988-1989)", 
        "his full power and missing restored, absorbed essence of Surtur (Thor #400, 1989)", 
        "possession by spirit of Surtur revealed (Thor #418, 1990)", 
        "restored to normal after Thor defeated Surtur (Thor #425, 1990)", 
        "fought Surtur in Norway, slain by him (Thor #40, 2001)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 650
}