{
    "aliases": [
        "Charlie", 
        "Charles Xavier", 
        "Magneto", 
        "That Which Shall Survive"
    ], 
    "citizenship": "Inapplicable", 
    "content": "Learning the mutant-hunting Sentinels could store psionic energy, Onslaught abducted scientists to create a Sentinel army. Soon after, Xavier encountered X-Man (Nate Grey) on the astral plane, who pulled Xavier’s astral form into the physical world. Onslaught thus escaped Xavier’s mind, but was still “tethered” to Xavier. To assist disseminating his hyper-psionic energy, Onslaught had the mutant teleporter Gateway abduct the psionic mutant Chamber, sent the armored mutant Post to “test” the X-Men and Cable, and recruited and empowered other mutants such as Blob, Mimic and Holocaust. Now fully possessing Xavier, Onslaught revealed Xavier’s suppressed darker memories to Jean Grey, hoping to recruit her Phoenix Force experience to gain more power. Rejecting Onslaught, Jean removed the Juggernaut’s mental block, discovering that Onslaught was Xavier. Onslaught then trapped Juggernaut’s consciousness inside Marko’s own empowering Ruby of Cyttorak, and created the child-like psionic projection Charlie to befriend and capture vastly powerful mutant child Franklin Richards.As Xavier, Onslaught attempted to lead the X-Men to war against humans. When the X-Men resisted, Onslaught revealed itself and attempted to destroy them. Onslaught then mentally enslaved the Hulk and sent him after Cable, but Cable and Storm freed the Hulk. Onslaught captured X-Man, adding both his and Franklin’s psionic powers to its own. It sent the Sentinels to Manhattan to sow panic, created a Central Park citadel, and unleashed an electromagnetic pulse. The X-Men, Fantastic Four, Avengers and even Doctor Doom opposed Onslaught, and after Thor freed Xavier, Onslaught became even more powerful.", 
    "durability": 7, 
    "energy": 7, 
    "eyes": "Variable Solid Colors (no visible irises or sclera)\n", 
    "fighting": 7, 
    "firstappearance": "(Named) Uncanny X-Men #322 (1995); (in shadows) X-Man #15 (1996); (fully) X-Men #53 (1996)\n", 
    "groupaffiliation": [
        "Employer of Gateway", 
        "Post", 
        "Blob", 
        "Mimic", 
        "Holocaust", 
        "& Dark Beast", 
        "controller of Sentinel army"
    ], 
    "hair": "Inapplicable\n", 
    "height": 120, 
    "id": "Onslaught_(entity)", 
    "identity": "No dual identity", 
    "intelligence": 7, 
    "knownrelatives": "Charles Xavier (Professor X, co-progenitor), Magnus (Magneto, co-progenitor)", 
    "occupation": "Would-be destroyer", 
    "origin": "Wolverine #104 (1996)", 
    "placeofbirth": [
        "Xavier Institute for Higher Learning", 
        "Westchester", 
        "New York"
    ], 
    "powers": "Onslaught possessed the combined abilities of Professor X, Magneto, Franklin Richards, and X-Man, including telepathy, telekinesis, astral projection, illusion creation, mental bolt projection, sensing mutant presences, manipulating magnetic fields, and affecting reality itself. Onslaught could also enhance its physical size and strength.", 
    "realname": "Inapplicable", 
    "significantissues": [
        "Xavier mindwiped Magneto, inadvertently created Onslaught (X-Men #25/Wolverine #104, 1993/1996)", 
        "Onslaught learned of Landau, Luckman & Lake’s warp portals, devised plan to erase thought by uniting mankind in a collective intelligence (X-Men: The Road to Onslaught, 1996)", 
        "invited Juggernaut to join him, knocked him across continent when he refused (Uncanny X-Men #322, 1995)", 
        "stole data on Cable from Blaquesmith’s computers (Cable #21, 1995)", 
        "learned of Sentinel’s ability to absorb psionic energy, invaded invaded Sentinel research facility, abducted scientists (X-Men: The Road to Onslaught/X-Men #46, 1996/1995)", 
        "witnessed X-Man pulling Xavier’s astral form into physical world (X-Man #10, 1995)", 
        "recruited Gateway, sent him to abduct Chamber (X-Men: The Road to Onslaught/X-Men #49, 1996)", 
        "had Gateway teleport X-Men to be tested by Post (X-Men #50, 1996)", 
        "X-Force encountered Onslaught’s servants Blob & Mimic (X-Force #52, 1996)", 
        "sent Post to confront Cable (Cable #31, 1996)", 
        "defeated Sebastian Shaw & Tessa, recruited Holocaust, sent Holocaust to abduct X-Man (X-Man #15, 1996)", 
        "Cable & Domino began investigating Onslaught, Onslaught attacked Blaquesmith (Cable #32, 1996)", 
        "aided Gambit & Jean Grey in escaping Operation: Zero Tolerance (Uncanny X-Men #333, 1996)", 
        "Post attacked Cable (Cable #33, 1996)", 
        "appeared to Jean Grey, invited her to become his consort (X-Men #53, 1996)", 
        "appeared to London Hellfire Club Black Queen (Excalibur #99, 1996)", 
        "X-Man defeated Holocaust (X-Man #17, 1996)", 
        "Juggernaut sought Jean Grey to unlock Onslaught’s identity from his mind (Uncanny X-Men #334, 1996)", 
        "Jean Grey learned Onslaught’s true identity from Juggernaut’s mind, Onslaught confronted Juggernaut (X-Men #54, 1996)", 
        "X-Man sought Avengers’ help against Onslaught (Avengers #401, 1996)", 
        "appeared to Franklin Richards as “Charlie” (Fantastic Four #414, 1996)", 
        "Juggernaut discovered trapped within Ruby of Cyttorak, Onslaught confronted X-Men, opposed by them, appeared to Franklin again, X-Man recruited Avengers’ help, Onslaught recruited Dark Beast (Onslaught: X-Men/X-Men Unlimited #12, 1996)", 
        "Avengers & X-Man came to X-Men’s aid, Avengers went to warn Fantastic Four of Onslaught’s interest in Franklin, X-Men set off for Muir Island, X-Force tasked with safeguarding X-Man, Storm went to aid Cable (Uncanny X-Men #335, 1996)", 
        "Onslaught mind-controlled Hulk, sent him to attack Cable (Incredible Hulk #444, 1996)", 
        "Cable & Storm vs Hulk, freed him of Onslaught’s control (Cable #34/Incredible Hulk #444, 1996)", 
        "Emma Frost sought to protect Generation X from Onslaught (Generation X #18-19, 1996)", 
        "Gateway revealed Onslaught’s origin to Wolverine & Elektra (Wolverine #104, 1996)", 
        "Avengers & Gambit located Joseph & Rogue (Avengers #401, 1996)", 
        "Onslaught confronted Fantastic Four, opposed by FF, Avengers & X-Men, defeated them, abducted Franklin (Fantastic Four #415, 1996)", 
        "X-Factor vs Post, Onslaught took control of Sentinels, Forge, Sabretooth & Mystique vs Dark Beast (X-Factor #125, 1996)", 
        "X-Men obtained Xavier Protocols (Excalibur #100, 1999)", 
        "Avengers, X-Men & Fantastic Four vs Sentinels, Onslaught created citadel, generated telepathically-enhanced electromagnetic pulse (X-Men #55, 1996)", 
        "X-Force failed to prevent Mr. Sinister capturing X-Man (X-Man #18/X-Force #57, 1996)", 
        "Spider-Man/Ben Reilly, Peter Parker & Green Goblin/Phil Urich vs Sentinels (Amazing Spider-Man #415/Green Goblin #12/Spider-Man #72, 1996)", 
        "Juggernaut escaped Ruby with aid of Gomurr & Tar (X-Men Unlimited #12, 1996)", 
        "Thor encountered Hela on eve of final battle against Onslaught (Thor #502, 1996)", 
        "Sinister failed to prevent Onslaught capturing X-Man (X-Man #19, 1996)", 
        "Xavier freed from Onslaught by Thor, Onslaught grew more powerful as a result (Uncanny X-Men #336, 1996)", 
        "Cable & Invisible Woman teamed with Apocalypse to attempt rescue of Franklin, betrayed by Apocalypse, rescue failed (Cable #35, 1996)", 
        "Wolverine rejoined fight against Onslaught (Wolverine #105, 1996)", 
        "Beast rescued by X-Factor, Dark Beast defeated & captured (X-Factor #126, 1996)", 
        "Onslaught failed to manipulate X-Force (X-Force #58, 1996)", 
        "Onslaught opposed Fantastic Four with phantoms of their greatest foes, Puppet Master, Inhumans, Black Panther, Fantastic Force, Namor, She-Hulk, & Doctor Doom joined fight against Onslaught (Fantastic Four #416, 1996)", 
        "Avengers vs Sentinels (Iron Man #332, 1996)", 
        "Hulk & Avengers attempted sneak attack on Onslaught, failed (Incredible Hulk #445, 1996)", 
        "S.H.I.E.L.D. vs Sentinels, Helicarrier downed, Punisher aided survivors (Punisher #11, 1996)", 
        "Avengers vs Holocaust & Post (Avengers #402, 1996)", 
        "Joseph & Rogue vs Sentinels, heroes planned final assault on Onslaught (X-Men #56, 1996)", 
        "Excalibur contemplated joining fight against Onslaught (Excalibur #101, 1996)", 
        "Avengers, Fantastic Four, Hulk, Namor, Doctor Doom & others seemingly sacrificed lives to destroy Onslaught (Onslaught: Marvel Universe, 1996)", 
        "heroes encountered manifestation of Onslaught (Iron Man #6, 1997)"
    ], 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 900
}