{
    "aliases": [
        "Killer Whale", 
        "the Human Killer Whale", 
        "Weapon One"
    ], 
    "citizenship": "Atlantis with international criminal record", 
    "content": "Having re-created the procedure which empowered the rogue amphibious superhuman Tiger Shark, Dorcas believed that Orka's limited intelligence made him an ideal candidate for this process since he was less likely to rebel against his benefactors.  Dorcas subjected Orka to a series of painful electro-shocks and irradiations which gradually enhanced his physiology, culminating in Orka's mutation by a \"morphotron\" device, which imprinted Orka with the genetic traits of a group of killer whales.  Far stronger than before (and able to augment that strength further with a power-absorbing belt linked to Dorcas' machines), Orka could now breathe in both air and water as well as communicate with and command whales.While Orka tested his new powers alongside an army of whales specially treated to survive long periods without air, Dorcas and Krang plotted the conquest of Atlantis.  When Namor stumbled upon their operation, Orka twice defeated him and the criminals enslaved Namor using a special control collar.  As further insurance, Dorcas and Krang also held hostage several Atlanteans, including Namor's beloved Dorma and advisor Vashti.  After the captives escaped, Krang ordered Orka to retrieve Dorma (whom Krang had long coveted) and kill the rest.  Orka's whales pursued the escapees, killing all but Dorma and Vashti until Tiger Shark happened upon the scene and defeated the whales, saving the two survivors.  Tiger Shark then promised to save Atlantis from Krang's forces in exchange for Dorma's reluctant vow that she would marry him.  When Krang, Dorcas, Orka and their whale army attacked Atlantis with Namor as their prisoner, Tiger Shark led the Atlantean army against them.  During the conflict, Namor freed himself and Orka clashed with Tiger Shark, a battle so destructive that a huge fissure opened in the ocean floor and swallowed them both.  The cowardly Krang and Dorcas had already fled by that time, and Orka's now-leaderless killer whales dispersed.Months later, the rampaging extra-dimensional tyrant Virago accidentally freed Orka, who no longer felt any loyalty to Krang after his commander's desertion.  Aspiring to conquer Atlantis and the surface world on his own behalf, Orka teamed with Virago and an army of whales to attack Atlantis again, fighting the Sub-Mariner and Namor's extraterrestrial ally Tamara Rahn.  The battle progressed in Orka's favor, but as he and Virago declared victory, Namor accidentally collided with a sunken U.S. navy vessel containing experimental nerve gas.  The gas escaped and rendered almost all Atlanteans comatose, including Orka.Gradually reviving due to his enhanced physiology, Orka was recruited by Roxxon Oil president Hugh Jones, who had fallen under the influence of the supernatural Serpent Crown.  Jones turned Orka over to Roxxon subsidiary the Brand Corporation, whose mutagenic procedures cured the lingering effects of the nerve gas, further augmented Orka's strength, eliminated the need for mechanical devices to further enhance his power, and tripled his size and the thickness of his blubber.  The larger, mightier Orka was held in reserve as a secret weapon until Jones' agenda brought him into conflict with the heroic Avengers.  When the Avengers stormed Brand's headquarters, Orka single-handedly felled most of them; however, even Orka's increased power was no match for a fighting-mad Thor, who finally beat Orka into submission and free his fellow Avengers.Years later, when Attuma rose to power in Atlantis and led a massive invasion of the surface world, Orka was part of the invading Atlantean army; however, he ran afoul of the Avengers again, and was subdued by the Black Panther and She-Hulk.  Somehow reduced to roughly his original size, Orka was imprisoned in Colorado's Vault super-prison and tried to escape during a mass breakout staged by the Wizard, but Iron Man subdued him.  Apparently slipping away during the ensuing confusion, Orka was soon among the many random villains manipulated by Doctor Doom's Aggression Enhancer device into attacking the Fantastic Four and was quickly defeated.  Reunited with Krang and restored to gigantic size, Orka aided him in a complex fraud scheme foiled by the She-Hulk.  Sent back to the Vault, Orka tried to escape again during a mass breakout led by Venom, but the Avengers intervened and Doctor Pym recaptured Orka.Eventually escaping, Orka returned to an Atlantis devastated and sparsely populated since Attuma's disastrous war.  He became a leading figure in the Atlantean army alongside Meranno, Tyrak and others.  When a three-way clash between the Avengers, Russian super-agents the People's Protectorate and the Peace Corpse terrorist group spilled into Atlantean waters, Orka and his fellow soldiers attacked the intruders.  As the surface-dwellers departed, Orka and company pursued them to Newfoundland, intent on avenging their people's honor and restoring their pride by striking back at the surface world.  The Atlanteans clashed with the Avengers, the People's Protectorate and Canadian super-team Alpha Flight until one of the nuclear bombs detonated and all factions were forced to cooperate to survive.  During this conflict, they also battled the Combine, a collective entity formed by a merger of irradiated Peace Corpse terrorists, until it achieved enlightenment and departed peacefully.  The Atlanteans, too, were allowed to depart, with promises of aid for rebuilding their ruined nation.Recruited by a robotic duplicate of the late Dr. Dorcas who believed himself to be the real Dorcas, Orka was subjected to procedures that made him larger and stronger than ever, though the transformation further retarded his intelligence.  As the robot's gigantic pawn, Orka battled Stingray and Namor, who defeated both Orka and the robot and freed the robot's captive, Stingray's wife Diane Newell.  Incarcerated at the Vault again, Orka was again reduced in size and was recaptured by the Thunderbolts during an attempted mass breakout.  Eventually on the loose once more, Orka teamed with Killer Shrike, Shockwave and Whiplash to take over retired aircraft carrier Intrepid as part of an extortion scheme, but mercenary super-team Heroes for Hire defeated and captured them.  Orka fared no better in a subsequent solo outing, apprehended through the combined efforts of Nova and Namor's cousin Namorita.  When Attuma usurped the throne of Atlantis again during one of Namor's absences, he recruited Orka, Tiger Shark, Nagala, Piranha and Sea Urchin to help him retain power; however, Namor returned with his surface world allies the Defenders, and Attuma's forces were defeated after two fierce battles.  During the final conflict, Orka and the monstrous Hulk were locked in a grudge match to the exclusion of all else, still fighting each other outside Atlantis long after Namor's victory.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Black\n", 
    "fighting": 1, 
    "firstappearance": "Sub-Mariner #23 (1970)\n", 
    "groupaffiliation": [
        "Formerly Heroes for Hire", 
        "Atlantean army", 
        "Brand Corporation"
    ], 
    "hair": "Black\n", 
    "height": 132, 
    "id": "Orka", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": [
        "Mercenary", 
        "former professional criminal", 
        "soldier"
    ], 
    "origin": "Sub-Mariner #23 (1970)", 
    "placeofbirth": "Atlantis", 
    "powers": "Orka has tremendous superhuman strength, stamina and durability, as well as enhanced speed and agility (both superhuman in water).  He can lift (press) up to 95 tons while wet, and up to 75 tons while dry.", 
    "realname": "Orka", 
    "significantissues": [
        "Joined Krang in his banishment, transformed by Krang’s ally Dorcas into amphibious super-being, twice defeated Namor, alongside Krang & Dorcas, invaded Atlantis, abandoned by Krang & Dorcas, lost in undersea crevice while battling Tiger Shark (Sub-Mariner #23-24, 1970)", 
        "freed by & allied with Virago, renounced allegiance to Krang, resolved to conquer Atlantis & surface world, alongside Virago, attacked Atlantis, vs Namor & Tamara Rahn, felled by nerve gas (Sub-Mariner #66-67, 1973)", 
        "recovered somewhat from nerve gas due to unique physiology, recruited by Hugh Jones via Serpent Crown, healed & augmented by Brand Corporation (Official Handbook of the Marvel Universe: Deluxe Edition #9, 1986)", 
        "now 24' high, defeated most of Avengers on Brand’s behalf, defeated by Thor (Avengers #149, 1976)", 
        "joined Attuma’s war on surface world, defeated by Avengers (Avengers Annual #18, 1989)", 
        "shrunk back to initial size & imprisoned in Vault, subdued by Iron Man during Vault breakout (Avengers Spotlight #26, 1989)", 
        "among villains mind-controlled by Doctor Doom into attacking Fantastic Four, defeated & captured (Fantastic Four #336, 1990)", 
        "regained larger size, adopted new costume, assisted Krang in fraud scheme that hinged on deliberately producing unsuccessful She-Hulk movie, defeated by She-Hulk, movie became hit despite their efforts (Sensational She-Hulk #12, 1990)", 
        "participated in attempted mass breakout at Vault, opposed by Avengers, captured by Doctor Pym (Avengers: Deathtrap - The Vault, 1991)", 
        "rejoined Atlantean army, alongside Merrano, Tyrak & others, vs Avengers, People’s Protectorate & Alpha Flight, joined forces with them to oppose Combine, departed peacefully with promises of surface world aid for war-ravaged Atlantis (Avengers #319-324, 1990)", 
        "briefly enlarged to over 60' high by rogue robot duplicate of Dorcas, mental faculties dulled by transformation, alongside Dorcas robot, vs Namor & Stingray (Namor: The Sub-Mariner #42-43, 1993)", 
        "imprisoned at Vault, restored to more conventional form, watched television (New Warriors #36, 1993)", 
        "participated in another mass escape attempt, recaptured by Thunderbolts (Thunderbolts ’97 Annual, 1997)", 
        "alongside Killer Shrike, Shockwave & Whiplash, tried to take over retired aircraft carrier Intrepid, vs Heroes for Hire, defeated & captured by Black Knight & Luke Cage (Heroes for Hire #4, 1997)", 
        "vs Namorita & Nova, defeated (New Warriors #0, 1999)", 
        "alongside Tiger Shark, Nagala, Piranha & Sea Urchin, on behalf of Attuma, vs Defenders, forced into seemingly endless grudge match with Hulk that lasted long after rest of battle was settled (Defenders #7 & 11, 2001-2002)", 
        "alongside other villains taken from various time periods, vs Avengers & league of heroes from divergent cosmos on behalf of rogue cosmic scholar (Avengers/JLA #4, 2004)", 
        "bailed out Stilt-Man, befriended Colleen Wing, Misty Knight & Otis Johnson, went drinking at Bar D’o with Otis & smashed up the place, shared information on Celia Ricadonna with Knight & Wing (Daughters of the Dragon #2-3 & 5, 2006)", 
        "joined new Heroes for Hire under Knight & Wing, helped team & Vienna run sting operation & initiate new members Tarantula & Humbug, captured sting victims Bloodshed, Equinox & Shockwave (Heroes for Hire #1, 2006)", 
        "with Heroes for Hire, vs Ricadonna’s forces including King Size & Flame, saved team & city from Grim Reaper’s bomb, developed crush on Knight, insisted he was fully reformed, helped save Humbug from Headmen (Heroes for Hire #4-7, 2007)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 732
}