{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A. (presumably still a minor)", 
            "content": "One such kidnapping attempt, once again from Mister Sinister’s orphanage, brought Nanny and the Orphan-Maker into conflict with Cyclops and Jean Grey, who were searching for Cyclops' infant son. Nanny was forced to flee, but she used the Orphan-Maker in a later attempt, this time to “liberate” Franklin Richards from the dangerous lifestyle his parents led. Again, she was thwarted, this time by Mister Fantastic, the Invisible Woman, and Captain America (as the Captain.) Another attempt led Nanny and her children to fight the original X-Factor over the orphaned babies that were rescued from being used in a demonic spell over Manhattan.Later, Nanny decided that the X-Men needed rescuing from the dangerous life they led, and she tracked them down to their base in Australia. She captured several members, sending them to attack the others with the Orphan-Maker. As the battle turned against her, Havok threw off Nanny’s influence, unleashing a blast and send her ship crashing, although Nanny and the Orphan-Makers’ bodies were never found.Years later, Nanny returned, determined as ever to rescue mutant children from a society that hates and fears them. She bade the Orphan-Maker to rescue the young St. Croix children (M and Penance) by killing their father, but he survived thanks only to the Orphan-Maker’s equipment dysfunction. (Nanny lamented that Peter must be “growing up,” and she redesigned his armor.) She then tried to have Orphan-Maker save a mutant child who took his school hostage after experiencing years of abuse, but the young mutants of Generation X also arrived, sparking a three-way conflict. The Orphan-Maker ultimately fled after witnessing the young mutant’s parents’ disregard for their own child, who turned out not to be a mutant at all, but merely a troubled, disfigured boy.", 
            "durability": 1, 
            "education": "Primary school drop-out", 
            "energy": 1, 
            "eyes": "Unrevealed\n", 
            "fighting": 1, 
            "firstappearance": "X-Factor #33 (1988)\n", 
            "groupaffiliation": "Agent of Nanny (cyborg)", 
            "hair": "Unrevealed\n", 
            "height": 0, 
            "id": "Orphan-Maker", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Criminal", 
            "placeofbirth": "Unrevealed", 
            "powers": "Unrevealed", 
            "realname": "Peter (full name unrevealed)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}