{
    "aliases": "Paul Denning", 
    "citizenship": "U.S.A.", 
    "content": "The Purple Man had manipulated the industrialist Maxwell Glenn into committing criminal acts for which he was being prosecuted, and Daredevil became personally involved, as he was dating Glenn’s daughter, Heather. In contrast, for Paladin, it was just business. He had been hired to take down the Purple Man by one former victims. Paladin and Daredevil crossed paths twice as they worked separately on the case, until on their third encounter they joined forces. The Purple Man eluded them both, however, when he fell into the water around Ryker's Island Prison and presumably drowned.Paladin was then hired by a woman named Marsha Roberts who wanted protection from her former boyfriend who had been transformed into a radioactive madman calling himself Phantasm. Similarly, Paladin was hired by Christine Michaels to track down her husband who had been transformed into Thermo the Thermatronic Man. Thermo was believed to be the so-called Street Stalker who was plaguing Manhattan, and Spider-Man bumped into Paladin when tracking him down. The two fought Thermo outside a nightclub, which alerted Dazzler, and it took the combined efforts of all three heroes to take Thermo down.He next appeared at the Caribbean island resort of Utopia Cay on behalf of a consortium of casino owners who hired him to apprehend the criminal Baron Brimstone who had been robbing their casinos. Ever the womanizer, he bumped into the vacationing Janet van Dyne, whose identity as the Wasp is publicly known, and they began seeing each other romantically. Together, they defeated Brimstone and parted amicably. He looked her up again when he was in New York, and wound up helping the Wasp apprehend several of the Avengers’ foes who were forming Zemo’s Masters of Evil at the time. The Wasp chided the mercenary that he helped despite the fact he was not being paid for it.Spider-Man came into conflict with Paladin when the mercenary was hired by Silver Sable to investigate a conspiracy against her native country of Symkaria. Spider-Man apologized for his intervention and helped Silver Sable and Paladin uncover an assassination plot. Paladin breezed off to another contract, leaving Spider-Man and Sable to deal with the assassination.Being a true gun-for-hire, Paladin has often found himself working on either side of the law. For instance, he was once hired by Vincent Mangano, godfather of a Maggia crime family, to kill the Punisher (although he claimed to be in it just for the money so that he could retire). Paladin’s first attempt failed, however, and Mangano set up his favored hitman to aid him. The two were still unsuccessful, as the Punisher found an ally in the U.S.Agent, who himself was hired to apprehend the Punisher but switched allegiances when he learned his orders were influenced by Mangano as well.Paladin continued to work for Silver Sable, joining her elite version of the Wild Pack, the Outlaws, alongside Sandman, the Prowler, and others. One of the Paladin’s first excursions with the Outlaws brought him into conflict with Excalibur, as Silver Sable traced stolen technology from her nation to England. Captain Britain and Excalibur were touring the nuclear facility and briefly fought the Outlaws until they uncovered the true culprit, Arnim Zola and teamed up against the genetic monstrosity behind his experiments.He has even been hired by other costumed individuals, in particular the time when Diamondback sought help in rescuing her allies Asp and Black Mamba from the Serpent Society, who had imprisoned the two on charges of treason against the team. Paladin, Diamondback, and Captain America succeeded in rescuing the them, but almost immediately afterward, the three women were taken by M.O.D.A.M. to be a part of Superia’s army of female supervillains. Paladin and Captain America had to infiltrate a cruise liner full of women to rescue them, an aspect of the assignment that the lady killer, Paladin particularly enjoyed.Although Silver Sable quickly abandoned the Outlaws as a team, Paladin was often hired to work with her as a recurring member of her Wild Pack.At least once, Paladin was hired by the Hellfire Club to lead a group of mercenaries. At the time, Cable was on the trail of the mysterious Tomorrow Agenda, a program that Donald Pierce begun to seek out the power of the mutant Apocalypse for his own use. Cable easily dispatched the mercenary team in his search for Pierce, taking out Paladin with ease.More recently, Paladin was hired by Adrienne Frost to recover a mystic samurai sword from the island nation of Madripoor. Unfortunately, the job went sour, as the sword was protected by the Rising Sons. Paladin retreated to Frost, who was then co-headmistresses of the Massachusetts Academy, where he encountered the young mutants of Generation X. Frost sent both Paladin and Generation X after the sword, and Jubilee became smitten by the flashy Paladin. After a desperate battle, and a near-death experience for Paladin, they managed to retrieve the sword, and Paladin parted company.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 7, 
    "firstappearance": "Daredevil #150 (1978)\n", 
    "groupaffiliation": [
        "Formerly Thunderbolts", 
        "Defenders", 
        "Heroes for Hire", 
        "Wild Pack", 
        "Outlaws", 
        "also worked for the Hellfire Club"
    ], 
    "hair": "Brown\n", 
    "height": 74, 
    "id": "Paladin", 
    "identity": "Secret", 
    "intelligence": 5, 
    "knownrelatives": "None", 
    "occupation": "Mercenary", 
    "origin": "Unrevealed", 
    "placeofbirth": "Unrevealed", 
    "powers": "Paladin possesses superhuman strength, the equivalent of three normal men.", 
    "realname": "Unrevealed", 
    "significantissues": [
        "dated Wasp, brought down Baron Brimstone (Avengers #251, 1985)", 
        "first appearing as a hired gun for Silver Sable, joining Spider-Man (Amazing Spider-Man #320-321, 1989)", 
        "hired by the Maggia to fight the Punisher (Punisher: No Escape, 1990)", 
        "hired by Diamondback to rescue Asp and Black Mamba (Captain America #381, 1990)", 
        "rescued Diamondback from Superia with Captain America (Captain America #387-392, 1991)", 
        "first appeared with the Outlaws, confronted Excalibur (Excalibur #36, 1991)", 
        "member of Wild Pack (Silver Sable & the Wild Pack #6-8, 1992): hired by Hellfire Club, led mercenary team against Cable (Cable #49, 1997)", 
        "hired by Adrienne Frost to recover sword, encounters Generation X (Generation X #52-54, 1999)", 
        "joined Defenders (Last Defenders #3, 2008)"
    ], 
    "speed": 1, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 225
}