{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Unrevealed", 
            "content": "When the space-warping mutant terrorist known as Locus teleported herself and X-Force member Skids to Mount Sorcista she broke through the mystical boundaries that held Pandemonia prisoner. The ancient succubus easily overcame the two girls, using her powerful magic to capture them and then imprison them in her dungeon. Etching her mystic symbol onto the Locus' forehead, Pandemonia managed to gain control of the young mutants mind. When Skids tried to escape, the succubus placed a mind-controlling sigil on her forehead as well.Pandemonia then made Locus teleport the three of them to X-Forces home in San Francisco where she ambushed and took control of Skids teammates: Meltdown, Sunspot, Siryn, and Proudstar. Pandemonia had used her powers to reshape X-Force's warehouse headquarters into a dark Gothic castle and her possessed X-Force were prepared to attack when Cannonball, Moonstar, and Jesse Bedlam returned from an exercise session. Because of status as a former Valkyrie, Dani Moonstar proved immune to Pandemonia's sigil. This unforeseen resistance disrupted the demonic sorceress' focus and Moonstar was able to evade her mind-controlled comrades and escaped with Bedlam and Cannonball.Desperate to find away to combat Pandemonia's magic, the trio searched through occult bookstores and eventually they were referred to the home of the sorceress Jennifer Kale. Kale was able to gather a remarkable amount of information about Pandemonia in a mystic tome that she referred to as her \"handy Demonic Concordance.\" The Concordence revealed Pandemonia's history and gave Kale Valuable secrets that she would be able to use against the succubus.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "White\n", 
            "fighting": 1, 
            "firstappearance": "(Shadowed) X-Force #80 (1998); (full) X-Force #85 (1999)\n", 
            "groupaffiliation": "None", 
            "hair": "White\n", 
            "height": 84, 
            "id": "Pandemonia", 
            "identity": "Succubus", 
            "intelligence": 1, 
            "knownrelatives": "Unidentified lesser Chaos Lord (father), unidentified (mother)", 
            "occupation": [
                "Sorceress", 
                "conqueror"
            ], 
            "placeofbirth": "Unrevealed", 
            "realname": "Pandemonia", 
            "significantissues": "Official Handbook Bibilography", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 220
        }
    }
}