{
    "aliases": "Pathway", 
    "citizenship": "Canadian", 
    "content": "Laura was autistic into her adolescence, and became a patient at the New Life Clinic, which was operated by Lionel Jeffries, the madman called Scramble. There Scramble used his superhuman powers to cause Laura to release her sister, who became known as Goblyn, from the \"Liveworld\" dimension to Earth. (Whenever Goblyn came to Earth, Laura took her place in \"Liveworld.\" When Laura returned to Earth, Goblyn would again return to \"Liveworld.\") Later, another menace, known as Bedlam, made Goblyn a member of his team of superhuman pawns, known as the Derangers. Bedlam pitted the Derangers against the members of Alpha Flight, a team of Canadian superhuman champions, in a battle that ended in the deaths of all the Derangers except Goblyn.The Purple Girl, a member of Alpha Flight's training division, Beta Flight, befriended both Laura and Goblyn, who were then inducted into Beta Flight as well. By now Laura was no longer autistic.Later, while Laura was in Liveworld, she was captured by the dimension's ruler, the Dreamqueen. The members, of Alpha Flight, including Goblyn, journeyed to Liveworld, rescued Laura, and battled the Dreamqueen, who then transported herself and them all to Earth, which she intended to conquer. Hence, Laura and Goblyn now coexisted on Earth for the first time. During the battle, former Alpha Flight member Puck seized the Dreamqueen, who stood within a dimensional portal between Liveworld and Earth. Realizing that she herself had the mutant power to open and close interdimensional portals, Laura then shut the portal, trapping the Dreamqueen within her own dimension.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Alpha Flight #53, 1987\n", 
    "groupaffiliation": "Former member of the Derangers and Beta Flight", 
    "hair": "Black\n", 
    "height": 48, 
    "id": "Pathway", 
    "identity": "Publicly known", 
    "intelligence": 1, 
    "knownrelatives": "Darby (father), Susan (mother), Goblyn (sister)", 
    "occupation": "Former adventurer", 
    "placeofbirth": "An unidentified Canadian city", 
    "powers": "Laura Dean is a mutant with the superhuman psionic ability to open portals into other dimensions at will. She can also mentally close any interdimensional portal that she has used her powers to open.", 
    "realname": "Laura Dean", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 190
}