{
    "aliases": "None", 
    "citizenship": "Citizen of the United States with no criminal record", 
    "content": "Eli Bradley comes from a family of heroes. Eli's grandfather, Isaiah, one of the first Super-Soldiers produced by the U.S. military, fought against the Axis in World War II (see: \"Truth: Red, White & Black\"), and his uncle, Josiah X, continued the family tradition, enlisting in Vietnam and recently taking up Isaiah's old Captain America uniform and joining the Crew. But Eli, unlike his grandfather and his uncle, was not a part of a sinister government plot to replicate Captain America's Super-Soldier Serum. Eli was never administered any type of Super-Soldier Serum, and was born with no superhuman abilities.At a time when the Avengers had disbanded, a young Kang The Conqueror traveled to the present era; sickened to have learned of the tyrant he would become from his future self, the teenage incarnation of Kang attempted to contact the Avengers in hopes to rewrite his personal history. Unsuccessful in his attempts to contact the Avengers, he downloaded the Vision's programming and operating system from the recently destroyed Avenger's remains, and accessed the Avengers' Failsafe program. Calling himself Iron Lad, the young Kang sought to recruit three New York-area based young men on the Vision's list of potential Avengers candidates to aid his cause; Eli's uncle, Josiah X, among them. However Josiah had been out of contact with his family for some time, and when Iron Lad encountered Eli, the youth told Iron Lad that he too was a super-soldier, wanting to live up to his family's heroic tradition. Eli used illegal Mutant Growth Hormone (MGH) pills to gain superhuman abilities, but informed Iron Lad he had received a blood transfusion from Isaiah following a violent altercation which caused heavy blood loss, resulting in the transference of the Serum and its desired effects. Wearing a costume very similar to that of Captain America's original sidekick, Bucky, Eli donned a full cowl and a set of five-pointed throwing stars as Patriot, and alongside his new teammates Teddy (Hulkling), Billy (Wiccan) and the Iron Lad, formed the Young Avengers.On one of their earliest outings the Young Avengers' super hero careers began to take off. After nearly bungling the rescue of a wedding party held hostage, the Young Avengers gained a persistent ally in Kate Bishop. Kate, a young woman in the wedding party, helped rescue herself, and Patriot, using one of Eli's discarded throwing stars. Immediately Eli and Kate demonstrated a contentious, and adversarial relationship. Eli found Kate annoying and arrogant, but their relationship was made more complex after Kate gave him one of Captain America's original triangular shields, and as Eli returned the favor and saved Kate's life as well.Following their initial encounter with Kang, the Young Avengers had been greatly changed. Eli's team had gained both Kate Bishop, and the teenage daughter of Scott Lang (Ant-Man), Cassie Lang (Stature), and had lost it's founder and leader, Iron Lad, for the sake of time itself. Though Eli was able to impress Captain America during this first encounter where the Young Avengers defeated Kang the Conqueror, both Iron Man and Captain America forbade the team from going out in costume again, using the threat of contacting and informing each teenager's parent. But the kids wouldn't take \"no\" for an answer, and after Kate unveiled their new headquarters at the abandoned Bishop Publishing building and new uniforms for the team, they went out into the world officially as \"Young Avengers.\"  Eli's new costume was only slightly different from his previous uniform, with a smaller, 'Zorro-style' mask and a scale-mail costume, like those of his grandfather, his uncle and Captain America.Soon after Eli's teammate Wiccan caught him in the act of using MGH to boost his powers. After taking MGH, Patriot fought Hyde one-on-one before injecting him with an overdose of MGH and knocking him unconscious. After being forcibly calmed by Wiccan's magics, Eli woke up in recovery at Avengers Tower, with the new Vision (now sporting the personality and memories of his friend Iron Lad) taking care of him. Eli revealed the true origins of his powers, then proceeded to quit the team. However he subsequently rejoined the Young Avengers after Hulkling was attacked by the Super-Skrull.During a battle between the Kree and the Skrulls, in which the Young Avengers fought alongside the New Avengers, Eli used himself to shield Captain America from gunfire, Eli was severly injured and rushed to a hospital. After the battle Captain America rushed to the hospital to give Eli a blood transfusion only to discover \"another Captain America\", Eli's Granfather, had already given Eli his blood. Since then Eli has gained the power he had previously pretended to have thanks to the transfusion.", 
    "durability": 4, 
    "education": "High School junior; The Bronx High School of Science, \"Bronx Science\"", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 5, 
    "firstappearance": "Young Avengers #1 (2005)\n", 
    "groupaffiliation": [
        "Secret Avengers", 
        "Young Avengers"
    ], 
    "hair": "Black (shaved bald)\n", 
    "height": 69, 
    "id": "Patriot_(Elijah_Bradley)", 
    "identity": "Secret", 
    "intelligence": 3, 
    "knownrelatives": "Sarah Gail Bradley (mother), Isaiah Bradley (grandfather), Faith Shabazz (grandmother), Josiah al hajj Saddiq (Josiah X, uncle), Stephanie Bradley (sister), Litigious Bradley (brother), unidentified sister, unidentified sister, unidentified step-father", 
    "occupation": [
        "Adventurer", 
        "high school student", 
        "part time librarian at The New York Public Library"
    ], 
    "origin": [
        "Young Avengers #8 (2005)", 
        "partial origin through flashback"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "Eli possesses strength, speed, agility, and endurance to the peak level of physical human perfection, as a result of a blood transfusion from his grandfather, Isaiah Bradley. Eli had originally demonstrated abilities that resemble the peak human physical attributes of Captain America due to use of Mutant Growth Hormone, or MGH.", 
    "realname": "Elijah \"Eli\" Bradley", 
    "significantissues": [
        "Revealed true identity and that Isaiah Bradley was his grandfather (Young Avengers #3, 2005)", 
        "revealed that he gained his powers due to the use of Mutant Growth Hormone, or MGH, and temporarily quit team (Young Avengers #8, 2005)", 
        "flashback showing his first encounter with MGH and learning of his grandfather's dual identity (Young Avengers Special #1, 2005)"
    ], 
    "speed": 4, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 145
}