{
    "aliases": "Unrevealed", 
    "citizenship": "Narcisson", 
    "content": "When Odin had been slain in battle with the fire demon Surtur, his powers were inherited by Thor who became Lord of Asgard. Thor wanted to help the people of Earth by directly involving the Asgardians despite protests from various groups and individuals. Zarrko, the Tomorrow Man allied himself with the American government, and on the hundredth day of Asgard’s presence on earth, he launched his own attack. Pulling the Dark Gods Perrikus and Adva from the time stream, Zarrko promised Perrikus rule of Asgard if he could defeat Thor and put Asgard back where it belonged. Perrikus was happy to oblige, and he began his assault on the Golden Realm by sneaking up on Heimdall and taking him out of the fight. Immediately setting his sights on Thor, Perrikus boasted how he was now stronger than before and almost seemed to have the upper hand, especially when Adva teleported Mjolnir away. It wasn’t until Thor picked up the axe of the Executioner that Perrikus found out just how wrong he was. Thor briefly succumbed to the evil within the axe and cut Perikkus’ arm off above the elbow. Then, threatened with the possibly of death by his own spear, Perrikus gave up the name of the man who orchestrated this attack.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Red\n", 
    "fighting": 1, 
    "firstappearance": "Thor #1 (1999)\n", 
    "groupaffiliation": "Formerly the Dark Gods", 
    "hair": "None\n", 
    "id": "Perrikus", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Tserron (spouse, deceased)", 
    "occupation": "Warrior", 
    "origin": "Unrevealed", 
    "placeofbirth": "Narcisson", 
    "powers": "Perrikus possesses superhuman strength, endurance and a high-resistance to injury on the same level of someone as powerful as Thor before he became the Lord of Asgard. Perrikus has also displayed the ability to fire energy blasts through his weapon, but it has yet to be revealed if the energy comes from within him or his spear.", 
    "realname": "Perrikus", 
    "significantissues": "Thor #1, 4-13, 53 (Zarrko pulls Perrikus from the time stream to battle Thor, Lord of Asgard)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}