{
    "add": {
        "doc": {
            "aliases": [
                "Chaos-Bringer", 
                "Starchilde", 
                "Phalkon", 
                "formerly Dark Phoenix", 
                "Black Queen", 
                "Phoenix", 
                "Jean Grey"
            ], 
            "citizenship": "Inapplicable", 
            "content": "The Shi’ar still judged it necessary to obliterate Phoenix’s powers entirely, lest it become Dark Phoenix again. The X-Men fought the ruling in a trial by combat against members of the Shi’ar’s Imperial Guard in the Blue Area of Earth’s moon, but during the battle Phoenix reverted to Dark Phoenix. Realizing that it could never fully retain control, Phoenix acted as the real Grey would have. Before the eyes of a horrified Cyclops, it committed suicide by telekinetically triggering an energy cannon, disintegrating its mortal shell. Later reflecting on its folly, the Force sought to undo the damage it had done by returning the life-force it had taken from Grey. On its return to Earth, it sensed the astral form of the time-traveling Rachel Summers, the daughter of Earth-811's Jean Grey. After returning Grey’s missing life-force, which was instead received by Grey’s clone Madelyne Pryor, the Force followed Rachel back to the future of Earth-811. There, it revealed itself to Kate Pryde, who asked the Force to give Rachel a new lease on life. The Force agreed and took Rachel as its host, supercharging her ability to time travel and causing her to physically travel back in time to Earth-616. Rachel was unaware that she hosted the Force’s essence until she took on the codename Phoenix. The Force then bonded to her fully and ensured that Rachel could only access as much power as she could safely wield, having learned from its past mistake. Adventuring with Rachel and the British super-team Excalibur for a time, the Force ultimately encountered Necrom’s Anti-Phoenix. After a cataclysmic battle, Rachel allowed Necrom to possess the Force, gambling that its infinite power would be too much for him. Necrom’s physical form exploded, and Rachel was destroyed in the blast. The Force gathered her shattered psyche and restored her body, promising Excalibur to protect and nurture her until she fully healed. Through Rachel’s eyes, the Force was able to experience the simple beauty of existence. In space, it encountered the world-devourer Galactus, who revealed to the Force the nature of its existence. Tormented with the knowledge that its desire to explore humanity had prevented generations of life from being born, the Force fled. Rachel reentered the timestream and emerged some 2,000 years into the future of Earth-4935. There, she encountered Diamanda Nero, daughter of that era’s mutant despot Apocalypse, and, in order to defeat her, was forced to purge herself of the Force.Free again, the Force traveled back into the past, drawn once again to Earth-616. En route, it was transported to the Ultraverse (Earth-93060) by a sentient alien starship that had crash-landed there eons ago. Buried deep within the Earth, the ship sought to reunite itself with its twin trapped within Earth’s sun, and intended to use the Force’s energy to power the recombination. Impaled on a lance of energy that linked the two ships, the Force fought back and managed to free itself, though not before the ship was able to bond them empathetically. Wounded, the Force sought out a host to protect it as it healed. Inhabiting the body of the super-strong hero Prime, the Force was opposed by the X-Men and Prime’s teammates in UltraForce. Exhausting Prime’s physical form, the Force found another host in Amber Hunt, who had previously been possessed by the ship’s essence. The heroes were able to free Hunt from the Force, after which they took the fight to the ship, severing its link to the Force. Seeking revenge, the Force attacked the ship, threatening the stability of the planet. The heroes were able to drive the Force into another portal, and it emerged four billion years in the past. Unleashing vast energies while transmigrating itself through time and space, the Force inadvertently (and ironically) caused the damage to the ship that forced it to crash-land to begin with.", 
            "durability": 7, 
            "education": "Inapplicable", 
            "energy": 7, 
            "eyes": "Inapplicable\n", 
            "fighting": 7, 
            "firstappearance": "(As Jean Grey impersonator/Phoenix) X-Men #101 (1976); (as Dark Phoenix) X-Men #133 (1980); (as Phoenix Force) Fantastic Four #286 (1986)\n", 
            "groupaffiliation": [
                "None", 
                "(as Phoenix) formerly X-Men", 
                "Hellfire Club (Inner Circle)"
            ], 
            "hair": "Inapplicable\n", 
            "height": 0, 
            "id": "Phoenix_Force", 
            "identity": "Secret", 
            "intelligence": 7, 
            "knownrelatives": "Inapplicable", 
            "occupation": "Celestial elemental", 
            "origin": "Excalibur #50 & 52 (1992)", 
            "placeofbirth": "Big Bang", 
            "powers": "The Phoenix Force is an immortal, indestructible, and mutable manifestation of the prime universal force of life, derived from the psyches of all living beings. In its natural state, this life-cycle is enough to sustain the Force. However, in order to manifest itself on the physical plane, the Force must tap into the near limitless source of energy provided by life-force reserved for future generations, thus denying them existence. The Force can wield this energy to project beams of immense concussive force, as well as transmigrate throughout time and space by folding its energy back into itself, causing it to collapse akin to a black hole, then it reforms itself upon reaching its destination, like the Phoenix of Earth legend.\nWhile possessing a human host, the Force is able to augment any super-powers they have to vastly higher levels.", 
            "realname": "Inapplicable", 
            "significantissues": [
                "Imprisoned Le Bete Noir (Gambit & Bishop: Sons of The Atom #5, 2001)", 
                "first scanned Jean (X-Men: The Hidden Years #8-9, 2000)", 
                "saved Jean, impersonated her (X-Men #101/Fantastic Four #286/Classic X-Men #8, 1976/1986/1987)", 
                "became Dark Phoenix, destroyed physical form (X-Men #133-137, 1980)", 
                "first inhabited Rachel (Excalibur #52, 1992)", 
                "vs Necrom/Anti-Phoenix (Excalibur #50, 1992)", 
                "confronted by Galactus, learned of true nature (Excalibur #61, 1993)", 
                "briefly inhabited Prime & Amber Hunt (Phoenix Resurrection: Genesis #1/Phoenix Resurrection: Revelations #1, 1995)", 
                "purged from Rachel (X-Men: Phoenix #1-3, 1999)", 
                "manifested within Jean (New X-Men #128, 2002)", 
                "Jean killed, Force shattered (New X-Men #150, 2004)", 
                "forcibly restored, resurrected Jean, fully merged with her (X-Men: Phoenix – Endsong #1-5, 2005)"
            ], 
            "speed": 7, 
            "strength": 7, 
            "universe": "Marvel Universe", 
            "weight": "Inapplicable\n"
        }
    }
}