{
    "add": {
        "doc": {
            "aliases": [
                "Captain Marvel", 
                "Legacy", 
                "\"Genny\"", 
                "\"Starface\""
            ], 
            "citizenship": [
                "Titan (14th moon of Saturn", 
                "Sol system)"
            ], 
            "content": "At the time, Monica Rambeau had long since established herself as a new Captain Marvel herself, but she conceded the title to Genis out of respect for Mar-Vell's legacy after Genis and Rambeau teamed up to defeat the Controller, who pitted the two heroes against each other to test his own abilities. Shortly after his encounter with Rambeau, Genis finally accepted the Captain Marvel title as his own after winning a victory over homicidal madman Zey-Rogg and his sister Una-Rogg, the children of Mar-Vell's late arch-enemy Yon-Rogg.When the Avengers became involved in the time-spanning cosmic conflict known as \"The Destiny War\", the mystery man Libra used Rick Jones's latent psionic powers to assemble a band of Avengers from various time periods, including the a future incarnation of Captain Marvel-- an older and more mature Genis with more experience and greater powers. Apparently, in at least one timeline, Genis was destined to become a member of the Avengers as the new Captain Marvel, a prospect that Jones found discouraging. The future-era Genis, for his part, seemed unusually bitter and fatalistic, and his bad feelings seemed to focus on Jones. Setting aside their various differences, Jones, Genis and the other Avengers joined forces to win the Destiny War by thwarting the Time Keepers' attempted destruction of most of the timestream's humanity-populated timelines. During the climax of this conflict, Jones suffered fatal injuries while destroying the Time-Keepers' chrono-cannon. To save Jones's life, the future Genis reluctantly merged his form and life force with that of Jones, just as the original Captain Marvel had shared a symbiotic relationship with Jones years earlier.When Jones returned from the Destiny War to the present day, the present-day Genis was surprised to find himself automatically taking his future self's place in the symbiotic relationship with Jones. The present-day Genis assumed the altered appearance and enhanced powers of his future self in the process, but was still greatly distressed to be trapped in a shared existence with a man he despised. Jones was no happier about it, but the reluctant duo were forced to adjust to their situation, with the experienced adventurer Jones served as mentor to the novice hero Genis.Genis had developed several meditative techniques to help him control the cosmic awareness that was thrust upon him taking his future self's place, but he was often forced to choose between situations to involve himself in. When one such decision resulted in the death of a young alien woman, Genis saw that this meant would result in the loss of potential universal peace. In anguish, his cosmic awareness overwhelmed his mind and Genis was shocked into a catatonic state for almost a month. When he awoke, Genis had become insane.Genis determined he needed to learn discipline to better solve the problems he envisioned with his cosmic awareness. He spent some time with the vigilante known as the Punisher, saying he admired the single-minded devotion the Punisher used to accomplish his goals. However, Genis determined the Punisher truly couldn't handle the issues Genis must tackle and he left him. Next, Genis confronted his father's former mentor in the Kree army. Instead of learning from him, however, Genis killed the alien captain and took his place, hoping that time in the military would teach him discipline. Over time, Genis took the mistress of a commanding officer as his lover. The mistress ended up being an agent for the alien Shi'ar, and the commanding officer ordered Genis to kill her. Instead, Genis killed his commanding officer and turned the gun on himself, apparently committing suicide.Genis continued to battle the overwhelming influence of his cosmic awareness, taking downright villainous actions such as endowing an alien serial killer with power, challenging the gods of Asgard, and threatening the Kree with extinction. Rick Jones tried to keep Genis in check by inducing mind-numbing pain through their mental connection, but soon even this trick would fail. Genis began influencing Jones' actions through their link, and ultimately induced Jones to be killed. In trying to reaffirm his perception of reality, however, Genis resurrected Rick (a feat made possible with their molecular bond). Finally, a coalition of Titan Eternals, including Elysius and Phyla-Vell, confronted Genis. A protracted battle ensued, ending after Genis was pulled into a portal to another dimension meant for his enemies alone. Beaten and broken, Genis promised to once again dedicate himself to becoming a force for good.Genis first created a base of operations on Saturn's moon Hyperion, but after only a few adventures, he was confronted by the cosmic being Eulogy, who revealed he had placed himself in Genis' and Rick's life at the time of their bonding but had determined their series of adventures had run its course. He arranged for the two to be no longer bonded together and encouraged Genis to surrender to the ending of his efforts. Instead, Genis was still determined to make up for his past misdeeds. He traveled to Earth to join the like-minded villains-turned-heroes, the Thunderbolts.His presence among the Thunderbolts caused quite a stir among his teammates, especially the romantic overtones he used with Songbird (with whom his future \"Destiny War\" counterpart had a relationship). He got into a scuffle with the Thunderbolt named Atlas, and instead of saving New York from an attack by Fathom's Five, Altas secretly attacked Genis instead, gravely wounding him and causing him to go into a protective energy cocoon in order to heal. After he was healed, Genis emerged from his cocoon physically transformed-- his body had absorbed the Nega-Bands and his body was transformed into photonic energy. He rejoined the Thunderbolts, calling himself Photon (which got him into another argument with Monica Rambeau who had started calling herself Photon after Genis took the Captain Marvel name. Still, Rambeau encouraged him to keep the codename). As Photon, Genis then became a full-fledged member of the Thunderbolts and has faced many challenges including Fathom's Five, Batroc's Brigade, the Purple Man, and the Avengers. During his battle with the Avengers he managed to prove himself so powerful that he easily bested the Sentry, an immensely powerful being, in combat.", 
            "durability": 7, 
            "education": "Unrevealed", 
            "energy": 6, 
            "eyes": "Blue\n", 
            "fighting": 3, 
            "firstappearance": "Silver Surfer Annual #6 (1993)\n", 
            "groupaffiliation": [
                "None", 
                "(formerly) Thunderbolts"
            ], 
            "hair": "Silver (dyed blond)\n", 
            "height": 74, 
            "id": "Photon_(Genis-Vell)", 
            "identity": "Publicly known in the intergalactic community", 
            "intelligence": 2, 
            "knownrelatives": "Elysius (mother), Mar-Vell (Captain Marvel, father, deceased), Phyla-Vell) (Quasar, sister), Dorrek VIII/Teddy Altman (Hulkling, half-brother), unidentified paternal grandparents (presumed deceased)", 
            "occupation": [
                "Adventurer", 
                "(formerly) cardsharper", 
                "gambler", 
                "hedonist"
            ], 
            "origin": "Silver Surfer Annual #6 (1993)", 
            "placeofbirth": "Titan", 
            "powers": "Inheriting his father's energy-based powers, Genis-Vell could absorb stellar energy, giving him enhanced strength and durability, flight, and the ability to fire photonic energy blasts. When Genis' mental state became unstable, he no longer held himself back in regards to his powers, which increased exponentially, especially when coupled with the Nega-Bands. He began using his powers in ways he hadn't before, such as choosing to project energy blasts through his gun, for visually dramatic purposes, and absorbing multiple forms of energy as well as opening various trans-dimensional shunts that could access various points in space/time and different realities/dimensions. This also appeared to be his level of power after physically being reborn and absorbing the Nega-Bands into his body, which was transformed into pure photonic energy. \nGenis later manifested a version of his father's \"Cosmic Awareness\", somehow activated by his transformation into a more \"mature\" form of himself from the future. This awareness granted him a sort of omnipresent consciousness that enables him to perceive objects, individuals, and cosmic threats or anything of significance to him anywhere, even if they were cloaked by invisibility or illusion. However, Genis's newfound cosmic awareness initially proved unreliable, sometimes feeding him distorted or illusory information. Despite a series of meditative techniques, his cosmic awareness drove him insane, although he thus exhibited greater use of this power, using it to see possible futures, definite futures, and alternate universes, and to project his cosmic awareness into others so that they can see their past, present, or future. He had also used it to communicate with the dead.\n\nAt one point, Genis was bonded physically to Rick Jones on the molecular level, allowing the two to share a symbiotic relationship and communicate telepathically between themselves. However, they could only exist in separate dimensions, typically the Earth dimension and the Negative Zone (later, the Microverse), and would switch places whenever the Earth-bound counterpart struck the Nega-Bands together.", 
            "realname": "Genis-Vell", 
            "significantissues": "death (Thunderbolts #100, 2006)", 
            "speed": 7, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 210
        }
    }
}