{
    "add": {
        "doc": {
            "aliases": [
                "Martyr", 
                "formerly Quasar"
            ], 
            "citizenship": "Titan", 
            "content": "Phyla remained convinced she should bear the name Captain Marvel, but an argument with Genis on the subject was interrupted by an attacking alternate future version of Marlo Jones, wife of Genis’s friend Rick. Genis investigated the timeline that had resulted in the attack, trusting Phyla to protect the contemporary Marlo, whom she rescued from an abduction attempt by the Magus, ally of the alternate Marlo and Ely-Vell, Genis’s son of that future era. Phyla then brought Marlo to Titan to better protect her, but her departure from Earth left Marlo’s female companion Moondragon open to attack by the Magus. When Genis returned from the future, Phyla was concerned by his obvious distress, unaware he had resolved to kill his own yet-to-be-conceived son to prevent the catastrophe Ely would cause later in life.Soon afterward, Moondragon lied to Marlo about the feelings between them and ended their romantic relationship, believing Marlo would be happier with Rick. Phyla was drawn to Moondragon by her selflessness, and a mutual romantic interest arose between the two, who departed together to investigate an unidentified portal, possibly proceeding afterward to view a spiral nebula near Renault VII. Recently, Moondragon was abducted by Thanos, and Phyla pursued him into the crisis known as the Annihilation Wave, already the center of conflict for many powerful space travelers. During the catastrophic battle with Annihilus and his insectoid forces, Phlya gained the powerful Quantum Bands from Wendell Vaughn (Quasar) the appointed protector of the universe.  Phyla sought the help of Moondragon’s father Drax the Destroyer, to rescue her from Thanos. Drax was eventually successful in rescuing Moondragon and taking the life of Thanos in the process.Reunited with her lover, Phyla went right back into cosmic chaos, Phyla and Moondragon found themselves on a dire mission to save the Kree race from immanent destruction, which was being caused by the techno-organic invaders known as the Phalanx. The two women warriors sought to find a powerful wizard that possessed the power to defeat the Phalanx. Before they could get off to a decent start on their quest, the woman adventurers were confronted by the Super-Adaptoid, who had been transformed into a Phalanx Select. Although the Adaptoid was viciously aggressive and cunning he was easily defeated. Phyla eventually found a cocoon that possessed the rejuvenating body of Adam Warlock, the phalanx were also in search of the Warlock and a battle ensued that eventually ended with Warlock being awakened prematurely and in a mentally unstable state. Phyla, Warlock and Moondragon managed to escape to a secret laboratory occupied by the High Evolutionary. There Phalanx attackers tracked them to the laboratory and Moondragon was slain by their leader Ultron. In a rage of passion Phyla lunged into battle, although she was persuaded by the High Evolutionary to retreat. Ultron and the Phalanx were eventually defeated and Phyla joined a new peace keeping teamed formed by Star-Lord. The team would later take on the name of the Guardians of the Galaxy and they utilized Knowhere as their base of operations.Discovering that Star-Lord had Mantis telepathically manipulate their minds to facilitate the formation of the Guardians most of the group quit. Phyla and Drax had already left in search of the young Earth girl Cammi, Drax’s former companion who has not been seen since the end of the first Annihilation catastrophe. While they questioned the inhabitants of an unidentified planet, a fortune teller revealed that there was a Great War of Kings about to take place and it might the reason for their being on this particular planet. Upset and annoyed with the woman’s distraction they began to walk away when she asked, was it the girl that they were looking for? The woman went to revealed that there was a chance for them to save Heather (Moondragon) from eternal death. Their search for her led them to the moon of Saturn also known as Titan. While on Titan they confronted Mentor, Moondragon’s step-father, who quickly murdered them both, so that their spirits could pass beyond the barrier of death into the realm of Oblivion, where Moondragon was trapped in the belly of the Dragon of the Moon. While in Oblivion's realm Phyla and Drax were approached by the malevolent trickster Maelstrom who was desperate to escape Oblivion. He took possession of the Phyla’s Quantum Bands, and used Phyla and Drax as sacrificial offerings to the Dragon of the Moon for passage out of Oblivion. Phyla was dropped into the mouth of the beast, but by unknown means was able to emerge from the monster transformed and possessing new powers. Wendell Vaughn had come to her rescue but was astound that she was free. He did manage to retrieve the Quantum Bands form Maelstrom, although Phyla refused to wear them again. She later revealed that she would be known as Martyr for now on.", 
            "durability": 4, 
            "education": "Unrevealed", 
            "energy": 5, 
            "eyes": "Blue\n", 
            "fighting": 4, 
            "firstappearance": "Captain Marvel #16 (2003)\n", 
            "groupaffiliation": [
                "Guardians of the Galaxy", 
                "formerly United Front"
            ], 
            "hair": "White\n", 
            "height": 69, 
            "id": "Phyla-Vell", 
            "identity": [
                "Publicly known on Titan", 
                "the general populace of Earth is unaware of her existence."
            ], 
            "intelligence": 4, 
            "knownrelatives": "Elysius (mother), Genis-Vell (brother), Mar-vell (father), Mar-Vell's mother (grandmother), Teddy Altman/Dorrek VIII (Hulkling, half-brother)", 
            "occupation": [
                "Protector of the Universe", 
                "adventurer"
            ], 
            "origin": "Captain Marvel #18 (2004)", 
            "placeofbirth": "Titan (14th Moon of Saturn)", 
            "powers": "Phyla has superhuman strength. She can fire energy blasts and fly. She also acts like an \"energy sponge,\" absorbing any energy attacks directed at her and returning them as energy blasts. She has cosmic awareness and is a proficient fighter.", 
            "realname": "Phyla-Vell", 
            "significantissues": "See Handbook Bibliography", 
            "speed": 7, 
            "strength": 5, 
            "universe": "Marvel Universe", 
            "weight": 103
        }
    }
}