{
    "add": {
        "doc": {
            "aliases": [
                "White Bishop", 
                "White King"
            ], 
            "citizenship": "U.S.A.", 
            "content": "As the White Bishop, Pierce participated in the capture and manipulation of Jean Grey, who was in fact the Phoenix Force. Pierce and the rest of the Hellfire Club were soon confronted by the Phoenix’s teammates, the X-Men. After being captured, the X-Men soon escaped and a battle ensued. Donald barely survived, almost losing a cybernetic limb to the X-Men’s Colossus. He escaped the battle with Shaw through secret passages under their Manhattan townhouse.With Shaw’s failure, Donald soon challenged him for leadership of the Inner Circle. Pierce kidnapped the mutant Tessa, now Sage. He also captured Charles Xavier, leader of the X-Men. Trying to harness the powers of Sage and Xavier, Pierce was confronted by the New Mutants, a new group of young mutants under the tutelage of Xavier, and was defeated before he could accomplish his task. Pierce, because of his treachery, was expelled from the Hellfire Club.For this, Donald was sent to a Hellfire installation in the highlands of Kentucky. There, he would live his life in exile. However, Donald was set free by a group of cybernetic mercenaries, the Reavers. Once ordinary men in the service of the Hellfire Club, the Revears lost their limbs in battle with Wolverine. Donald gave them a new lease on life and offered them his skills in cybernetics.With his newfound freedom, Donald began plotting revenge on both the X-Men and Wolverine. Going to the outback of Australia, Pierce watched his enemies until Wolverine had been left alone to guard the base.  Donald and his Reavers took him by surprise and captured him. Donald then crucified and began torturing Wolverine while his Reavers reclaimed their old headquarters, which had been taken from them by the X-Men. Wolverine soon escaped with the help of Jubilee.After evaluating the possible escape and evasion scenarios, Pierce sent his Reavers to Muir Island, the place he thought Wolverine would go. Donald was confronted, however, by a group of mutants lead by Banshee and Freedom Force. His team was quickly defeated, and Donald barely escaped.After the X-Men had abandoned their Outback base, Pierce brought his team there to consolidate their forces.  Soon, Donald was attacked by a group of Sentinels sent by the Upstart, Trevor Fitzroy. While most of his Reavers died, Donald escaped with help from Gateway, who teleported him to the Hellfire Club in New York. The Sentinels pursued him and destroyed his body. The only remaining piece of him was his head.Sometime later, Donald appeared mysteriously rebuilt. He soon allied himself with Shaw again, who was reforming another incarnation of the Inner Circle. Donald was once again reinstated to his position in the Hellfire Club by Sebastian Shaw and assigned to head up a secret mission dubbed the “Tomorrow Agenda.”  Utilizing the knowledge of a time-displaced being named Ch’Vayre, they were going to harness the power of the immortal mutant, Apocalypse. Their first attempt to harness his power was in London. With the help of Ch’Varyre, the Hellfire Club awakened an agent of Apocalypse called Harbinger, only to be interrupted by Cable. Pierce and the Hellfire agents were attacked by the Harbinger, and, knowing the battle to be fruitless, Pierce escaped, leaving Cable to the mercies of the creature.Pierce and Shaw moved on to the Swiss Alps. There they uncovered an ancient stronghold that once belonged to Apocalypse.  After escaping a siege by the stronghold’s defenses, Piece was again confronted by Cable.  Pierce and Cable fought as the stronghold began to self-destruct.  As Shaw escaped, Pierce tried to follow. Shaw made it clear that Pierce’s failure in the Tomorrow Agenda had lost him his reinstatement into the Inner Circle, and he left Pierce to die as the mountain exploded.", 
            "durability": 1, 
            "education": "Unreavealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Uncanny X-Men # 132 (1980)\n", 
            "groupaffiliation": [
                "Purifiers", 
                "formerly The Hellfire Club", 
                "The Reavers"
            ], 
            "hair": "Blonde\n", 
            "id": "Pierce,_Donald", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Anton Pierce (Great Grandfather)", 
            "occupation": [
                "Criminal", 
                "former magnate"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "Donald Pierce is a human being augmented by advanced cybernetic components. Originally, Donald had only four cybernetic limbs, but after being assaulted by Sentinels, it is unknown how much of Pierce is still human.  He has superhuman strength, reflexes, and agility.  Due to his metallic body, Pierce retains a great degree of resistance against physical and biological harm; if he losses a limb in combat, Pierce can usually replace it with a new one.", 
            "realname": "Donald Pierce", 
            "significantissues": [
                "Fought with the Hellfire Club against the X-Men  (Uncanny X-Men #132-134, 1980)", 
                "Tried to harness the power of Sage and Xavier  (Marvel Graphic Novel # 4: The New Mutants)", 
                "Freed from exile by the Reavers (Uncanny X-Men #245, 1989)", 
                "Crucified Wolverine (Uncanny X-Men #251, 1989)", 
                "Body destroyed by Sentinels (Uncanny X-Men # 281, 1991)", 
                "Rebuilt after apparent death (Domino #2, 1997)", 
                "Participated in the Tomorrow Agenda  (Cable # 48-53, 1997-1998)", 
                "Retuned to take over Hellfire Club, beheaded by Shaw (Uncanny X-Men # 453 and 454, 2005"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel_Universe"
        }
    }
}