{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A.", 
            "content": "After their first foray against the Defenders, Piledriver and the Wrecking Crew were inseparable, appearing with them in all their endeavors, including their abduction to Battleworld by the Beyonder and joining with Doctor Doom's army of super-villains. The Crew also joined Baron Zemo's Masters of Evil and Piledriver was instrumental in helping bring down Hercules. After this, Thor used his hammer to draw the Wrecker’s away from the others who divided it, and Piledriver was left powerless.Months later, the Wrecker freed his Crew and restored their power once more. As before, wherever the Wrecking Crew was to be found, Piledriver was among their number. They performed many other acts of villainy, although they had to deal often with the treachery of Thunderball, who craved the Wrecker’s power all for himself. Eventually, the Crew reconciled, seeking out Hercules once more. But battling them helped Hercules overcome the fear of combat he had suffered since the  beating at their hands, and they were defeated.Once, their powers began fading when many of Asgard's links to Earth were separated. The entire Crew received a power boost when hired by Arnim Zola to battle the Thunderbolts (unaware that the Thunderbolts included many of their former allies in the Masters of Evil).The Wrecking Crew appeared together for various endeavors: hired by the likes of the Doomsday Man, battling heroes such as the Avengers and the Warriors Three, used as lackeys by Morgan le Fay, among others. When the Crew was imprisoned in the Raft, they joined the massive breakout and escaped.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Defenders #17\n", 
            "groupaffiliation": [
                "Wrecking Crew", 
                "(formerly) Masters of Evil"
            ], 
            "hair": "Blonde\n", 
            "height": 0, 
            "id": "Piledriver_(Brian_Calusky)", 
            "identity": "Publicly known", 
            "intelligence": 1, 
            "knownrelatives": "Ricky (Excavator, son)", 
            "occupation": [
                "Criminal", 
                "former farmhand"
            ], 
            "origin": "Defenders #18", 
            "placeofbirth": [
                "Brooklyn", 
                "New York City", 
                "New York"
            ], 
            "powers": "Piledriver shares the Asgardian enchantment originally given to the Wrecker, becoming transformed into a being of superhuman power, slightly less than an Asgardian god. He possesses vast superhuman strength and a high degree of invulnerability with some resistance to cold, heat, fire, corrosives and toxins. (When the Wrecking Crew believed their enchantment was fading, they sought augmentation by geneticist Arnim Zola, who used scientific means to restore their power.)", 
            "realname": "Brian Philip Calusky", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 310
        }
    }
}