{
    "aliases": [
        "Pipman", 
        "King Pip", 
        "Formerly Dr. DeTroll"
    ], 
    "citizenship": "Laxidazia", 
    "content": "Getting into trouble on scores of planets, Pip was imprisoned on the Universal Church of Truth spaceship Great Divide and slated for execution along with the other renegades and non-humanoid species the UCT had deemed unproductive and fit only to be chemically recycled into their basic elements. There Pip met artificial human Adam Warlock, a fellow UCT captive being transported to the UCT's Homeworld, Sirus X for questioning. After helping other prisoners revolt against the spaceship's crew. Pip joined Warlock's quest to stop the Magus. Warlock's evil alternate future self. The duo piloted a stolen shuttlecraft to Homeworld and Warlock left Pip in the city to confront the Church's temporal leader the Matriarch, seeking the truth of the Magus' origins. Miffed at being abandoned right when things were getting interesting, Pip entered into the local tavern where he met with Gamora, so-called deadliest woman in the galaxy, who offered to help Pip free Warlock from the Sacred Palace and aided them in defeating the Magus. They discovered Warlock right after he freed himself from a brainwashing session, and the trio confronted the Magus, who quickly knocked Pip out. Pip woke up minutes later. unable to help either Warlock or Gamora stop the Magus from summoning the In-Betweener to start the process that would transform Warlock into the Magus. Rescued by Gamora's master, Thanos's ship, Sanctuary 1, where pip decided that following Warlock into the time portal set to change his future was safer than observing a fight between Magus and Thanos. Pip witnessed Warlock finally finding the key to prevent himself from turning into the Magus, removing much of his influence from the universe-616 timeline and re-inventing the Universal Church as a more benign entity in the process.Returned to Sirus X, Warlock and Pip indulged themselves at a local tavern until Warlock left to find answers to his new riddles among the stars. Left to his own devices, Pip found new adventures in saving the concubine Heather Delight from her master Pro-Boscis the Procurer, and latter in a rash of petty thefts to pay for his various vices. Pip then decided to see Warlock and Gamora had been up to lately; searching Sanctuary 1, he instead found Thanos, who destroyed Pip's mind. When Warlock finally found what was left of Pip, he absorbed Pip's soul in to his Soul Gem, sending it to the peaceful Soulworld where Pip was soon reunited with the souls of Warlock and Gamora, who were also victims of Thanos.Years later, after a visiting Silver Surfer warned Warlock (now Soulworld's leader) of the resurrected Thanos' plans to become the universe's Supreme Being using the Infinity Gauntlet, Pip and Gamora were resurrected with Warlock in the dead bodies of three petty criminals (pip possessed the late Ralph Bunker); Warlock transmuted these husk into exact duplicates of his, Pip,s, and Gamora's original bodies, with their original powers enhanced. While Warlock and other Earth heroes and cosmic entities sought to strip Thanos of his Infinity Gauntlet, Pip kept Doctor Strange company until Warlock won the Gauntlet. Pip, Strange and Gamora convinced Warlock not to use the Gauntlet to eliminate all evil impulses like competitiveness and ambition from all sentient beings, which would have led to despair and apathy. When the Living Tribunal ruled that Warlock was not fit to be a Supreme Being, Warlock dispersed the Gauntlet's Infinity Gems to his \nInfinity Watch - Gamora (Time Gem), Pip (Space Gem), Thanos (Reality Gem, and secret \"silent partner\" of the team), Moondragon (Heather Douglas, Mind Gem), and Drax the Destroyer (Power Gem) - those he deemed best able to safeguard the Gem's from malicious adventurers. He gave the Space Gem to Pip, since his roguish nature would enable him to keep the gem safe from potential thieves. While left restore his spirit after  divesting himself of divinity, the others dispersed with Pip teleporting to Earth to go joyriding in the Fantastic Four's Fantasticar and an Avengers Quinjet until he was captured by Omega (a disguised Man-Beast), who captured Gamora, Drax, Moondragon. Man-Beast used their Gem's power's to create  the energy creature Infinity Thrall, which nearly killed Warlock before he tricked it into destroying the starship engines used to create it. A revived Pip, teleported the Watch onto Monster Island, where the Mole Man talked the now organized team into using the island as their base.When Thanos Contacted the Watch about the plans of the reborn Magus, Pip teleported them to the Infinity Well in Death's other-dimensional palace to further learn the Magus' plans, but they were forced to flee before they could learn anything useful. Regrouping in another dimension, the Watched battled a group of Earth's heroes whom the Magus had tricked into believing that Thanos and Warlock were responsible for the plague of doppelgangers assaulting the Earth. Eventually, Galactus teleported everyone onto his ship and linked everyone's minds to quickly resolve the misunderstanding. Warlock reassembled the Infinity Gauntlet, only to have the Magus kidnap him and steal the Gauntlet's power. After Warlock defeated the Magus, the Watch regained their respective Gems and returned to Monster Island to recuperate and watch over a now-catatonic Warlock. Pip made a half-hearted attempt to become the Watch's new leader, but decided that Gamora was better suited to the role than he was.Revived by Eternity, Warlock led the Watch in helping the Silver Surfer rescue the soul of his lover Shalla Bal from the demonic Mephisto and restoring her  to life. After fending off an attack form the time traveling amnesiac strongman Maxam, the Watch fell prey to the schemes of Warlock’s “good half” the Goddess banished Warlock to a far distant dimension and convinced Gamora, Moondragon and others to join her crusade to cleanse the universe of sin. Pip then decided to become the Watch’s new leader as the Pipman and kidnapped Mister Fantastic to help find Warlock, only to have Drax and Maxam to decide that Mister Fantastic would make a better leader than Pip. Joining the remaining heroes at the Avengers Mansion, Pipman was forcibly bathed by some of them to reduce his personal stench to a more bearable level. Getting a reading off Professor X (via his temporary mindlink with Moondragon) of the Goddess’ location, Pip teleported himself to her  and used her new-created Cosmic Egg (a merging of several extradimensional Cosmic Cube-like objects) to turn her into a salt statue, leaving Pip in control of Egg. Proclaiming himself to be “King Pip,” he mulled over several possible uses for his new-found power, ranging from endless creature confronts to becoming a Supreme Being himself, until he decided all he truly wanted was to be like all the other heroes enough for them to throw him a birth day party. Before he could implement that wish, the Goddess’ hidden protector Silhouette Chord knocked him out and restored the Goddess to her former state. After Warlock defeated and imprisoned the Goddess in the Soul Gem, the freed Pip teleported him and the rest of the Watch away from the rest of the heroes before they had a chance to vent their frustrations over the Goddess’ actions on Warlock.Warlock had Pip teleport him to an insane Thor so he could cure his madness and place the thunder god in his dept. Thor was cured after a series of conflicts during which Pip rescued the group from Asgardian trolls, brought Thanos into the matter, and fought Odin and other Asgardians. Pip and the Watch then aided princess Maya of the Egolix-7 dimension and the mystic Darklore in overthrowing the the evil demi-godlike Count Abyss. After freeing hundreds of souls from the alien Lord Domitian's clutches, the Watch were robbed of their respective Gems buy the Earth-93060 (Ultraverse) vampire Rune, leading to the Watch's dissolution.Months later Pip and Gamora reunited with Warlock and Drax to stop the Negative Zone ruler Lord Syphonn from destroying their dimension. More recently, Pip teleported Warlok from an alien mental ward and helped him bring the toddler Atleza Langunn to dying reality anchor Atlez before the nihilist Thanosi (rogue creations of Thanos) could kill her. Pip has added both Thanos and Warlock against the extradimensional Hunger, and helped stop the power-mad Champion of the Universe from destroying the alien Skards in his quest for worthy opponents to fight. He later testified as a character witness for Starfox when was accused of inappropriate use of his love powers on unwilling women, it is said that Pip has returned to his partying ways, until the next time his buddy Warlock needs him.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Pink\n", 
    "fighting": 2, 
    "firstappearance": "Strange Tales #179 (1975)\n", 
    "groupaffiliation": [
        "Former member of the Infinity Watch", 
        "partner of Adam Warlock and Gamora", 
        "former employee of Thanos"
    ], 
    "hair": "Red\n", 
    "height": 52, 
    "id": "Pip_the_Troll", 
    "identity": "Known to intergalactic authorities", 
    "intelligence": 4, 
    "knownrelatives": "None", 
    "occupation": [
        "Adventurer", 
        "former prince and painter"
    ], 
    "origin": "Strange Tales #179", 
    "placeofbirth": [
        "Planet Laxidazia", 
        "Dolenz system", 
        "Milky Way Galaxy"
    ], 
    "powers": "Pip's original body had no superhuman powers beyond an extremely high tolerance for various mood altering substances. However, his new body has superhuman strength (Class 10), though Pip's knack for avoiding actual combat has left that untested. While in possession of the Space Gem, Pip could teleport himself or anyone touching him to any place he could picture mentally, or anyone touching him could picture, even to other dimensions. Mutated by the Space Gem's radiation, he can still teleport anyplace he wishes without leaving a detectable energy trail. He can teleport mass up to the size and weight of Galactus with ease. He carries various explosives. The hair around his feet hardens after growing to full length, giving his feet a cloven hoof-like appearance.", 
    "realname": "Prince Pip Gofern", 
    "significantissues": "See Handbook Bibliography", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 144
}