{
    "aliases": "None", 
    "citizenship": [
        "Utopia Isle Earth-712", 
        "Honorary citizen of the United States of America with no criminal record on Earth-712"
    ], 
    "content": "Zarda eventually became the common law wife of Howard Shelton. Due to Zarda's Utopian genetic structure she aged far more slowly than Shelton and remained young while Howard grew older, becoming elderly. Zarda became a founding member of the Golden Agency's latter-day successor, the Squadron Supreme. She is the only person who has served in both the Golden Agency and the Squadron Supreme. Zarda stayed behind when the rest of the team went to Earth-616 to battle the Avengers.Like all of the Squadron members except Hyperion, Power Princess fell under mental control of the alien Overmind who was working in concert with Null the Living Darkness. Using the Squadron members as pawns, the Overmind conquered Earth-712. Hyperion escaped to Earth-616 where he enlisted the help of the Defenders. Hyperion returned with the Defenders to Earth-712 and Zarda and the rest of the Squadron were released from the Overmind's control. The Defenders and the Squadron then worked together to vanquish Null and the Overmind.After the alien takeover Earth-712 was left in political and economic ruin in the aftermath of the alien takeover. The Squadron decided to implement the 'Utopia Program's (a program based upon the principles by which Utopia Isle had been governed) to attempt to solve all of the major problems that the people of the United States then faced, ranging from crime and hunger to sickness and death. Power Princess was one of the principal architects and advocates of the Utopia Program. In order to carry out the program, the Squadron took control of the United States of America for one year. In protest over this violation of democratic principles, Nighthawk (one of the founding members of the Squadron) resigned from the Squadron. The Squadron fought against several rogue military groups who opposed the Utopia Program. Power Princess also helped the Squadron oppose the Institute of Evil.Later that year Hyperion's nemesis Master Menace banished Hyperion to a pocket dimension from which he couldn't escape. Menace's ally, the criminal Hyperion from Earth-616 then joined the Squadron pretending to have amnesia to account for his lack of pertinent information. Power Princess replaced Hyperion as Squadron leader due to his alleged memory loss, and began helping Hyperion \"relearn\" everything. Becoming infatuated with Power Princess, the criminal Hyperion secretly murdered Howard Shelton by sucking the oxygen out of Shelton's lungs. Power Princess did not suspect that Howard had died through foul play, and eventually began responding to the affection from the criminal Hyperion, eventually falling in love with him. Eventually the Squadron's Hyperion found his way out of the pocket dimension and immediately attacked the criminal Hyperion. The battle left the 712 Hyperion blinded for an extended period of time and the criminal Hyperion died in Power Princess' arms confessing that he had killed Shelton and that he truly loved Zarda.Afterwards Power Princess realized that she was actually in love with the 712 Hyperion who began to return her love. Power Princess remained the Squadron's leader due to Hyperion's blindness and the planned on getting married. At the end of the year, the Squadron made ready to return power to the United States government. Nighthawk's Redeemers attacked and defeated the Squadron in battle at Squadron City. Power Princess fought Inertia who almost killed her by using Hyperion's strength against her. Right before his death Nighthawk convinced Hyperion of the wrongs that the Squadron had perpetrated convincing Hyperion that the Utopia Program had been a mistake. Hyperion moved that the Squadron be disbanded and he and Power Princess worked together to disband the Squadron and restore power to the United States government.During the power change Power Princess fought with a dissatisfied Redstone over how fast the exchange was proceeding in Squadron City. The fight was broken up when Hyperion retrieved Zarda to answer a summons from Professor Imam. Arriving at Professor Imam's Temple of Contemplation Professor Imam explained that the universe was going to end due to the destructive force of an object which had situated itself behind the sun. Zarda and Hyperion then gathered all of the surviving Squadron and Redeemer members, Professor Imam, and Master Menace and flew a shuttle into space to attempt to protect the Earth from the menace. During this assault the Squadron discovered that the menace was Dr. Thomas Lightner, and he was defeated when the infant Benjamin Thomas Jones traded destinies with Lightner. The Squadron were then banished from the 712 dimension by a turncoat Master Menace, and the former Squadron members wandered through realities until they arrived in the 616 dimension.Arriving in the 616 dimension the Squadron immediately encountered Quasar. The Overmind (who had awakened from a mental stupor upon the arrival of the Squadron in the 616 dimension) mentally took over Power Princess and all of the other Squadron members except Hyperion. The Overmind used the Squadron as soldiers in an attack against the Stranger at his Laboratory World. The Power Princess was awakened from her mental domination and opposed the Overmind who was defeated by the Stranger. Power Princess then resided at Project: PEGASUS with the rest of the Squadron. While at Project: PEGASUS, Power Princess made friends with PEGASUS security chief Blue Shield and Quasar and began working for the project as an Investigator of Extra-dimensional Phenomena. Eventually Imus Champion used the Corruptor to control the Squadron into attacking the Avengers but they stopped the plot. The Avengers then teamed with the Squadron to attack Champion. Power Princess was partnered with Firestar and Champion defeated them both and the rest of their teammates in combat, but was brought down by Giant-Man. Discovering the Nth Projector in Champion's cache of weapons, the Avengers used it to return the Squadron back to their home reality.Returning to Earth-712, the Squadron faced the Global Directorate, a group which had used the technology from the Utopian Program to take over the world running it as a dictatorship with the fascist Blue Eagles\nas their shock troops. The Squadron were then approached by Mysterium who told them to seek out \"the Dark Phoenix, the In-Betweener, and the Watcher\". Realizing that Mysterium was speaking in metaphor, Power Princess sought out the Amphibian recruiting him back into the Squadron. Alongside the rest of the Squadron founders, the new Nighthawk, the Whizzer's family, and a broken Master Menace, Power Princess settled on Utopia Isle where the Squadron continued the rebellion against the Global Directorate.Recently Proteus (a refugee from the House of M) fled into the 712 reality while the Squadron were defending Utopia Isle from the Blue Eagles. Proteus helped the Squadron defend Utopia Isle and defeat their attackers. Proteus, pretending to be a persecuted hero from another reality, warned the Squadron about the Exiles who were pursuing him. Once the Exiles appeared in the 712 reality, the Squadron attacked and captured them while Proteus escaped into another reality. Hyperion, accusing the Exiles of betraying his trust, causing multiversal havoc and possibly harming Beak, placed the Exiles on trial with the Power Princess acting as the prosecutor. Heather Hudson used the Tallus and the Timebroker interface to show the Squadron the truth about the Exiles, Proteus,  and the Global Directorate. Confronting the Global Directorate at their base of operations the Squadron informed them that their global reign of oppression was over. Hyperion volunteered to go with the Exiles to help them take down Proteus. power Princess spoke out stating that Hyperion was needed on their Earth, and Zarda volunteered to join the Exiles on their quest to stop Proteus, even against Blink's objections. Power Princess then left with the Exiles in pursuit of Proteus.The Exiles returned to the Panoptichron where Power Princess began to assert some control over the other Exiles. She outlined a plan for taking down Proteus and had the Exiles ally themselves with the Maestro to take Proteus down. Power Princess accidentally stabbed the Maestro with one of Longshot's knives causing the Maestro to attack her and the rest of the Exiles. Proteus took advantage of this and broke the Maestro's neck seeking to take over his body. Instead Proteus took over the body of Morph and escaped to the next reality, leaving Power Princess to regroup the disheartened Exiles for a new attack on Proteus.", 
    "durability": 1, 
    "education": "Advanced graduate level studies from Utopis Isle and Cosmopolis", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Defenders #112 (1982)\n", 
    "groupaffiliation": [
        "Squadron Supreme", 
        "formerly Exiles", 
        "Golden Agency", 
        "Imperial Guard"
    ], 
    "hair": "Black\n", 
    "height": 80, 
    "id": "Power_Princess_(Earth-712)", 
    "identity": "Publicly known to the citizens of the United States of America of Earth-712", 
    "intelligence": 1, 
    "knownrelatives": "Howard Shelton (common law husband, deceased)", 
    "occupation": [
        "Adventurer", 
        "(Formerly) Ambassador", 
        "Government Agent", 
        "Investigator of Extra-dimensional Phenomena", 
        "Thrall of the Overmind"
    ], 
    "origin": "Squadron Supreme #1 (1985)", 
    "placeofbirth": "Utopia Isle", 
    "powers": "Superhuman strength allowing her to lift twenty tons. Zarda is resistant to conventional injury which falls just short of making her bulletproof. Zarda also ages at a much slower rate then normal humans and is highly resistant to diseases. Zarda also has superhuman speed, stamina, agility, and reflexes.", 
    "realname": "Zarda", 
    "significantissues": [
        "With Squadron Supreme was brainwashed by the Overmind (Defenders #112, 1982)", 
        "with Squadron battled the Defenders (Defenders #113, 1982)", 
        "brainwashing reversed by Defenders (Defenders #114, 1983)", 
        "battled Overmind and Null the Living Darkness alongside the Squadron and the Defenders (Defenders #115, 1983)", 
        "alongside the Squadron resolved to assume control of the government of the United States (Squadron Supreme #1, 1985)", 
        "addressed the public as the spokeswoman for the Utopia Program (Squadron Supreme #3, 1985)", 
        "fought against armed civilian opponents of the Utopia Program (Squadron Supreme #4, 1985)", 
        "battled the Institute of Evil (Squadron Supreme #5, 1986)", 
        "voted to behavior modify Golden Archer instead of expelling him from the Squadron (Squadron Supreme #6, 1986)", 
        "common law husband killed by imperfect Hyperion duplicate, began romance with duplicate (Squadron Supreme #7, 1986)", 
        "learned her Hyperion was an imposter, witnessed the real Hyperion kill the imposter (Squadron Supreme #8, 1986)", 
        "began romance with real Hyperion, assumed leadership of the Squadron (Squadron Supreme #9, 1986)", 
        "introduced the hibernaculum to the American public (Squadron Supreme #10, 1986)", 
        "inducted five new members into the Squadron (Squadron Supreme #11, 1986)", 
        "battled Nighthawk and the Redeemers, disbanded the Squadron (Squadron Supreme #12, 1986)", 
        "led former Squadron members into space to stop the expanding Nth Man, left Earth-712’s reality (Squadron Supreme: Death of a Universe, 1989)", 
        "stranded on Earth-616 with former Squadron members, encountered Quasar, brainwashed by Over-Mind and left for space (Quasar #13, 1990)", 
        "acted as Overmind’s bodyguard during his invasion of the Stranger's Laboratory World (Quasar #14, 1990)", 
        "along with Squadron relocated to Project: PEGASUS (Quasar #16, 1991)", 
        "alongside other heroes on Earth-616 helped save New York City from Eon’s body (Quasar #27 (1992)", 
        "among assembled beings gathered to help Quasar (Quasar #50, 1994)", 
        "fought the Avengers alongside the Squadron (Avengers #5, 1998)", 
        "was attacked by the Avengers at Project: PEGASUS, was revealed to be mentally controlled by the Corruptor (Avengers #6, 1998)", 
        "fought and defeated Imus Champion alongside the Avengers, was sent back to her home dimension alongside the Squadron (Avengers/Squadron Supreme Annual ‘98, 1998)", 
        "returned to Earth-712, recruited Amphibian to rejoin the Squadron, joined rebellion against the Global Directorate (Squadron Supreme: New World Order, 1998)", 
        "fought the Exiles upon their arrival in the 712 reality (Exiles #77, 2006)", 
        "acted as prosecutor in the Squadron's trial against the Exiles, was shown the corruption of the Global Directorate and the history of the Exiles, joined the Exiles and departed for the next reality in pursuit of Proteus (Exiles #78, 2006)", 
        ""
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Earth-712", 
    "weight": 239
}