{
    "aliases": [
        "Doctor X", 
        "Professor Xavier", 
        "formerly Prisoner M-13"
    ], 
    "citizenship": "U.S.A.", 
    "content": "By the time he graduated high school, Charles was completely bald as a side effect of his mutant nature. He entered Bard College in New York at age 16 and earned his bachelor's degree in biology within two years. He was then accepted into the graduate-studies program at England's prestigious Oxford University, where he earned degrees in genetics and biophysics. There, Charles met and fell in love with a young Scotswoman named Moira Kinross. Their passionate discussions on the subject of genetic mutation gave way to romance, and they planned to marry. Their only obstacle was Moira's former boyfriend, Joe MacTaggert, a lance corporal in the Royal Marines and a bully, just like Cain. In Joe's eyes, Charles was a good-for-nothing intellectual, so Charles enlisted in the military after completing his studies at Oxford to validate himself in terms his rival would understand.Charles quickly became something of a legend in the area of search and rescue thanks to his mutant abilities. Attached to the same unit as his stepbrother, Charles was present when Cain deserted under fire during a mission in Asia. Following him in the hope of convincing him to return to their unit, Charles witnessed Cain's discovery of the mystical Ruby of Cyttorak and his transformation into the superhuman Juggernaut. Charles escaped the subsequent cave-in, mistakenly believing his stepbrother was dead.Charles next traveled to Israel, where he fell in love with Israeli diplomat Gabrielle Haller. He also befriended a fellow drifter named Erik Magnus Lehnsherr, a fellow mutant who would become his greatest enemy: Magneto, self-styled master of magnetism. Whilst Charles optimistically believed that humans and mutants could coexist, the Jewish Magnus foresaw mutants as the new minority to be persecuted and hunted because of their differences. Together, the pair prevented the nefarious Baron Von Strucker from launching his terrorist group Hydra on an unsuspecting world. Magnus departed with Strucker's gold, and upon departing Israel himself, Charles was unaware that Haller was pregnant with his son, David.En route to the United States, Charles encountered the alien scout Lucifer in the Himalayas. To prevent any interference in his race’s planned invasion of Earth, Lucifer dropped a massive stone block on Charles, crippling his legs. In desperation, Charles called out with his mental powers and touched the mind of a young mutant named Tessa who was operating as a mercenary in the neighboring Hindu Kush mountains. Tessa came to his aid and Charles was airlifted to safety. During his convalescence in an Indian hospital, Charles met Amelia Voght, a young nurse who fell in love with him and renewed his will to live.Charles resumed graduate work at Columbia University in New York, and after receiving a Ph.D. in anthropology he spent several years in London earning a M.D. in psychiatry. There, Charles renewed his friendship with Moira, who had married Joe MacTaggert and was now a renowned geneticist. The two began discussing the idea of founding a school for mutants.Charles returned to America and resumed his studies of mutation, working alongside Doctor Karl Lykos, a mutant whom would one day become the creature named Sauron. During this time, Professor John Grey, a friend of Charles' from Bard College, brought his young daughter Jean to Charles for help. Jean had been traumatized when she telepathically experienced the death of a friend. Charles aided in her recovery, and in the ensuing years trained her to use her mental powers. Charles later met with Fred Duncan, an F.B.I. agent investigating the growing number of mutants. Charles told Duncan of his plan to locate young mutants and enroll them in a school using his ancestral mansion home as a base to train them to use their powers for humanity's benefit. Amelia remained with Charles until the young mutant Scott Summers joined the school. She left, fearing an escalating genetic arms race between Charles and Magnus. Over the following months, Charles used the mutant-locating computer Cerebro to assemble his original group of students: Cyclops, Iceman, Angel, Beast, and Jean, who took the name Marvel Girl. He dubbed his students the \"X-Men,\" because each possessed an \"extra\" ability that normal humans lacked. Charles also recruited Tessa at this time, but kept her presence at the mansion a secret from his other students as he planned to use her talents as a spy.Soon after, Charles learned of a planned invasion of Earth by the alien Z'nox, and theorized that he would have to link the minds of the majority of morally upright people on Earth to stop the invaders. However, he needed time in virtual isolation to prepare his mind for such an awesome task. To that end, Charles had the mutant shape-changer named Changeling impersonate him so that his students, except for Jean to whom he entrusted his plan, would remain none the wiser. After Changeling died on a mission with the team, Charles allowed the X-Men to believe he was dead. Months later, Charles revealed his deception to his students and repelled the invaders. The X-Men and the superhuman adventurers known as the Fantastic Four then traveled into space and defeated the aliens.Years later, when his original students were captured by the sentient island-being Krakoa, Charles recruited Banshee, Colossus, Nightcrawler, Storm, Sunfire, and Wolverine as a new team to rescue them. Afterwards, Cyclops was the only original member to remain and help Charles train the new recruits. Before long, Charles began to experience psychic nightmares from an alien world. These images were sent by Lilandra, princess of the intergalactic Shi'ar Empire, who was seeking assistance to defeat her mad brother D'Ken. In the course of the ensuing struggle, Charles and Lilandra fell in love, and for a time he lived on Chandilar, the Shi'ar throneworld, as her consort.Charles and Lilandra spent much time together on Earth before her coronation, and during this time the X-Men fought Magneto in Antarctica. After the battle, most of the team made it to the hidden jungle in the icy wasteland known as the Savage Land. Phoenix and Beast returned to Westchester, believing the rest of the team had died. Heartbroken, Charles accompanied Lilandra to the Shi'ar homeworld for her coronation. When he learned that the rest of the X-Men were actually alive, he returned to Earth.Some time later, Lilandra faced a coup by her sister Deathbird and the insectoid alien Brood race. The X-Men and the space pirates known as the Starjammers helped defeat them, but Charles had been implanted with a Brood egg which would ultimately hatch and transform him into the Brood's new queen. When Charles tried to probe the implant he was sent into a coma, and after he awoke he learned the X-Men had been captured by the Brood and taken into space. Fearing his students dead, and under subconscious commands from the larval Brood within him, Charles gathered a new group of young superhuman students he named the New Mutants. Following the X-Men’s return, the queen hatched and transformed Charles into a Brood. Although his body was destroyed, with the X-Men's help, Charles was able to retain mental control of the Brood Queen long enough for the Starjammers' physician Sikorsky to clone him a new body with no disabilities. It was some time before Charles could walk again due to the psychosomatic pain of being crippled for so long.Eventually, Charles began to take his most active role ever with the X-Men by accompanying them on missions. During this time, Gabrielle requested Charles’ help in treating her son David, the powerful psionic mutant known as Legion who suffered from multiple personality disorder. Charles learned that David was his child, and helped him emerge from his autistic condition.Charles' cloned body eventually began to deteriorate, and he was forced to leave Earth with Lilandra and the Starjammers to heal. He left the school in the seemingly reformed Magneto's care, joining Lilandra in the fight to regain her rightful place on the Shi'ar throne. After an extended sojourn in space, Charles returned to Earth and both the original and second teams of X-Men reassembled under his leadership to battle his old enemy Farouk, now calling himself the Shadow King. Charles’ spine was broken in the ensuing battle, leaving him crippled and confined to a wheelchair once more.Since the X-Men were all now highly trained adults, Charles renamed his school as the Xavier Institute for Higher Learning. He also assumed control of a private institution, the Massachusetts Academy, and transformed it into a new School for Gifted Youngsters. There, yet another new crop of young mutants, Generation X, learned to use their budding superhuman abilities, with Banshee and Emma Frost as headmasters.After a pitched battle, America's greatest super heroes narrowly defeated Onslaught. To ensure that Charles never again spawned such a being, the United States government took him into custody. Although Charles was willing to pay the price for his folly, he was appalled when the government turned him over to the custody of Bastion, head of the anti-mutant Operation: Zero Tolerance. After Zero Tolerance was shut down, the X-Men set out to search for their missing founder. When they finally located him, Charles was leading a new incarnation of the Brotherhood of Mutants in an attempt to defeat a now-sentient Cerebro. Charles ultimately defeated Cerebro by showing him the unique importance of each living individual.Charles subsequently returned to the X-Men, but soon after disbanded the team over fears a member of the shape-shifting alien race known as the Skrulls had infiltrated them. After Wolverine was seemingly killed in battle, it was revealed that it was actually a Skrull impersonating him who had died, thus proving Charles' theory correct. The X-Men reformed in time to foil the plans of the eternal mutant Apocalypse, who sought to rule the world by using the power of the Twelve -- a fabled team of mutants, including Charles and Magneto, who were destined to usher in a new golden age for their kind. After Apocalypse was defeated, Charles departed Earth with Cadre K, a team of adolescent mutant Skrulls, to help them find a new home.Charles returned to the X-Men to lead them once more, but was captured by Magneto who had been amassing an army on the island nation of Genosha in preparation for an all-out war against humanity. The X-Men rescued their founder, and Magneto was himself crippled by Wolverine. Soon after, Genosha’s population was obliterated by giant mutant-hunting robotic Sentinels sent by Charles’ malevolent genetic twin sister, Cassandra Nova. Charles found himself powerless against his sister after she switched bodies with him, trapping his mind in her own dying form. In Charles’ body, Nova publicly outed him as a mutant and then left Earth with Lilandra whom she convinced to order the Shi'ar's superhuman Imperial Guard to destroy all mutants on Earth. After a pitched battle with the X-Men during which Nova's deception was revealed, Jean Grey absorbed Charles’ consciousness into her own mind, then used the new mutant-locating Cerebra device to hide pieces of it in the minds of every mutant on Earth. When Nova went to use Cerebra to kill all of Earth's mutants, she unwittingly reformed Charles’ consciousness and he forced her out of his body. Once Nova was defeated, Xorn, the X-Men’s newest member, healed Charles’ body.Free of having to hide behind a veil of secrecy, Charles took to his now public role as a mutant rights activist with vigor. He opened his school to mutants everywhere, and the X-Men became the new faculty. It was not long, however, before Charles’ world came crashing down around him after it was revealed that Xorn was seemingly Magneto in disguise. His old nemesis had survived the Genoshan holocaust and infiltrated the X-Men, gathering together a class of students to use as his new soldiers for the war against mankind. Xorn crippled Charles once more and took control of New York City, rechristening it New Genosha. Using a neurotoxic drug known as Kick to boost his powers, Xorn planned to reverse the magnetic poles of the Earth, destroying humanity and ushering in a new age for mutantkind. However, his students rebelled, and the timely arrival of the X-Men saw a permanent end to his plans after Wolverine decapitated him.With reality restored, Xavier was still missing and the X-Men were unable to locate him with Cerebro. Many assumed the worst. Xavier returned when Vulcan attacked the X-Men, revealing that Wanda had given him control of his legs, with the exchange being that he was no longer a mutant. Under Vulcan's orders, Xavier revealed that he had sent a team of young mutants to their deaths to Krakoa when his original X-Men were captured. After Vulcan was dispatched of, Cyclops told Xavier that he was no longer welcome at the Xavier Mansion.Xavier still remained at the mansion disregarding Cyclops' orders only to aid in assisting Beast in his analysis of Darwin, though the tension between him and Cyclops was palpable. He started to try contacting the Shi'ar Empire, to see if Vulcan had arrived, but got only dead air. The best they could do was make a machine that would send them a message every 30 minutes. To help him deal with the results of his years-old misjudgment, he asked Havok, Polaris, Warpath, Nightcrawler,and Marvel Girl to join him on a quest to the Shi'ar Galaxy to stop Vulcan. In spite of Cyclops' feelings, Xavier traveled to space to confront Vulcan before he could enact his vengeance against the Shi'ar empire. While en route to the Shi'ar homeworld, he was abducted by agents of the Shi'ar Vice Chancellor K'Tor.Endangered Species Gallery\nX-Men #200 & Endangered Species Sell Out!\nWorld War Hulk Checklist", 
    "durability": 4, 
    "education": "Ph.Ds in genetics, biophysics, psychology, and anthropology, and an M.D. in psychiatry", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 4, 
    "firstappearance": "X-Men #1 (1963)\n", 
    "groupaffiliation": [
        "X-Men (founder)", 
        "formerly Excalibur (Genoshan)", 
        "Illuminati", 
        "Cadre K (founder)", 
        "the Twelve", 
        "Starjammers", 
        "New Mutants (founder)", 
        "U.S. Army"
    ], 
    "hair": "Bald (blond during childhood)\n", 
    "height": 72, 
    "id": "Professor_X", 
    "identity": "Publicly known", 
    "intelligence": 7, 
    "knownrelatives": "Brian Xavier (father, deceased), Sharon Xavier (mother, deceased), Cassandra Nova (sister), Kurt Marko (stepfather, deceased), Cain Marko (Juggernaut, stepbrother), Lilandra (ex-wife), David Charles Haller (Legion, son, deceased)", 
    "occupation": [
        "Mutant rights activist", 
        "geneticist", 
        "teacher", 
        "formerly adventurer", 
        "soldier"
    ], 
    "origin": [
        "X-Men #12 (1965)", 
        "X-Men #38-42 (1967-1968)"
    ], 
    "placeofbirth": [
        "New York City", 
        "New York"
    ], 
    "powers": "Professor X is a mutant who possesses vast psionic powers, making him arguably the world's most powerful telepath. He can read minds and project his own thoughts into the minds of others within a radius of approximately 250 miles. With extreme effort, he can greatly extend that radius. Professor X can also psionically manipulate the minds of others, for example to make himself seem invisible, and project illusions into them. He can also induce temporary mental and/or physical paralysis, loss of particular memories or even total amnesia. Within close range, Professor X can manipulate almost any number of minds for such simple feats. However, he can only take full possession of another being's mind one at a time, and he can only do so if he is within that being's physical presence.\nFurthermore, Professor X can project powerful mental bolts of psionic energy enabling him to stun the mind of another being into unconsciousness. These bolts only apply force upon other minds; they do not inflict physical damage. Professor X can also sense the presence of other superhuman mutants within a small radius of himself by perceiving the distinct mental radiations emitted by such beings. In order to detect the presence of mutants beyond this radius, he must amplify his powers. He often does this by using first Cerebro and subsequently Cerebra, devices which are sensitive to that portion of the electromagnetic spectrum that contains mental frequencies.\n\nProfessor X can project his astral form, the sheath of his life essence, onto abstract dimensions congruent to our own known as astral planes. There, he can use his powers to create ectoplasmic objects. He cannot engage in long-range astral projection on the earthly plane.", 
    "realname": "Charles Francis Xavier", 
    "significantissues": [
        "Attempted to kill sister in-utero (New X-Men #121, 2001)", 
        "first encountered Amahl Farouk (X-Men #117, 1979)", 
        "first met Magneto (Uncanny X-Men #161, 1982)", 
        "crippled by Lucifer (X-Men #20, 1966)", 
        "rescued by Tessa (X-Treme X-Men #44, 2004)", 
        "first met Amelia Voght (Uncanny X-Men #309, 1994)", 
        "founded X-Men, first battled Magneto (X-Men #1, 1963)", 
        "formed second X-Men team (Giant-Size X-Men #1, 1975)", 
        "first met Lilandra (X-Men #105, 1977)", 
        "founded New Mutants (Marvel Graphic Novel #4, 1982)", 
        "received cloned body (Uncanny X-Men #167, 1983)", 
        "crippled by Shadow King (Uncanny X-Men #280, 1991)", 
        "reformed X-Men (Uncanny X-Men #281/X-Men #1, 1991)", 
        "founded Generation X (Uncanny X-Men #318, 1994)", 
        "reformed school (New X-Men #114, 2001)", 
        "witnessed destruction of Genosha (New X-Men #115, 2001)", 
        "publicly outed as mutant (New X-Men #116, 2001)", 
        "\"healed\" by Xorn (New X-Men #126, 2002)", 
        "crippled by Xorn (New X-Men #146, 2003)", 
        "buried \"Magneto\", began rebuilding of Genosha (New X-Men #155-156, 2004)", 
        "rejoined X-Men (Uncanny X-Men #475, 2006)"
    ], 
    "speed": 2, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 190
}