{
    "aliases": [
        "Proteus", 
        "Mutant X", 
        "Kevin Sidney"
    ], 
    "citizenship": "Unknown", 
    "content": "His killing spree continued until he stumbled on a team that consistent of people from several different realities that called themselves as Exiles. At this point Proteus had possessed body of Angel Salvadore who was approached by Beak member of the omniversal team who had married her in his own reality Earth-616. Proteus used this opportunity to collect information of who they were but Exiles soon arrived with Moira who had revealed them who Proteus really were. They tried to stop him but his world altering powers were too much for them to handle. Proteus took the Tallus from Sabretooth and used it to steal information from Crystal Palace's databases. He forgot to bay attention to her mother who shot him in the back but Proteus just left the body showing his true form. He then killed her mother and took over Mimic's body. Stunned Exiles just watched as Proteus left to other reality using the information he stole from Crystal Palace.He then found himself in Earth-15731 where he fought Justice and eventually took his body over as he managed to destroy Mimic's body almost entirely. He soon met the Exiles again who had taken it as their mission to stop Proteus. Now they had come prepared as they hired Longshot from Mojoverse to fight him. Longshot was winning the fight until Proteus escaped to another reality. He found himself in Earth-6375 where he changed body once again taking over this reality's Hulk. He then was attacked by Exiles and this reality's Spider-Man. In the middle of the fight Proteus ripped Spider-Man's mask off revealing his identity to whole world. Proteus soon left this world as well and traveled to Earth-712 where he briefly met Squadron Supreme. He then visited earth that was devastated by a war that killed most of world population and was now ruled by Maestro (Hulk of this reality). He was approached by Rick Jones who hired him to kill Maestro. He only accepted the job because it fit his own agenda to take over the city. He attacked the castle and shot Maestro with a gun given to him by Rick Jones and tried to posses Maestro but couldn't because it was Morph in Maestro's form and he had piece of metal in his head. They had made a deal with Maestro to stop Proteus but something went wrong and Maestro attacked Exiles. In the mist of the battle piece of metal in Morph's head was punched out and Proteus used the opportunity to posses his body. Immediately he realized that Morph's body was not the same as the others. It didn't start to waste away immediately as he possessed it. He briefly tested his new abilities before he decided to go home.When he warped to Earth-616 reality he found a world totally different as he had left behind. In reality he didn't know that Heather Hudson intervened on the transfer and transported him to Counter-Earth. There he met Young Allies and convinced them that the Exiles were not to be trusted. Then Chaos and Order proclaimed that Proteus was the person it has been waiting for. They took Proteus to Atlantis and told him this world should be destroyed, as it was not part of natural order. He killed everyone on Atlantis and raised it from the ocean floor launching the nuclear missiles shortly after that. Young Allies and Exiles worked together to stop the missiles and fought Proteus. They managed to trick Proteus to wear a crown that had mind-reprogramming device got from Earth-712. They used it make Proteus think he really was Morph.He then came part of the team as he thought nothing happened. This way they could observe if his memories would come back and stop it if necessary. After his first mission with the team in Heather Hudson's home reality Earth-3470 he was fired with the rest of the team by the Timebreakers. He and the rest of the team were hired back when the bugs found themselves in situation that was more than they could handle. They soon found themselves in Earth-127 where Quicksilver, Scarlet Warlock, Wolverine, Magneto and Mesmero of that world had merged in one being calling itself Brother Mutant. Timebreakers had sent several Wolverine's from different worlds to Earth-127 as computer predicted that Wolverine was the answer. There Exiles worked with them and managed to finally kill Brother Mutant with the help of a young Wolverine from Earth-1880. In one mission Morph was recruited to Imperial Guard of Earth-552 with the rest of the Exiles so they could fight Silver Surfer of that reality and stop him killing his old master Galactus the Restorer of Worlds.", 
    "durability": 1, 
    "education": "Unknown", 
    "energy": 1, 
    "eyes": "White\n", 
    "fighting": 1, 
    "firstappearance": "Exiles #69 (2005)\n", 
    "groupaffiliation": [
        "Exiles", 
        "(formerly) Imperial Guard"
    ], 
    "hair": "None\n", 
    "height": 0, 
    "id": "Proteus_(House_of_M)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Moira MacTaggert (mother)", 
    "occupation": [
        "Reality traveler", 
        "former murderer"
    ], 
    "origin": "Exiles #70 (2005)", 
    "placeofbirth": "Unknown", 
    "powers": "When he was Proteus he could manipulate reality to do whatever he wanted. He could also open portals into other realities allowing him to traverse through them. He is too vulnerable outside of a host body so he has to inhabit the body of other sentient beings. His power burns through most corporeal forms so he constantly has to switch bodies as he runs through them. Proteus was also vulnerable to magic and metal but recently he has seemed to grow a tolerance of it. As Morph he can manipulate his shape and chemical make-up. He can transform body parts and is a natural mimic of voices and sounds. He can also change his color. He is also extremely durable and resistant to physical damage. He is much more susceptible to energy based attacks. He is also able to fly via unknown means.", 
    "realname": "Kevin MacTaggert", 
    "significantissues": [
        "took over Angel Salvadore's body (Exiles #69, 2005)", 
        "fought Exiles and took over Mimic's body (Exiles #71, 2005)", 
        "took over Justice Warrior's body (Exiles #73, 2006)", 
        "revealed Spider-Man's identity and took over Hulk's body (Exiles #75, 2006)", 
        "killed Maestro and took over Morph's body (Exiles #80, 2006)", 
        "brainwashed to think he is Morph (Exiles #82, 2006)", 
        ""
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": [
        "Omniverse", 
        "formerly: Marvel Universe and House of M"
    ]
}