{
    "aliases": [
        "Shadowcat", 
        "Cat", 
        "Kitten", 
        "formerly Ariel", 
        "Sprite"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Kitty herself was unaware that she was a mutant until the afternoon that Emma Frost, then White Queen of the Hellfire Club, arrived to speak to her parents about enrolling Kitty in her Massachusetts Academy. During the visit, Kitty suffered her worst headache yet and went upstairs to her room. When the headache stopped, Kitty was surprised to find she was on the floor of her living room. She had unknowingly used her power to phase through solid matter for the first time, passing through her bed and floor into the room below.Kitty quickly became a valuable member of the X-Men, proving her worth one Christmas Eve by single-handedly defeating one of the demonic N'Garai. Kitty formed a close friendship with both the X-Man Storm and the mutant sorceress Illyana Rasputin. The bond between Kitty and Illyana grew so strong that Kitty was eventually able to manifest the Soulsword, the ultimate expression of Illyana's magical nature.Kitty also formed a romance with her teammate Piotr Rasputin (Colossus), and she gained a constant companion on an adventure in space in the form of a small alien dragon-like creature she named Lockheed. Kitty gained another close friend when she met Doug Ramsey, a fellow student in Stevie Hunter's dance class with whom she shared an affinity for computers. Doug's death on a mission with the New Mutants would prove to be the first of many personal losses Kitty would suffer.While Colossus was away on Battleworld during what was to be called the Secret Wars, he became infatuated with an alien healer named Zsaji. Upon returning to Earth, he admitted his disloyalty to Kitty, severing their romance.During the massacre of the underground community of mutants known as the Morlocks by the team of superhuman mutant assassins the Marauders, Kitty was injured by an energy spear hurled by the Marauder called Harpoon that adversely affected her powers. Unable to regain her solidity, Kitty was saved by the combined efforts of the European dictator Doctor Doom and his arch-rival, Reed Richards of the team of superhuman adventurers known as the Fantastic Four. However, she could now only maintain a solid form through concentration.Months later, Kitty learned that Illyana was dying from the deadly mutant-killing Legacy Virus, a disease that targeted mutants. Kitty was present when Illyana finally succumbed to the disease, unaware that the young mutant's death bonded the Soulsword to her. Eventually the arcane magic's of the sword began to corrupt Kitty, and she surrendered the weapon to her then teammate Daytripper who in turn gave it to her mother, the gypsy sorceress Margali Szardos.Soon after, Excalibur was approached by the clandestine organization known as Black Air for assistance on a mission to the island nation of Genosha. They were assigned a liaison in Pete Wisdom, an uncouth British mutant who regularly clashed with the outspoken Kitty. The pair eventually overcame their initial impressions of one another and fell in love. Wisdom even resigned from Black Air and joined Excalibur to be with Kitty.Later, Kitty was recruited by the international law enforcement agency S.H.I.E.L.D. to repair the computer system of their flying headquarters. Kitty discovered the problem was due to Ogun’s spirit having infiltrated the computer system, and with the aid of Wolverine, she managed to purge Ogun's presence. During this time, Kitty was attracted to a S.H.I.E.L.D. intern her own age, and this made her begin to doubt her relationship with Wisdom. Soon after, she broke off their relationship.Kitty remained a member of Excalibur until it disbanded whereupon she rejoined the X-Men. Soon after, an incident in Genosha caused Kitty to develop a rebellious attitude, reflected by her cutting her hair short, her more ferocious combat technique, and her taking to wielding one of Wolverine's broken bone claws in battle.When Colossus sacrificed his life to release a cure for the Legacy Virus, his body was supposedly cremated, and Kitty scattered the ashes over his Russian farmland home. Mourning the loss of her old friend, and trying to live a normal life, Kitty left the X-men. She enrolled in the Robert A. Heinlein School for Engineering and Astrophysics in Chicago on a full scholarship, yet chose to live off campus and began working as a bartender for her neighbor at his establishment, the Belles of Hell. Kitty found herself unable to escape the ever-prevalent prejudice of humans, and she soon clashed with members of a student anti-mutant organization named Purity. Kitty was put on probation and was forced to attend mandatory counseling. During this time, Kitty faced her most difficult loss when she learned her father was amongst those killed in an attack on Genosha.Kitty's battle against Purity continued after the organization attempted to frame her for the sabotage of a research experiment. A student meeting was called to debate the banning of either Purity or mutants from campus, but discussions were cut short by an attack by a new breed of mutant-hunting robotic Sentinels which were destroyed by Kitty with the help of former New Mutant Karma and Genoshan exchange student Shola Inkosi.", 
    "durability": 3, 
    "education": "Some university-level courses", 
    "energy": 2, 
    "eyes": "Hazel\n", 
    "fighting": 4, 
    "firstappearance": "(As Kitty Pryde) X-Men #129 (1980); (as Sprite) X-Men #139 (1980); (as Ariel) X-Men #171 (1983); (as Shadowcat) Kitty Pryde and Wolverine #5 (1985)\n", 
    "groupaffiliation": [
        "Formerly X-Men", 
        "Excalibur", 
        "S.H.I.E.L.D.", 
        "New Mutants"
    ], 
    "hair": "Brown\n", 
    "height": 66, 
    "id": "Pryde,_Kitty", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Carmen Pryde (father, deceased), Theresa \"Terri\" Pryde (mother), Samuel Prydeman (grandfather, deceased), Chava Rosanoff (great-aunt, deceased)", 
    "occupation": [
        "Adventurer", 
        "teacher", 
        "former student", 
        "bartender", 
        "S.H.I.E.L.D. agent"
    ], 
    "origin": "X-Men #129 (1980)", 
    "placeofbirth": [
        "Deerfield", 
        "Illinois"
    ], 
    "powers": "Kitty Pryde is a mutant with the ability to “phase” through solid matter by shifting her atoms through the spaces between the atoms of the object through which she is moving. Kitty can phase her clothing along with herself, and through practice has learned to phase other objects and people without harm to them. For all intents and purposes, Kitty is intangible whilst phasing, however she is still vulnerable to psionic or mystical attacks. Certain forms of energy can also disrupt her phased state.\nWhen Kitty phases through an object with an electrical system, the process disrupts the system's workings. This includes the electrical impulses found in the human brain. Kitty can phase part or all of her body through another living being without harm to herself, though the other being can be rendered unconscious as a result. Kitty also has the potential to kill another being by phasing them into a solid object and then releasing them, causing them to solidify whilst still within the object.\nKitty passes through objects at the same rate of speed at which she is moving before phasing. Since she is unable to breathe while phasing, she can only continuously phase through solid objects - as when she travels underground - as long as she can hold her breath. Kitty can keep her phased form at rest in relation to the rotation of the Earth upon its axis, thus allowing her to assume a ground speed of the length of a football field and a half every second. Kitty can also walk on air whilst phasing.\n\nKitty has trained herself to reflexively assume a phased state at any indication of danger, such as a loud noise like a gunshot, in order to protect herself.", 
    "realname": "Katherine \"Kitty\" Pryde", 
    "significantissues": [
        "Joined X-Men (X-Men #138, 1980)", 
        "possessed by future self (X-Men #141/Uncanny X-Men #142, 1981)", 
        "vs N'Garai demon (Uncanny X-Men #143, 1981)", 
        "briefly attended Massachusetts Academy (Uncanny X-Men #151-152, 1981)", 
        "met Lockheed (Uncanny X-Men #166, 1983)", 
        "briefly joined New Mutants (Uncanny X-Men #168, 1983)", 
        "met Doug Ramsey (Uncanny X-Men #180, 1984)", 
        "first encountered Ogun (Kitty Pryde and Wolverine #1-6, 1984-1985)", 
        "first manifested Soulsword (New Mutants #30, 1985)", 
        "injured by Marauders (Uncanny X-Men #211, 1986)", 
        "co-founded Excalibur (Excalibur: The Sword is Drawn, 1988)", 
        "attended St. Searle's (Excalibur #32-34, 1990-1991)", 
        "death of Illyana (Uncanny X-Men #303, 1993)", 
        "met Pete Wisdom (Excalibur #86, 1995)", 
        "briefly joined S.H.I.E.L.D. (Kitty Pryde: Agent of S.H.I.E.L.D. #1-3, 1997-1998)", 
        "rejoined X-Men (Uncanny X-Men #360/X-Men #80, 1998)", 
        "adopted rebellious attitude (X-Men #100, 2000)", 
        "mourned Colossus (X-Men #110, 2001)", 
        "first attended university, encountered Purity (X-Men Unlimited #36, 2002)", 
        "debated against Purity, vs Sentinels (MekaniX #1-6, 2003)", 
        "uncovered secret of Mount Haven (X-Treme X-Men #25-30, 2003)", 
        "rejoined X-Men (X-Treme X-Men #46, 2004)", 
        "revealed to be alive and returned to Earth by Magneto (Uncanny X-Men #522, 2010)"
    ], 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 110
}