{
    "aliases": [
        "Bee", 
        "Betsy", 
        "Captain Britain", 
        "Lady Mandarin"
    ], 
    "citizenship": "U.K.", 
    "content": "When the crimelord Vixen secretly usurped S.T.R.I.K.E., she hired Slaymaster to eliminate the Psi-Division before they could expose this. The telepaths fled, but Slaymaster continued to pick them off; only a handful were left when Betsy sensed Brian's return and called on his help. He defeated Slaymaster and the three surviving psi's (Betsy, Tom and Alison Double) moved into the holographically hidden Braddock Manor. In short succession this hideout was found by the Special Executive, Captain U.K. and the Fury; as the last of these battled Brian and the Executive, Betsy foresaw a future where superhumans were imprisoned in concentration camps. Soon the U.K. became a fascist state ruled by the insane reality warper Sir James Jaspers, with S.T.R.I.K.E. \"Beetle\" squads rounding up those with powers. While Brian confronted Jaspers, the Beetles found the others' hideout. Tom died trying to buy his friends time to escape; Betsy was in Tom's mind when he died, and was captured. After being freed, she was nursed back to health by fellow camp inmate Victoria Bentley, who taught her to use her experiences to strengthen her powers. When Kaptain Briton, Brian's Earth-794 counterpart, tried to rape her, Betsy fried his mind, killing him. The same night, Mastermind informed the twins of their father's non-terrestrial origins, and the Resources Control Executive (R.C.X.) asked them to billet Warpies, children transformed by Jaspers' warp, at the Manor. One of the R.C.X. agents was Matthew, now codenamed Gabriel. Betsy overruled Brian and let R.C.X. and the Warpies move in. When Brian went overseas, Gabriel convinced Betsy to become the new Captain Britain, wearing Kaptain Briton's modified costume. Working with Captain U.K. (Linda McQuillan), the duo became public sensations, but after several months Betsy went solo. Vixen lured her into a showdown with Slaymaster, who brutally beat her, then gouged her eyes out. Brian felt her pain, flew to her rescue and killed Slaymaster. Betsy refused R.C.X.'s offer of cybernetic eyes, preferring to rely on her psychic abilities; she and Gabriel got engaged, and went to Switzerland for Betsy to recuperate.Betsy was kidnapped from the Alps by Mojo, brainwashed, given cybernetic eyes, and, as \"Psylocke,\" became the star of his new show \"Wildways.\" Brian and the New Mutants rescued her, after which Betsy moved to the X-Men's mansion to recover, exactly where Roma (Merlyn's daughter) needed her to be. When the Marauders attacked the Morlocks, and Sabretooth invaded the mansion, she used herself as bait to lead him away from the injured until Wolverine got there. Impressed by her bravery, Wolverine nominated her to join the X-Men, beside whom she met Mephisto, Dr. Doom, the Fantastic Four, and Horde. The X-Men later battled Freedom Force and the Adversary in Dallas, and, in a televised battle, sacrificed themselves to allow Forge to bind the Adversary; Roma secretly restored them to life, and gave Betsy the Siege Perilous, which they could use if they ever wanted to start new lives. The X-Men moved to the Reavers' Australian Outback base, from where they took on the Brood Boys, Genoshan Magistrates, M Squad, Mr. Jip, the Serpent Society, the Abomination, Master Mold, Nimrod, Nanny, the Orphan-Maker, Zaladane and the Savage Land Mutates. As they were about to depart the Savage Land, Betsy had a precognitive flash of the Reavers killing the team. To prevent this, she sent them through the Siege Perilous.Betsy reappeared amnesiac on an island near China, where the Hand found her. Matsu'o Tsurayaba, their leader, saw a chance to save his brain-dead lover, Kwannon, and had Spiral's Body Shoppe swap their souls. This inadvertently blended their minds, leaving each with the same memories and telepathic powers. Tsurayaba brainwashed Psylocke and gave her to the Mandarin as his assassin, Lady Mandarin, until Wolverine restored her memories. Back with the X-Men Betsy took on Cameron Hodge, Warskrulls, the Shadow King and cosmic cleaner Edifice Rex; she also informed Brian she was alive. The next few months saw battles against Magneto, Fenris, Mys-Tech (alongside new ally Dark Angel), and a Brood-infected Ghost Rider. Visiting Brian, Betsy helped Excalibur fight Sat-Yr-9 and the now insane Jamie, whom Betsy struck comatose. Encounters followed with the Troll Associates, the Mutant Liberation Front, Stryfe, Omega Red, and the Soul Skinner.Then Kwannon arrived at the Mansion in Betsy's original body, claiming to be the real Psylocke. Unable to discern which was truly Betsy, both stayed with the X-Men, maintaining an uneasy coexistence, with Kwannon taking the name Revanche. Learning she had the Legacy Virus, Revanche had Matsu'o kill her, after which Betsy regained her soul's missing piece. Having become involved with her teammate Angel, the following months saw her fight the Phalanx, try to reach Jamie's comatose mind, battle Legion in Israel, and combat Gene Nation. When Sabretooth gutted Psylocke, Angel, Wolverine, Doctor Strange and Gomurr the Ancient retrieved a magical liquid from the Crimson Dawn dimension which healed her and gave her new powers, but also marked her with a red tattoo over her left eye. Kuragari, Proctor of the Crimson Dawn, tried to claim Betsy as his bride, but was thwarted with Gomurr and Angel's aid, freeing Betsy of the Dawn's influence. Subsequently she aided Storm against the Shadow King, who tricked Psylocke into initiating a psychic shockwave which disabled all other telepaths, leaving him unchallenged on the astral plane. Her own astral form was destroyed, but her exposure to the Crimson Dawn gave her a new shadow form with temporarily enhanced powers, which she used to trap the Shadow King's core. To keep him trapped she was forced to constantly focus her telepathy on him, effectively rendering herself powerless. After attending Brian's wedding, she was kidnapped to take part in the Coterie's contest of champions. When Apocalypse and his Horsemen sought to gather the Twelve, Psylocke used Cerebro to boost her powers, so that she could use them and still keep the Shadow King imprisoned, allowing her to free the brainwashed Wolverine. Jean Grey's attempt to help Betsy deal with the Shadow King somehow swapped their powers, leaving Betsy telekinetic. With her new abilities Betsy fought Belasco, the Neo, the Goth, and the Prime Sentinels, then aided her brother freeing Otherworld from Mastermind's Warpie army.", 
    "durability": 3, 
    "education": "University graduate", 
    "energy": 6, 
    "eyes": "(originally) Blue; (cybernetic) purple; (currently) purple\n", 
    "fighting": 6, 
    "firstappearance": "(As Elizabeth) Captain Britain #8 (1976); (as Captain Britain) Captain Britain #12 (1986); (as Psylocke) Uncanny X-Men #213 (1987); (as Lady Mandarin) Uncanny X-Men #256 (1989)\n", 
    "groupaffiliation": [
        "X-Force", 
        "formerly X-Men", 
        "Sisterhood of Mutants", 
        "Exiles", 
        "Excalibur", 
        "Captain Britain Corps", 
        "S.T.R.I.K.E.", 
        "The Hand"
    ], 
    "hair": "(originally) Blonde, dyed purple; (currently) black, often dyed purple\n", 
    "height": 71, 
    "id": "Psylocke", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "James Braddock Sr. (father, deceased), Elizabeth Braddock (mother, deceased), James \"Jamie\" Jr. (brother), Brian Braddock (Captain Britain, brother), Meggan Braddock (sister-in-law)", 
    "occupation": [
        "Adventurer", 
        "former charter pilot", 
        "super model", 
        "government agent", 
        "assassin"
    ], 
    "origin": [
        "Excalibur Annual #2 (1994)", 
        "X-Treme X-Men #3 (2001)"
    ], 
    "placeofbirth": [
        "Braddock Manor", 
        "England"
    ], 
    "powers": "Psylocke can generate a telekinetic katana, or direct her telekinesis through her fists to strike as if she had superhuman strength; she is also immune to telepathic probes and attacks. Psylocke's original powers were precognition, telepathy, mental bolts, mind control, and generating illusions. After Roma resurrected her, Betsy was briefly invisible to all mechanical detection devices. She could generate a \"psychic knife\" to stun or kill opponents. The Crimson Dawn gave her the power to travel via shadows, and to become virtually invisible in same. After swapping powers with Jean Grey, Betsy could create force fields, move objects with her mind, and generate energy blades.", 
    "realname": "Elizabeth \"Betsy\" Braddock", 
    "significantissues": [
        "Possessed by Dr. Synne (Captain Britain #9, 1976)", 
        "first precog dream (Captain Britain #34, 1977)", 
        "pursued by Slaymaster, reunited with Brian (The Daredevils #3, 1983)", 
        "death of Tom, placed in camp (Mighty World of Marvel #9, 1984)", 
        "killed Kaptain Briton (Captain Britain #6, 1986)", 
        "became Captain Britain, blinded by Slaymaster (Captain Britain #12-13, 1986)", 
        "captured by Mojo, given bionic eyes, rescued by New Mutants (New Mutants Annual #2, 1986)", 
        "first joined X-Men (Uncanny X-Men #213, 1987)", 
        "briefly became Lady Mandarin (Uncanny X-Men #256-258, 1989-1990)", 
        "exposed to Crimson Dawn (Uncanny X-Men #328, 1996)", 
        "with Archangel, opposed Kuragari (Psylocke & Archangel: Crimson Dawn #1-4, 1997)", 
        "imprisoned Shadow King (X-Men #77-78, 1998)", 
        "with Excalibur, liberated Otherworld from Mastermind (Excalibur: Sword of Power #1-4, 2001)", 
        "killed by Vargas (X-Treme X-Men #2, 2001)", 
        "returned alive (Uncanny X-Men #455, 2005)", 
        "joined Exiles (Exiles #90, 2007)", 
        "rejoined X-Men (Uncanny X-Men #511, 2009)"
    ], 
    "speed": 3, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 155
}