{
    "aliases": "None", 
    "citizenship": "Canada", 
    "content": "Much of Judd's subsequent activities in the years that followed remain unrevealed. It is known that Judd spent a year in Spain with another famous adventurer, the author Ernest Hemingway, where he learned to become a bullfighter, despite his size. In more modern years, he was working in some capacity at the Hull House orphanage in Canada. During this time, he helped other Canadian heroes help shut down an experimental energy reactor. (Many of these heroes would later be his teammates in Alpha Flight.)Once imprisoned for an unrevealed charge, he came to the attention of James MacDonald Hudson (Guardian), who was in the process of creating Canada’s first superhero team. He arranged for Judd’s parole so that he could join Beta Flight. At that time, Judd promised Hudson that he would never kill another human being again, perhaps a clue to his former imprisonment. Although Judd, code-named Puck, was officially to be promoted to join Alpha Flight, the Canadian government scrapped the project. Judd returned to working as a bouncer, but it wasn’t long before Guardian needed help against one of the Great Beasts, Tundra. Alpha Flight, including Judd, were reassembled. (Unfortunately, due to his limited resources, Judd failed to arrive in time to fight the Great Beast, although he made sure to track Hudson and burst onto the scene. He wouldn’t let Hudson consider abandoning the team again, not when he was finally promoted, and Alpha Flight was formed!)Puck became one of the most committed members of Alpha Flight, serving them for a long tenure. Judd also found his infatuation for Heather Hudson, Guardian’s wife, growing. Guardian was believed to have died early in Alpha Flight’s organization, but Judd would never act on his feelings, considering himself too unworthy of her.The spirit of Raazer remained trapped within Judd for years, escaping only three times. Once, during Alpha Flight’s encounter with Deadly Ernest, Puck was forced to kill the villain, and the guilt, along with other pressures, such as his feelings for Heather Hudson and his wish to return to normal size, enabled Raazer to escape from Judd's body. Judd grew to his full height but also aged all the years he had lived. Alpha battled Raazer while Judd knew that he needed to imprison the sorcerer again. Using his \"light,\" Judd once again drew Raazer inside him, returning to his dwarfish size and youthful appearance. The second time, he was tricked by Arcade to believe he inadvertently contributed to the death of Heather Hudson. Again, the guilt unleashed Raazer, and Judd was the only one who could defeat him by drawing him back inside his body.The last time occurred when Alpha Flight journeyed to the site of a previous battle, the Ebony Firefountain, in an effort to cure the two Flight members, Aurora and Northstar, of mysterious ailments. During a fight with the Dark Elves, Puck was hurled into the Ebony Firefountain. The Asgardian trickster Loki, who was manipulating events from afar, arranged to have the Ebony Firefountain remove the demon Raazer from Puck's body. For reasons known only to himself, Loki negated the effects of time on Puck's body, so he retained his youth while growing to full size. But Judd's face looked as if he were approaching his real age of 74 years. Puck was separated from Alpha Flight at this point and the team assumed he was killed in the battle. Actually, Loki teleported Puck to the Himalayan Mountains, where he spent his time wandering and pondering his existence.Eventually, Puck decided to search for the Doorway Between Worlds, a mystical portal in the Himalayas that opened onto other worlds. Instead, the guru at the temple there showed him his old teammates in combat with the entity known as the Dreamqueen. While helping Alpha Flight fight the Dreamqueen, Puck sacrificed himself in order to hold the villain in her own dimension while Alphan associate Laura Dean closed the portal with her newly discovered power. Trapped in the Dreamqueen's dimension, Puck was tortured mercilessly by her. When she was done torturing him, she would renew his body to ready him for more torture.The Dreamqueen again fought Alpha Flight and at the end of the battle was banished to a distant limbo dimension. Puck escaped his prison and learned how to manipulate the dream dimension. Puck was able to escape the dimension when Alpha Flight was tricked into traveling there by Llan the Sorcerer. The Sorcerer had created an alternate Manhattan, completely populated by warped versions of superheroes, in order to trap Alpha Flight there while he continued his conquest of Earth. With Puck's help, Alpha Flight was able to escape the dimension and return to Earth to defeat Llan.The victory was not without a price, however. The injuries Puck accumulated in the dream dimension appeared once he returned to Earth. As they were cured with Dreamworld substance, the magic didn't stay beyond the dream dimension. While in the hospital, trying to recover from his injuries, Puck's height had mysteriously shrunk by two feet when he was captured by two minions of the Alpha's archenemy, the Master. Throughout his stay in the hospital, the Master's slaves had been injecting Puck with an enzyme derived from blood of another of Alpha Flight's enemies, the flesh-manipulator Scramble, and Puck's blood from a former stay at the hospital. The enzyme \"read\" Puck's previous blood as from a dwarf and was forcing Puck's body back into that shape.While being held prisoner at the Master's inter-dimensional complex, Puck was subjected to further treatments to make him into a mate for the late-Alphan Marrina. When Alpha Flight found him, he was a shifting mass of flesh, barely even resembling a human being. Judd's teammate, Sasquatch, used the Master's equipment to mold Judd's DNA back into its previous form, which also turned Puck back into a dwarf. Puck's tissues were condensed in this process of genetic manipulation, which caused his body to become denser. His body, now similar in strength and density to compressed rubber, allowed him to gain a boost in power, and he rejoined Alpha Flight.During a brief period when the team was disbanded, Puck continued as a solo adventurer, once teaming up with an old friend, Wolverine. Alpha Flight was reorganized under a new Department H, and Puck and others were recruited rather forcibly by armored agents called Epsilons. After fighting a new Zodiac organization, Puck agreed to remain a member, despite his misgivings about the Department’s questionable tactics, in part so that he could investigate what was going on, and perhaps also in part because Heather remained as well, and she and her husband had separated  recently. Puck eventually managed to reveal his feelings to Heather when there seemed no chance that she might reconcile with her husband, and she agreed to go out with him. Unfortunately, the date ended in disaster. When the Guardian leading the team was eventually revealed to be a clone, the true Guardian formed his own version of Alpha Flight to confront Department H. The two versions of Alpha Flight soon reconciled and joined together as one, and Puck remained a member despite Heather’s subsequent reunion with her husband.Puck was with Alpha Flight when they were captured by the alien Plodex and rescued by an all-new, all-different Alpha Flight, the latter of which included a new Puck, his reputed daughter. The Plodex complex was seeded with eggs that were using the genetic templates of the original Alphans for gestation, and Puck and the original Alpha Flight chose to accompany the eggs on the trip back to its home planet, leaving Earth, and his recently-discovered daughter, behind.", 
    "durability": 3, 
    "education": "Military training", 
    "energy": 3, 
    "eyes": "Brown\n", 
    "fighting": 2, 
    "firstappearance": "Alpha Flight #1 (1983)\n", 
    "groupaffiliation": [
        "Alpha Flight", 
        "formerly Beta Flight", 
        "the Outcasts", 
        "the Remnant Men"
    ], 
    "hair": "Bald\n", 
    "height": 0, 
    "id": "Puck_(Eugene_Judd)", 
    "identity": "Publicly known", 
    "intelligence": 2, 
    "knownrelatives": "Zuzha Yu (Puck, daughter)", 
    "occupation": [
        "Adventurer", 
        "former mercenary", 
        "soldier-of-fortune"
    ], 
    "powers": "Eugene Judd originally possessed no superhuman powers, except perhaps for his magically-induced diminutive height. Later, after having his body condensed from his original size, by scientific experiments from the Master, Puck possessed some degree of superhuman strength, speed, and resistance to injury.", 
    "realname": "Eugene Milton Judd", 
    "significantissues": "deceased (New Avengers #16, 2006)", 
    "speed": 4, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 225
}