{
    "aliases": [
        "Vendetta", 
        "the female Punisher"
    ], 
    "citizenship": "Unrevealed", 
    "content": "Seeking to revenge herself on Alchemax and the men who abused her, she studied the city of New York and the new incarnation of the Punisher.  She felt that his work was important, but that he wasn’t efficient enough, and she decided to replace him as the new Punisher.  So, gearing herself up in a similar outfit, and carrying even more brutal weapons, she started her war on New York’s crime.One of her first attacks was on a man named Langen Russel, who marketed an anti-depressant for women called “Femsmile,” which unfortunately had severe side effects, mentally crippling hundreds of women.  After a shoot out with the police, in which she killed a pair of Public Eye officers, she fired rounds filled with plastic shards into Russel, killing him slowly.Her next step was to break in to a “New U” clinic, which was uploading the minds of old, rich patrons, into the young bodies of Decreds.  There she ran into Jake Gallows, the other Punisher, and she helped him catch a dying man who had tricked Jake and had run away in a Decred body.  Next, they came after the head of the clinic, Sidwell Wilson, who used to own Polly.  But when she shot him with incendigel to make him suffer, the other Punisher killed him quickly with a bullet, out of mercy.This put them at odds, and they fought it out, even though Jake Gallows was reluctant at first to physically attack a woman.  The police shortly interrupted their fight by shoot Vendetta in the arm.  The Punisher rescued her and took her back to his headquarters.  When she awoke she declared that she was going to take over the Punisher’s work, but after he showed her the prison in his basement and his Molecular Disintegrator, she realized that it was too much for her, and she left to continue her own mission.Vendetta left earth shortly afterwards and traveled to an asteroid mine which was set up to steal eggs from Fear Bugs.  There she led a group of fellow gene dolls she removed the inhibitors from in a revolt against their abusers.", 
    "durability": 1, 
    "education": "None", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Punisher (2099) #19\n", 
    "groupaffiliation": "None", 
    "hair": "Red\n", 
    "id": "Punisher_2099_(Vendetta)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": "Former gene doll", 
    "origin": "Punisher (2099) #19", 
    "placeofbirth": "Created in an Alchemax lab", 
    "powers": "None", 
    "realname": "Polly", 
    "significantissues": "Punisher (2099) #19 (orign/intro), Punisher (2099) #34 (teams up with Punisher).", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}