{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "While the four were distracted, Masters used a puppet of the personal trustee of the warden of the state prison to break out the prison’s inmates and have them riot. But when his back was turned, the Invisible Girl tried to sneak out of his apartment but was tripped when he manipulated a puppet of her. She was able to fire her flare gun out of the window before being recaptured, however. The rest of the Fantastic Four soon appeared and Masters sent a massive, robot puppet after them, which the Thing quickly destroyed. He then tried to escape on a robotic, flying horse, along with the Invisible Girl in tow. But Mister Fantastic grabbed her at the last minute, and Masters escaped too fast for the Human Torch to follow.The Fantastic Four later stopped the riot and Alicia was left alone in their apartment, fearing that her stepfather would return to force her to help him with his evil plans. Masters did return, and revealed to Alicia a puppet of himself with a king’s crown and robe, then announced that he would control the leaders of the world to take over the planet and even bend the Fantastic Four into servitude. But Alicia fought him, and in the struggle she was knocked to the ground but managed to knock over his puppet, causing him to fall out of the window seemingly to his death. The Fantastic Four arrived shortly afterwards; baffled as to why he had fallen, but thankfully that he was out of the picture.But the Puppet Master was not dead, and continued to plot against the Fantastic Four and the rest of the world for years after. He later took control of Prince Namor, and tried to use his love for the Invisible Girl to destroy the Fantastic Four, but was beaten again. He frequently teamed up with the Mad Thinker, and on their first grouping he tried to use a puppet of Professor X to force the X-Men to beat the Fantastic Four, but the Beast eventually resisted control. He was also one of the villains that Doctor Doom used to attack Reed and Sue's wedding, but after trying to poison the Thing with a controlled guest, Nick Fury's men used a brain wave scanner to foil his plans. When his stepdaughter was captured by Skrulls year later, and returned, Masters even tried to use his powers to reunite Alicia with her one-time boyfriend, the Thing, but to no avail.", 
    "durability": 3, 
    "education": "Unrevealed", 
    "energy": 4, 
    "eyes": "Brown\n", 
    "fighting": 4, 
    "firstappearance": "Fantastic Four #8 (1962)\n", 
    "groupaffiliation": "Former partner of Egghead and the Mad Thinker", 
    "hair": "Bald\n", 
    "height": 0, 
    "id": "Puppet_Master", 
    "identity": "Publicly Known", 
    "intelligence": 5, 
    "knownrelatives": "Alicia Masters (stepdaughter)", 
    "occupation": [
        "Craftsman", 
        "puppeteer", 
        "professional criminal", 
        "formerly biologist"
    ], 
    "origin": "Marvel Team-Up #6 (1973)", 
    "placeofbirth": [
        "Dragorin", 
        "Transia"
    ], 
    "powers": "None", 
    "realname": "Phillip Masters", 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 150
}