{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "United States of America of Earth-712", 
            "content": "After their defeat, the Institute members were all behavior modified to be well-behaved citizens and follow the commands of all Squadron members and all of the Institute members were inducted into the Squadron Supreme. Quagmire helped with the construction of Squadron City and became a valuable asset to the team including going on a mission to recover asteroid remains with Tom Thumb. On an assignment to upgrade the safety of a factory with Ape-X and the Blue Eagle Quagmire was reprimanded by the Eagle for flirting with one of the female factory workers. Eagle punched Quagmire telling him he wasn't making a good impression because of his appearance and his attitude and then the Eagle flew off. After the Eagle left there was an accident at the factory and highly concentrated tranquilizer gas leaked out in lethal doses. Quagmire pulled thirty factory workers out of the facility by himself before falling into a coma due to his exposure to the gas. His comatose body was placed on life support under the care of Doctor Decibel at a hospital in Squadron City, and he was watched over by a guilt-ridden Blue Eagle. Eventually his comatose mind began subconsciously creating apertures into the Darkforce Dimension causing the hospital to fill with Darkforce material and drowning Doctor Decibel. Eventually the Squadron came to stop the flooding and Hyperion was forced to pull the plug connecting Quagmire's body to the machine's that were supposedly keeping him alive. The Darkforce material immediately disappeared as did Quagmire's body and he was believed to be dead.On Earth-616 Quasar was alerted to a disturbance at the Nexus of Realities and went to investigate. Quasar discovered Jennifer Kale and an apparently pregnant Man-Thing who were surrounded by a \"mud-storm\". What appeared to be pregnancy was in fact a dimensional aperture that had been absorbed into the belly of the Man-Thing and was beginning to open. Quasar used his Quantum Bands to cut open the Man-Thing and Quasar and Jennifer removed the body of Quagmire from the Man-Thing's open \"womb.\" Quagmire immediately awoke and acted in a manner consistent with the attitude he exhibited prior to his behavior modification, his coma and subsequent trans-dimensional journey apparently having reversed the process. Quagmire attacked Quasar and accosted Jennifer Kale when Quasar re-engaged him in battle and managed to knock Quagmire unconscious. The \"mud-storm\" (which was really just free floating Darkforce material that had been summoned by Quagmire) stopped instantaneously, and Quasar transported Quagmire to the Vault.Later, the Chief Examiner contacted Quagmire at the Vault and helped him escape. Quagmire then approached Kayla Ballantine and forced her through the Chief Examiner's black teleportal. Quagmire then battled a tiny antibody (one of the many that belonged to Antibody), which had snuck into the 616 reality from the New Universe. The tiny antibody then secretly sought refuge in Quagmire's body.", 
            "durability": 7, 
            "education": "Middle school", 
            "energy": 7, 
            "eyes": "Blue\n", 
            "fighting": 7, 
            "firstappearance": "Squadron Supreme #5\n", 
            "groupaffiliation": [
                "None (Formerly) Squadron Supreme", 
                "Institute of Evil", 
                "also was once a thrall of the Darkling"
            ], 
            "hair": "Blonde\n", 
            "height": 72, 
            "id": "Quagmire", 
            "identity": "Publicly known to the people of Earth-712", 
            "intelligence": 7, 
            "knownrelatives": "None", 
            "occupation": [
                "criminal", 
                "renegade (Formerly) government agent"
            ], 
            "origin": "Unrevealed", 
            "placeofbirth": [
                "Pittsville", 
                "Terranova", 
                "United States of America on Earth-712"
            ], 
            "powers": "Quagmire has the ability to tap into and manipulate the extra-dimensional Darkforce in the form of a thick, viscous, tar-like substance. Opening a dimensional interface with his mind, Quagmire seemingly projects the Darkforce from his fingertips but he can open the interface anywhere within thirty feet of himself. He can control the flow of Darkforce from a thin spray of globules for a thick torrent of oozing slime. His darkforce manifestations are extremely adhesive: a sufficient quantity can immobilize beings of up to Class 100 strength. He can also apply small quantities of it to his fingertips and toes in order to scale walls and ceilings. He can shape the Darkforce into animated tendrils or whip them about his person in a psychokinetic tornado. The Darkforce generally behaves like quasi-solid liquid. Since the dimensional Darkforce is virtually limitless, there is theoretically no limit to the amount which Quagmire can draw to this dimension. Presumably mental fatigue will eventually affect how long he can hold the Darkforce interface open, eventually impairing his performance. When he is rendered unconscious the portal to the Darkforce dimension snaps shut and the Darkforce substance he has drawn from it quickly vanishes to its place of origin.", 
            "realname": "Jerome Myers", 
            "speed": 7, 
            "strength": 7, 
            "universe": [
                "(Currently) Marvel Universe", 
                "(Originally) Earth-712"
            ], 
            "weight": 185
        }
    }
}