{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "None", 
            "content": "After the Thinker rebuilt the original, android Human Torch, he programmed Quasimodo to initiate its destruction if it ever failed him. Then, when Lockjaw transported the Fantastic Four, Wyatt Wingfoot, and the android Torch back to the Thinker’s lab, the Torch turned on the Mad Thinker, refusing to be a party to murder. The Thinker ordered Quasimodo to destroy him, and he did, shutting off the protective layer that kept the Torch’s flame in check. But afterwards, the Mad Thinker escaped and left Quasimodo alone, crying out for his master to free him.The Silver Surfer soon found him, sensing his torment while he flew around the world to learn about humanity. Even though he knew that he shouldn’t interfere, the Surfer felt compelled to help, and he gave Quasimodo human form as he asked. But Quasimodo was not grateful, and after finding himself hideously ugly when he looked in the mirror, he used his Destruct Eye to attack the Silver Surfer. Quasimodo rampaged out of the lab, attacking buildings and anything he could get his hands on, finding satisfaction only in chaos and destruction. The Surfer followed soon after, intending to rectify his mistake. Quasimodo then fought with the Surfer and threatened to kill him in front of the gathering masses. Because the Surfer was handsome, and Quasimodo was ugly, he hated the Surfer and intended to throw him to the ground; but the Surfer teleported out of Quasimodo’s hands, leaving only a pulsing field of cosmic power in his place. The field of power slowly traveled up Quasimodo’s arm, threatening to engulf his body, while Quasimodo fought it, desperately clinging to his newfound life. But he could not outrun the power and it soon completely overcame him, freezing him above a giant clock. The Surfer felt it was appropriate, as a body without a soul only deserved to be a statue.When Quasimodo recovered, he encountered Spider-Man and Hawkeye in trying to gain control of major computer systems. He then learned of Xandar, whose planet-wide computer system was too tempting a target. Unfortunately, he was defeated by the Fantastic Four and the Sphinx and ended up a disembodied intelligence in in a computer in Russia.", 
            "durability": 1, 
            "education": "Programming", 
            "energy": 1, 
            "eyes": "White\n", 
            "fighting": 1, 
            "firstappearance": "Fantastic Four Annual #4 (1966)\n", 
            "groupaffiliation": "Computer servant of the Mad Thinker", 
            "hair": "Brown\n", 
            "id": "Quasimodo", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Mad Thinker (creator)", 
            "occupation": "Computer", 
            "placeofbirth": "Unrevealed", 
            "powers": "Quasimodo's robot body is cosmically-powered and semi-organic, which gives him superhuman strength and protection from most forms of attack. His left eye can also fire a deadly force blast.", 
            "realname": "Quasi-Motivational Destruct Organism", 
            "significantissues": "Fantastic Four Annual #4 (intro), Fantastic Four Annual #5 (given human form, frozen)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}