{
    "aliases": "Chanté Giovanni Brown", 
    "citizenship": [
        "U.S.A.", 
        "Wakanda (Jabari)"
    ], 
    "content": "Nevertheless, the extremists murdered Damola and his wife while their daughter was still an infant. When the Black Panther learned of this, he realized his fault in the crime and the potential for civil war over the issue of the infant queen. The Panther thus surrounded the girl with highly-trained Wakanda security forces in the form a kindly grandmother, friends, and associates. The girl grew up as Chanté Giovanni Brown, giving herself the nickname Queen Divine Justice, unaware of her true origin.Years later, the Panther believed his enemy Malice might target Queen for murder. Malice was formerly one of the order of the Dora Milaje, a harem of \"wives-in-training\" from various Wakanda tribes dedicated to the king and promoting harmony among Wakanda's many rival tribal factions. Believing the security around Queen may prove insufficient, he ordered that Queen be recruited into the Dora Milaje herself. This would also have the added benefit of helping to stabilize the political situation surrounding the Jabari tribe. A representative of Wakanda took Queen Divine Justice to New York City to meet with the Black Panther. Along the way, she crossed paths with the monstrous Hulk as he raged through the city. Queen managed to talk him down, avoiding great potential destruction, and the Panther helped thwart the Hulk's rampage.During her time with the Panther and his entourage, Queen continued to learn more about her true origins, and despite her bravado, the weight of her responsibility seemed at times more than she could bear. She also met the Wakanda hero Vibraxas, and the two struck up a romantic friendship. She kept her status as a member of the order Dora Milaje a secret, as contact with such persons is strictly forbidden. Vibraxas might not only bring great shame on himself and his tribe, but a romantic affair with the Queen of the Jabari cult could de-stabilize the entire realm and plunge Wakanda into civil war. However, when the Panther's enemy Man-Ape, would-be priest of the White Gorilla cult, kidnapped Queen Divine Justice, the truth of her status as Dora Milaje was revealed, and Vibraxas was devastated, Nevertheless, he tried to help rescue Queen, but was captured by Man-Ape as well.Man-Ape kidnapped Queen Divine Justice in an attempt to reclaim her for her native, outlawed Jabari tribe. Man-Ape, too, believed Queen Divine Justice to be the hope of the Jabari and might help reclaim their lands, their religion, and their identity as a people. Seeing his point of view, Queen's loyalty to the Panther grew severely tested. Eventually, the Black Panther battled the Man-Ape in the frozen tundra of the Jabari's Crystal Forest. Queen, anxious to help the Panther and desperate for answers, urged Vibraxas to use his power to defeat Man-Ape and stop the battle. When Vibraxas activated his power, however, he was not wearing the control bands that helped regulate his power, and the energies released grew wildly out of control. The Crystal Palace was destroyed and a duplicate Black Panther, later referred to as the Happy Pants Panther, was uncovered. Man-Ape was imprisoned and the youths left the forest with the Panthers.", 
    "durability": 1, 
    "education": "High school student", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Black Panther #13 (1999)\n", 
    "groupaffiliation": "(formerly) Dora Milaje", 
    "hair": "Black\n", 
    "id": "Queen_Divine_Justice", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Damola (father, deceased), mother (unnamed, deceased), T'Challa (Black Panther, former betrothed)", 
    "occupation": "Queen of the Jabari tribe", 
    "placeofbirth": "Chicago", 
    "powers": "None", 
    "realname": "Ce'Athauna Asira Davin", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}