{
    "add": {
        "doc": {
            "aliases": [
                "Pietro Frank", 
                "Gypsy Davey", 
                "Mateo Maximoff"
            ], 
            "citizenship": [
                "Former citizen of Transia", 
                "naturalized citizen of the United States of America"
            ], 
            "content": "Eventually, Wanda began to become romantically involved with the Vision, and Pietro condemned her relationship with a pseudo-human android, causing their first major rift. The rift was later mended, some time after Wanda married the Vision, when the telepath Moondragon permanently altered Pietro's prejudice toward the Vision in a self-righteous employment of her powers.Pietro left the Avenges while the group was engaged in battle with the mutant-hunting Sentinel robots. Sustaining injuries in battle, Pietro was taken to medical care by Crystal, member of the Inhumans and whose dimension-spanning companion Lockjaw happened upon the scene of the battle. Months passed before Pietro was well enough to contact his companions to tell them of his circumstances. In the meantime, Pietro became romantically involved with his rescuer, and he and Crystal were married after a brief courtship. The wedding, held in the Inhuman city of Attilan, was attended by the Inhumans, the Avengers, and the Fantastic Four.The Golden Age hero Whizzer knew of the exploits of Quicksilver and the Scarlet Witch, believing them to be his children whom he abandoned when his wife, Miss America, died in childbirth on Wundagore Mountain. Feeling guilty, however, he made no effort to contact them, until the day he sought the Avengers help in saving his other son, Nuklo. Wanda had come to believe the Whizzer was her father, but Pietro remained dubious.Months later, however, after being mystically abducted by Django Maximoff and freed by Avengers, Wanda and Pietro took a leave of absence from the team to investigate the secrets regarding their childhood origins. Returning to Wundagore Mountain, they met Bova and learned the truth of their parentage-- they were, in fact, the children of Magneto. His wife, the gypsy Magda, had fled from Magneto, terrified of the sudden manifestation of his power and intentions of world domination. Magda found her way to the tiny nation of Transia, finding refuge with Bova, a woman evolved from a cow by Wundagore’s High Evolutionary. Magda gave birth to twins, a boy and a girl, with Bova as her midwife, but was still afraid of her husband, and left Bova her children. Several nights later, a vacationing couple (the Whizzer and Miss America in their civilian identities) also needed refuge as the wife midwife assistance. Unfortunately, the couple's child was stillborn, and Miss America died in childbirth. Bova hoped to award Magda’s children to him instead, but the Whizzer fled from Wundagore upon hearing of his wife's death, nearly insane with grief. Bova instead presented the twins to the High Evolutionary, who found Django and Marya Maximoff, a gypsy couple camped nearby who had lost their own twin children, Ana and Mateo, during World War II. They cared for the children as their own.Their abduction by Django also led to the revelation that Wanda held a connection to the demon Chthon, who was trapped within Wundagore Mountain and hoped to escape using Wanda as a host body someday. The return to the mountain allowed Chthon to possess Wanda, but she was soon freed by her brother, the Avengers, and Django Maximoff, who sealed Chthon inside Wundagore before dying.Pietro and Crystal soon had their own child, a daughter, Luna. Not long after, Pietro was confronted by Magneto who wanted to investigate his grandchild's birth. Pietro denounced Magneto for his callous treatment of them when they were members of this Brotherhood and refused to believe he and amended his megalomaniacal ways. Eventually, however, when Magneto appeared to be reforming, Pietro relented in his resentment for his natural father.Pietro had also volunteered his services to the head of the Inhumans’ small militia and became an officer. During his period of service, however, the Inhuman had no call for military activity. His neglect of his wife led her to become involved with another man. Learning of her infidelity, Pietro refused to forgive her and fled Attilan, vowing vengeance. He later tried unsuccessfully to frame the Avengers for treason, using the opportunity to attack the Avengers alongside the android Zodiac Cartel. He relented only after the Vision asked him if he was willing to orphan his and Wanda's infant children. Pietro later allied with the Hungarian government and assisted them in the development of techniques to create super-powered individuals. He proclaimed to believe fully in mutant supremacy and intended to rule the world as its self-proclaimed King of Mutants. He again tried to capture his Avengers teammates, but they escaped.Distraught and addled, Pietro was accosted by the original X-Factor team, who were posing as mutant-hunters at the time. X-Factor helped restore Pietro to the Inhumans, whereupon it was discovered that his criminal insanity had been artificially inflicted by Maximus the Mad, who had been influencing Pietro's actions since he split with Crystal. Maximus was defeated and Pietro remained with the Inhumans. He secretly renewed alliance with Avengers, however, and publicly pretended to rejoin Magneto in order to watch over and influence his sister, Wanda, who had at the time gone mad and rejoined Magneto's service. With Avengers, he helped free Wanda from exploitation by Magneto and Immortus, restoring her to sanity. Pietro then remained alongside the Avengers for another long tenure, remaining estranged from Crystal and the Inhumans.Pietro later joined the U.S. government-sponsored X-Factor team, serving with the team throughout its public existence. At one point, during psychotherapy with Doc Samson, Pietro explained how his prickly personality stems largely from his frustration at dealing with a world where almost everyone and everything seems slow or stupid or both. When X-Factor was dropped from government sponsorship and forced to operate underground, Pietro left.When the Avengers were attacked by the alien Brethren, Pietro returned to aid the Avengers and found Crystal had also joined the team at the same time. Pietro refused to join the team since Crystal remained with them, although he later rejoined while participating in the rescue of his daughter Luna from Magneto's former Acolyte, Fabian Cortez, and his rival, Exodus. Pietro was gravely injured by Exodus and saved by the Avenger Black Knight, who by then was entertaining romantic intentions with Crystal. Recovering from his injuries at the Avengers Mansion, Pietro tried to win back Crystal. Ultimately, however, he began to repair his relationship with Crystal only after the Black Knight left Avengers.Soon afterward, Crystal and the other Avengers seemingly sacrificed themselves to stop the psychic menace of Onslaught. Pietro remained alongside the X-Men for a while before professing to wanting to track down other former Avengers. Instead, however, Pietro refused to join or to continue any form of the Avengers in retaliation from the government's anti-mutant legislation introduced in the wake of Onslaught.Again confronting Exodus and Magneto's Acolytes, Pietro joined the High Evolutionary in repelling their attack on Wundagore. Pietro was asked to become the leader of a small band of the Evolutionary's Knights of Wundagore, animals that the geneticist had endowed with human intelligence and humanoid-like forms. Pietro accepted and exhibited an adeptness at leading the Knights in battles against injustice, although he soon left in order to find his true self.When the heroes who were believed dead returned to Earth, Pietro and Crystal were reunited. Both helped the Avenges reassemble and accepted the status of reserve members. Pietro would return to assist the Avengers on occasional missions.Not long afterward, Magneto was given control of the island nation of Genosha. Investigating his father's activities, Pietro was captured by resistance forces and would have been killed if not for the intervention of the X-Men Rogue and the former Acolyte Amelia Voght. After Magneto crushed the resistance, Pietro was ready to storm off when Voght teleported him to a Genoshan camp for those mutants infected with the Legacy Virus. Horrified, Pietro chose to stay in Genosha and act as his father's conscience, to remind him that both mutants and humans have to right not to be persecuted. He accepted a cabinet-level position in Magneto's new regime. This was all according to Magneto's plan, as he hoped to make Pietro into a loyal and subservient son. During his time with Magneto, Pietro was exposed to the mutagenic Isotope E, which boosted his powers to unforeseen levels. However, Pietro could no longer stomach his father's ruthless methods after witnessing him in battle against a Genoshan Resistance. He briefly warned the X-Men about Magneto and rejoined the Avengers.Recently, Wanda went mad, causing the deaths of Ant-Man, the Vision and Hawkeye, and though subdued, she remained a serious threat to the world. Quicksilver was shocked to find out that the Avengers and X-Men were deliberating over whether to kill his sister.Enraged, Quicksilver went to Genosha to find his sister, who had been taken into their father's care, and trying to make everything right, he convinced his sister to use her reality warping powers to make the \"House of M\", an alternate reality where mutants ruled. Magneto and his family were the rulers of this new world, and everything seemed to be going well until some renegade heroes informed the royal family of how the world had been before.  Magneto's anger caused him to slay Quicksilver who was brought back to life quickly by a distraught Scarlet Witch. Magneto seemed to have calmed her down when Quicksilver's sister changed reality back to its previous state. However this time, blaming all her heartache on the powers she and her family possessed, the phrase she uttered to bring back reality removed millions of mutants' powers, Quicksilver included.", 
            "durability": 2, 
            "education": "Unrevealed", 
            "energy": 2, 
            "eyes": "Blue\n", 
            "fighting": 4, 
            "firstappearance": "X-Men #4\n", 
            "groupaffiliation": [
                "Avengers", 
                "formerly X-Factor", 
                "Inhumans militia", 
                "Queen's Vengeance", 
                "Brotherhood of Evil Mutants", 
                "Knights of Wundagore (leader)", 
                "Acolytes", 
                "Zodiac"
            ], 
            "hair": "Silver\n", 
            "height": 72, 
            "id": "Quicksilver", 
            "intelligence": 3, 
            "knownrelatives": "Wanda Maximoff (Scarlet Witch, sister), Lorna Dane (Polaris, half sister), Magnus (Magneto, father), Magda (mother, deceased), Django Maximoff (adoptive father), Marya Maximoff (adoptive mother, deceased), Crystal (wife), Maximoff, Luna (daughter), Medusa (sister-in-law), Black Bolt, Gorgon, Karnak, Triton, Maximus (cousins by marriage), Vision (ex-brother-in-law)", 
            "occupation": [
                "Adventurer", 
                "former Genoshan cabinet minister", 
                "terrorist"
            ], 
            "placeofbirth": [
                "Wundagore Mountain", 
                "Transia", 
                "Europe"
            ], 
            "powers": "Quicksilver possessed superhuman speed, and could travel on foot at speeds exceeding the speed of sound for hundreds of miles before tiring; he could \"fly\" for short distances by flapping his arms or \"vibrating\" his legs; he could also use his speed to create cyclones, dodge machine gun and laser fire, and run up walls and across water. When the High Evolutionary's Isotope E upgraded his powers, he did not know the true limits of his speed.\nFollowing the loss of his mutant nature, Quicksilver exposed himself to the Terrigen Mists, resulting in him now possessing the power to vibrate his atoms so quickly he travels forward in time. His molecular speed that he generates displaces him out of the mainstream time/space so that he is able to propel himself into the future. He can leap from thirty seconds to up to twelve days, and remain for several minutes to several hours before being recalled to his present time once his body tires, or he can return at will before his time is up. As he returns from his trip, he returns the exact moment he left so as to appear that he has been gone for half a nano-second. He is able to bring inorganic objects from the future back to his correct time, although it has yet been shown what would happen if he attempted to bring organic objects with him. These new powers are having an affect on his physical health. Each time he meets up with his future self (if indeed the person he meets is his future self), the future self looks more and more haggard. \n\nAfter the incident on Genosha, Pietro continued to inhale the Mists of Terrigen and has apparently obtained the power, with the shards of the Mists in his hands, to restore other mutants’ powers.", 
            "realname": "Pietro Django Maximoff", 
            "speed": 7, 
            "strength": 2, 
            "universe": "Marvel Universe", 
            "weight": 175
        }
    }
}