{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Unrevealed", 
            "content": "While his father prepared to burn a boy born with angel wings, Petros sped to the court of King James to encourage him to side with Enrique once he came to power. James agreed, and Petros promised him that Enrique would turn all of England against the witchbreed, but that the students of Carlos Javier must be brought to Enrique for punishment. Javier was a fellow witchbreed, and an ex-friend of Enrique’s, who built a school to house the less physically appealing witchbreed, and so was set against Enrique. Petros also implied that Enrique could speed up Elizabeth’s inevitable death, for which James was agreeable. Petros allayed James’ questions about Petros’ efficiency as a messenger, by ironically joking about running fast. But run fast he did, and he kept up the correspondence with James. When Count Otto von Doom killed Queen Elizabeth, James assumed Enrique had, and told Petros as much, though Petros declined to contradict him. James then agreed to turn over any witchbreed to Enrique. But once James had taken control of the English Crown and captured Javier’s students, he baulked at Petros’ suggestion that he owed them to Enrique, and Petros left before James could force Petros to work for him, instead. Petros next ran to Toad, Enrique’s man in the Vatican, who told him that the Pope was less concerned about the Inquisition, and more concerned about Doom’s rise in power.But Petros set to the roads again, and traveled to warn Doom of the approach of Javier's students, though Doom found out moments later. He then watched as Javier’s students and Nicholas Fury, the Queen’s spymaster, besieged Doom’s Castle. He hurried back to report to his father that Doom’s Castle had fallen and that James had arrived in England and begun to imprison Fury’s cohorts, including the court’s previous physician, Doctor Strange. Though Petros was actually reporting to one of the King’s men, who had found out after threatening Toad of Enrique’s true plans. The man captured Petros, along with his sister and father, and readied them to be burnt at the stake. But before they could be, Enrique had the man bring him a special helmet made for him by Javier, and used his own powers to pull off his own chains, along with his children’s, and together they subdued the guards; then escaped England altogether.They set sail to rendezvous with the rest of Enrique’s Brotherhood, as he began to call them, but the winds took them in a different direction, and Enrique decreed that they would go with them. The boat eventually took them to the New World, where Javier’s men attacked them, freezing the boat and imprisoning Petros and his family within. Javier soon boarded the boat, himself, offering Petros’ father freedom in exchange for help to heal their world that was slowly tearing itself apart after a stranger from a future time landed in the Roanoke Colony of America. His father agreed, and he joined the group of heroes who succeeded in repairing the rift and saving their universe.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Marvel 1602 #1\n", 
            "groupaffiliation": "Formerly of the Inquisition", 
            "hair": "White\n", 
            "id": "Quicksilver_(1602)", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Enrico (father), Sister Wanda (sister)", 
            "occupation": "Former member of the Inquisition", 
            "placeofbirth": "Unrevealed", 
            "powers": "Petros has the superhuman ability to run at subsonic speeds.", 
            "realname": "Petros", 
            "significantissues": "Marvel 1602 #1 (intro)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel 1602 (Earth-311)"
        }
    }
}