{
    "add": {
        "doc": {
            "aliases": "02STK-72206", 
            "citizenship": [
                "Citizen of Tarnax IV (now destroyed)", 
                "Skrull empire"
            ], 
            "content": "R’kin’s time to prove himself as a warrior came when he rescued his idol, Kl’rt the Super Skrull, during a firefight with Baroness S’bak’s forces. The Super Skrull was outnumbered by Skrull warbirds, but was still putting up a fight. R’Kin, piloting one of the ships, swooped in and plucked the Super Skrull from the field of battle and became a fugitive as well. He explained to his idol that his father, General N’ala, served and died under his command. R’kin accompanied his new leader to the home of his most hated enemies, the Fantastic Four, and took a trip to the Negative Zone with the help of Mister Fantastic in hopes to find some way to destroy the forces of Annihilus. Soon, R’kin’s idolization of Super Skrull came to an end during a mission to \"interrogate\" some of Annihulus’ troops. R’kin was supposed to guard the room Super Skrull was questioning the prisoners in, but R’kin wanted to help. He disobeyed orders and entered without permission. Inside, he watched as the Super Skrull ruthlessly tortured and killed his enemies. Super Skrull said it was a necessity, but R’kin regarded it, and him, as evil.In the Negative Zone, Super Skrull squeezed a name from one of the Annihilation Wave troops of the individual responsible for creating their ultimate weapon called the Harvester of Sorrows. Hawal was the scientific genius that would soon be responsible for destroying the Skrull world of Zaragz’na and take the life of the Kl’rt’s son. In his pursuit of Hawal, Super Skrull managed to raise an army comprised of other prisoners that Hawal tortured for his enjoyment. R’kin joined the ranks of that militia with others like Praxagora and Preak. Hawal, with some extreme convincing, created a way to defeat the Harvester of Sorrows just as R’kin was building a dimensional portal to liberate the Super Skrull’s army from the Negative Zone. Once the portal was completed and Kl’rt’s forces were ready to strike, R’kin convinced Super Skrull to allow the lowly mechanic to prove himself worthy of the Skrull name and deliver the killing blow to Annihilus’ ultimate weapon of destruction. However, R’kin only proved how treacherous the Skrull race can be when he betrayed the Super Skrull and did not show up to save Zaragz’na from being obliterated.", 
            "durability": 1, 
            "education": "R’kin had an extraordinary intellect but it is unrevealed whether he was born with it or received special schooling", 
            "energy": 1, 
            "eyes": "Green (Variable)\n", 
            "fighting": 1, 
            "firstappearance": "Annihilation: Super Skrull #1 (2006)\n", 
            "groupaffiliation": "Formerly the Skrull Imperial Fleet", 
            "hair": "None (Variable)\n", 
            "height": 56, 
            "id": "R%27kin", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "N’ala (father, deceased), Five unidentified siblings", 
            "occupation": "Former Skrull fleet mechanic/laborer", 
            "origin": "Annihilation: Super Skrull #3 (2006)", 
            "placeofbirth": "Unrevealed", 
            "powers": "R’kin, as most Skrulls, possessed the power to shape shift. Unfortunately for R’kin, his small stature was a hindrance and only permitted him with substandard shape shifting abilities and inferior strength.", 
            "realname": "R’kin", 
            "significantissues": "Helped Super Skrull escape Imperial Fleet, partnered with Super Skrull against the forces of Annihilus, betrayed Super Skrull and was ultimately killed in the last battle to destroy the Harvester of Sorrows (Annihilation: Super Skrull #1-4, 2006)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 78
        }
    }
}