{
    "aliases": "None", 
    "citizenship": "Unrevealed", 
    "content": "While arguing amongst themselves Raptra, Cap’n Reptyl, and Kid Syn  stumpled across an Avengers’ Quinjet, carrying an assemblage of Avengers in search of the Celestial Messiah Quoi. The Avengers easily defeat Reptra and the other cosmic pirates and their crews, causing them all to load into escape pods. Raptra’s ship was unshaved in the confrontation, and she disobeyed Cap’n Reptyl who commanded her to leave Kid Syn behind. Outraged at her disobedience Reptyl scolds her, for failing to comply to his orders. She reminded the villainous saurian that she was not his lackey and there was no need for her to follow his orders. Almost instantly Sanctuary II appeared, piloted by its owner Thanos. The pirates were unmoved at the presence of Thanos and prepared to attack Thanos when he boarded their ship. With simply a wave of his hand Thanos kills every member of their crews. Raptra stood defiant and ready for battle, but Thanos decides to spare them if they are willing to be members of his new pantheon. Thanos goes on to explain that as member of his pantheon the would granted god like powers. Raptra and Kid Syn decline, knowing the true evil Thanos, but Cap'n Reptyl jumps at the chance to increase his power. Thanos kills Kid Syn by absorbing his energy and transferring it to Cap'n Reptyl. He offers the chance to Raptra once more, but again, Raptra refuses the offer. She is spared death, but only as the life source for the next member of his pantheon.Raptra finds Quoi and knocks him out, after taking him as a captive. Raptra manages to elude detection by the sentient Cotati using the cloak of invisibility, which she stole form Thanos. While fleeing into space Raptra contemplates the idea of trading Quoi to Thanos, if he would spare her life. Thanos refused her offer and sent Primo and Reptyl to capture both Quoi and Raptra. Quoi came to and she informs him that she had rescued from the treat of Thanos and it was Thanos that had knocked him unconscious. In an attempt to ditch her pursuers she navigated a course into a dark patch of space knowns as the Rot. Raptra was unaware that the Rot was an actual sentient being, birth by Thanos and Death.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Yellow\n", 
    "fighting": 1, 
    "firstappearance": "Avengers: Celestial Quest #2 (2002)\n", 
    "groupaffiliation": "Formerly allied with Cap'n Reptyl", 
    "hair": "None\n", 
    "id": "Raptra", 
    "identity": "Unknown to the general populace of Earth", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": [
        "Pirate", 
        "starship pilot"
    ], 
    "origin": "Unknown", 
    "placeofbirth": "Unrevealed", 
    "realname": "Unknown, possibly Raptra", 
    "significantissues": "Avengers: Celestial Quest #2-8 (2002)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}