{
    "aliases": "The Beast", 
    "citizenship": "Citizen of United States of America", 
    "content": "Ravage armed himself with junk from Alchemax’s scrap yards, as well as a bulletproof lining for his coat taken from an Alchemax lab.  He also came across an old, metal dump truck, and used that for an assault vehicle.  In response to Ravage’s attacks and inherent threat to Alchemax, the company kidnapped his former secretary Tiana, who initially warned him about the threat against him, and sent her to Hellrock, a polluted island with poisonous air where beings known as mutroids were created and reigned as the only inhabitants.  Alchemax’s security also shot Ravage’s friend Dack, putting him in a medi-cell.Ravage then traveled to Hellrock and faced the leader of the island, Dethstryke.  When the tyrant tore off Tiana’s protective suit, designed to keep the poisonous air out, Ravage put her in his instead and helped her escape the island.  Without protection, Ravage wandered the island, fighting off the mutroids and eventually gaining the ability, with the help of a genetic scientist named Ursell, to fire energy from his hands.  He finally came across a rebuilt Fantasticar from the 20th Century and used it to escape the island.On his way back to New York, Ravage found Tiana and Dack, who Tiana had helped escape from the medi-cell, fighting with Public Eye police officers.  In the ensuing fight the Private Eye captured Dack and creatures from New Atlantis abducted Tiana.  Ravage rescued Dack and submerged the Fantasticar to save Tiana from being dissected by the New Atlanteans and their leader, Dragonclaw, in order to for them to find a way to breath air like humans.  While escaping New Atlantis, Ravage found that he could turn his hand-energy inwards, rejuvenating himself.After escaping, Ravage happened upon Henton who captured him and intended to return him to Dethstryke, the Hellrock leader, who worked with Alchemax.  But when the two men fought, Henton decided not to give Ravage up, though Ravage broke free anyway and forced Henton to give up his “dirty disk,” on which he kept the documentation of his criminal acts.  Ravage then fled to the Decred Barrio, under the protection of Barrio Man, who taught him to be a hero according to the Codex Heroica.  Ravage learned from the stolen dirty disk that Eco Central, his former office, was just a PR front.  At the same time, the mutations in his hands turned inward, making Ravage into a man-beast with horns and claws.  He then dedicated himself to defending the Barrio, which was shortly afterwards attacked by his ex-comrade, and sister’s fiancée, Alec DuPledge, who he defeated and let escape.Ravage brought the disk to his brother, John Claude, but found that he had been killed by a microchip that projected images into the mind of its victims, creating actual damage out of illusion.  Ravage destroyed the chip, and after briefly being suspected for his brother’s death, reunited with his estranged family.  His father then made him head of Green Globe, though his sister, Miranda Ravage, continued to plot against him to take his place.  After another microchip attack, her fiancée, DuPledge, brought Ravage in for questioning, where they found the Fearmaster in Henton’s office, who had replaced him after Henton had been killed by his master, Avatarr.  Ravage then destroyed the Animek that Fearmaster turned on him, and the Fearmaster escaped.When Avatarr built his floating city, Valhalla, and created a series of nano-engineered super heroes, including Ravage’s friend Tiana as Hela, Ravage attempted to stop it.  After being voted down to pull funding out of the project through Green Globe, Ravage turned into the Beast and traveled to the city and tried to sabotage it.  There he ran into the Punisher, who interrupted him.  Instead of destroying it, Ravage stole blueprints for the city, and had them translated with the help of the 2099’s Doctor Doom.  He also met the next century’s X-Men, Meanstreak, Bloodhawk, and Krystalin, who came to him with questions about their friend, Jordan Boone, and together they attacked Valhalla.  Then eventually, as a part of a group consisting of 2099’s Spider-Man, Doom, and the Punisher, Ravage helped to destroy the city and save New York before it could crash down upon it.When a man named Dr. Rudolf Menkel turned himself into a similar beast-creature named Throwback, and began to attack people at random, thereby laying suspicion on Paul-Phillips, Ravage began a war upon the Synthia Food Corporation to delineate his actions from the Throwback.  Ravage killed a series of Synthia managers before being targeted by an experiment called X-11, an expert in necronics, the science of death.  Then, after a confrontation with Throwback, Paul-Phillip’s sister and her fiancée managed to get him committed on trumped up charges and placed into Dr. Menkel’s psychiatric clinic.  A patient at the clinic set Paul-Phillips free, who then transformed into the Beast and attacked Throwback in Menkel’s virtual reality program, where he fought a prehistoric battle between primitive tribes that represented the ancestry of each beast, and finally destroyed Throwback.  He was later attacked by X-11, and their battle brought them into a restaurant where Hela, as Tiana, was conducting a business lunch.  After an inconclusive fight with X-11, Tiana transformed into Hela and sucked the life out of the experiment, turning him into a normal man.Ravage then fought a brief battle against a man named Tessi who called himself the Hunter.  But after enlisting the aid of Tessi’s unwitting attack animal, Katt, Ravage managed to kill Tessi and shut down the thermal nuclear weapon he had set off as a failsafe.The confrontation with DuPledge later came to a head when DuPledge accused Paul-Phillip of being the Beast, forcing him to change and reveal himself in front of his family.  When they reacted with horror, Ravage decided to stay as the Beast, and escaped.  Then after killing the head of Synthia, Darrius Rush, Ravage was found by Barrio Man, who told him that the prophecy in the Codex Heroica said that Ravage would have to search for the Valley of the Beasts in order to find himself.  Before he could start searching, Ravage was contacted by a telekinetic laboratory experiment, which took the form of a giant bat, that he helped set free, despite Avatarr’s efforts to have it destroyed.While searching for the Valley, Ravage and the bat creature came across a series of adversaries.  First, was the tyrant Machine Head, who ruled a place called Techville and established his own laws.  A woman named Ferra, in order to defend her against Machine Head, hired Ravage, and he destroyed Machine Head according to the cyborg’s own laws.  The bat creature later named herself Ferra in honor of the woman's courage.  They even discovered a false Valley of the Beasts, ruled by a reality-altering creature called Atrin, who used to be human, which Ferra helped Ravage kill, freeing the primitive inhabitants of the fake Valley.  Ravage and Ferra also came across a group of people who treated an out of control farming truck as a destructive god and were lead by the Lord Flame Bearer, who Ravage destroyed and took over his station.  Then, after stopping the Megatruk, Ravage spent two weeks reeducating the people to be free and prosperous.After rebuilding the farming society, Ravage was suddenly attacked by Dethstryke, who had been sent there by his consultant, the Seeress, who had planned to overthrow Dethstryke by sending him against someone she felt had a chance to beat him.  Dethstryke seemingly killed Ferra, who was later healed by the villagers, and he threatened the peoople’s lives if Ravage didn’t come willingly away with him.  Back at Hellrock, Dethstryke left Ravage for dead after injecting him with even more poison, however it backfired and only mutated him further, causing him to become more savage and primitive.  The Seeress then used Ravage as a pawn to fight her war against Dethstryke and he led her troops against Dethstryke’s army, killing his champion, General Slaggfest, in the process.  The genetic scientist Ursell, who Ravage believed dead, traitored on the Seeress and transferred a small part of Ferra’s soul into Ravage, releasing him from the Seeress’ control and stopping his continuing mutation.  Ravage then attacked Dethstryke’s castle, finding Hela already there and in battle with the Seeress, but because Dethstryke had switched the machine underneath Hellrock, which kept the pollution attracted to it, into reverse, Ravage had to save the Seeress and force her to help him turn the machine back on.  Dethstryke returned, fighting with Ravage and the Seeress, but Ursell came and sacrificed himself and the Seeress in order to stop the machine.  Dethstryke then brought the cave crashing down in attempt to kill everyone, but both Ravage and Dethstryke survived to continue fighting.Above ground, Dethstryke and Ravage ran into Mr. Crisp, a soldier hired to stop the destruction of Hellrock.  With Ravage distracted, Dethstryke ran off, and Mr. Crisp was commanded by his superiors to give Ravage any help he wanted.  Returning to the castle, Ravage faced Dethstryke and an image of the Seeress appeared, explaining that Dethstryke’s power that had flowed through her before when she attacked Hela allowed her to initiated a Revenge Program, and she weakened Dethstryke enough for Ravage to kill him.  Then it was revealed that Dethstryke was actually Graeme Striker, the last democratically elected President of the United States and the Seeress was his first lady, Sophia.  The current President, Doom, appeared and declared that he was the new owner of Alchemax.  In the lull, Crisp and Hela used Dethstryke’s technology to de-mutate Ravage back to his Beast self.   But then, before Ravage and Tiana could mend their differences, a creature called Mindrot attacked, claiming, through telepathic communication with Ferra, to be an invulnerable, space-spawned being that would bury itself on planets until the inhabitants reached a certain intelligence level, as determined by pollution in the water, and it would come out to eat the minds of every last being.  Mindrot killed Ferra, Crisp, and nearly killed Ravage before it was destroyed by a microwave beam sent by Doom.", 
    "durability": 1, 
    "education": "Trained as Green Beret soldier", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "Ravage (2099) #1\n", 
    "groupaffiliation": "None", 
    "hair": "Red\n", 
    "id": "Ravage_(2099)", 
    "identity": "Public", 
    "intelligence": 1, 
    "knownrelatives": "Wes Ravage (father), Hyzell Ravage (mother), Gylla Ravage (step-mother), John Claude Ravage (brother, deceased), Miranda Ravage (sister)", 
    "occupation": [
        "Former Head of Eco Central", 
        "Former Head of Green Globe"
    ], 
    "origin": "Ravage (2099) #1", 
    "placeofbirth": "Unrevealed", 
    "powers": "Ravage was briefly able to fire powerful bolts of energy through his hands.  After his mutation turned inwards, he was gifted with increased strength, agility, toughened skin, and razor sharp teeth, claws, and horns.  When mutated further, these powers increased.", 
    "realname": "Paul-Phillip Ravage", 
    "significantissues": "Ravage (2099) #1 (intro/origin), Ravage (2099) #4-5 (birth of new powers), Ravage (2099) #33 (final issue, apparent death)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}