{
    "aliases": [
        "General Ross", 
        "\"Thunderbolt\" Ross", 
        "Red Hulk", 
        "Rulk", 
        "Red", 
        "Red man", 
        "Redeemer", 
        "Zzzax"
    ], 
    "citizenship": "U.S.A.", 
    "content": "When he came of age Ross enlisted in the military, graduating first in his class at West Point. He married Karen Lee, the daughter of his commanding officer at the time. Ross rapidly rose in rank to captain and then major while serving in his first war. Ross made a great reputation as a leader in combat, but after the war, he was stationed at the nuclear research facility at Los Alamos, New Mexico. There he met nuclear physicist Brian Banner, the father of Robert Bruce Banner.Ross had risen to the rank of colonel by the time he was sent to his next war, during which he became a general in the U.S. Air Force (Ross never rose beyond three-star general). As he gloried in combat, he was dissatisfied with the \"desk jobs\" he was given before and after the war.Ross's wife, Karen, bore him only one child, his daughter Betty. Karen died when Betty was in her early teens. General Ross came to command Desert Base, New Mexico - a missile base and nuclear research site. He resented the fact that Bruce Banner, a civilian, was appointed supervisor of the gamma bomb project. Moreover, the general had contempt for the scrawny, intellectual Banner for failing to live up to Ross's own vision of true manhood. Making matters worse was the growing attraction between Banner and Betty, whom Ross hoped would marry a military officer.Banner was transformed into the Hulk as a result of intense radiation exposure during the first test of the gamma bomb. The savage Hulk quickly became a menace, and Ross began his long career of hunting the Hulk. Banner's frequent, unexplained absences made Ross suspect Banner of treasonous activity and of a possible alliance with the Hulk himself. To prove his suspicions, Ross brought Major Glenn Talbot to Desert Base as the new security chief. The Pentagon designated Ross as head of Operation: Hulk.Even after Banner's dual identity became public knowledge, Ross continued his pursuit of the Hulk, causing Banner to become a fugitive. Ross incorrectly suspected that Banner controlled the Hulk and was thus a menace to national security. Over the years, Ross succeeded in capturing the Hulk or Banner, but the Hulk usually thwarted the general's attempts to permanently put him down. Embittered by these failures, Ross became obsessed with the Hulk.Ross frequently found himself in conflict with other superhuman foes too, most notably the Leader and the Abomination. Invariably these threats were defeated by Banner or the Hulk, forcing the general to regard the Hulk with a grudging respect. When Banner actually did gain control of the Hulk, Ross reluctantly approved of his marriage to Betty. However, the Leader sabotaged the process, transforming Banner back into the savage Hulk before they could be wed. Ross himself was injured in the ensuing conflict.The U.S. Government commissioned Operation: Greenskin, based out of Hulkbuster Base, a special site for operations to capture or kill the Hulk. Due to his experience, Ross was given command of the base and its troops, commonly referred to as the Hulkbusters. The primary directive of the Operation was to capture the Hulk and cure him, as well as study the effects of radiation on the human body to bring about major medical breakthroughs.Ross led a team of Hulkbusters to pursue the Hulk into the Arctic Circle where he was captured by the Gremlin, a Russian agent. Ross was freed by the combined efforts of Glenn Talbot and Air Force colonel Jack Armbruster. However, in the process, Talbot was captured in his place and presumed by the others to be dead. As a result of his capture, Ross was relieved of command of Operation: Greenskin and replaced by Armbruster. Though officially on leave, Ross often accompanied Armbruster on Hulkbusters missions. After Armbruster was killed, Ross and S.H.I.E.L.D. agent Clay Quartermain led a team to rescue Talbot.Ross rededicated his command post as Gamma Base, focusing even more on gamma research. However, injured when the Leader took over Gamma Base, Ross was pushed into a nervous breakdown by Moonstone, who used her psychiatric skills to crumble his psyche. Ross spent a length of time under the care of Doc Samson. During this time Betty and Glenn Talbot had gotten married and divorced, the funding for Gamma Base was cancelled, and Talbot died while trying to kill the Hulk.Ross eventually recovered and returned to active duty, hell-bent on avenging Talbot's death. He also blamed the Hulk for his nervous breakdown. Ross was unable to regain funding for hunting the Hulk, but the President made him a special advisor at the Pentagon on matters relating to the dangers posed by the Hulk. However, soon after, Banner regained control of his alter-ego, and the President pardoned him for all of his past offenses.Ross made an alliance with both the Abomination and MODOK to eliminate his archenemy. This effort, too, failed; when Betty Ross learned of these events, she was appalled, accusing her father of treason. Overwhelmed by shame, Ross nearly committed suicide in his office in the Pentagon. However, he instead dropped out of sight, during which time he was dishonorably discharged. Ross became a drifter, sinking increasingly further into insanity.Upon learning that Betty and the seemingly cured Bruce planned to marry, Ross attempted to stop the wedding at gunpoint. Ross shot Rick Jones when he tried to stop him, but Betty confronted her father and persuaded him to let the wedding proceed. Ross was hospitalized and placed under psychiatric care.Ross's old ally Clay Quartermain enabled Ross to participate in an experiment that would give him the powers of Zzzax. However, the experiment went awry and Zzzax absorbed Ross's consciousness, after which the Ross-controlled creature attacked Bruce Banner and Rick Jones, who had taken a Hulk-like form at the time. Ross/Zzzax fled after being forced to recognize that he himself was now a monster, and Ross's mind returned to his own body. Still retaining some electrical powers, Ross sacrificed his life, using that energy to destroy the mutant Nevermind which had briefly terrorized Gamma Base.Ross blamed Bruce for Betty's apparent death from radiation poisoning and went on to lead a new incarnation of the Hulkbusters. However, while pursuing the Hulk he confronted the Abomination and learned that it was actually he who had poisoned Betty. Afterwards, Ross made his peace with Banner.Later, Ross was coerced into working with General John Ryker against the Hulk, but ultimately Ross helped the Hulk free himself and defeat Ryker's plot. Soon after, Ross goaded the Hulk into seeking out and badly beating the Abomination. After using his former enemy to gain the vengeance that he himself lacked the power to accomplish, Ross allowed Banner to leave in peace.A Red Hulk was on the loose, and there seemed to be no way to stop him. He defeated every challenger in his path – both gods and monsters. Still, it was his confidence that ultimately led to his defeat. Despite besting both Hulk and Thor in their initial meetings, both opponents came back for round two. Again, Hulk found himself on the losing end until Thor returned ready to teach the monster a lesson. Thor fought the Red Hulk to a stand-still, and just as he was about to deliver the final blow, Hulk snatched victory from Thor's grasp. Hulk needed to win this battle, and A-Bomb convinced Thor of this as well. Hulk uncovered Red Hulk's condition of the angrier he gets, the hotter he gets, and guessed it could be a weakness. Hulk let his opponent strike him repeatedly until the heat became too intense for the Red Hulk. He became unbalanced, and Hulk was able to finish him off quickly. Satisfied, the Hulk left as A-Bomb transformed back to Rick, and before Rick could yell out the true identity of the red beast, he was shot in the back by Doc Samson. Samson dragged Rick away as General Ross berated the defeated Red Hulk; telling him how he was given the means to destroy the Hulk and he blew it.She-Hulk, still angry over the beating the Red Hulk gave her, called in a few friends to help dish out some payback. Two powerhouses in Valkyrie and Thundra answered her call. The mission was to find and take down the Red Hulk in hopes of determining who he really is. The trio found him on Mount Rushmore, but even with their combined strength, the Red Hulk proved to be more than a match for them. The three female gladiators almost succeeded in their task, but the Red Hulk simply would not give in. Once reinforcements showed up in the form of Invisible Woman, Black Widow, Tigra, Spider-Woman, Storm and Hellcat, the odds suddenly turned against the massive red devil. The Red Hulk would not be stopped as he tossed around the Lady Liberators like rag dolls, but it wasn't until She-Hulk built up a rage so fierce that her next assault staggered the monster. The rest of the women followed suit, and it seemed as if victory was theirs. The Red Hulk was down and bound in chains as they waited for him to revert back to his civilian identity, and only Thundra wanted to slay the beast. Red Hulk was merely playing possum with the Liberators, and he broke free of his chains, kidnapped Thundra and offered to recruit her because of her warrior nature. The proposition remained undisclosed to Thundra's allies, and the Red Hulk went on his way - his identity still a mystery.The Red Hulk's win went to his head, and he presumed he could give orders to the two Elders responsible for the game. At his behest, Red Hulk was inserted back into the game where he proceeded to murder each of his teammates, starting with Terrax. After he absorbed the Power Cosmic of the Silver Surfer, Red Hulk exterminated the remaining Defenders, Dormammu and challenged Galactus too. Galactus would have nothing to do with Red Hulk's insolence and took the cosmic energy inside him away, expelling him back to the Elders with a warning. The Grandmaster had enough of the Red Hulk and resurrected the Defenders to deal with him. He also undid the damage to the other Offenders, but he was too late to save himself. Red Hulk viciously attacked him until the Hulk intervened and punched him through a mountain face. The Collector claimed the Grandmaster was dead, and he refused to honor the deal to restore the soul mates of the Defenders. Each individual was returned to their respective time and Hulk was left distraught over his still dead love, Jarella. Red Hulk was happy his nemesis was alive because the Hulk was left in the same state he was left in at one time – with a broken heart.She-Hulk enlisted the help of Ben Urich to discern the true identity of the Red Hulk. Urich brought along a photographer and She-Hulk brought Doc Samson to infiltrate an A.I.M. base - posing as a S.H.I.E.L.D. facility - to expose the truth behind the mystery. Samson revealed to all how A.I.M's leader, M.O.D.O.K., was experimenting on gamma-powered individuals, with the help of General Ross, to make gamma-powered super soldiers. The satellite used to bring Hulk down during World War Hulk was under M.O.D.O.K.'s influence, and he interfaced with Banner's irradiated cells. Using this information, M.O.D.O.K. was responsible for the creation of the Red Hulk, Rick Jones' transformation into A-Bomb, and the evil split personality of Doc Samson which gave away the group's position.A fight broke out between Samson and She-Hulk, leaving Urich to fend for himself against the Red Hulk. Luckily for him, the photographer who accompanied Urich doubles as the amazing Spider-Man, and Spider-Man tangled with the red giant until a captive Banner changed into the Hulk. The two Hulks clashed, but Red Hulk used his radiation absorption abilities to steal the gamma energy from inside the Hulk, preventing him from ever becoming the monster again. The A.I.M. base was destroyed, but Red Hulk wasn't about to let Urich reveal anything he saw that day. He threatened the reporter if one word saw print, he would kill everyone at Urich's newspaper - Front Line - in one murderous rampage.Red Hulk set up a meeting with General Ross that concluded with the general's death when he showed up in the Redeemer armor, intending to kill the red giant. After the memorial service, Red Hulk met with his new ally who appeared to have orchestrated Ross's death all along, Bruce Banner.When the Frightful Four attacked the Fantastic Four in the Baxter Building, Red Hulk uncharacteristically came to their rescue. He managed to save everyone inside from being sucked into a portal even though Mister Fantastic was kidnapped. He also tried to prevent the Intelligencia from abducting Beast and Black Panther (T'Challa) from his home in Wakanda but opposing the X-Men as well as the Red Ghost proved to be too much for him. Red Hulk's last chance to stop the Intelligencia would be aboard their Hellcarrier.His presence was expected, and they unleashed the Gammadroid and Cosmic Hulk to take him down. Instead of preventing his former allies from unleashing their master stroke, Red Hulk became a part of it as they siphoned off much of his energy to create an army of Hulks. His backup plan, Deadpool, saved him before they completely drained him, but he was saturated in a gamma bath, transforming him into Hulkpool. Other heroes on the scene were also affected by the gamma radiation. The worst part for Red Hulk was the Intelligencia had won with a plan he devised.General Ross never told anyone that from the first moment he encountered the Hulk he coveted the creature's raw power. After suffering several defeats at the brute's hands, Ross finally got a taste of what real power felt like when the Leader placed him in the Redeemer armor. Finally, he had enough power to destroy the monster that plagued him for years, but there was one drawback. Ross couldn't speak or function on his own and appeared to be in a catatonic state though he was fully conscious of what was happening to him; even the Leader wasn't aware Ross's mind was undamaged. Ross was eventually returned to his normal state, but his obsession with the Hulk continued to grow.After Hulk returned to Earth and waged war on the Illuminati, that's when Ross's obsession gave way to his new nightmare. Using radiation siphoned from the Hulk, Leader and M.O.D.O.K. transformed Ross into the Red Hulk. However, Ross didn't reveal his true identity until he came under attack by the Red She-Hulk for a second time. He offered no resistance to her violence, telling her he could never harm his daughter.Banner discerned Red Hulk's true identity beforehand and knew the Ross appearing in public was merely a Life Model Decoy operated by M.O.D.O.K.. That's why he took control of its programming, stole the Redeemer armor and had Red Hulk smash it. Banner figured he could end the Intelligencia's plan if the key to it succeeding was destroyed.Red Hulk didn't tell Banner he stood idly by while Samson killed Clay Quartermain after he brought down the Helicarrier.Drained both mentally and physically because of his ordeal aboard the Hellcarrier, Ross looked defeated until an out-of-control Cosmic Hulk happened upon him and attacked. Ross absorbed much of the radiation flowing through the robot's body, triggering his transformation back to the Red Hulk. He tore the Cosmic Hulk in half and began his search for the Leader. Done with alliances and ready to take on the world solo, Red Hulk confronted the Leader only to learn Glenn Talbot was inserted into the White House as a replacement for Ross since the world believed him dead. Red Hulk absorbed all the gamma radiation within the Leader's body, leaving him an ordinary man. He then proceeded to the White House to destroy what he assumed was another Life Model Decoy of Talbot controlled by the Leader while it was addressing the people of the nation. Red Hulk held the LMD's severed head up to the cameras and stated he was now in charge.Red Hulk was not going to place the country he fought so hard to protect over the years in jeopardy, but to his surprise, the Hulk returned and challenged his authority. The battle of the Hulks was savage, and both knew the only way their feud would end was when one of them was dead. Banner was unwilling to take a life, but his opponent wasn't as squeamish. Red Hulk delivered a killing blow only he failed to kill the Hulk. Instead, he was defeated, and Hulk told him he could never change back into Ross or he would expose him as a traitor to the world. Ross was trapped in the body of what he hated most and there was nothing he could do about it. Red Hulk was imprisoned, and Hulk called in Steve Rogers to give his enemy a chance at redemption.Ross' time to prove himself would come as a backup plan of the Leader's and M.O.D.O.K.'s automatically initiated after their defeat. Steve Rogers enlisted Red Hulk to stop everything from techno-viruses to speeding comets, hard-sound sea monsters to mega-life from Monster Island, but Red Hulk could not handle it alone. Specially selected teammates were paired with Red Hulk, but all had a score to settle with him. Iron Man, Thor, Namor and even A-Bomb had all fallen to his might, but each of them had to move past previous defeats to save Earth from certain destruction. Red Hulk ran into trouble on Monster Island while attempting to stop the inhabitants from marching to the mainland and destroying everything in their path. His body overheated as his temper rose, and Red Hulk transformed back to Ross. He would have been eaten if Banner had not teleported to his side, giving Ross enough time to cool down and change back. Again at full strength, the Hulks found the supercomputer consisting of several cloned M.O.D.O.K. brains responsible for activating the Scorched Earth scenarios, and Red Hulk demolished it, shutting it down. Unknown to him he missed one of the brains which was implanted into a new body and MODOK Superior was born.", 
    "durability": 7, 
    "education": "Unrevealed", 
    "energy": 2, 
    "eyes": "Blue (Ross); Yellow (Red Hulk)\n", 
    "fighting": 5, 
    "firstappearance": "(Ross) Incredible Hulk #1 (1962); (Redeemer) Incredible Hulk #397 (1992); (Red Hulk) Hulk #1 (2008)\n", 
    "groupaffiliation": [
        "None", 
        "formerly Intelligencia", 
        "Code Red", 
        "Offenders", 
        "Operation: Hulk", 
        "United States Air Force Mobile Combat Force One (Hulkbusters and Area 102 Hulkbusters)"
    ], 
    "hair": "White, formerly brown (Ross); Black (Red Hulk)\n", 
    "height": 73, 
    "id": "Red_Hulk", 
    "identity": [
        "Publicly known (Ross)", 
        "known only to a select few (Red Hulk)"
    ], 
    "intelligence": 5, 
    "knownrelatives": "Karen Lee Ross (wife, deceased), Betty Ross-Banner (daughter), Glenn Talbot (son-in-law, deceased), Bruce Banner (son-in-law), unidentified father-in-law", 
    "occupation": [
        "Adventurer", 
        "former assassin", 
        "lieutenant general", 
        "U.S. Air Force", 
        "stunt pilot"
    ], 
    "origin": [
        "(Ross) Incredible Hulk #291 (1984)", 
        "(Red Hulk) Hulk #23 (2010)"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "Red Hulk possesses an incredible level of superhuman physical strength, stamina and durability. Unlike the Hulk, whose physical strength is potentially limitless due to the fact that the Hulk's strength increases with his level of anger, the Red Hulk becomes hotter as he grows angrier leaving huge amounts of residual radiation after a heated confrontation. This temperature increase may serve as a hindrance to the Red Hulk but that has yet to be determined. \n\nThe Red Hulk can also use his superhumanly strong leg muscles to leap great distances including into orbit around the Earth. The Red Hulk has shown to be nearly invulnerable to physical damage regardless of the cause, and has also shown the ability to regenerate damaged areas of tissue at an amazing rate. It is entirely possible that the Red Hulk also has the Hulk's resistance to extreme temperatures, poisons, and diseases but that, too, has yet to be revealed. However, as in outer space, Red Hulk can hold his breath for an extremely long amount of time and function normally, even under times of great duress.\n\nAn attribute of the Red Hulk which isn't known to many is what gives him his tremendous power. Red Hulk is able to absorb radiation at will, mostly gamma radiation, but he can also absorb other types such as cosmic radiation. The more he absorbs, the more powerful he becomes. However, Red Hulk is susceptible to mind control.  \n\n\nAt one time, Ross's mind controlled the form of Zzzax and commanded Zzzax's powers too. When his mind was returned to his original body, Ross could still release some of the electromagnetic energy at will for a brief period.", 
    "realname": "Thaddeus E. Ross", 
    "significantissues": [
        "Operation: Hulk initiated (Tales to Astonish #61, 1964)", 
        "Operation: Greenskin/Hulkbusters initiated (Incredible Hulk #145, 1971)", 
        "captured by the Gremlin's agents (Incredible Hulk #163-166, 1973)", 
        "renamed Hulkbuster Base as Gamma Base (Incredible Hulk #198, 1976)", 
        "nervous breakdown (Incredible Hulk #228, 1971), allied with MODOK and Abomination (Incredible Hulk #287-290, 1983)", 
        "merged with Zzzax, died fighting Nevermind (Incredible Hulk #325-327, 330", 
        "1986, 1987)", 
        "resurrected and used as Redeemer (Incredible Hulk #398-400, 1992)", 
        "re-resurrected by Troyjans (Incredible Hulk #464, 1998)", 
        "with Kathleen Sparr in new Hulkbusters (Incredible Hulk #468, 470, 472-474", 
        "1998, 1999)", 
        "forced to assist Gen. Ryker (Incredible Hulk #16, 18-20", 
        "2000)", 
        "sent Hulk to gain vengeance on Abomination (Incredible Hulk #24-25, 2001)", 
        "Responsible for the death of the Abomination (Hulk #1, 2008)", 
        "Defeated She-Hulk and Iron Man and took out a S.H.I.E.L.D. Helicarrier (Hulk #2, 2008)", 
        "Fought A-Bomb, destroyed Gamma Base and released the original Hulk (Hulk #3, 2008)", 
        "Fought and defeated Hulk (Hulk #4, 2008)", 
        "Fought, defeated and left Thor stranded on the moon (Hulk #5, 2008)", 
        "Rematch with Hulk and Thor, was beaten then abandoned by his benefactors, General Ross and Doc Samson (Hulk #6, 2008)", 
        "killed a Wendigo before facing the Abomination, and threatened the life of She-Hulk before destroying the Helicarrier (King-Size Hulk #1, 2008)", 
        "Challenged by She-Hulk and her allies and made quick work of them (Hulk #7-9, 2008)", 
        "Formed a group of his own to take on the Defenders, killed the Hulk but was defeated by the Hulk when he was resurrected by the Grandmaster (Hulk 10-12, 2009)", 
        "Possibly had his identity compromised by Domino, formed Code Red, fought X-Force, and found out his allies were now his enemies (Hulk #13-17, 2009-2010)", 
        "killed General Ross LMD and is working with Banner (Fall of the Hulks: Gamma, 2010)", 
        "Saved Fantastic Four from being killed by the Frightful Four (Hulk #19, 2010)", 
        "Attempted to prevent the kidnapping of T'Challa and Beast (Hulk #20. 2010)", 
        "Helped Thudra get home (Fall of the Hulks: Red Hulk #2, 2010)", 
        "Beaten by the Intelligencia (Hulk #21, 2010)", 
        "Origin of the Red Hulk (Hulk #23, 2010)", 
        "Teamed with other heroes to put an end to a doomsday plan devised by the Leader and M.O.D.O.K. (Hulk #26-29, 2010-2011)", 
        "fought Xemnu, body fused together with green Hulk courtesy of the Impossible Man (Hulk #30, 2011)"
    ], 
    "speed": 4, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 245
}