{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A. with criminal record", 
            "content": "Razorfist dealt with Freezer Burn, but came up empty handed – in more ways than one. After killing Freezer Burn, Razorfist was discovered by Colleen Wing and Misty Knight, also looking for Freezer Burn for an outstanding warrant. Colleen severed the weapon hand of the assassin, and called the police to come pick him up. Next on their list was 8-Ball, but before he could divulge all the information about their heist, the Wrecker killed him while in their custody. The Trapster was hired to take out Whirlwind, but although he didn't kill him, Trapster didn't get Ricadonna's property back either. What she did get was a visit from Misty and Colleen, inquiring about the robbery, but after blatantly lying and careful misdirection, Ricadonna paid Misty a visit at her apartment just as Humbug showed up with her precious merchandise.Vicious as she is beautiful, Ricadonna ruthlessly attacked Misty, leaving her battered, broken and minus her bionic arm which currently housed the stolen microchip Ricadonna went through all the trouble to reclaim. The only reason she didn't kill Misty is because Humbug summoned a swarm of insects to forcibly remove Ricadonna from the premises. She planned to auction the chip, made by the Mad Thinker, to whichever terrorist group or outlaw nation would pay the highest, but what was on the chip was truly frightening – an advanced computer virus capable of wreaking havoc with the world's economy or any given country'’s defense systems. Ricadonna had the anti-virus of course, making her systems immune to any devastating effects. Everyone from A.I.M., the Hand and Hydra to other smaller mob families showed up to bid on the chip, but Misty, Colleen and Iron Fist weren't about to let that device fall into enemy hands.The trio fought superbly against superior numbers, but Ricadonna attempted to escape. However, she ran into Misty and Colleen's indestructible receptionist, Otis Johnson, who stalled her long enough for Misty to challenge Ricadonna to a rematch. This time is was Misty that emerged victorious, as she had the upper hand with improvements made to her new bionic arm. Ricadonna was beaten and the microchip was removed from her possession, both being handed over to the proper authorities. She stayed incarcerated until such a time where those with special abilities were required to register with the government, but a place called The Corporation had a solution for that dilemma.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Green (variable; formerly blue)\n", 
            "fighting": 1, 
            "firstappearance": "Daughters of the Dragon #1 (2006)\n", 
            "groupaffiliation": "Ricadonna's Rogues", 
            "hair": "Green (variable; formerly blond)\n", 
            "height": 66, 
            "id": "Ricadonna,_Celia", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Unidentified mother", 
            "occupation": [
                "Criminal mastermind", 
                "terrorist", 
                "former Celia Enterprises CEO", 
                "mafia princess", 
                "magazine publisher", 
                "television producer", 
                "clothing and cosmetic merchant"
            ], 
            "origin": [
                "Daughters of the Dragon #3 (2006)", 
                "Heroes for Hire #4 (2007)"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "Ricadonna had voluntarily surgery where Skrull organs were implanted into her body, giving her enhanced strength and speed – possibly to superhuman levels - shape-shifting abilities where she can alter her form into anything; though she can increase her size, she presumably cannot gain body mass. By stretching out her mass, she can grow new appendages, including wings, enabling her to fly at 90 mph and strong enough to carry aloft at least 200 lbs. in addition to her own body weight. Ricadonna can make her fists inhumanly powerful and immune to pain and injury as well as bioelectric energy blasts able to penetrate solid concrete", 
            "realname": "Celia Ricadonna", 
            "significantissues": [
                "Put a hit on four thieves for robbing her (Daughters of the Dragon #1, 2006)", 
                "Confronted Misty Knight, defeated her, and took back her stolen microchip (Daughters of the Dragon #3-4, 2006)", 
                "began her auction but was stopped by Misty and sent to prison (Daughters of the Dragon #5-6, 2006)", 
                "Escaped prison (Heroes for Hire #3, 2006)", 
                "Put hits out on Heroes for Hire and gained super powers (Heroes for Hire #4, 2007)", 
                "Defeated and believed to be dead (Heroes for Hire #5, 2007)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 129
        }
    }
}