{
    "aliases": [
        "The Warlord", 
        "Doctor Doom"
    ], 
    "citizenship": "USA", 
    "content": "Richards actually sent himself into Earth’s future, but as the time platform didn’t work that way, it instead shunted him aside to a parallel universe. He found himself on a planet that had been devastated by a war that occurred centuries before, between the people of the Earth and the human colonists of the Moon, ending in the destruction of the Moon itself. Nathaniel traveled around the war-torn planet, helping people with his scientific knowledge, until one day he met the Queen of the dominant race of humans. He gave her the information to better her people and create for them amazing machines, including flying, metal dragons that they rode on. In gratitude, the Queen gave Nathaniel her eldest daughter to marry. Nathaniel later discovered a citadel that held powerful, yet ancient, machines, and rebuilt it to live in. The Queen and her people left him with a workforce made up of ape-like mutates from the Southern parts of the planet, but returned three years later to find the citadel transformed into a fortress, and Nathaniel seemingly calling himself the Warlord. The Queen discovered that-soon after the construction of the fortress was finished-the Warlord had attacked the nearest township and declared himself the ruler of the world.In fact, the Warlord was not Nathaniel, but his wife, Cassandra. She kept him lulled in his citadel, pretending to love him and eventually bearing him a son. But she secretly lusted after power and disguised herself as Nathaniel, in his armor. It was to this newly ravaged world that the Fantastic Four traveled, searching for Reed’s father so that Reed could fill in certain holes in his memory. They found people dressed as cowboys from the Old West, but carrying laser guns and riding on flying, metal steeds. The four soon met with the Queen, who told them the history of the Warlord, and Reed himself approached the fortress, alone, to reason with his father. Yet the Warlord attacked him, sending her troops against his team, until Wyatt Wingfoot snuck around and threw a rock into a powerful, anti-matter weapon that the Warlord prepared to end the fight with. The resulting explosion knocked Wyatt out, but killed the Warlord, Nathaniel’s wife.When Wyatt recovered, Nathaniel had joined them and spoke with his son. He was ashamed that he had been fooled for so many years by his wife and vowed to rebuild the world that his technology had devastated. The Fantastic Four left shortly afterwards, returning to their own time.Years later, Nathaniel appeared in Four Freedoms Plaza and explained to his grandson, Franklin Richards, that he had come to help him. The Fantastic Four soon arrived, and Nathaniel greeted his son and his daughter-in-law, the Invisible Woman. He explained that while traveling through the timestream he found a possible future of his home-Earth, where Sentinels took over the planet and eventually killed most of the mutant populace, including Franklin. Though Agatha Harkness announced that she detected truth in his words, she also revealed that he was hiding something that involved Reed. Nathaniel told them that the Sentinels were efficient because they used technology invented by Reed, himself. When Reed interrupted the conversation to speak with Matt Murdock, their attorney, concerning the Human Torch's brush with the law, Nathaniel was left with Agatha. She told him that she knew his mission, but would stay silent because she felt it necessary and asked if they would hate them for it. Nathaniel replied that they would, as they should.Once Reed was distracted with the problem of the Sentinel’s circuitry, Nathaniel made his move and fired at his own son, knocking him out. He revealed that his true goal was to remove Franklin-who he described as a danger to the entire universe-completely from their timeline. But Susan refused to allow him and prepared to fight him, though Agatha tried to stop her with her sorceress powers. Franklin himself turned on Nathaniel, angered that he had turned Agatha against Franklin’s mother, and used his psychic powers to fire blasts of mental energy that Nathaniel’s suit could barely protect him from. Susan quickly subdued Agatha and Nathaniel fended off Ms. Marvel who jumped in to help, whom he quickly subdued as well. Then Reed appeared and he and his wife fought Nathaniel together, though Nathaniel fired a neuro-scrambler at Susan to distract them. She blasted it out of air, and pointed at Nathaniel too late, as he grabbed Franklin and disappeared into the timestream. While Reed, Susan, and Agatha argued with each other about whose fault it was, a figure reappeared moments later in Nathaniel’s armor. They assumed it was Nathaniel himself, but the figure revealed himself to be a teenage version of Franklin, sent back from the future by his grandfather.Nathaniel later transported to Doctor Doom's castle and reprogrammed Doom’s robots to believe that Nathaniel was Doom, himself. He then disguised himself as Doom and revealed himself to the people of Latveria as their monarch. Nathaniel used Doom’s machines to contact his grandson, Franklin, telling him to turn to Nathaniel’s son to save the world, though he pointedly did not specify which son. While searching for Reed, Nathaniel’s daughter-in-law appeared at Castle Doomstadt, investigating rumors that Doom had returned. But she found Nathaniel in his place who announced that he was searching for his son, and asked for her help, but explained that Reed was not the son he sought. Nathaniel told Susan that he searched for his son, which he had fathered during his travels through the timestream, who became the absolute ruler of Latveria, implying to her that Doom was also his son. But his responses to her questions gave her little reason to trust any explanation or facts he gave her. Then, together they traveled to Tibet and the Monastery of Doom. While she fought the armed guards, Nathaniel found his own way inside and fired at Susan’s back when she discovered two sealed, person-sized containment tubes.While Susan looked on in horror, Nathaniel opened the pods to reveal Kristoff Vernard and Doom’s servant, Boris (who was actually Zarrko the Tomorrow Man in disguise). Then Nathaniel, Kristoff, Susan, and Boris joined up with the rest of the Fantastic Four to fight against Aron the Rogue Watcher, who had disguised himself as Uatu. But when they transported to Uatu’s base on the Moon, and Aron revealed himself and attacked them, Nathaniel retreated rather than face his powers.Nathaniel’s grandson, Franklin, and his Fantastic Force team later followed one of the flaming apparitions of Susan that warned them to help the Fantastic Four, back to its source using Huntara’s scythe. What they found was Nathaniel, posing as Doctor Doom, and using the fake apparitions to control his grandson and daughter-in-law. Huntara attacked Nathaniel, intending to kill him for his traitorous crimes, but Franklin stopped her before she could finish him. Then, Nathaniel took them to the Watcher’s base to join the Fantastic Four. After Huntara rescued Susan from the Negative Zone where Aron had thrown her, the entire group jumped into the cosmic rift that swallowed Uatu and found themselves in the middle of a trial. The defendant was the One, the repository of all Watcher knowledge, judged by Arishem, the Celestial Judge. After finding the last piece of a super weapon they needed to defeat Aron, Susan sent the Thing and the Fantastic Force to face Aron, while Nathaniel and the rest turned on the Celestials to save the Watchers very existence. They faced off against Exitar the Executioner, who had been powering up for centuries to obliterate the One, and Nathaniel explained to Susan that her powers came from hyperspace where the Celestials existed, and so they were enough to damage them. Susan used her force powers to tear a hole in the side of Exitar’s body and they entered him to destroy him.They eventually reached the core of the Celestial, where a mirage of Susan appeared to reason with them and explain the purpose of the Celestials. Though it recounted the history of the Celestials, and informed Susan that they needed to survive-over the Watchers-she lashed out and blew apart its nerve center when it attacked the One. The group inside the Celestial fell to the ground when it disappeared, and Uatu gathered them together in his shield, explaining that they had only stalled the confrontation between the Watchers and Celestials by a few millennia-as each group would eventually rebuild its strongest member. Then, when pressed, Uatu joined them and the other group against Aron, and used his own power to erase Aron from existence. He Who Summons appeared moments later and cast Uatu out of the Watchers for his crimes and excessive involvement, but Uatu was left with enough power to send the whole group back to Earth.After Nathaniel accidentally robbed the Blue Area of the Moon of its artificial atmosphere, creating a panic in the Inhumans that was only fixed when the Fantastic Four shrunk Attilan to save them, Nathaniel offered his services to Morgan Le Fay to restore the city to its original size. He interrupted his attempts to save the city when Hyperstorm began to plot against the Fantastic Four. Nathaniel tried to stop them from traveling to Latveria, but failed, and while transporting out his beam was intercepted by Hyperstorm. His future descendent trapped Nathaniel and taunted him with his failure to stop his own plans to destroy the Fantastic Four. Imprisoned, Nathaniel mocked Zarrko, making him insecure, which inadvertently sent him into the room with an equally imprisoned Doctor Doom, who had recently freed his mind enough to lock Zarrko’s gaze with his, and transfer his mind into Zarrko’s body. Zarrko then freed Nathaniel and they plotted to surprise Hyperstorm. Together the two fought their way through Hyperstorm’s robots, but Nathaniel separated from Doctor Doom-Zarrko when he saw his son, Reed, returned and being attacked by Hyperstorm’s robots along with his family.Nathaniel arrived to the fight in time to direct Susan to use her powers, as she had against the Celestials, and she tore apart Hyperstorm’s destructoids. But Hyperstorm appeared directly afterwards and they turned to battle him. Hyperstorm turned out to be too powerful, and Nathaniel and Susan convinced Reed that his abilities were better suited to finding a solution in Doom’s labs; so then Nathaniel and Reed left Susan to fight Hyperstorm alone. Reed tried to convince Doom, who used some of his own mechanisms to attack Hyperstorm, to work with him to defeat his future descendant, but Doom’s ego would not allow him to. Soon enough, Hyperstorm appeared and shuttled Doom off to his own Latveria, in his own time line, in order to embarrass him with his inability to defeat Hyperstorm. Then, instead of crushing the surrounding heroes, Hyperstorm healed the Thing’s face-which Wolverine had scarred-and sent them home, as well, commanding them to leave him to his plans, and not interfere again.When Susan later collapsed in a fight with an out of control Black Bolt, Reed blamed his father for teaching her to use her powers to an extent that turned out to be too dangerous. Nathaniel countered that he was merely teaching her, her true potential. He watched as his son worked feverishly to come up with a solution to the threat of Hyperstorm, though Nathaniel warned him continuously that he was wasting his time and endangering himself. Reed even went as far as trying to contact the Silver Surfer or Galactus to assist them, though the Surfer revealed that Galactus had seemingly died at the hands of his former herald, Morg. When Reed returned from his visit to the Surfer, Nathaniel and his son’s family watched as a time platform descended on Franklin, from Hyperstorm, returning Franklin to his true age. Forced by the situation, Nathaniel explained that he had previously stolen and aged Franklin because Franklin was destined to, one day, father Hyperstorm along with Rachel Summers, the child of Cyclops and Jean Grey. Nathaniel continued to explain that-in all the time lines he had researched-the Fantastic Four were fated to die at the hands of Hyperstorm.Despite Nathaniel’s warnings, Reed was insistent that he would find a way to defeat Hyperstorm. To that end, he traveled to the last known location of Galactus-with his family and friends stubbornly following him-and set up a machine to recall the world devourer. Hyperstorm soon appeared and attacked the collected heroes, and even Nathaniel turned on him and poured fire upon him, until Hyperstorm swatted him away. Then, as it seemed that Hyperstorm would win, Reed managed to hit a button on his device and open a portal to where Galactus lay exiled by his own hand, and the devourer grew angry at being summoned. Though he immediately sensed a source of unlimited power and energy in Hyperstorm and attacked him, feeding off of the hyperspace energies that Hyperstorm controlled. Reed’s device then shut back off, sealing both Galactus and Hyperstorm in the dimensional void, ending the threat.", 
    "durability": 2, 
    "education": "Unrevealed", 
    "energy": 4, 
    "eyes": "Blue\n", 
    "fighting": 2, 
    "firstappearance": "Fantastic Four #272\n", 
    "groupaffiliation": "None", 
    "hair": "Gray\n", 
    "id": "Richards,_Nathaniel", 
    "identity": "No dual identity", 
    "intelligence": 5, 
    "knownrelatives": "Major John Richards (father, deceased), Cassandra Richards (ex-wife, deceased), Evelyn Richards (ex-wife, deceased), Reed Richards (son), Susan Richards (daughter-in-law), Franklin Richards (grandson), Valeria Richards (granddaughter), unnamed Richards child (son), Tara Richards, (daughter), Kristoff Vernard (alleged son); Kang, his divergent counterparts, and offspring (common ancestry)", 
    "occupation": [
        "Time-traveler", 
        "Former Warlord of an alternate Earth"
    ], 
    "origin": "Fantastic Four #273", 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Nathaniel Richards", 
    "significantissues": "Fantastic Four #271 (first mention), Fantastic Four #272 (intro), Fantastic Four #375 (takes Franklin)", 
    "speed": 2, 
    "strength": 3, 
    "universe": "Marvel Universe"
}