{
    "aliases": "Robbie", 
    "citizenship": "U.S.A. with a criminal record (pardoned)", 
    "content": "Putting the Tombstone incident behind him, Joe graduated from Harlem, attended Columbia, got his degree, and landed a job several years later as a night-desk catcher with a Philadelphia newspaper. He also married his girlfriend, Martha, but Robbie's old secret would soon come back to haunt his new life. When a telephone tipster told Robbie he knew who had killed local crimelord Ozzy Montana, Robbie set up a secret waterfront meeting; but he found his informant dead in the grip of Tombstone, who had become a mob hitman with a penchant for snapping necks. Robbie fled and kept quiet about the whole incident, fearful of what Tombstone might do to him or his wife if he talked. Joe realized he had never fully recovered from his early encounters with Tombstone, and that the killer had a strange sort of hold over him.Trying to forget his Tombstone failures, Robbie threw himself back into his journalism career. He and Martha moved back to Manhattan, where Joe became a reporter for the Daily Bugle. Over the next twenty years, Robbie rose through the ranks to become the Bugle's city editor and one of the city's most respected journalists. He formed a close friendship with the Bugle's publisher and editor-in-chief, J. Jonah Jameson, supplying a calming yin to Jameson's raging yang. Though a good newspaperman at heart with a strong social conscience, Jameson has often allowed his personal biases to compromise his journalistic perspective, but Robbie's counterbalancing views have kept the Bugle's news coverage relatively fair (unlike many of Jameson's editorials). Jameson and Robertson have sharply differing views on super heroes in general and Spider-Man in particular. Jameson tends to regard costumed vigilantes with suspicion and contempt, and is consumed by a jealous loathing of Spider-Man, not knowing the hero is secretly young Bugle photographer Peter Parker. Robbie has a more objective view of New York's super heroes, judging them by their actions, and has aided Spider-Man and other heroes on many occasions. Robbie has also been something of a fatherly mentor to Peter Parker, and has often seemed aware of Peter's dual identity; but he has never voiced, exploited or acted on this knowledge, and has even protected Peter's secret on occasion, such as when he steered Bugle reporter Ken Ellis away from learning the truth.They first worked together when Robbie helped Spider-Man capture the criminal Chameleon. Later, when Robbie exposed corrupt politician Sam Bullitt, Spider-Man and Iceman teamed up to rescue Robertson from a vengeful Bullitt's thugs. Robbie went on to target another corrupt politician, mayoral candidate Richard Raleigh, and Spider-Man saved Robertson from Raleigh's savage super-agent, the Smasher, who later killed Raleigh himself.Robbie's family life often ran less smoothly than his professional life. His firstborn son, Patrick, died while still an infant. His second son, Randy, grew to adulthood, but often fought bitterly with his father over their differing beliefs. An anti-establishment radical, Randy was a key player in student protest movements at Empire State University, where Robbie sometimes intervened as both father and reporter. Ultimately deciding to pursue social work as a career rather than journalism, Randy transferred to the University of Pittsburgh, where he met and married a white Jewish woman named Amanda, much to Robbie's discomfort. Randy eventually moved back to New York and found employment as a social worker, and Robbie gradually accepted his son's mixed marriage, though Randy and Amanda later broke up. In recent times, Randy has been dating Glory Grant, long-time secretary to Jameson and Robertson at the Daily Bugle.Jameson's obsessive hatred of Spider-Man drove him to unusual lengths over the years, including the funding of several projects designed to capture, humiliate or destroy the hero. One such project created the mad super-criminal known as the Scorpion. Jameson kept his involvement secret for years, but after the Hobgoblin (Roderick Kingsley) tried to blackmail him using this information, Jameson made a full public confession and stepped down as the Bugle's editor-in-chief, promoting Robertson to replace him. While Jameson has remained a very hands-on presence in the Bugle as its publisher, Robertson has proved very successful and effective in his new role as the paper's chief editor. He has been a friend and mentor to reporters and columnists such as Betty Brant, Kate Cushing (his successor as city editor), Kat Farrell, Ned Leeds, Joy Mercado, Leila Taylor and Ben Urich.Then, at the height of Robbie's success, Tombstone brought his whole world crashing down. After years of rising through the ranks of organized crime as a Philadelphia mob enforcer, Tombstone began working for New York crime boss Wilson Fisk, the Kingpin. Consumed by guilt over having helped make Tombstone's many murders possible with his silence, Robbie confronted Tombstone with a gun, intending to take him into custody and tell the police everything. Lonnie overpowered Joe and seriously injured him, seemingly breaking his back. By this time, Robbie had left an audiotape with Peter Parker, confessing his role as an accessory in Tombstone's criminal career. But when Tombstone menaced the crippled Robertson in the hospital, Joe began to have second thoughts about going to the police. Berated by Parker and reporter Ben Urich for his weakness, and supported by Randy, Robbie finally worked up the courage to face his fears. He rapidly regained his mobility through physical therapy, and made a full confession of his Tombstone secrets to his Bugle colleagues and the public. Robbie offered to resign his editorial post, but Jameson refused to accept his resignation. Lonnie, meanwhile, had been captured by Spider-Man, who was baffled by Tombstone's admission that he spared Robertson's life because he still regarded Robbie as his friend.The public and Robertson's colleagues seemed prepared to forgive his mistakes, but a corrupt Kingpin-connected judge sent Robbie to prison for his indirect role in Tombstone's crimes. To make matters worse, Tombstone fixed it so that he and Robbie ended up in the same federal prison, where Lonnie and his cronies could continue to haunt his old friend. Robertson befriended a massive convict known as Bruiser, who acted as his bodyguard for a time, but Bruiser was ultimately taken unawares and beaten to death. Later, Tombstone broke out of prison, taking Robbie with him as a hostage. When Spider-Man intervened, Tombstone had the hero at his mercy and was about to kick him off an airborne helicopter, but Robbie tackled Tombstone first, sending himself and Lonnie hurtling toward Earth. Incredibly, they survived the fall and landed in a riverbed on Amish farmland, where Tombstone forced the Amish folk to treat the seriously injured Robbie, then challenged Robertson to a duel to settle their differences. Robertson was taking a beating until he finally struck back by stabbing Tombstone with a nearby pitchfork. Badly wounded and shocked that his \"friend\" Robbie would do this to him, Tombstone staggered off alone, and Robbie turned himself in to the authorities; however, the late Bruiser's brother, attorney Stuart McPhee, used his connections to secure Robertson a Presidential pardon. Robbie was released from prison and reclaimed his post at the Bugle.", 
    "durability": 1, 
    "education": "Columbia School of Journalism graduate", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Amazing Spider-Man Vol. 1 #51 (1967)\n", 
    "groupaffiliation": [
        "Daily Bugle staff", 
        "Jameson News Digest staff"
    ], 
    "hair": "White\n", 
    "height": 73, 
    "id": "Robertson,_Joseph_%22Robbie%22", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Martha (wife), Patrick Henry (son, deceased), Randolph (Randy, son), Samuel Robertson (father, deceased), Alice Robertson (mother, deceased), Amanda (Mandy, ex-daughter-in-law)", 
    "occupation": [
        "Editor-in-Chief", 
        "Daily Bugle", 
        "former convict", 
        "city editor", 
        "reporter"
    ], 
    "placeofbirth": [
        "Harlem", 
        "New York"
    ], 
    "realname": "Joseph Robertson", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 210
}