{
    "aliases": [
        "Der Schlächter (\"The Butcher\" in German)", 
        "Slasher", 
        "El Tigre", 
        "others"
    ], 
    "citizenship": "Unrevealed (numerous international criminal records)", 
    "content": "Little is known about Sabretooth’s subsequent activities until the early 1960s when served in Team X, a special intelligence unit run by the Central Intelligence Agency for the subversive Weapon X Program. In Team X, Sabretooth was reunited with both Logan, now known as Wolverine, and Silver Fox, however none of them recalled their past experiences due to false memory implants provided by Weapon X’s ally Psi-Borg.Sabretooth had a falling out with Wolverine during a mission in East Berlin in Germany during the early 1960s, exacerbating the already tense animosity between the two. During that same mission, Sabretooth met and romanced Leni Zauber, an operative for another unnamed government agency. Unbeknownst to Sabretooth, Zauber was actually the shape-shifting mutant known as Mystique. Sabretooth remained with Zauber for a month before returning to his Team X duties and remained with the team until its disbandment. He then set out on his own as a hired assassin, earning a worldwide reputation. At some point in the subsequent decades he became a student of the enigmatic Foreigner, head of the assassin guild known as the 1400 Club and one of the few men that Sabretooth respects. Sabretooth was also again manipulated by Mystique, who, for reasons of her own, seduced him in order to become pregnant with his child. However, the resultant son had no mutant potential and was abandoned by Mystique, growing up to become the anti-mutant activist Graydon Creed.While working for the elitist Hellfire Club, Sabretooth clashed with Wolverine in the latter’s capacity as an agent of the Canadian government’s Department K. Months later, an amnesiac Wolverine, having recently been subjected to experiments which bonded the unbreakable metal Adamantium to his skeleton, sought the advice of Adamantium creator Doctor Myron MacLain. Sabretooth, hired by unidentified parties, interrupted the consultation and attempted to kill his former foe and teammate, only to be stopped by Wolverine’s allies. At some point, Sabretooth took up the practice of annually stalking Wolverine on the day Wolverine believed to be his birthday.In recent years Sabretooth, although always a violent man, gradually began developing a psychotic bloodlust that overcame his admittedly heartless human persona. As a result of this further mutation, Sabretooth’s features became more animal-like, a condition which eventually corrected itself. He first came to attention in the modern era when he abducted noted attorney Jeryn Hogarth who was rescued by his client, the martial artist known as Iron Fist. Later, Sabretooth formed a partnership with the costumed criminal the Constrictor on an assignment for the crimelord Montenegro. However, driven by his hunger for violence, Sabretooth disguised himself and slew several people in New York City, resulting in reports of a mysterious “Slasher.” When Sabretooth was exposed as the Slasher, he and the Constrictor found themselves fighting not only Iron Fist, but his allies in the super-strong Power Man, the cyborg detective Misty Knight, and the mutant adventurer El Aguila. Sabretooth and the Constrictor were forced to retreat, however the pair later sought revenge on Knight, only to again meet defeat at the hands of Power Man and Iron Fist.Later, in an effort to prove himself to the Foreigner, Sabretooth tracked down the costumed adventurer the Black Cat, who had clashed with some of the Foreigner’s agents. The effort led to battles with both the Black Cat and the costumed crimefighter Spider-Man, with Sabretooth ultimately being hospitalized under guard. Soon escaping, he was subsequently recruited by an old acquaintance, the mutant thief Gambit, to join the cadre of mutant assassins the Marauders in the service of the enigmatic geneticist Mister Sinister. The Marauders were sent to slaughter the underground mutant community of Morlocks, leading to a clash with the Morlocks’ allies, the team of mutant adventurers the X-Men who counted Wolverine amongst their ranks. In the course of the so-called “Mutant Massacre,” Sabretooth and Wolverine fought several times, with Sabretooth ultimately meeting defeat.As his bloodlust increased, Sabretooth hired the telepathic Birdy to help him keep his urges in check, only for Birdy to be murdered by his son Graydon, now an avid anti-mutant activist with a deep hatred of his parents. Sabretooth then slipped into a killing spree, only to be captured by his former Team X teammate Maverick and the X-Men. The X-Men’s founder, the telepathic Professor Charles Xavier, undertook the task of helping Sabretooth overcome his bloodthirsty impulses, just as the X-Men had helped Wolverine deal with his own berserker rages. Sabretooth played along at first, although doing little to hide his contempt for the X-Men, but when the opportunity presented itself, he escaped from his holding cell in Xavier’s mansion. Confronted by Wolverine, the two fought savagely and Sabretooth was nearly lobotomized when Wolverine thrust one of his claws into Sabretooth’s brain. Following this attack, Sabretooth seemed unusually passive, and one of the X-Men’s allies, the young mutant called Boom-Boom, became fond of the seemingly peaceful prisoner and sought to help him reform. However, Sabretooth soon regained his true personality and turned against Boomer and the X-Men, almost killing the X-Man Psylocke during his escape.Not long after, Sabretooth was recruited by the U.S. government to pursue the malfunctioning mutant tracker known as the Hound. To that end, Sabretooth was instated as a member of the government-sponsored mutant team X-Factor, much to the chagrin of X-Factor’s leader Forge. Unknown to his supposed teammates, Sabretooth was actually a sleeper agent of the government’s Hound Program, under orders to kill X-Factor should they be deemed uncontrollable. He was forced to wear an inhibitor collar that administered a severe shock to his nervous system if he became overly aggressive towards any of his teammates or if he tried to remove the collar. After joining his teammate Mystique in opposing the terrorist organizations Hydra and A.I.M., Sabretooth obtained pills to help him overcome the pain and, after succeeded in removing the collar, he savagely assaulted several other members of X-Factor before escaping. Rejecting the government’s authority, Sabretooth also killed several potential members of the Hound Program, setting back the government’s efforts to control mutants. Sabretooth also clashed with the Russian super-soldier Omega Red who sought to capture the feral mutant and bring him to the Russian telepath Elena Ivanova, whose mother Sabretooth had killed years earlier whilst she was still in-utero.Under unrevealed circumstances, Sabretooth had the near-unbreakable metal Adamantium bonded to his skeleton and claws, much as the Weapon X Program had done to Wolverine decades prior. Sabretooth then attacked Wolverine during his wedding to the Viper on the island nation of Madripoor, only for Wolverine to be forced to cooperate with his foe to save Madripoor from an attempted invasion by the ninja clan the Hand and the terrorist organization Hydra. In a later encounter, Sabretooth and Wolverine were set against each other by the eternal mutant Apocalypse, who sought to transform one of them into a Horseman in his service. After a savage battle, Wolverine defeated Sabretooth, tearing out his heart, and Apocalypse removed the Adamantium from Sabretooth, bonding it to Wolverine’s skeleton instead. Left for dead, Sabretooth was found in an extremely weakened state by Gambit and the mutant shape-shifter Courier. The trio broke into one of Mister Sinister’s bases, and, after some haggling, Sabretooth received a treatment to kickstart his healing factor. Gambit subsequently secured enough Adamantium from Sabretooth’s former partner the Constrictor to keep him alive.Restored to his former self, Sabretooth joined Mystique’s restructured Brotherhood of Mutants in an effort to release a virus that would infect the normal human population. However, after an attack on the Muir Island research base, Sabretooth was defeated by the X-Man Bishop.Sabretooth was subsequently captured by the reformed Weapon X Program, and Adamantium was once more bonded to his skeleton. Sabretooth was used as the Program’s key operative, responsible for recruiting other former Weapon X members back into the fold. Sabretooth recruited the mercenary Deadpool, but failed to recruit his former Team X teammates Maverick and Wraith. Sabretooth was then assigned as back-up on Deadpool’s mission to kill the shape-shifting mutant named Copycat, Deadpool’s former lover. When Deadpool refused to kill her, Sabretooth performed the deed instead.Sabretooth soon betrayed Weapon X by stealing its data on the world’s known mutants, data he used as a lure to recruit two more of Wolverine’s enemies, Omega Red and the cyborg Lady Deathstrike, to attack Wolverine’s friends and family, capturing Wolverine’s young ward Amiko Kobayashi. Sabretooth quickly betrayed these allies as well, teleporting himself and Wolverine to the original and long abandoned Weapon X facility where he taunted his nemesis with the revelation that some of Wolverine’s amnesia about his life was due to his own healing factor, which repressed overly painful memories. Using command codes stolen from the Weapon X project’s Director, Sabretooth utilized a device that stripped Wolverine of his mutant powers. Sabretooth then challenged Wolverine to a supposed final battle during which his own mutant abilities were negated by the same device. Both mutants seemingly died of wounds sustained in the ensuing fight, but once their powers were re-activated both were revived by their mutant healing factors.Sabretooth next set about using his stolen data to murder several mutants, who were under consideration by the Weapon X Program, which soon recaptured him and subjected him to the hypnotic power of the mutant Mesmero to keep him in line. However, Mesmero soon lost his powers, leaving Sabretooth a threat once again. Sabretooth escaped Weapon X a second time with the help of Mister Sinister, then disguised as the project’s lead scientist Doctor Charles Windsor. Returning to his former mercenary ways, Sabretooth accepted employment from an offshoot of Weapon X to track down an escaped test subject called the Native. Outfought by the Native, Sabretooth manipulated Wolverine into tracking her for him, only to be turned on by his employers as they recaptured their quarry. Seeking vengeance, he allied with Wolverine to raid the facility where the Native was being held. After killing his employers and watching Wolverine and the Native escape, Sabretooth swore to finish the job he had started.Recently, Sabretooth \"allied\" himself with the X-Men once again.  He joined Rogues team, alongside the likes of Cable, Cannonball, Iceman and others.  Wolverine did not agree with this decision to once again have Creed in the mansion and decided to settle the score with him once and for all.  The battle took both of them to Wakanda, where it was revealed to them that they were both descendants of a \"wolf\" like evolutionary scale as opposed to ape.", 
    "durability": 4, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Amber\n", 
    "fighting": 7, 
    "firstappearance": "Iron Fist #14 (1977)\n", 
    "groupaffiliation": [
        "Formerly X-Men", 
        "Weapon X", 
        "Brotherhood Of Mutants", 
        "Hound Program", 
        "Marauders", 
        "X-Factor", 
        "Team X", 
        "former agent of Tribune", 
        "Foreigner", 
        "Montenegro and others", 
        "former partner of Constrictor"
    ], 
    "hair": "Blond\n", 
    "height": 78, 
    "id": "Sabretooth", 
    "identity": "Known to various government officials", 
    "intelligence": 2, 
    "knownrelatives": "Zebadiah Creed (father, deceased), unidentified mother (deceased), Graydon Creed (Tribune, son, deceased)", 
    "occupation": [
        "Mercenary", 
        "former government agent", 
        "possibly others"
    ], 
    "origin": "Sabretooth: Death Hunt #1-4 (1993)", 
    "placeofbirth": "Unrevealed", 
    "powers": "Sabretooth is a mutant possessing various superhuman attributes that are the result of genetic mutation and artificial enhancement. Sabretooth's primary mutant power is an accelerated healing factor that enables him to regenerate damaged or destroyed tissue with far greater speed and efficiency than an ordinary human.  Sabretooth can fully heal from injuries that result in massive tissue and blood loss such as multiple gunshots, slashes, puncture wounds, and severe burns within only a few minutes. This mutant healing factor also renders Sabretooth highly resistant, possibly even totally immune, to disease.  Sabretooth's healing powers, also, render him immune to most drugs and toxins, except within massive doses. sabretooth can lift [press] 118 tons. Sabretooth ages much slower than an ordinary human. Despite having a much greater chronological age, Sabretooth possesses the appearance and vitality of a man in the physical prime of his life. All of Sabretooth's natural mutant abilities stem from, at least partially, his accelerated healing factor.when sabretooth goes feral his brute strength increases without limit.\nSabretooth possesses superhumanly acute senses of sight, hearing, smell, and taste - although perhaps not of touch - comparable to those of certain animals, allowing him to track prey similar to the way dogs and wolves do. His night vision is preternaturally sensitive, containing twice the average human being’s area of light-gathering retina, and extends into the infrared portion of the electromagnetic spectrum. His hearing is extraordinarily acute, able to detect light breathing in a cave at 200 feet. His sense of taste can detect 1 part of foreign matter in 10,000. His highly developed olfactory sense and memory allow him to detect and track a scent over eight hours old, possibly a concentration of 20 parts per million, that he had not been exposed to for up to several months previously. Dilute, common odors of perspiration, perfumes, cigarettes, candies, and food are beacons to his senses.\nMany of Sabretooth's physical abilities function with superhuman levels of efficiency.  He possesses some degree of superhuman strength, the limits of which are unknown. Originally, Sabretooth possessed sufficient physical strength to crush an iron barbell, with ease. Sabretooth has undergone various procedures, some willingly and some unwillingly, that have increased his strength considerably beyond his original levels. Sabretooth's mutant healing factor grants him much greater immunity to the lactic acids generated by his muscles during physical activity than the musculature of an ordinary human. Hence, Sabretooth possesses superhuman stamina in all physical activities.  His natural agility and reflexes are enhanced to levels that are beyond the natural limits of the human body. Sabretooth's agility and reaction time are superior to those of the finest human athlete.\n\nCurrently, Sabretooth's entire skeleton has been artificially infused with the, virtually indestructible, alloy known as Adamantium.  As a result, Sabretooth's bones are unbreakable.", 
    "realname": "Victor Creed", 
    "significantissues": [
        "First battled Wolverine (Wolverine #10, 1989)", 
        "romanced Leni Zauber (Sabretooth: Death Hunt #3, 1993)", 
        "manipulated by Mystique (X-Men Unlimited #40, 2003)", 
        "vs Wolverine, Viper, & Seraph (Wolverine #126, 1998)", 
        "vs Iron Fist (Iron Fist #14, 1977)", 
        "as Slasher, partnered with Constrictor, vs Iron Fist (Power Man and Iron Fist #66, 1980)", 
        "as Slasher, vs Misty Knight (Power Man and Iron Fist #78, 1981)", 
        "as Slasher, vs Power Man (Power Man and Iron Fist #84, 1982)", 
        "employed by Foreigner, vs Spider-Man & Black Cat (Peter Parker: The Spectacular Spider-Man #116/Peter Parker: The Spectacular Spider-Man #119, 1986)", 
        "joined Marauders, participated in Mutant Massacre, vs Wolverine (X-Factor #10/Thor #374/Uncanny X-Men #212-213, 1986)", 
        "during Mutant Massacre, vs Daredevil (Daredevil #238, 1987)", 
        "with Marauders, vs X-Men (Uncanny X-Men #221-222/Uncanny X-Men #240/Uncanny X-Men #243, 1987/1989)", 
        "hunted Morlocks, vs Archangel & Caliban (X-Factor #51-53, 1990)", 
        "vs Caliban, New Mutants, & Cable (New Mutants #90-91, 1990)", 
        "vs Werewolf By Night (Marvel Comics Presents #98, 1992)", 
        "allied with Fenris & Matsu'o Tsurayaba, vs Maverick & X-Men (X-Men #5-7, 1992)", 
        "vs Shiva, reunited with Team X, vs Psi-Borg, killed Silver Fox (Wolverine #60-64, 1992)", 
        "forcibly recruited by Tribune, vs Wolverine (Sabretooth: Death Hunt #1-4, 1993)", 
        "vs Maverick & X-Men, captured by X-Men (X-Men Unlimited #3, 1993)", 
        "escaped, vs Wolverine, almost lobotomized (Wolverine #90, 1995)", 
        "assigned to X-Factor (X-Factor #119, 1996)", 
        "with Mystique, vs Hydra & A.I.M. (Sabretooth and Mystique #1-4, 1996)", 
        "escaped X-Factor's custody (X-Factor #136, 1997)", 
        "vs Omega Red (X-Factor #138, 1997)", 
        "rematch with Power Man & Iron Fist (Marvel Fanfare #6, 1997)", 
        "revealed to have Adamantium, vs Wolverine, allied with him against Hand & Hydra (Wolverine #126-128, 1998)", 
        "battled Wolverine to become Apocalypse's new Horseman Death, lost Adamantium (Wolverine #145, 1999)", 
        "with Darkhold Redeemers, vs N'garai (Darkhold: Pages From The Book of Sins #3-4, 2001)", 
        "with Brotherhood of Mutants, attacked Muir Island, defeated by Bishop (Bishop: The Last X-Man #16, 2001)", 
        "rejoined Weapon X, regained Adamantium (Wolverine #162, 2001)", 
        "attempted to recruit Maverick & Wraith for Weapon X, killed Wraith (Wolverine #166, 2001)", 
        "with Wild Child, attempted to recruit Sunfire for Weapon X (Weapon X: The Draft - Wild Child #1, 2002)", 
        "recruited Omega Red & Lady Deathstrike to attack Wolverine's friends (Wolverine #173-175, 2002)", 
        "vs Agent Zero, forcibly returned to Weapon X (Weapon X #2-3, 2003)", 
        "sent to capture Native, manipulated Wolverine, sided with him against employers (Wolverine #13-18, 2004)", 
        "deceased (Wolverine #55, 2007)"
    ], 
    "speed": 2, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 275
}