{
    "aliases": [
        "Flint Marko", 
        "Sylvester Mann", 
        "Quarryman", 
        "\"Mud-Thing\""
    ], 
    "citizenship": "U.S.A. with criminal record", 
    "content": "He soon became very successful in the New York criminal underworld, but was arrested, convicted, and forced to spend many years in solitary confinement. Upon his released he discovered that his long time girlfriend Marcy Conroy had left him for Vic Rollins, another member of his gang. In a rage he got revenge on Rollins and started a lone citywide crime spree. Marko was captured and placed in a maximum-security wing at Ryker's Island prison but escaped through an unguarded drainage tunnel. With the FBI and police on his tail, Marko traveled south and sought refuge in a place where he was unlikely to be found: an atomic testing site near Savannah, Georgia. As he rested on a nearby beach, the experimental reactor's steam system exploded, bombarding him with a massive dose of radiation and apparently bonding his body with the sand. Awakening after a brief period of unconsciousness, Marko discovered his newly acquired ability to transform into a sand-like substance he could manipulate and reshape at will. Now easily able to elude authorities, the Sandman was born.The Sandman embarked on a criminal career that led him into conflict with Spider-Man, the Fantastic Four, Hulk, and many other heroes. After failing to defeat Spider-Man as a member of the Sinister Six under Doctor Octopus, he joined forces with the Wizard who provided him with a belt that enabled him to produce a variety of dangerous and deadly effects through the injection of various chemicals. The Sandman and the Wizard then teamed with the Trapster to become the core members of the original Frightful Four. The team encountered many defeats at the hands of the Fantastic Four and they soon broke up. Marko later broke out of prison with the Wizard's help, and broke into the Baxter Building, briefly teaming up with Blastaar when he first escaped from the Negative Zone.Marko's criminal career was struck a major blow when he joined forces with Hydro-Man and in a freak mishap combined to form a grotesque, mud-like monster called the \"Mud-Thing\". The creature was subdued by the authorities and transported to a laboratory in Manhattan were scientists sought to analyze the composition of the unusual mud, but determined with the instruments at their disposal that it was inanimate. They decided to seal the substance in a container and dispose of it. As a delayed effect of the analytic procedures, the mud spontaneously separated into the two criminals, who burst free of their container.The ordeal so traumatized Marko that he was stricken with a troubled conscience. Striking up a surprising friendship with the Thing of the Fantastic Four, the Sandman soon talked of abandoning crime. When he encountered Spider-Man fighting the Enforcers, the Sandman made good on his intentions and rescued the wall-crawler. Still a wanted man, the Sandman adopted the alias Sylvester Mann. He rented a room in Coney Island from a suburban family and decided to reform earning money as a contract worker for Silver Sable as a member of her Wild Pack. He joined the Outlaws for their brief time in existence, aiding Spider-Man. Though there was a period of suspicion as to whether his intentions were noble, he gained the public's trust and became a reserve member for the Avengers along with Spider-Man. Granted a pardon for his crimes, he returned to his birth name of William Baker. After he helped the Avengers defeat the sorceress Morgan Le Fay and stop the theft of military equipment, a minor misunderstanding with Captain America caused by his undisciplined temperament lead to his resignation from the reserve Avengers. However, the Sandman was determined to remain reformed. When Doctor Octopus blackmailed him into rejoining the Sinister Six, the Sandman turned against his former ally as soon as he had the chance.Feeling the loss of his partner-in-crime, the Wizard kidnapped Baker and forcibly subjected him to a machine that amplified the underlying dark side of its subject's personality. The violent Flint Marko regained consciousness, and believed he had faked his well-intentioned heroics. He was not to be the Wizard's lackey.The now-villainous Sandman re-formed the Sinister Six to seek revenge on Doctor Octopus, but Venom, turned on his teammates and took a large bite from Sandman. Weakened and poisoned by Venom, Baker began to lose bits of himself until he eventually dissipated. Delirious from his condition, he sought out Spider-Man to exact his final vengeance. In his weakened state he was unable to defeat the wall-crawler. With his last bit of strength, he made peace with Spider-Man and asked that he say goodbye to his mother for him. The despondent Sandman then lost cohesion and was washed away into a New York City storm drain.The Sandman's dispersed body was eventually washed up onto a beach, where his consciousness remained in a coma-like state. Eventually, a television rock concert awoke Sandman, who began to attack the concert-goers. Eventually, the Sandman gathered enough strength to re-form his body, but his mind was still heavily damaged.", 
    "durability": 7, 
    "education": "High school (incomplete)", 
    "energy": 4, 
    "eyes": "Brown\n", 
    "fighting": 5, 
    "firstappearance": "Amazing Spider-Man #4 (1963)\n", 
    "groupaffiliation": [
        "None", 
        "(Formerly) Sinister Twelve", 
        "the Sinister Six", 
        "the Frightful Four", 
        "the Outlaws", 
        "the Intruders", 
        "the Wild Pack", 
        "and reserve member of the Avengers"
    ], 
    "hair": "Brown\n", 
    "height": 73, 
    "id": "Sandman_(William_Baker)", 
    "identity": "Known to legal authorities", 
    "intelligence": 4, 
    "knownrelatives": "Floyd Baker (father), Mrs. Baker (mother), unidentified cousin", 
    "occupation": [
        "Professional criminal", 
        "former adventurer"
    ], 
    "origin": "Amazing Spider-Man #4 (1963)", 
    "placeofbirth": [
        "Queens", 
        "New York"
    ], 
    "powers": "The Sandman possesses the ability to convert all or part of his body into a sand-like substance by mental command. His brain has attained subliminal awareness of all granulated particles of his body. Through conscious effort, he can affect the degree of molecular cohesion between the numerous adjoining surfaces of his particles and thus cause locomotion of discrete volumes, down to the individual grains. His radically mutagenically altered body composition and increased density enable him to compact or loosen the particles of sand that make up his form. Consequently, the Sandman can become as hard as sandstone, or disperse his body so that he becomes invulnerable to physical attacks. He can shape his sand-state body into any continuous shape he can imagine. He can project his sand particles outward at high speeds and, when in the shape of a bulky object, with the impact of a large sandbag.\nThe Sandman is vulnerable to temperatures over 3,400 degrees Fahrenheit. Such temperatures can cause his highly impure silicate composition to fuse into amorphous silicate (glass). The Sandman maintains mental control of the particles of which his body is composed so that he can reform his scattered grains unless a substantial portion of his body mass has been isolated. Apparently, he can also convert common grains of sand around him into constituents of his body to replenish portions he might lose track of during battle. In this manner, he can increase his overall size and volume (to some as yet unknown limit), or that of his limbs.\nThere appears to be no limit to how long the Sandman can remain in his sand-state. If he were to be rendered unconscious while in his sand-state, he would remain in that state, although the relaxing of his control over his particles would cause him to become an amorphous pile of sand.\n\nThe Sandman's mind continues to function in astral form even when he has turned his head into sand and even when the particles of sand that composed his brain are widely scattered. The limit to how far the particles of his brain can be dispersed before he is unable to reassemble is not yet known.", 
    "realname": "William Baker", 
    "significantissues": [
        "Joined Sinister Six (Amazing Spider-Man Annual #1, 1964)", 
        "merged with Hydro-Man to become \"Mud Thing\" (Amazing Spider-Man #217-218, 1981)", 
        "first pangs of conscience (Marvel Team-Up #138, 1984)", 
        "aided Silver Sable (Amazing Spider-Man #280, 1986)", 
        "joined the Wild Pack (Amazing Spider-Man #303, 1988)", 
        "joined the Outlaws (Web of Spider-Man #50, 1989)", 
        "forced to rejoin the Sinister Six (Amazing Spider-Man #334, 1990)", 
        "joined the Avengers (Avengers #329, 1991)", 
        "quit the Avengers (Amazing Spider-Man #348, 1991)", 
        "returned to the Avengers (Avengers #332, 1991)", 
        "joined the Sinister Six against Doctor Octopus (Spider-Man #18, 1992)", 
        "criminal psyche restored by the Wizard (Peter Parker: Spider-Man #12, 1999)", 
        "bitten by Venom and poisoned (Peter Parker: Spider-Man #16, 2000)", 
        "body disintegrated(Peter Parker: Spider-Man #22, 2000)", 
        "recovered strength by eating pop stars (Peter Parker: Spider-Man #42, 2002)", 
        "personality split (Peter Parker: Spider-Man #56, 2003)", 
        "sought to rescue and exonerate father (Friendly Neighborhood Spider-Man #17 -19, 2007)"
    ], 
    "speed": 4, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 240
}