{
    "add": {
        "doc": {
            "aliases": [
                "Box", 
                "Wanda Langkowski"
            ], 
            "citizenship": "Canada", 
            "content": "Alpha Flight’s roster would change frequently over the years as they went through phases of government contracts and independent action. Walter studied many incoming operatives, who were generally assigned to training teams Beta and Gamma Flight, for Department H. One operative, later known as Wild Child, had a very unstable genotype and psychosis, but the government shoe-horned him into the program anyway. Langkowski buried Wild Child’s unstable results, figuring he would handle them at another time, though he never put much thought into it. In Alpha Flight’s earliest missions, Sasquatch battled the X-Men, the Hulk, Sunset Bain, Machine Man, Tundra of the Great Beasts, Ranark the Ravager and Wendigo. Sasquatch also participated in the \"Contest of Champions\" organized by the Grandmaster and Death, and, as one of the Grandmaster’s operatives, battled the Chinese Collective Man to a stalemate. Langkowski was consulted by the Fantastic Four for his radiation expertise, and battled the Dire Wraiths, Omega Flight (in a battle where Hudson was believed killed) and the Collector.Becoming fast friends with the diminutive Puck, Walter started a romantic relationship with the light-powered Aurora, a fact her twin Northstar resented immensely. Walter and Aurora’s relationship became complicated when Aurora began struggling with split personalities, one that liked Walter and one that didn’t. In the process of trying to help Aurora retain her more outgoing personality, Walter altered her mutant powers. Sasquatch discovered his ability to quickly heal from injuries after he broke his arm in a battle with the Super-Skrull.Langkowski eventually began struggling with a more bestial side of his nature during various battles, and feared he was becoming more like the Hulk. When his aunt, Lillian Von Loont, left Walter a mansion on Tamarind Island, Walter and Aurora investigated only to battle Loont, who had become the cyborg madwoman Gilded Lily. This mansion would later serve as Alpha Flight’s headquarters for a time. Sasquatch, alongside Alpha Flight and the X-Men, was temporarily cured of his rages by a Loki-possessed Madelyne Pryor.Snowbird, whose mission it was to slay the ancient Great Beasts who had roamed the Earth before mankind, discovered that Walter’s Sasquatch form was actually Tanaraq, and Walter was now losing control. Left with no choice, Snowbird followed Alpha Flight’s battle with Caliber and slew Sasquatch by ripping out Tanaraq’s heart. Alpha Flight pursued Walter’s soul into the realm of the Great Beasts and battled their leader, Somon who killed Aurora, Northstar and Talisman before Langkowski used his life-force to resurrect them. Shaman helped preserve Walter’s soul as they transported back to Earth, only to discover that Walter’s body had been destroyed completely. Walter’s soul took over the Roger Bochs created Box armor as a temporary home and continued aiding Alpha Flight. Seeking a physical body, Walter entered the interdimensional Crossroads and briefly possessed the Hulk, but his soul was left adrift when he refused to displace his old friend Bruce Banner’s spirit. Months later, Walter found Omega Flight’s now-mindless Smart Alec in the Crossroads, possessed him, and returned to Earth.During his absence, Snowbird had been killed, and the evil Pestilence had reanimated her albino Sasquatch form and attacked Alpha. Walter inhabited the Box armor again and aided his team, who were shocked to find him alive. At the battle’s end, Smart Alec’s form had been crushed and the Sasquatch form left empty, so Walter transferred his soul to the Sasquatch form; however, when he returned the Sasquatch body to human state, he found himself in a woman’s form. Deciding to call himself Wanda, Langkowski rejoined the team, possessing none of Snowbird’s powers except the ability to transform into the Sasquatch. Aurora was distressed at Langkowski’s return as a woman and attempted to get the flesh-altering Lionel Jeffries to alter Wanda’s form to a man again, but this failed due to Wanda’s body having Snowbird’s godly attributes. Wanda struggled to adjust to her new form, and, after batting Bedlam, was overcome by a mysterious force and helped resurrect four of the Great Beasts. Overcoming the temptation to join them, Sasquatch helped Alpha Flight banish the Beasts back to their realm. After brief jaunts through space and Dream Queen’s dimension, Wanda sought to reclaim Langkowski’s fortune to help fund Alpha Flight, but the fortune had been willed to Veronica; unable to prove she was Walter, Wanda left the fortune in Veronica’s hands. In final battle with the Dream Queen, Sasquatch was bewitched to be loyal to the villain until Snowbird’s spirit freed Sasquatch from the spell and changed Wanda’s form back into Walter’s; this also changed the albino Sasquatch form back into the orange one, and enabled Walter to reclaim his fortune.The team battled Llan the Sorcerer, a villain who briefly broke both of Sasquatch’s arms (though the injury soon healed). When Alpha Flight restructured itself, Sasquatch was assigned to both Alpha Flight and Gamma Flight, in the latter as Biotech research and development. When Wild Child joined the team as Weapon Omega, Walter struggled with guilt over his part in Wild Child’s origins and the truth soon came out, causing several team members to distrust Sasquatch. Alpha Flight continued to act as super-heroes despite breaking ties with the Canadian government over the newly instituted Super Powers Act. Struggling with all he had lost over the years by devoting all his time to Alpha Flight, Sasquatch was easily drawn into following the mystical Goddess, the \"good\" side of Adam Warlock’s soul, who controlled Sasquatch and others into battling fellow heroes for her cause. Remembering his doubts regarding religion, Sasquatch shook off the Goddess’s influence with Shaman’s help, and the Goddess was soon defeated.Though Alpha Flight soon disbanded, Walter continued his gamma ray research at Project Michelangelo in Antarctica. Months later, the mercenary Deadpool attacked the base and caused the core to overload, endangering the entire world, so Sasquatch and Deadpool teamed up to shut it down. The Canadian government, in forming a new Alpha Flight, discovered a true bestial Sasquatch in the woods and assumed it was Walter. Finding ways to subdue the beast, they had this Sasquatch participate in team missions until it was killed while battling Ecliptic’s Zodiac, and the team held a funeral for Walter. Still in Antarctica and unaware of the new team, Walter discovered corruption in the Canadian government. Sasquatch helped gather some of the original team and the group exposed the corrupt government program, then stayed on to rejoin Alpha Flight. While aiding Wolverine (actually a Skrull imposter)in a battle against A.I.M. (Advanced Idea Mechanics), Alpha Flight was shocked to find Snowbird alive again. Walter and Aurora became romantically involved once more, but Aurora was soon terrorized by Mauvais and kidnapped by the corrupt Weapon X program, leaving no trace of her whereabouts. When Alpha Flight went up against the X-Men again, Sasquatch briefly donned battle armor that allowed him to defeat a weakened Juggernaut.", 
            "durability": 7, 
            "education": "Ph.D. in physics from the Massachusetts Institute of Technology; Bachelors degree from Pennsylvania State University", 
            "energy": 7, 
            "eyes": "(as Walter and Wanda) Blue, (as Sasquatch) red\n", 
            "fighting": 7, 
            "firstappearance": "X-Men #120 (1979)\n", 
            "groupaffiliation": [
                "Omega Flight", 
                "formerly Alpha Flight", 
                "Beta Flight", 
                "Gamma Flight", 
                "Howling Commandos"
            ], 
            "hair": "(as Walter) Blonde; (as Sasquatch) orange; (as Wanda) white\n", 
            "height": 0, 
            "id": "Sasquatch_(Walter_Langkowski)", 
            "identity": "Secret", 
            "intelligence": 7, 
            "knownrelatives": "Veronica Langkowsi (ex-wife), unidentified son, Lillian von Loont (Gilded Lily, great-aunt, deceased)", 
            "occupation": [
                "Adventurer", 
                "bio-physicist", 
                "government operative", 
                "former college lecturer", 
                "professional football player"
            ], 
            "placeofbirth": [
                "Edmonton", 
                "Alberta", 
                "Canada"
            ], 
            "powers": "In his Sasquatch form Langkowski possesses vast superhuman strength and heightened endurance. When completely possessed by Tanaraq, Sasquatch was several times as powerful. Sasquatch is also highly agile and able to jump great distances. His resistance to conventional injury is superhuman in this form.\nEarly in his career, changing from his human form into his Sasquatch form caused Langkowski extreme physical discomfort. To alleviate the pain, Langkowski recited a slow mantra which served the same purpose as a yoga practitioner concentrating to calm the body and to divorce pain from the physical body. Since taking over Snowbird's original body, he can now achieve his Sasquatch form with relative little pain or effort.", 
            "realname": "Walter Langkowski", 
            "significantissues": [
                "First appearance, fought X-Men (X-Men #120, 1979)", 
                "fought Omega Flight (Alpha Flight #12, 1984)", 
                "killed by Songbird (Alpha Flight #23, 1985)", 
                "resurrected in Snowbird's body, became Wanda Langkowski (Alpha Flight #45, 1987)", 
                "transformed back into male body (Alpha Flight #68, 1989)", 
                "assembled new team (Alpha Flight #1, 2004)", 
                "time-travel chaos (Alpha Flight #9-12, 2004-2005)", 
                "apparently deceased (New Avengers #16, 2006)"
            ], 
            "speed": 7, 
            "strength": 7, 
            "universe": "Marvel Universe", 
            "weight": 245
        }
    }
}