{
    "add": {
        "doc": {
            "aliases": [
                "Supreme One", 
                "Satannish the Supreme", 
                "Master of Souls", 
                "Mister Cloot", 
                "Satan", 
                "numerous others"
            ], 
            "citizenship": "Hell dimension ruler", 
            "content": "Heroic sorcerer Doctor Strange has sometimes invoked Satannish's power, but has never entered the demon's service; he first encountered Satannish when minor mystic Lord Nekron tried unsuccessfully to sacrifice Strange's soul to Satannish in place of his own. Shortly thereafter, a faction of the Sons of Satannish cult led by Asmodeus (secretly Strange's old medical colleague, Dr. Charles Benton) tapped Satannish's power in a world-threatening scheme thwarted by Doctor Strange, the Black Knight and the Avengers. Dying of a heart attack in battle with Strange, a resurrected Asmodeus later tried to win back his life and soul by seeking the souls of the Defenders, but he was defeated and Satannish claimed him. Satannish's subsequent schemes have been opposed by champions such as Strange, Daimon Hellstrom, Luke Cage, the Hulk, the Avengers (who twice fought the Satannish-empowered Hangman) and Hellcat.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "unrevealed\n", 
            "fighting": 1, 
            "firstappearance": "Doctor Strange #174 (1968)\n", 
            "groupaffiliation": [
                "Hell-lords", 
                "Master of the Sons of Satannish and other mortal pawns", 
                "former manipulator of the Lethal Legion", 
                "Night Shift and the Six-Fingered Hand", 
                "possible member of the Lords of the Splinter-Realms", 
                "Maggia (alleged founder)"
            ], 
            "hair": "unrevealed\n", 
            "id": "Satannish", 
            "identity": "Unknown to most of humanity", 
            "intelligence": 1, 
            "knownrelatives": "Presumptive relationship to other Hell-Lords; quasi-paternal relationship to Daimon and Satana Hellstrom; alleged (perhaps metaphorical) relationship to Dormammu", 
            "occupation": [
                "Enslaver of souls", 
                "ruler of own Hell realm", 
                "embodiment of evil"
            ], 
            "placeofbirth": [
                "Unknown", 
                "possibly Dark Dimension"
            ], 
            "powers": "Satannish's vast mystical powers include teleportation; interdimensional travel; near-limitless command of time, space and matter; illusion-casting; size and shape-changing powers (his true form is unknown); destructive mystical force bolts; demonic possession; and incalculable strength and durability. Satannish often has difficulty manifesting on the earthly plane, and his powers decrease outside of his home dimension.", 
            "realname": "Satannish", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}