{
    "aliases": [
        "Gypsy Witch", 
        "Wanda Frank", 
        "Wanda Magnus", 
        "Ana Maximoff"
    ], 
    "citizenship": "Transia (U.S. naturalized)", 
    "content": "Kept in stasis by the Evolutionary for decades, the two infants were later placed in the custody of a Gypsy couple named Django and Marya Maximoff. When Wanda and Pietro were teenagers and had already manifested their mutant powers, their family's encampment was attacked, leaving Marya dead; Django survived, but was separated from his children, while the traumatized Wanda and Pietro also fled, believing their foster father to have died. After several months of surviving on their own in the woods, the siblings ventured into a nearby town, where Wanda's powers inadvertently set fire to a house. Set upon by villagers who believed the pair to be \"in league with the Devil\", they were rescued by the timely arrival of Magneto, the mutant master of magnetism. Magneto was in fact their father, but neither he nor the siblings were aware of this at the time. Exploiting the pair's gratitude, Magneto pressed them into service as part of his anti-human terrorist unit, the Brotherhood of Evil Mutants.Now known as the Scarlet Witch and Quicksilver, Wanda and Pietro accompanied Magneto and his fellow mutants in their power-seeking efforts, clashing with the heroic X-Men. After a time, the siblings, disillusioned with Magneto and feeling that their debt to him had been paid, decided to abandon their terrorist activities; alongside the archer and ex-criminal Hawkeye, they joined the Avengers under the leadership of Captain America. As a member of this foursome, the first major reorganization of the still young super-team, the Scarlet Witch served with distinction against such foes as Dr Doom, the Mole Man, Kang, and others.As the team expanded, the Scarlet Witch, despite her brother's disapproval, became romantically drawn to one of her fellow Avengers, the android known as the Vision. To better control her power, she began taking sorcery lessons from the witch Agatha Harkness, and after both she and the Vision had built their confidence, the couple married. At the time, none of the Avengers realized the Limbo lord Immortus, who sought to arrange events so the Scarlet Witch would never have children whose power would grow to be a threat, had subtly encouraged the marriage.Some time later, Magneto returned to Wundagore, searching for his past, and casually learned, from the lips of Bova herself, the truth about Wanda and Pietro. Excited to finally know the truth, Magneto traveled to Attilan, home of the Inhumans in Earth's Moon, where Wanda had traveled to in order to meet her newborn niece, Luna. Magneto told the pair the news, and held his granddaughter in his arms.When the Baxter Building was threatened by the Negative Zone warlord Annihilus, the Scarlet Witch and the Vision returned to active duty. Weeks later, when most of the Avengers were trapped in the Secret Wars, the Vision was named Chairman of the team. He used his position to create a second branch of Avengers, placing them in the West Coast of the United States. Vision's mind was affected by an interface with the Titanian computer ISAAC, and he launched an attempt to take control of the world's computers, an effort stopped by the Avengers. The Vision and the Witch then left active Avengers duty once more. Although the couple sought only to live in domestic peace, they found themselves repeatedly drawn into clashes with several super-villains. During one such encounter, a battle with the sorcerers known as Salem's Seven, the Scarlet Witch used accumulated magic energy to become pregnant by the Vision, and she later gave birth to twin sons, William and Thomas.With Agatha Harkness's help, the Scarlet Witch learned of her nature as a Nexus Being and was able to drive off an extradimensional invasion by another Nexus Being, Lore. When the West Coast branch of Avengers disbanded due to internal conflict in the overall team, several members formed a new team known as Force Works, and the Scarlet Witch was appointed leader. During their first mission, her mutant powers interfered with the teleportation of the alien known as Century, bringing him to Earth. Century joined the Force Works team, and did not hide his feelings for the Scarlet Witch, which she seemed to reciprocate. However, the team disbanded before they could actually express their feelings, and Wanda returned to the Avengers. She was among those who were seemingly destroyed by the psionic being Onslaught. In fact, they were transported to an alternate universe created by the powerful mutant Franklin Richards. She and her fellow heroes remained there for months before returning to their home universe. The centuries-old sorceress Morgan Le Fay came across the Twilight Sword of Surtur, and was able to gather the Norn Stones. She then created a series of attacks on the Avengers to capture Wanda in the process. Using Wanda's mutant powers, she was able to pierce the gap between her Celtic magic and the Asgardian magic of the Twilight Sword, with it she remade the world in her image, turning the Avengers into the Queen's Vengeance. Subsequently, while held captive by Morgan Le Fay, the Scarlet Witch, in attempting to summon the other Avengers, inadvertently caused Wonder Man to partially cross over from the world of the dead. Channeling the willpower of the Avengers through Wonder Man, Morgan was defeated and the world returned to normalcy.While battling the Squadron Supreme, Wanda was once again able to call Wonder Man, and the deceased Avenger was able to return when Wanda was in danger, whether conscious or not. Wanda was also able to feel Morgan's magic within her still, even long after the sorceress had been defeated. Confused, Wanda sought the guidance of Agatha Harkness once more. Agatha revealed it was not Morgan's magic, but her own power that had matured before its time. Agatha then revealed that it was Chthon who had imbued in her the potential to wield magic, if not for his involvement, she would have been a mere energy-wielding mutant like her father. She was linked to Chthon's chaos magic, and that was the true source of her mutant power, though she wielded it in an unschooled manner. Agatha told her she had to control it and guide it, instead of allowing her subconscious to direct her \"chaos-grenades\", that she needed to understand her full power and subsume it within her, or the results could very well be disastrous. Wanda asked Agatha how she could bring back Wonder Man to life for good, and her mentor laughed saying Wonder Man had held on because he loved her, and all she had to do to bring him back was love him in return. Soon after, Wanda used her powers to bring back Wonder Man to life, as well as Wonder Man's brother, the Grim Reaper. She and Wonder Man began to pursue a romantic relationship.With Iron Man severely injured, Thor preoccupied with his alter ego, and Captain America missing, the rest of the team appointed her as Deputy Leader, even though she had been considering leaving the Avengers. Wanda led the Avengers in the Captain's absence, focusing her energies on improving the morale and efficiency of the team. During this period, Wanda began using her powers in new ways, fighting diseases, healing wounds and even creating sickness in her enemies.After several months of almost no progress in restoring her stability, The X-Men and the Avengers gathered to decide Wanda's fate. Quicksilver, suspecting that the inevitable conclusion would be to kill her, convinced Wanda to alter reality into a utopian world where all of the heroes and Magneto would have what they wanted. Wanda did, creating a reality where Magneto was the head of a mutant empire and humans were the minority. Eventually the heroes discovered the ruse and, believing Magneto to be responsible, attacked him at his fortress in Genosha. When Magneto learned that Quicksilver was the instigator of the warp, Magneto turned on him in anger. Distressed by all the fighting and her father's hatred of humanity, Scarlet Witch revived Quicksilver and muttered three simple words: \"No More Mutants,\"  sending reality back to normal, but reducing the mutant population from millions to an estimated 198. Wanda has since been living on Wundagore mountain in apparent powerless obscurity.  Thus far only Hawkeye, seeking closure after his multiple deaths and resurrections at Wanda's hand, has sought her out.", 
    "durability": 3, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "X-Men #4 (1964)\n", 
    "groupaffiliation": [
        "Formerly Avengers", 
        "Avengers West Coast", 
        "Brides of Set", 
        "Brotherhood of Evil Mutants", 
        "Force Works", 
        "Lady Liberators", 
        "Secret Defenders", 
        "former student of Agatha Harkness"
    ], 
    "hair": "Auburn\n", 
    "height": 67, 
    "id": "Scarlet_Witch", 
    "identity": "Publicly known", 
    "intelligence": 3, 
    "knownrelatives": "William \"Billy\" Kaplan (Wiccan, son), Thomas Shepherd (Speed, son), Pietro (Quicksilver, brother), Anya (sister, deceased), Magnus (Magneto, father), Magda (mother, presumed deceased), Lorna Dane (Polaris, half-sister), Vision (estranged husband), Maximoff, Django (foster father, deceased), Maximoff, Marya (foster mother, deceased), Crystal (sister-in-law), Maximoff, Luna (niece), Talia Wagner (Nocturne, alternate timeline daughter)", 
    "occupation": [
        "Adventurer", 
        "formerly witchcraft tutor", 
        "housewife", 
        "terrorist"
    ], 
    "origin": [
        "Avengers #187 (1979)", 
        "Avengers #234 (1983)"
    ], 
    "placeofbirth": [
        "Wundagore Mountain", 
        "Transia"
    ], 
    "powers": "The Scarlet Witch can tap into mystic energy for reality-altering effects; this power was formerly limited to the creation of \"hex-spheres\" of reality-disrupting quasi-psionic force to cause molecular disturbances in a target's probability field, resulting in spontaneous combustion, deflection of objects in flight, and so on.  She later became able to alter reality on a far greater scale, creating entire armies of enemies from nowhere.  Although the Scarlet Witch has been trained in basic sorcery techniques, she lacks the specialized mystic training required to fully control her power.", 
    "realname": "Wanda Maximoff", 
    "significantissues": [
        "With Brotherhood of Evil Mutants, vs X-Men (X-Men #4-7, 1964)", 
        "joined Avengers (Avengers #16, 1965)", 
        "began romance with the Vision (Avengers#108-109, 1973)", 
        "began study of sorcery under the tutelage of Agatha Harkness (Avengers #128, 1974)", 
        "married Vision (Giant-Size Avengers #4, 1975)", 
        "learned full story of her adoptive parents, possessed by Chthon (Avengers #185-187, 1979)", 
        "learned Magneto was her father (Vision & the Scarlet Witch #4, 1983)", 
        "gave birth to mystically conceived twins (Vision and the Scarlet Witch #12, 1986)", 
        "joined West Coast Avengers (West Coast Avengers #34, 1988)", 
        "Vision dismantled (West Coast Avengers #42-45, 1989)", 
        "lost children to Master Pandemonium and Mephisto, went insane, joined forces with Magneto (Avengers West Coast #51-57, 1989-1990)", 
        "captured by Immortus, rescued by Avengers restored to sanity (Avengers West Coast #60-62, 1992)", 
        "learned of Nexus Being nature (Scarlet Witch #1-4, 1994)", 
        "quit Avengers (Avengers West Coast #102, 1994)", 
        "became leader of Force Works (Force Works #1, 1994)", 
        "returned to the Avengers (Avengers #397, 1995)", 
        "fought Onslaught (Onslaught: Marvel Universe, 1996)", 
        "captured by Morgan Le Fay (Avengers #1, 1998)", 
        "inadvertently restored Wonder Man to life (Avengers #3, 1998)", 
        "brought back Wonder Man to life completely (Avengers #11, 1998)", 
        "elected Deputy Leader (Avengers #13, 1999)", 
        "revelation of Immortus involvement in her wedding and Vision's dismantlement (Avengers Forever #8, 1999)", 
        "went insane, vs Avengers (Avengers #500-503, 2004)", 
        "reshaped the world in her father's image (House of M #1, 2005)", 
        "\"No More Mutants\" (House of M #7, 2005)"
    ], 
    "speed": 3, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 132
}