{
    "add": {
        "doc": {
            "aliases": [
                "Father Set", 
                "the Great Serpent", 
                "Serpent God"
            ], 
            "citizenship": "Inapplicable", 
            "content": "Approximately 1 million years BC, Sligguth spawned the Serpent Men, reptilian humanoids serving as Set's agents on Earth, and the similar-looking Dragon Kings. Set's other children include Ishiti, who begat the Man-Serpents with snake-like bodies and human heads adorned with snakes in place of hair; Phorcys, who begat Echidna, the parent to the giant, magically-powered Snakes of Many Colors and many monsters of Olympian (Greek) mythology; the cosmically powerful Dragon of the Moon; Tartessus, progenitor to the Snake Clan; and Yamato-no-Orichi, the eight-forked serpent of the Kami (Japanese gods). A pair of early Serpent Men, granted increased intellect by Set, infiltrated a verdant haven created by the time-traveling sorcerer Sise-Neg for a pair of pre-human anthropoids. Descendants of these humanoids visited the haven annually as part of their tribe's migration, and the tribe leader and his mate encountered the Serpent Men (disguised as anthropoids) who tried to convince them to worship Set, offering warmth and protection in exchange for slaying their own tribesmen as food for Set, and bringing Sets tribe to see upcoming \"visitors from the sky.\" Refusing, the anthropoids attacked the invaders, exposing them as Serpent Men and driving them from the haven. Immediately afterward, the \"visitors from the sky\"— the First Host of the Celestials — arrived. Gaea guided the man-apes to the Celestials, who studied them and experimented upon them, genetically diverging mainstream humanity, the Eternals, and the Deviants. The Serpent Men asked a boon of the Celestials but were driven off by Arishem the Judge.Long before the dawn of humanity, the Serpent Men created the Cobra Crown via power drawn from Set to create \"an empire of the Earth\" from the land that would become Valusia. The Crown was worn by Serpent Men kings but eventually proved defective and was hidden under a black shrine to Tsathoggua, a toad-demon ally of Set's. It was guarded by a living stone idol of the Toad-God on the Nameless Isle and would not be found for millennia. Set also empowered the lesser-powered Serpent Amulet and other talismans.Some members of the Elder Race — a seemingly humanoid race predating humanity and composed of numerous wizards—such as Thulsa Doom, as well as certain sects of Deviants, worshiped Set as their god. As Homo sapiens emerged, the Serpent Men enslaved them for an epoch while vying with the Deviants and other empires;demonic races, such as the N'Garai and Undying Ones; or Elderspawn (descendants of the Elder Gods), such as Harpies, Spider People and Wolf Men. Circa 18,500 BC, the Serpent Men were opposed by Valusia's King Kull, who would become one of their greatest-foes, bringing them to the verge of extinction. Kull slaughtered a sect of Set-worshipers and ordered the death of twin infants they had magically created, but they were mercifully spared; the twins, Narcta and Alexus, would achieve vast mystical power before being destroyed 8000 years later.500 years after Kull's time, when the Deviants had established an advanced empire in Lemuria and conquered much of the Earth, human alchemist Atra sought to overthrow them, allying with Serpent Men to create the Serpent Crown. Set empowered the Serpent Crown and linked it to his mind as a replacement for the Cobra Crown. Atra donned the Crown, but Set then transferred his allegiance to the Deviants, refusing to allow the Crown's power to be used against them. Deviant emperor Phraug, emboldened by their new deity, ordered an attack against the Second Host of Celestials, who had returned for follow-up investigation of the human race. The Celestials shrugged off Phraug's attack and caused a massive nuclear explosion that destroyed the Lemurian continent as well as damaging Atlantis. As a result, the Great Cataclysm devastated the planet, ending this stage of world history. Atra and Emperor Phraug were dead center under the main explosion and died instantly, but the Celestials' power preserved their skeletal remains, left clutching the Serpent Crown as a warning about pride.Some Serpent Men survived the Great Cataclysm, but later humans took much of the remaining Serpent Men-ruled territory, setting up the kingdom of Stygia in the process, as well as Acheron, circa 15,500 BC. Set was worshiped by the peoples of Stygia and Acheron (as well as Eldoran and other places). Many of the sorcerers there worshiping Set formed the Black Ring coven. Eventually, Acheron was toppled, but Stygia survived. In the succeeding millennia, Set would also be worshiped by Kushites, degenerate cults in mountains between Nemedia and Aquilonia and remnants of Stygian civilization in Shem. Over time Set developed alliances with dark gods, such as Nexxx, as well as fierce enmities with other gods, such as Mitra and the bird-headed Ibis (possibly a manifestation of Thoth);and other demons, such as Xka'Ahk and the spider god Omm. Set also guided the development of his descendent the Midgard Serpent (Jormungand) of Asgardian mythos.Circa 10,000 BC the mysterious \"Dragon of Set\" menaced the town Solvantha until being driven off by Cimmerian sorcerer Rham-Skot, who created the Sword of Graven. The Cobra Crown was eventually recovered from the Nameless Isle by the legendary barbarian Conan who destroyed the Tsathoggua idol, but the Crown was later claimed by Thoth-Amon, then leader of the Black Ring. Thoth-Amon attempted to usurp the leadership of Zingara from King Ferdrugo, but another would-be usurper, Villagro, seized the Crown for himself. Villagro's untrained mind caused the Cobra Crown to burn itself out, rendering it useless, and Thoth-Amon fled. Set later seduced the turncoat Mitraic priestess C'harona with promises of power, and C'harona manipulated the people of D'eim to build a tower to Mitra, which was actually a drill used to free rat-like demons serving Set. C'harona became a powerful harpy, but Conan slew her, and the demons perished under the collapsing false tower. Conan opposed and slew many of Set's followers in the Black Ring and elsewhere. Eventually,Conan became king of Aquilonia, and he and his son Conn eradicated the last stronghold of the Serpent Men, though a few others survived.Following the end of the Hyborian era, circa 8000 BC, Set's worship continued in what was Stygia (which eventually developed into Egypt as further cataclysms reshaped Earth), but an upstart Ennead death god, Seth, adopted serpentine form and impersonated Set, usurping his followers; trapped in his extradimensional realm, Set writhed in vain frustration. Egyptians would later mistake the immortal mutant En Sabah Nur (later Apocalypse) for both Set and Seth.", 
            "durability": 7, 
            "education": "Inapplicable", 
            "energy": 7, 
            "eyes": "Red\n", 
            "fighting": 7, 
            "firstappearance": "Sub-Mariner #9 (1969)\n", 
            "groupaffiliation": "None", 
            "hair": "None\n", 
            "height": 0, 
            "id": "Set", 
            "identity": "The public is largely unaware of Set’s existence", 
            "intelligence": 7, 
            "knownrelatives": "Demiurge (father); Chthon, Equus, Gaea, Isuus, other Elder Gods (siblings); Damballah, Sligguth, Ishiti (offspring); Children of Ishiti, Dragon Kings of Lemuria, Snakes of Many Colors (descendants)", 
            "occupation": [
                "Elder God", 
                "demon"
            ], 
            "origin": [
                "Thor Annual #10", 
                "Silver Surfer Annual #2"
            ], 
            "placeofbirth": "Nascent Earth", 
            "powers": "Set is an ancient Elder God of great power, limited only by his inability to leave his pocket dimension and manifest totally on Earth. Sorcerers calling upon the power of Set have been capable of performing a wide variety of powerful magic. Those wearing the Serpent Crown were also granted power, such as levitation, mind blasts, and telepathic communication and mind control. Set could taint the minds or otherwise influence those in the presence of the Serpent Crown and was able to control minds of its bearers to some extent.", 
            "realname": "Set", 
            "significantissues": "vs. the Thing, Stingray, and the Scarlet Witch for control of the Serpent Crown (Marvel Two-In-One #64-66, 1980)", 
            "speed": 7, 
            "strength": 7, 
            "universe": [
                "Marvel Universe", 
                "Earth-712"
            ], 
            "weight": 25
        }
    }
}