{
    "aliases": [
        "Set", 
        "Serpent God of Death", 
        "Typhon", 
        "Lord of the Unliving", 
        "Setesh", 
        "Setekh", 
        "Suty", 
        "Sutekh", 
        "Set-Nubti", 
        "Great Enemy"
    ], 
    "citizenship": "of Heliopolis", 
    "content": "The god Osiris was the ruler of ancient Egypt and his wife is Isis, goddess of fertility. It was said that Seth was the offspring of these two Heliopolitan gods, but this statement has been proven false. Seth, in actuality, wanted to overthrow Osiris and claim himself ruler of the Gods of Heliopolis. Seth’s bloodlust was fueled even futher when his own wife, Nephthys, had a son, Anubis, with Osiris. Seth hatched a plan that enabled him to trick Osiris into entering a coffin and seal him away in a hidden location. However, Isis had eventually found the coffin, but Seth would not be denied his vengeance. He dismembered Osiris' body into fourteen pieces and placed them in several places throughout Egypt. Isis would not have her husband disrespected that way, so she gathered up all of the pieces and used an ancient, forgotten magic to make her husband whole once more. Once resurrected, Osiris ordered his sons Anubis and Horus, who also helped with their father’s return, to find Seth so that he may pay for his betrayal.Seth and Osiris battled for many years, and in the end, Seth used deception to achieve his victory. Osiris, Isis and Horus were trapped within a pyramid that Seth sank under the sands. Seth then took control of the other-dimensional city of Heliopolis, and claimed that his enemies would never be free to plague him again. Seth also boasted that the only way they would be freed is if their ancestor, Atum-Re, were to return to Earth. The overthrown Heliopolitan gods stayed buried for many years until the pyramid was discovered in the United States. It was at this time that the three trapped deities used their magic to convince Odin, ruler of Asgard that he was Atum-Re so that they may be free once more. The son of Odin, the mighty Thor, wanted the Heliopolitan gods to remove the spell they cast, so he traveled with them to Heliopolis to confront the death god. The five of them battled Seth's skeleton army, and Thor was convinced how great a threat Seth was, so he engaged him in battle directly. During their battle, Odin projected an energy blast at Seth that destroyed his right hand and led him to be defeated. Osiris then cast Seth off the Golden Bridge of the Gods and reclaimed leadership of Heliopolis when Seth was swallowed up by the ground below.Sometime later, Seth returned and captured his brother once more. He also captured his brother’s wife and son, Horus who he planned to sacrifice to gain control of a demon called the Devourer. Unfortunately for Seth, the Devourer turned against him, and it took the combined might of Thor and the Thing to defeat it. With Seth defeated, Osiris and his family were freed. Soon after, Seth formed an alliance with Mephisto and others who ruled the land of the dead such as Pluto and Hela to merge their realms into an individual realm of the dead so that their powers would be united. When these gods of the dead used their powers to unite the realms, Demogorge, the God-Eater was summoned and he ate Seth and the others. If not for Thor, Seth and the other gods of the dead would not have been saved. Fearing to release Demorgorge again, these individuals ended their alliance.After, the Rainbow Bridge had been destroyed severing the path between Earth and Asgard, Seth sent his armies to invade Asgard just as he sent his minion Grog the God Crusher to Earth to assassinate Thor. However, Thor was on the Avengers floating headquarters, Hydrobase, and when Grog attacked and Thor was assisted by the Black Knight and the Captain. Between the three of them, Grog's forces were defeated and Grog was taken to the former prison for superhuman criminals, the Vault. After that, while Thor was attacked at a construction site by an assassin named Mongoose, the gods of Asgard sent Hogun, the Grim to Earth to find Thor and tell him of Seth's invasion. Hogun did arrive on Earth, but his senses were scrambled and everyone around him appeared to be a threat which led him to a conflict with Daredevil and the police. The police gunned him down despite the protests of Daredevil, and Hogun had to be taken to the hospital where he was close to death. At the hospital, Seth made a bargain with three mortals who also lied at death's door. He gave them incredible power and a vow to let them continue to live if they killed Hogun. Together these three, known as Earth Force, had an inevitable run in with Thor who was at the hospital once he got word that Hogun was there. Even though they had Thor beaten, two of the three members decided that they should rethink their position and leave before they did something they would regret. Hogun was confronted by Seth the realm of death and refused to surrender his life, so Seth assaulted Hougun leaving his mark upon him.Thor saved the life of Hogun with a blood transfusion, and then received the news about Asgard’s recent troubles. Earth Force then returned asking to be granted a second chance to show they are not truly evil, and that they were tricked by Seth into attacking Thor. The group traveled to the Vault where they questioned Grog who was being watched by the Black Knight. Grog opened a portal to the realm of Seth in order to escape, but the heroes followed. During the resulting battle, Balder decided that the power of Thor must be brought back to Asgard in order to defend themselves against Seth's armies, Thor's powers were siphoned off and given to Balder leaving Thor at the mercy of Grog. It wasn’t long before the rest of the heroes, except for Wind Warrior, were captured. With the heroes in captivity, Seth launched his attack on Asgard. Thor and the others eventually broke free and defeated Grog and his minions, so that they could finally bring the fight to Seth. Grog, fearing for his life, brought the heroes to the Black Pyramid and there Thor released Bes, the Heliopolitan God of luck. Bes revealed Seth's plan to exterminate all life, and he was able to be so successful because he kept the odds in his favor by using the power of Bes. Wind Warrior, meanwhile, found the rest of the Heliopoiltan gods that had their powers stolen by Seth, and they, too, converged on the Black Pyramid. Yet inside the pyramid, Thor and the others broke into a room where they found the All-Father, Odin, a prisoner.Seth reemerged, with a new look and both hands undamaged, in an underwater base beneath the Hudson River which he called his Armageddon Complex. The psychotic vigilante, Bloodaxe was the first to uncover his base, and he was also the first to be defeated at the hands of Seth. After his defeat, he called for help from his enemy Thunderstrike and together they confronted Seth in his underwater base. Seth revealed his plans to make genetically engineered troops and exploit mankind as he saw fit. Bloodaxe and Thunderstrike attacked the death god, but they were no match for his power, and Seth placed the mark of death upon Thunderstrike's chest. If not for the timely intervention of Stellaris, Thunderstrike may have perished in the initial attack. After Thunderstrike flooded Seth's Armageddon Complex, Seth was forced to use his mobile underwater transport as a base. Seth was also visited by the disembodied spirit of Loki looking to make a deal. In exchange for a genetically engineered body for his spirit to reside in, Loki would help the death god dispose of Thunderstrike. Seth readily agreed, and made a new body for the god of mischief. Loki intended to keep his part of the bargain as he tried to trick She-Hulk into killing Thunderstrike, but when Ant-Man and War Machine arrived on the scene, Loki was the one who was bested. Later at a newly constructed base, Thunderstrike, now with the power of his mace and the Executioner's axe, paid a visit to Seth. Seth tried to seduce Thunderstrike into joining him, but it didn't work. The two of them battled furiously, but it ended when Thunderstrike used the combined powers of the mace and axe to seemingly kill the death god.Seth tried to recruit followers in the forms of Black Spectre, Bushman and Morpheus in order to strike at his enemy, the moon god Khonshu. However, a newly resurrected Moon Knight stood in his way. Seth, in the guise of a statue of Set, would lash out at Moon Knight in his dreams and even came to life when the ebony energy of Morpheus struck the statue. In the end, Morpheus was defeated by Moon Knight and the statue of Set was destroyed.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Marvel Tales #96 (1950)\n", 
    "groupaffiliation": [
        "Gods of Heliopolis", 
        "leader of Serpent's Teeth and his own legions"
    ], 
    "hair": "Red\n", 
    "height": 0, 
    "id": "Seth", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Nephthys (wife, separated), Osiris (brother), Isis (sister), Horus and Anubis (nephews), Geb (father), Nut (mother), Atum-Re (great-grandfather), Neith (Gaea, great-great-grandmother), Nun (Demiurge, great-great-grandfather), Thoth (great-grand uncle); Crocodile God (Sobek), Lion God (Sekhmet), Panther God (Bast), Shu (granduncles); Tefnut (great aunt), numerous others", 
    "occupation": [
        "Death god", 
        "conqueror"
    ], 
    "placeofbirth": "Celestial Heliopolis", 
    "powers": "Seth has the attributes of a god of Heliopolis such as superhuman strength, immunity to all terrestrial disease and is immortal. Before the loss of his right hand, Seth was able to lift at least 90 tons but even now remains at superhuman levels. Seth, as all the gods of Heliopolis, he has flesh that is at least three times denser than that of human tissue, and has superhuman endurance. Seth's powers also include the ability to provoke a person's death with just a touch, or he can mystically speed up the aging process causing one to grow old in seconds. He can project concussive blasts from his hand, and he can project hypnotic powers from his eyes. Seth can also transform into a large serpent (and perhaps other shapes) and retain his speech. Seth can drain other gods’ powers and open portals to other dimensions. He sometimes marks his enemies with a brand, signifying that he plans a fight to the death with that person in their next meeting. Seth commands the denizens of the underworld, including displaced spirits, harpies, demons and various types of vermin, notably rats. Mystics and believers in Seth have invoked his name on occasion for specific purposes, the extent of which remains unknown. He has developed unique offensive weaponry and employs genetic manipulation techniques. Seth can exit his body in his astral form. Unable to experience death himself, Seth sometimes transfers his consciousness to newly prepared bodies. Seth can manipulate organics (such as turning flesh into wood), cause constructs to explode, and cause objects to grow in size.", 
    "realname": "Seth", 
    "significantissues": [
        "Thor #240-241, Marvel Two-In-One #22-23, Thor #386-387, 389-390, 393, 395-400, Thunderstrike #13-14, 17-21, 23, West Coast Avengers #41, Journey Into Mystery #-1, 503-513, Moon Knight Limited Series 1-4 (1998)", 
        "Attacked Thor after he was banished from Asgard (Thor Annua1 #1, 2009)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 395
}