{
    "aliases": "None", 
    "citizenship": "Citizen of the United States", 
    "content": "Outside, they were attacked by the Theatre’s security, which intended to return them to the research labs.  But Sham used her illusions to distract them briefly, until the X-Men’s Meanstreak appeared and disabled them.  The X-Men explained that they were going to go in and try to bring down the Theatre, which Quiver was hesitant about.  But when the X-Men entered the Theatre and faced Zhao’s remaining, unthawed X-Men, known as the Chosen, Sham snuck in with Quiver to help.  She used her illusions once again to distract the flying Wingspan, long enough for Bloodhawk to overpower him and throw him through the window into the auditorium where the X-Men’s former leader, Xi’an Chi Xan, then known as Controller X, orchestrated a massive broadcast of suffering.  Xi’an and the Theatre were soon beaten, and Xi’an returned to his old self.  President Doom then appeared and offered the X-Men refuge in Halo City, built as a safe haven for all of the Theatre's victims.  Both Sham and Quiver excitedly followed the X-Men there, and called it home.Sham joined the X-Men’s Protectorate, a security force designed to safeguard Halo City against outside and inside disorder.  As a member, she fought against the Undead, using her illusionary powers to aid the rest of the X-Men.  Sham also attended the Disinterred concert, along with some of the other Protectorate, which was attacked by the Graverobber’s Undead.  She briefly faced off against her fellow Protectorate, Skullfire, who had been killed and brought back from the dead.  But with nothing to use against him, he swatted her away.  She continued to assist them against the Undead, until Morphine Somers, the acting governor of Halo City, stopped the Graverobber with a bomb attached to his hostage, Zail Haddad.  Sham was with Metalhead, Rosalinda, and their baby when Vulcann sent his pets to take the child.  But when she tried to distract one of the animals, it saw through the illusion and knocked her down.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "X-Men (2099) #22\n", 
    "groupaffiliation": [
        "X-Men", 
        "Halo City Protectorate"
    ], 
    "hair": "None\n", 
    "id": "Sham_(2099)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "None", 
    "placeofbirth": "Unrevealed", 
    "powers": "Sham is able to create sensory illusions to fool an unsuspecting foe.", 
    "realname": "Diamanda LaSalle", 
    "significantissues": "X-Men (2099) #22 (intro)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}