{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "USA", 
            "content": "At first, Silent Fox was skeptical, but when he saw the machine destroying his oil fields he called Washington D.C. on a portable satellite phone. Washington informed him that the Red Star Company’s people had been called away from his land and it became clear that the machine was sent by them to force them from their land. Silent Fox refused any help from the government and instead sent his own tribesmen, armed with modern weapons and vehicles, against the false god. The Fantastic Four also offered their services, and together with a returned Wyatt Wingfoot, they went up against the robot.Though the Fantastic Four were beaten at first, and the tribesmen’s guns were useless, Mister Fantastic soon came up with a plan and ordered Wyatt to fire him from a bazooka into an opening under the robot’s eyes. Reed flew into the robot and managed to short-circuit it, destroying it. Though the Human Torch expected the tribe to celebrate, Reed explained that the machine would have shaken their faith in their god. But Silent Fox disagreed, pointing to the horizon where a giant, fading image of the real Tomazooma stood. He explained that their true god had been prepared to step in but the super team saved them before it had to. Silent Fox’s faith was never shaken.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "Fantastic Four #80\n", 
            "groupaffiliation": "Keewazi Tribe", 
            "hair": "White\n", 
            "id": "Silent_Fox", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Will Wingfoot (son, deceased), Wyatt Wingfoot (grandson)", 
            "occupation": "Chief of the Keewazi Tribe", 
            "placeofbirth": "The Keewazi Tribe's Reservation", 
            "powers": "None", 
            "realname": "Silent Fox", 
            "significantissues": "Fantastic Four #80 (intro)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}