{
    "aliases": [
        "Son of Hulk", 
        "Sakaarson", 
        "Worldbreaker"
    ], 
    "citizenship": "Sakaar", 
    "content": "File:Acotilletta2--Skaar Sakaar442.jpgThe catastrophe on Sakaar which caused the death of Caiera and the Hulk to seek revenge on those he held responsible gave birth to a new kind of monster. A lone child emerged from the charred waste the planet was left in. He grew quickly, and without parents to raise him so did his rage. Taken in by savage creatures, the child learned at a young age to kill in order to survive. Soon, he was given a name – Skaar – and his story was just beginning. Skaar was proclaimed a prophet by some and a demon by others, but all he cared about was claiming his birthright – the Old Power. There were those who would oppose him, but after suffering so many hardships since birth, Skaar only knew how to endure.Hell-bent on destroying Axeman Bone and his army, Skaar persisted in fighting a war that only delayed his people from escaping Sakaar's imminent destruction. Caiera's spirit tried to reason with her son after she took the Old Power from him. Skaar said he only wanted to cleanse the planet of those he believed were evil, but a vision shown to him by the Surfer illustrated how everyone on Sakaar would die once Galactus arrived. Skaar tricked his mother into thinking he saw the error of his ways, but once she restored his power, Skaar doomed his people by destroying their means of escape. Caiera was left with no choice but to banish him to Earth. Before he was completely sucked through the wormhole, Skaar watched as his mother sacrificed herself to Galactus hoping to sate his hunger with an enormous amount of Old Power. The Silver Surfer said her final act would save billions since the Old Power could sustain his master for years to come. Skaar chose to defile Caiera's memory and awakened Galactus' need to feed once more with a blast of his Old Power, and then he was gone.File:Acotilletta2--Skaar transformation442.jpgOn Earth, Skaar didn't find peace as an encounter with the Fantastic Four, She-Hulk and H.A.M. M.E.R. forced Norman Osborn to bomb the battlefield, seemingly killing him in the process. Skaar didn't die that day, but he learned he could transform into a young boy. His inner child despised everything Skaar stood for, but Skaar only had one thing on his mind – to find the Hulk and kill him for abandoning him on Sakaar. He blamed his father for every horrible thing he had to bear on his home world, and he would have the chance to pay him back when the Hulk finally arrived. Banner suppressed the personality known as the Green Scar, leaving the \"Savage Hulk\" in his place, but this incarnation was still more than a match for Skaar. While Hulk had no memory of his son, this didn't stop the raging titans from nearly causing a nuclear catastrophe during their brawl. After Hulk and the Warbound averted disaster, Skaar deemed Hulk wasn't worthy enough to kill and left.", 
    "durability": 7, 
    "education": "No formal education", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 6, 
    "firstappearance": "World War Hulk #5 (2007)\n", 
    "groupaffiliation": "None", 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Skaar", 
    "identity": "No dual identity", 
    "intelligence": 3, 
    "knownrelatives": "Robert Bruce Banner (Hulk, father), Caiera (mother, deceased), Hiro-Kala (twin brother), Lyra (half-sister), Brian and Rebecca Banner (grandparents, deceased), others", 
    "occupation": "Warrior", 
    "placeofbirth": [
        "Crown City", 
        "Sakaar"
    ], 
    "powers": "Skaar's gamma-spawned and Old Power heritage grants him superhuman strength, lifting at least 90 tons. He possesses superhuman stamina and durability, is particularly immune to the affects of fire and can rapidly regenerate from wounds. Skaar's powerful legs muscles allow him to leap through the air up to 600' vertically or 1000' horizontally. Using the Old Power, Skaar can make his skin harder than stone and increase his strength while he touches ground; he can also manipulate stone and rock, using the power to levitate boulders. At the height of his connection to the Old Power on Sakaar, Skaar could create earthquakes and sense the life forces of other beings anywhere on the planet. Skaar can transform into a childlike Shadow form in which he can still access some of the Old Power, but cannot use his gamma-induced powers.", 
    "realname": "Skaar", 
    "speed": 5, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 105
}