{
    "aliases": "None", 
    "citizenship": "Panto-9", 
    "content": "Skreet's early documented exploits were with the estranged being known as Lunatik. He came from the planet Wy'nkar-7. Together they became very successful mercenaries. At one point they were employed by the Universal Cosa Nostrum. Their most notable mission was to recover Addictum. This was a drug created by the Universal Cosa Nostrum's agent known as Lupal. The drug turned its users blood into napalm when they could not get their fix. Skreet and Lunatik tracked Lupal to Begal, an insignificant planet, located in a little known star system far from developed space. Upon their arrival on the planet they learned that Lupal had committed suicide.They were confronted by the former Herald of Galactus the Silver Surfer. The Silver Surfer and Lunatik engaged in a fierce battled. Skreet joined the battle by blasting the Surfer with a violent plasma blast. The Surfer returned the blast only to find that his Power Cosmic had no effect on Skreet. Lunatik quickly knocked out the distracted Silver Surfer. Skreet and Lunatik determined that Lupal had placed tattoos on a tribe known as the Children. This was his way of hiding the secret formula. Skreet and Lunatik slaughtered the entire tribe to harvest the tattoos, in order to decode the formula. Once the Silver Surfer recovered he destroyed the formula and he blasted Skreet far enough away to defeat Lunatik.Skreet and Lunatik landed on another planet were Lunatik purchased the Intergalactic Star Sled from Murray. Skreet entered a card game with Champman, in which she won the Drogs to pull the Sled. They soon traveled to the planet Earth in search of Arisen Tyrk also known as Lunatik. Tyrk was aging and sickly, they found him in the hospital, where Lunatik killed him. Skreet and Lunatik spent a short time with the Avengers, during that time she was mistaken for the Janet van Dyne, by Giant-Man. Not long after that they returned to space and were hired by Lady Fynn-Geres of the Interstel Church of Perpetual Annoyance. She had offered them seventy five percent of twelve million credits. After defeating their foe Ictus the She Wolf Lunatik became the ICPA's pope.Lunatik eventually betrayed Skreet, by withholding her share of the big bounty. He turned Skreet over to the authorities (possibly Peter Quill), who imprisoned her in the Kyln prison planetoids. The Kyln housed many highly charged cosmic beings, such as the Proemial Gods, Antiphon, Aegis and Tenebrous. The very first Herald of Galactus, the Fallen One was also a prisoner there. Skreet was freed from a cocoon while on the planetoid by the Kosmos (also known as the Maker or Beyonder), who basically threw her away. She landed in a sandy desert area of the planet. The Maker shrunk down several other inmates who confronted her. The ferocious Mynx was among them. They were all tossed away just like Skreet. Mynx was caught in mid air by Skreet. She later witnessed Thanos being blasted through the air by the Maker.", 
    "durability": 1, 
    "education": "Self educated through her eight billion years of existence.", 
    "energy": 1, 
    "eyes": "Pink\n", 
    "fighting": 1, 
    "firstappearance": "Marvel Comics Presents #172 (1995)\n", 
    "groupaffiliation": [
        "Partner of Cammi", 
        "former partner of Thanos & the Wy'nkarian Lunatik"
    ], 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Skreet", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Diableri (creator)", 
    "occupation": [
        "Galactic Mercenary", 
        "bounty hunter"
    ], 
    "origin": "Unrevealed", 
    "placeofbirth": "Pyx", 
    "powers": "Skreet is a very small and extremely powerful being. She has a nearly indestructible body. She has the ability of interplanetary flight through the small wings on her back. Skreet can also navigate the voids of space by emitting plasma burst from her hands, thus enabling her to reach light speed. Skreet has used her speed of flight as an offensive weapon, propelling herself into her enemy like a cosmic torpedo. Her plasma blasts were strong enough to affect both the Fallen One and the Silver Surfer.", 
    "realname": "Skreet", 
    "significantissues": [
        "Marvel Comics Presents #172 (1995)", 
        "Marvel Comics Presents #173-174 (1995)", 
        "Marvel Comics Presents #175 (1995)", 
        "Cosmic Powers Unlimited #3 (1995)", 
        "Lunatik#1-3 (1995, 1996)", 
        "Thanos #9-12 (2004)", 
        "Annihilation: Prologue (May 2006)", 
        "Annihilation: Silver Surfer#1-4 (2006)", 
        "Annihilation #1-4 (2006, 2007)", 
        "Annihilation #6 (March, 2007)", 
        "Annihilation: Heralds of Galactus #2 (May, 2007)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 3
}