{
    "aliases": "None", 
    "citizenship": "Citizen of the United States", 
    "content": "Tim later agreed to join Meanstreak and Krystalin to investigate the disappearance of Meanstreak’s friend, Jordan Boone.  But on the way, La Lunatica of the Theatre of Pain, captured them and tortured Tim by forcing him to relive the painful memory of when he accidentally immolated his girlfriend, Reiko, with his emerging powers.  The trauma of the memory activated Tim’s powers, which destroyed the retraining collars on the captured X-Men, along with Luna’s, as well.  She then turned on her captors, killing her master, Controller Thirteen.  She allowed the X-Men to part, but Tim, angered by what she had done to him, promised to meet her again.  The X-Men continued on to New York where they searched Boone’s apartment for clues.  They found a connection to the man-beast Ravage in a hidden journal, but Tim found himself stuck to a gel chair, and had to catch up with his friends.  After overcoming a group of Public Eye officers, Tim hitched a ride on a floating platform to Valhalla, Alchemax’s floating city, where the rest of the X-Men fought the genetically created, Heimdall.  Tim nearly died when he fell off of the platform after it failed, but was saved by 2099’s Doom, and brought up to the city.  Tim was just in time to meet the approaching engineered Thor, which Doom faced off against.  After the two flew away in an explosion, the X-Men helped the citizens of Valhalla escape the flawed city before 2099’s Spider-Man, Punisher, Doom, and Ravage brought it to a halt.Since being attacked by Luna, Tim’s personality had begun to change from an insecure follower, to a near-suicidal, brazen leader.  His powers also changed, allowing him to control them at will, so that when he followed Xi’an to meet Mama Hurricane, and ran into her Freakshow, he was able to defend the X-Men against one of the trackers that came after them.  Around this time Tim began to call himself Skullfire.  Skullfire later went along with the X-Men to answer Krystalin’s call, and found her in the grips of Zhao and his genetically-accelerated, yet unstable, X-Men.  After Skullfire’s X-Men were captured, Zhao entered Xi’an’s head to hypnotize him, but Xi’an’s criminal personality resurfaced and took over, putting Zhao into a coma.Xi’an then began to change himself, and became selfish and rude.  When he decided to leave the X-Men and hunt for the Driver and the mutant paradise, Avalon, Skullfire joined him.  While Xi’an parted from Skullfire to talk to Broken Haiku, Skullfire ran into Lunatica, who was running from the Theatre of Pain.  At first they fought, but their fighting soon turned into kissing, and they revealed a mutual attraction for each other.  Skullfire later had his face permanently painted white to match hers.  But it turned out that Luna had tricked Skullfire, and brought him to the X-Men’s former teammate, Junkpile.  Luna explained that she rescued Junkpile from an Alchemax truck, and brought him along to help her fend off the Theatre’s hunters.  Skullfire reluctantly agreed to go along, and using the information Xi’an gathered from Haiku, they all headed to the Driver’s hidden base.  Yet Haiku, who had a grudge to settle with Xi’an, alerted the Driver of their arrival, and he captured them when they appeared.  The Driver revealed that he brought runaway mutants to his base and then uploaded them into his database to save them until the world was ready for their revival.  He attempted to upload Junkpile, but before he could, Brimstone Love, the leader of the Theatre of Pain, stopped him, destroying the database in the process.  Brimstone announced that, though he was there to bring Luna back, he was more interested in Xi’an’s potential.  And, to the surprise of the people present, Xi’an accepted Brimstone’s invitation.Skullfire returned to the X-Men and told them of Xi’an’s betrayal.  He also introduced Luna to them as the new member, which most of the rest were not happy to hear.  Soon, Skullfire declared himself the leader of the team, and announced that they would go and tear down the Theatre of Pain.  While Meanstreak and Krystalin were off on personal missions, and Metalhead had quit to join the Freakshow, Skullfire was left behind with Luna and Cerebra, and he was sleeping when Xi’an transported into the compound and stole Zhao’s body, along with his frozen X-Men that Cerebra was working to fix, and left a bomb next to an unconscious Cerebra.  Luckily, she woke up in time to lead Skullfire and Luna out of the building before it exploded.After a consultation with Broken Haiku, the three remaining X-Men found the Floodgate, the gathering spot for the Theatre’s victims.  They disguised themselves as outcasts but were quickly identified and forced to fight the Theatre’s security.  The security force quickly knocked out Skullfire and Luna, but Cerebra manage to sneak away when Junkpile, as a S.H.I.E.L.D. agent, raided the place.  Though Brimstone Love soon beat him.  While her ex-sisters of the Norns took Luna, Skullfire was dropped into a refuge dump along with the beaten Junkpile.  Despite their shared animosity, they worked together, and Skullfire used a broken, robot dog of Junkpile’s to energize and burn his way out of the dump before the solvent drain could liquefy them.  When they broke out, Skullfire found that Luna had another obedience collar put on her, and he tore it off with his powers.  Together they attacked Brimstone Love, but they were ineffectual, and only Xi’an was able to stop him by turning the Mindfire Machine on him that Zhao’s body was hooked up to.  After Brimstone escaped, Xi’an was angry with the X-Men that allowed him to get away, but then Luna leapt on him and used her powers to shock him out of his violent persona.  Doom appeared shortly afterwards with S.H.I.E.L.D. troops, and announced that he had built Halo City as a refuge for the Theatre’s victims.Skullfire and the X-Men became residents at Halo City, and organized the Protectorate, made up of their own members, to handle security for the city.  But their peace was short-lived, and a being known as the Graverobber appeared, along with his resurrected mutants known as the Undead.  The X-Men were lured into a fight with them after they destroyed Halo City’s polyclinic, and Skullfire was tricked away from the group and killed by a poison dart, shot by the resurrected Serpentina.  Skullfire found himself in the afterlife, faced with his dead girlfriend, but he was shortly pulled away and back to his body, resurrected by the Graverobber.  The Graverobber took control of him and planned to use him to threaten the city’s generator, the Spark, unless Cerebra’s father, Zail Haddad, was brought to him to pay for his crimes against him.  While Skullfire unwittingly drained power from the generator, the X-Men fought the Undead and the Graverobber, until Morphine Somers gave him Zail Haddad.  But before the Graverobber could bring him justice, Somers tricked him and detonated a bomb attached to Zail, destroying the Graverobber and releasing his hold on the Undead.  The X-Men then gathered up Serpentina and threw her ashes to the winds.  Skullfire returned to the afterlife, but his girlfriend told him he had to leave, and he found himself alive again.With his powers flaring up again, Skullfire returned to his erratic, almost-suicidal tendencies, wondering if he was even capable of dying.  As on a mission to rescue the mutant savant, Book, when Skullfire stopped to play chicken with a train.  Then, when fighting Javier Belize, who used the power of the god Quetzalcoatl, he managed to connect with and absorb the eldritch energies he released.  Later, Skullfire used his powers to start a sky-cycle in order to distract the Foolkiller who was after Xi’an’s old group, the Lawless, enough for Luna to disable him with her vampiric touch.  Skullfire finally led his team into rescue missions once Halo City had begun to flood, thanks to the approaching planetoid.  But when he investigated the Halo Tower’s explosion with Luna, he found Vulcann and Metalhead’s godson, hyper-aged to adulthood, and calling himself Darkson.  Darkson threw Luna away with a wave of his hand and blew Skullfire to pieces, seemingly killing him instantly.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Green\n", 
    "fighting": 1, 
    "firstappearance": "X-Men 2099 #1\n", 
    "groupaffiliation": [
        "X-Men", 
        "Halo City Protectorate", 
        "former member of the Undead"
    ], 
    "hair": "Brown\n", 
    "id": "Skullfire_(2099)", 
    "identity": "Publicly Known", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": "None", 
    "placeofbirth": "Unrevealed", 
    "powers": "Skullfire is able to draw energy from surrounding electrical objects, and send it back towards anyone as blasts of energy.  Later, through an evolution of his powers, Skullfire became a being of pure energy, but still needed to draw energy from specific sources.", 
    "realname": "Timothy Sean Fitzgerald", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel 2099 (Earth-928)"
}