{
    "aliases": "Unrevealed", 
    "citizenship": "U.S.A.", 
    "content": "Not much has been revealed about the intervening years, but Conrad was later approached by Henry Peter Gyrich, head of the Commission on Superhuman Activities, who was looking to form an alternative hero team to the Thunderbolts, of which Erik had become a part of as the villain-turned-hero, Atlas. While most of the Redeemers had criminal pasts of their own to atone for, and thus agreed to join the team, it has been suggested that Conrad was approached with the offer that his participation would help the Commission look favorably on his brother Erik’s “criminal” activities. He was outfitted with a special costume to access the Darkforce Dimension, and he took the code-name Smuggler, an alias of Erik’s in his first appearance as a costumed criminal.In fact, Gyrich had launched a plan to eliminate, if not control, the world’s population of superhumans, starting with the Thunderbolts. He remade Nomad into Scourge, charging him with the task to hunt down and eliminate the team, who at this time were scattered and underground. The Thunderbolts eventually defeated Scourge, which led to a confrontation with Gyrich and the Redeemers. Gyrich and the Redeemers were actually being influenced by nanotech, microscopic probes that manipulated Gyrich’s superhuman phobias and allowed him to force the Redeemers to fight. Freed of the nanoprobes with help of the Thunderbolts, Gyrich nevertheless ordered the Thunderbolts to disband, and their role was supplanted by the Redeemers.The Redeemers took the place of the Thunderbolts in their Mt. Charteris headquarters, being trained by  Captain America under the direction of the Commission and S.H.I.E.L.D. Conrad was among the team when they battled Graviton, but Graviton decimated the ranks of the Redeemers. In particular, Smuggler’s powers were turned inward on themselves, and he disappeared, believed to have been killed like his teammates. Instead, Conrad had become trapped in the Darkforce dimension, lost for many weeks.When the Thunderbolts reassembled, Baron Zemo began recruiting his own group of Thunderbolts that would help him battle the original team over the life of Photon, who had the power to inadvertently destroy the world. To this end, he manipulated the comatose body of Blackout, a Darkforce-manipulator, like a puppet on strings. During the battle between the two teams, Zemo revealed Blackout was merely a shell in which he kept the Smuggler trapped. This had the desired effect of turning his brother, Atlas, against his team, and Zemo gained the upper hand. When Zemo was triumphant, he restored Conrad fully to Earth, and he shared a bittersweet reunion with his brother.", 
    "durability": 4, 
    "education": "Unrevealed", 
    "energy": 2, 
    "eyes": "Brown\n", 
    "fighting": 3, 
    "firstappearance": "(unnamed) Thunderbolts #47 (2001); (as Smuggler) Thunderbolts #48 (2001)\n", 
    "groupaffiliation": [
        "Formerly Thunderbolts", 
        "Redeemers"
    ], 
    "hair": "Reddish-Brown\n", 
    "id": "Smuggler_(Conrad_Josten)", 
    "identity": "Secret", 
    "intelligence": 2, 
    "knownrelatives": "Parents (full names unrevealed, deceased), Carl Josten (brother, deceased), Erik Josten (Atlas, brother), Lindy Josten (sister, deceased)", 
    "occupation": "Unrevealed", 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Conrad Josten", 
    "significantissues": "Identity revealed (Thunderbolts #50, 2001)", 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe"
}