{
    "aliases": [
        "Ricochet Rita", 
        "Apocalypse", 
        "Shiva"
    ], 
    "citizenship": "U.S.A.", 
    "content": "She, along with Gog and Magog, were sent by Mojo to capture Longshot, the rebel leader who escaped Mojo World and landed on Earth. Spiral, Gog and Magog failed, forcing Mojo himself to come to Earth. Not only did Mojo hope to keep Longshot from returning to Mojo World, he decided to begin a plan to enslave Earth as well. Aided by Ricochet Rita, a stuntwoman and his new love interest, Longshot defeated Mojo, forcing him into an interdimensional portal with Spiral. The heroes also entered the portal in order to continue the fight, but Mojo managed to return Longshot to Earth amnesiac.It remains unrevealed if Spiral later became trapped on Earth or elected to stay, but she next appeared having joined for unknown reasons, the government sponsored team called Freedom Force. (It is suggested that she used this as a means of learning more about Earth). During this time, she battled many opponents such as Magneto, Daredevil, the Avengers and Avengers West Coast, X-Factor, and Firestar. Spiral eventually left the team shortly after a clash with the X-Men in Dallas, Texas, where the X-Men seemingly died in battle with the trickster-god, the Adversary.During her time on Earth, Spiral also created a guise as \"pro-priestess\" of the Body Shoppe, a place where genetics and technology are used to alter people in the same way that Spiral herself was altered. She is responsible for the transformation of Lady Deathstrike, as well as, presumably, many of the cyborg Reavers. Also during this time, Spiral lured Rachel Summers of the X-Men to capture and slavery in Mojo's universe. Similarly, she also helped Mojo capture Besty Braddock, at which point Betsy was given bionic eye implants. The New Mutants rescued Betsy with the help of her brother, Captain Britain, but Mojo had planned all of this from the start, so that Betsy's new eyes would broadcast images of the X-Men to the television-obsessed society of Mojo World.After her time with Freedom Force, Spiral presumably returned to the Mojo's universe, where later, Longshot and Dazzler led a rebellion against Mojo. For reasons of her own, she teleported the X-Men to the universe to aid the rebellion. After Mojo was seemingly killed by Longshot, Spiral teleported away.Spiral was later revealed to be Ricochet Rita from an alternate future, one in which she was abducted by Mojo, transformed by the engineer Arize, and granted the ability to wield magic. (She had long thought of herself as another of Mojo’s humanoid slaves, artificially created through genetic engineering and designed with six arms, rather than only two, so as to ensure Spiral's hatred of other humanoids.)At one point, Mojo set his sights upon the hero Shatterstar and, with Spiral, captured him. Mojo transformed the hero into a digitized state, mortally wounding him. In an unexpected act of heroism, Spiral transported Shatterstar and Longshot back to Earth, to a hospital where lay a youth named Benjamin Russell. She transferred Shatterstar's essence into the comatose body of Benjamin, physically linking the two. Spiral teleported away, her true motives remaining unclear, but obvious that she held deep feelings for both Shatterstar and Benjamin Russell.On her next appearance, Spiral was marked with a sigil of the Crimson Dawn, although the implications of this remain a mystery. The cultists known as the Dragons of the Crimson Dawn had kidnapped Captain Britain, hoping to use his connection to extradimensional energies to usher in the “coming of the Crimson Dawn,” but Spiral sought out his teammates of Excalibur to help rescue him. Although she claimed capable of using the energies of Crimson Dawn for her own purposes, she chose to help Excalibur and defeat the Dragons, whereupon she teleported away as mysteriously as she came.Spiral was once again at Mojo’s side when the X-Babies needed to use Mojo’s machines to save their teammate Psychilde and, later, when Mojo hoped to kidnap the Exiles’s teammate Morph.Spiral later sought out the sacred blade known as the Five Fingers of Annihilation, a weapon forged to defeat the alien Skornn. She tricked Shatterstar into fighting Dominicus Pierce, its current owner and Spiral’s former lover, but Pierce handed the weapon to him, knowing Shatterstar to be a capable warrior. Spiral then revealed herself and her true intentions, to welcome, not defeat, the Skornn. Shatterstar fought Spiral and agents of her creation, which included Roundhouse, but the battle ended with the two enemies thrown into a portal and landing on an alternate earth, although separated by many years. In the meantime, Spiral became known as Apocalypse, ruling the land with an iron hand. Shatterstar joined an alternate version of X-Force to confront her. After the final, tumultuous battle, Shatterstar reclaimed the fabled Five Fingers blade and returned to Earth.  Spiral was captured, but presumably managed to escape soon after.", 
    "durability": 3, 
    "education": "Unrevealed", 
    "energy": 6, 
    "eyes": "White\n", 
    "fighting": 5, 
    "firstappearance": "Longshot #1\n", 
    "groupaffiliation": [
        "Sisterhood of Mutants", 
        "formerly Freedom Force", 
        "Wildways", 
        "Body Shoppe"
    ], 
    "hair": "Silver\n", 
    "height": 60, 
    "id": "Spiral_(Rita_Wayword)", 
    "identity": "Secret", 
    "intelligence": 2, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Servant of Mojo", 
        "executioner", 
        "spy", 
        "former stuntwoman", 
        "body shop owner"
    ], 
    "origin": "X-Factor Annual #7", 
    "placeofbirth": "Unrevealed", 
    "powers": "Spiral has six arms, one of which is fully cybernetic; she also has enhanced strength, speed, and reflexes. She has the ability to teleport, become invisible, and she also has shown the ability to remove superhuman abilities. She can stun others to the point of causing a concussion or paralyze others. She is a proficient magic user and usually dances when she casts spells. Spiral for some unknown reason is immune to certain types of possession.", 
    "realname": "Rita Wayword", 
    "significantissues": "True identity as Ricochet Rita revealed (X-Factor Annual #7)", 
    "speed": 2, 
    "strength": 4, 
    "universe": "Mojoverse", 
    "weight": 162
}