{
    "aliases": [
        "Number One", 
        "Santa Claus"
    ], 
    "citizenship": "Unrevealed", 
    "content": "Upon hearing of Tony Stark’s alleged death, Spymaster recruited the Beetle (Abe Jenkins), Blizzard (Donnie Gill) and Blacklash (Mark Scarlotti) for a new mission. As Tony Stark’s funeral was conducted atop Stark Enterprises, Spymaster and his allies gained access to the facility, but the new Iron Man (Jim Rhodes) and the Avengers quickly captured them. When super-criminal Trapster tried to sue the criminal mechanic Tinkerer for faulty equipment, Spymaster was among the many villains called to serve as witnesses, but the hearing broke down as the criminals fought among themselves. She-Hulk stopped the villains from destroying the courthouse. Later, when Justin Hammer attempted to buy up Beverly Hills by driving the wealthy residents out with fear tactics using local street gangs, his efforts were stopped by Silver Sable and her Wild Pack. Enraged, Hammer sent Spymaster and other operatives to attack them. When a street gang member was killed by a substitute Blizzard during the ensuing chaos, the gangs teamed up with Silver Sable and the Wild Pack, forcing Spymaster and the others to flee.Justin Hammer next hired Spymaster to inject Tony Stark with rogue cells that would alter his hormones and trigger fits of rage. Spymaster had his Espionage Elite ambush Stark, beating him nearly to death and injecting him with the rogue cells as Spymaster watched from a rooftop. When criminal psychic Mentallo amplified his telepathic powers to global levels, Tony Stark overpowered Mentallo and used the villain’s powers to eradicate knowledge of his Iron Man secret identity from everyone who had learned it over the years, including Spymaster. Spymaster later sent his Espionage Elite to kidnap Stark, who realized this was the same group that nearly killed him. With increased rage due to the rogue cells, Iron Man viciously assaulted the Espionage Elite and tracked Spymaster to his hideout. Iron Man then overloaded Spymaster’s absorption force field, short-circuiting it, and crushed his hand, allowing police to take him into custody.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Iron Man #254 (1990)\n", 
    "groupaffiliation": [
        "Espionage Elite II", 
        "Hammer Industries", 
        "Taskmaster’s Academy"
    ], 
    "hair": "Brown\n", 
    "height": 71, 
    "id": "Spymaster_(Number_One)", 
    "identity": "Known to the authorities", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Industrial spy and saboteur", 
        "assassin", 
        "former student of Taskmaster"
    ], 
    "origin": "Iron Man #254 (1990)", 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Nathan Lemon", 
    "significantissues": [
        "First appearance (Iron Man #254, 1990)", 
        "shown to be leader of Espionage Elite II (Iron Man #8, 1999)", 
        "severely beaten by behaviorally altered Iron Man (Iron Man: Bad Blood #2, 2000)", 
        "killed by agents of Sinclair Abbott (Iron Man: Inevitable #2, 2006)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 190
}