{
    "aliases": [
        "\"The One Who Knows\"", 
        "\"The Light\"", 
        "\"the Giver of Light\"", 
        "\"Hadji\""
    ], 
    "citizenship": [
        "Planet Arcturus IV", 
        "Reality-691"
    ], 
    "content": "The Living Tribunal declared the Hawk God dangerous, partly because he was thought to be a likely instigator of the long-prophesied reality-threatening War of the Cosmic Beings. The Hawk God was sent back to the planet Arcturus IV, around Earth's early 20th Century. He was among the gods worshiped by the early Arturians, and they constructed a 30' robotic computer in his likeness. Upon his demotion, the Hawk God was trapped in this immense replica, in an inactive state.The humanoid Arcturian race is presumed to be violent and unstable, this trait is thought to be a side effect of the constant daylight, due to the planet having twin suns. They measure their lifespans in centuries instead of years. The Acrturians also practice genetic engineering. This practice ended in a planet wide nuclear war.", 
    "durability": 1, 
    "education": "Unrevealed, this includes the vast accumulated knowledge from centuries of study and having relived countless variations of his own life through a series of time loops.", 
    "energy": 1, 
    "eyes": "White, with no visible pupils\n", 
    "fighting": 1, 
    "firstappearance": "Defenders #27 (1975)\n", 
    "groupaffiliation": [
        "Formerly Avengers (honorary member in the 616 Reality)", 
        "Guardians of the Galaxy"
    ], 
    "hair": "Brown\n", 
    "height": 76, 
    "id": "Starhawk_(Stakar_Ogord)", 
    "identity": "Secrete", 
    "intelligence": 1, 
    "knownrelatives": "Kismet (Her of the 691 reality, mother); Quasar (father,deceased) & Vaughn family (deceased); Warlock (uncle reality-691); Ogord (adoptive father, deceased), Salaan (adoptive mother)-all reality-691, Aleta Ogord (ex-wife and adoptive sister), Tara and Sita Ogord (daughters, deceased), John Ogord (son, deceased)-all reality-691; many unidentified additional adoptive parents within reality-691 and other alternate timelines", 
    "occupation": "Adventurer", 
    "origin": [
        "Marvel Presents #9-11 (1977)", 
        "Guardians of the Galaxy #7", 
        "45", 
        "49-50 & 61-62 (1990", 
        "1994 & 1995)"
    ], 
    "placeofbirth": "Sisters of Mercy nunnery on the planet Vesper", 
    "powers": "Starhawk can generate luminous energy for various purposes. He can surround his body with in a nimbus of light providing simple illumination up to blinding intensity. He can cast beams of light as spotlights of flares. By shifting his light beam's frequency, he can generate intense heat beams, or coherent light beams that strike their targets with tremendous concussive force. He uses a nimbus of intermingled photons and anti-gravitons to levitate or fly at great speeds.", 
    "realname": "Stakar Ogord", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Earth-691", 
    "weight": 450
}