{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "In fact, when the ray had condensed his matter to a certain point, Day was transported into a limbo-like \"microverse\". Months later, Day and his stilts reappeared on Earth at their full size.Constantly re-modifying and improving upon his original stilts and the rest of his battlesuit, the Stilt-Man has fought against the likes of Daredevil, Spider-Man, and Captain America. When given a special duplicate of his suit forged from secondary adamantium by Blastaar, the Stilt-Man even dared to challenge the thunder god Thor. After Thor defeated the Stilt-Man, Day's Adamantium suit was confiscated and melted down. Day later recovered his own modified Stilt-Man battlesuit.Subsequently, an incompetent small-time hood named Turk stole Day's Stilt-Man suit. Turk began using the Stilt-Man suit himself, but Day told Daredevil how to defeat Turk by manipulating the gyroscopes that keep the battlesuit balanced. Turk proved inept at manipulating the stilts, bungled an attempt to kidnap Manhattan Assistant District Attorney Maxine Lavender, and was caught by Daredevil.Day decided that after this humiliating episode, he had to do something dramatic to regain his reputation as a formidable criminal. Day broke into a Cordco factory and used its automated devices to construct an improved battlesuit within a remarkably short time. Spider-Man learned of the break-in and tackled the Stilt-Man. But when Spider-Man saw that a sonic disruptor Day had activated was about to blast Day himself, Spider-Man took the blast himself to save Day's life. Moved by Spider-Man's sacrifice for an enemy, the Stilt-Man gratefully took the unconscious crimefighter to safety, and then left the factory.The Stilt-Man has often returned to crime, only to be defeated time and again. He once joined fellow villains Owl and Gladiator in an attempt to form a formidable team to take over the operations of the Kingpin, but were defeated by Spider-Man and Daredevil when they were betrayed by their teammate Copperhead to a demonic entity.", 
    "durability": 1, 
    "education": "Ph.D.", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Daredevil #8 (1965)\n", 
    "groupaffiliation": [
        "Formerly Emissaries of Evil", 
        "formerly partner of the Owl and Gladiator", 
        "Copperhead"
    ], 
    "hair": "Gray\n", 
    "height": 66, 
    "id": "Stilt-Man", 
    "identity": "Publicly known", 
    "intelligence": 1, 
    "knownrelatives": "Zelda DuBois (Princess Python, ex-wife)", 
    "occupation": [
        "Former criminal", 
        "scientist", 
        "inventor"
    ], 
    "origin": "Daredevil #8 (1965)", 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Wilbur Day", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 150
}