{
    "aliases": "None", 
    "citizenship": "U.S.A", 
    "content": "Hamilton, Super Sabre, and the Commando returned to America. When they arrived home they were disturbed by the criminal acts of people who thought they were \"above the law\". Finally deciding to do something they came out of retirement and would kidnap criminals and hunt them for sport. Later they accidentally captured Storm and realized that she was not a criminal. Faced with this dilemma they decided to hunt down Storm in order to keep their whereabouts a secret. Storm was also captured with another prison while they were hunted. Priscilla Morrison, who was in fact their actual target. Morrison betrayed Storm, but before she could kill Storm the Commando was able to kill her. Storm and the Commando then fought in combat, which she won. After she won she demanded that Commando and Stonewall turn themselves in. Distraught because they thought Super Sabre was dead, they complied and turned themselves in. Months later Valerie Cooper arranged for the release of the Commando and Stonewall if they joined Freedom Force. They reluctantly agreed. Super Sabre turned up alive and also joined the Freedom Force.Months later during a mission on Muir Island the Freedom Force faced off against the Reavers. During this confrontation Stonewall was electrocuted and killed by Donald Pierce. His comrades Super Sabre and Crimson Commando buried him in an undisclosed location.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 1, 
    "firstappearance": "Uncanny X-Men #215\n", 
    "groupaffiliation": [
        "Formerly Freedom Force", 
        "former partner of Super Sabre", 
        "Crimson Commando", 
        "& Yankee Clipper"
    ], 
    "hair": "Black\n", 
    "id": "Stonewall", 
    "identity": "Known to the U.S. Government", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": [
        "Government operative", 
        "formerly vigilante", 
        "adventurer", 
        "otherwise unknown"
    ], 
    "origin": "Uncanny X-Men #215-216", 
    "placeofbirth": "An undisclosed location in Massachusetts", 
    "powers": "Increased physical density gives him superhuman strength, endurance and durability. He is also capable of altering the placement of his own center of gravity, so that he can stand up to any impact without falling down. He has even proven that his power of not being moved is better than the Blob's.", 
    "realname": "Louis Hamilton", 
    "significantissues": "Uncanny X-Men #215-216 & 223 & 225-227 & 255, Captain America #346, New Mutants #65, X-Factor #30-31, Wolverine #176", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}