{
    "aliases": [
        "\"Beauty", 
        "\" Wind-Rider", 
        "\"Stormy", 
        "\" Mutate #20", 
        "White King", 
        "\"Goddess of the Plains\"", 
        "'Ro"
    ], 
    "citizenship": "Dual U.S./Wakandan citizenship", 
    "content": "Ororo managed to escape the rubble of her shattered home with nothing but the tattered clothes on her back and her mother's ancestral ruby.  Homeless and orphaned, Ororo was found by a gang of street urchins who took her to their master, Achmed el-Gibar. Achmed trained Ororo in the arts of thievery and she soon became his prize pupil, excelling in picking both pockets and locks. During her time in Cairo, Ororo picked the pocket of an American tourist.  The man proved no easy mark, however, as he was Charles Xavier, a powerful mutant telepath who used his abilities to stop the theft.  At that moment, Xavier was psionically attacked by another mutant and Ororo used the opportunity to escape.Finally, Ororo reached her ancestors' homeland on the Serengeti Plain in Kenya.  She was taken in by an elderly tribal woman named Ainet who taught her to be responsible with her powers.  Ororo soon came to be the object of worship of the local tribes who believed her to be a goddess due to her gift.Years later, Ororo was forced to battle the threat of a fellow mutant weather manipulator known as Deluge, who sought revenge against humanity.  With the help of several members of the team of mutant heroes known as the X-Men, Deluge was seemingly destroyed and Ororo returned to her life amongst the tribal people.  The X-Men subsequently told their founder, Professor Xavier, about Storm but he declined to contact her at this point, not wanting to shock the young woman with the true nature of her powers.Months later, however, Xavier was left with no choice but to recruit Storm and other mutants from around the world into the X-Men in order to rescue his original students from the threat of the sentient island being known as Krakoa.  Xavier explained to Ororo that she was not a \"goddess\", but a mutant, and as such she had a responsibility to use her abilities to help the world just as she had helped the local tribes.  Curious, Ororo accepted Xavier's offer, and was given the codename \"Storm\".Storm was initially very naïve when it came to the customs of the modern world, but her team mate Jean Grey helped educate her in the ways of society and the pair formed a lasting friendship.  Jean was also one of the first X-Men to learn of Storm's claustrophobia after the two women chased a thief into the subway.After serving with the team for many years, Storm was appointed leader of the team following the departure of former leader Cyclops after the apparent death of Jean.  Storm was initially unsure about her new role, but with the support of her team mates she soon became a capable leader.  When Cyclops eventually returned to the team, Storm found herself doubting her leadership abilities once more after a mission she led went wrong.  However, she soon asserted her position, reminding Cyclops that she was now team leader.Soon after, the X-Men encountered the underground community of mutants known as the Morlocks who had kidnapped one of their former members, Angel.  To save her friends, Storm challenged the Morlock leader Callisto to a duel and bested her in hand-to-hand combat.  As a result, Storm became leader of the Morlocks and she ordered them to cease their hostilities against the surface-dwelling humans.When the X-Men later travelled to Japan to attend the wedding of their team member Wolverine, Storm first met the ninja named Yukio.  A friend of Wolverine's, Yukio was the most care free spirit that Ororo had ever met and the two became fast friends.  Yukio influenced a major rebellious change in Storm's attitude towards life, and she took to wearing leather and shaved her hair into a Mohawk.Storm later had her powers accidentally neutralized by a gun invented by the mutant machinesmith named Forge, who took it upon himself to nurse Storm back to health.  During her convalescence, Storm and Forge fell in love but their relationship was cut short after Storm learned Forge had created the device that stripped her of her powers.Storm subsequently quit the X-Men and returned to Africa where she finally came to terms with losing her mutant ability.  Returning to Cairo, Storm joined Xavier's newest team of young mutants, the New Mutants, in an adventure into the past during which Storm met one of her ancestors who helped the heroes return to their own time.  Storm and the New Mutants were subsequently captured by the Asgardian trickster god Loki who sought to use Storm in one of his schemes to discredit his half-brother, the thunder god Thor, by restoring her abilities and brainwashing her into believing she was a goddess.  With the aid of the X-Men, Storm was able to reject Loki's gifts, thus thwarting his plan.Storm returned to the X-Men to find herself being challenged to a duel for leadership of the team by Cyclops.  Despite her still being powerless, she won and Cyclops quit the team.  Soon after, the X-Men and the Hellfire Club formed an alliance to combat the growing threats against mutants that saw Storm share the position of White King with a reformed Magneto.  The alliance was to be short-lived, however, after Storm decided that in order to safeguard their friends and families from their many enemies, the X-Men must fake their deaths and become an underground proactive strikeforce.  Soon Storm realized that she needed her powers restored and so she sought out Forge for his help.  She found Forge's old mentor Nazé instead, who informed her that Forge had been corrupted by his nemesis, the Adversary, and was seeking to destroy the world.  Unbeknownst to Storm, the Adversary had actually corrupted Nazé.  When Storm finally located Forge, she found him atop a mountain seemingly opening a dimensional portal filled with demons.  Storm struck Forge down, and only then realized he had been attempting to close the portal, not open it.  The Adversary then trapped Storm and Forge in the other dimension and seized control of Dallas, warping time and space in order to foment chaos on Earth.Storm and Forge spent a year on an alternate Earth, during which time they made peace and admitted their love for one another.  Forge used components from his cybernetic leg to fashion a new device that restored Storm's powers which she then used to energize a portal back to their own world.  They rejoined the X-Men in time to defeat the Adversary, imprisoning him at the cost of their own lives.  However, the Omniversal Guardian named Roma restored the X-Men to life, freeing the Adversary under the notion that there could be no order without chaos.Storm was eventually restored to adulthood after the X-Men were captured by agents of the island nation of Genosha who used mutants as slaves.  Storm underwent the mutate transformation process, however the Genoshan Genegineer and Chief Magistrate were members of a rebel faction.  They restored Storm's body and mind, and the X-Men were able to defeat their aggressors.Soon after, the X-Men were reformed into two separate strike teams, with Cyclops and Storm as co-leaders.  Forge aided both teams as their resident technician, however this left little time for them to rekindle their relationship.  Forge still asked Storm to marry him, but she hesitated on giving a reply.  Forge was left thinking she did not truly love him and he left before she could respond with a \"yes\".Months later, the eternal mutant Apocalypse made a bid for power by gathering together the Twelve, a group of mutants prophesied to usher in a golden age for their kind that counted Storm amongst their number.  Apocalypse was defeated, but not before the ultimate extent of Storm's mutant power was revealed in an alternate future wherein she had evolved into a wholly elemental being.Not long after, Storm and five of her team mates formed a splinter group of X-Men known as the X-Treme X-Men, cutting all ties with the rest of the team to search for the diaries of the blind mutant seer Destiny that mapped the future of mutants.  During a mission in Australia, Storm was reunited with Gambit who sought to obtain her mother's ruby.  It was revealed that the ruby was part of a set that, when empowered, could open a portal between dimensions.  Several of the gems had already gone missing, and Gambit wished to ensure that Storm's ruby remained safe.  At that moment, the other-dimensional warrior named Shaitan attacked, capturing Gambit and stealing the ruby.  Shaitan used the gems and Gambit's mutant ability to empower them, thus opening a portal allowing the armies of his master, Khan, to pass through and invade Earth.Storm's X-Men opposed the invaders, but she was seriously injured by Madripoor's ruling crimelord Viper and was subsequently taken prisoner by Khan himself.  The warlord intended for Storm to be his queen, and commanded his physicians to heal her.  Storm attempted to seduce Khan into calling off his invasion whilst her team mates fought to close the portal.  Khan's other concubines grew jealous of Storm's advances and attempted to kill her.  Despite her injuries, Storm prevailed and escaped, rejoining her team mates as they destroyed the portal.Storm's first mission would be a solo one as she was charged with infiltrating and exposing an underground slave trading network that forced mutants to fight in gladiator-style arenas.  Soon after, Storm and her team returned to Westchester to help rebuild the mansion following an attack by Magneto and stayed on to continue their new direction. With the XSE, Ororo and her teammates opposed such threats as the Weaponeers and the extradimensional Fury, as well as aiding the Hellfire Club against an attack by rogue member Donald Pierce. Ororo was captured by the saurian Hauk’ka who amplified her powers with the intent of creating a global hyper-storm to destroy human civilization, but she was freed by her teammate Rachel. Later, Ororo accompanied Havok’s X-Men team to Africa to investigate animal mutations. Alongside the Black Panther, Ororo and the X-Men opposed Genoshan scientist Doctor Paine and the Russian criminal the Red Ghost, after which Ororo opted to leave the X-Men and remain in Africa.", 
    "durability": 3, 
    "education": "College-level courses at Xavier's School for Gifted Youngsters, Westchester, New York", 
    "energy": 6, 
    "eyes": "Blue, glowing white when using powers\n", 
    "fighting": 5, 
    "firstappearance": "Giant-Size X-Men #1 (1975)\n", 
    "groupaffiliation": [
        "X-Men", 
        "formerly  Fantastic Four", 
        "X-Treme Sanctions Executive", 
        "Tokyo Arena", 
        "Twelve", 
        "Brides of Set", 
        "Hellfire Club (Inner Circle)", 
        "Morlocks (leader)"
    ], 
    "hair": "White\n", 
    "height": 71, 
    "id": "Storm", 
    "identity": "Publicly known", 
    "intelligence": 5, 
    "knownrelatives": "Ashake (ancestor, deceased), unidentified paternal grandfather, Harriet Munroe (paternal grandmother), unidentified maternal grandmother, David Munroe (father, deceased), N’dare Munroe (mother, deceased), unidentified paternal aunt (deceased), Colonel Shetani (maternal uncle), David Munroe Jr. (nephew), T'Challa (Black Panther, husband), extended in-law family via marriage", 
    "occupation": [
        "Queen of Wakanda", 
        "adventurer", 
        "former gladiator", 
        "student", 
        "thief", 
        "tribal patron"
    ], 
    "origin": [
        "X-Men #102 (1976)", 
        "X-Men #117 (1979)", 
        "Ororo: Before The Storm #1-4 (2005)", 
        "Marvel Team-Up #100 (1980)", 
        "X-Men: The Hidden Years #5-7 (2000)"
    ], 
    "placeofbirth": [
        "New York City", 
        "New York"
    ], 
    "powers": "Storm is a mutant who possesses the psionic ability to manipulate weather patterns over limited areas. She can stimulate the creation of any form of precipitation such as rain or fog, generate winds in varying degrees of intensity up to and including hurricane force, raise or lower the humidity and temperature in her immediate vicinity, induce lightning and other electrical atmospheric phenomena, and disperse natural storms so as to create clear change. Storm can direct the path of certain atmospheric effects, such as bolts of lightning, with her hands. She has also demonstrated the ability to manipulate ocean currents, though the extent of this ability is still unclear.\nStorm’s control over the atmosphere is such that she can create certain effects over a specific area while shielding smaller areas within that region. For example, she can create a rainstorm around herself but prevent the raindrops from touching her. Storm can also create atmospheric phenomena over very small areas, such as creating a rainstorm small enough to water a single potted plant.\nStorm can only manipulate weather patterns as they exist in nature. For example, she can end a drought in one area by creating torrential rains there, but that would necessitate robbing all available moisture from the surrounding areas. Storm is not able to create atmospheric conditions that do not exist naturally on the planet she is on. For example, Storm is unable to lower temperatures as far as absolute zero or raise them to solar intensities on Earth.\nThe limit to the size of the area over which Storm can manipulate the weather is not yet known. However, she once diverted the jet stream so as to create storms over the entire East Coast of the United States. She can create weather effects within indoor areas or within artificially maintained environments. Storm is limited by the force of her will and the strength of her body. It once took her several hours to stop a savage blizzard sweeping over much of Canada, and she nearly died from exhaustion in the process.\nStorm is able to fly by creating winds strong enough to support her weight, the weight of others, and to propel her forward through the air. Storm can thus travel as fast as any wind can, and has reached speeds up to 300 miles per hour. Her powers over the atmosphere enable her to breathe at any speed, protect her from air friction, and grant her limited immunity to extreme heat and cold.\nStorm is also able to alter her visual perception so as to perceive electrical energy patterns as well as those factors responsible for existing meteorological phenomena in her surrounding environment.\n\nStorm's ability to manipulate the weather in her immediate vicinity is affected by her emotions; hence, if she does not maintain control, a fit of rage might induce a destructive storm. Storm also suffers from severe claustrophobia.", 
    "realname": "Ororo Munroe", 
    "significantissues": [
        "First joined X-Men (Giant-Size X-Men #1, 1975)", 
        "became Morlocks leader (Uncanny X-Men #170, 1983)", 
        "met Yukio (Uncanny X-Men #172, 1983)", 
        "stripped of powers (Uncanny X-Men #185, 1984)", 
        "met Forge (Uncanny X-Men #186, 1984)", 
        "became goddess of thunder (New Mutants Special Edition #1/X-Men Annual #9, 1985)", 
        "powers restored (Uncanny X-Men #226, 1988)", 
        "regressed to childhood (Uncanny X-Men #253, 1989)", 
        "met Gambit (Uncanny X-Men #267, 1990)", 
        "restored to adulthood (Uncanny X-Men #272, 1991)", 
        "rejoined X-Men (X-Men #1, 1991)", 
        "proposed to by Forge (Uncanny X-Men #290, 1992)", 
        "founded X-Treme X-Men (X-Men #109, 2001)", 
        "vs Khan's invasion, injured (X-Treme X-Men #10-16, 2002)", 
        "began physical therapy (X-Treme X-Men: Xposé #1, 2003)", 
        "founded X-Treme Sanctions Executive (X-Treme X-Men #35, 2004)", 
        "battled in Tokyo Arena (X-Treme X-Men #36-39, 2004), rejoined X-Men (X-Treme X-Men #46, 2004)", 
        "proposed to by Black Panther (Black Panther #14, 2006)", 
        "back to the X-Men (Uncanny X-Men #487, 2007)"
    ], 
    "speed": 5, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 127
}