{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "None", 
            "content": "The Stranger happened upon Earth in the mid-20th Century, apparently attracted by the sudden proliferation of superhumanly powered beings on Earth. Investigating some of these beings the Stranger encountered Magneto and his Brotherhood of Evil Mutants, and the original X-Men. The Stranger took Magneto and the Toad with him to his home-base to study. Apparently from his observations of Magneto and the Toad, the Stranger concluded that the powers in the process of development by the denizens of Earth would be misused and, in time, become a threat to other worlds. Thus he journeyed to Earth in two occasions for the express purpose of limiting Earth’s population through a random purge. On each of these occasions, he was convinced by the selfless actions of Earth beings (the Hulk and scientist Al Harper) the Earth had the potential for good. After his second attempt to destroy Earth, the Stranger declared it safe from any future reprisals.Since that time, the Stranger has employed his vast powers on behalf of the Earth. The first of these incidents pitted him against his ancient enemy, the Overmind. The Stranger used his superior power to imprison the Overmind on a mole of dust. The second time he assisted Earth in the deactivation of the Null-Life Bomb, the same device that he once invented to destroy Earth’s population. The third time he came to Earth was to thwart a plot by the Olympian god Pluto.", 
            "durability": 6, 
            "education": "Unrevealed", 
            "energy": 7, 
            "eyes": "Black\n", 
            "fighting": 2, 
            "firstappearance": "X-Men #11 (1965)\n", 
            "groupaffiliation": "None", 
            "hair": "White (Variable)\n", 
            "height": 0, 
            "id": "Stranger", 
            "identity": "Unknown to the general public", 
            "intelligence": 7, 
            "knownrelatives": "None", 
            "occupation": [
                "Surveyor of worlds", 
                "scientist", 
                "accumulator of data", 
                "experimenter"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "The Stranger possesses cosmic and psionic power beyond human measurement. Whether he taps outside sources of cosmic energy or the energy is generated inside him is not known. He can employ his cosmic energies for a vast number of effects. He can project large amounts of cosmic energy with great concussive force. He can mentally manipulate the molecules of ordinary matter into other shapes with different properties. He can alter his own size, mass, and density to unknown limits at will (he has appeared at 6 feet in stature as well as 50 feet), or alter the size and mass of other objects and organisms. He can convert matter to an unknown form of energy and teleport it through space at hyper-light speeds. He can erect invisible force shields of great impermeability. Further, he can use cosmic energy to enhance his own physical powers, such as speed, strength, and endurance. He can mentally manipulate gravitons to allow himself to levitate. The extent of the Stranger’s extrasensory and psionic powers are unknown.\nThe Stranger possesses several known limitations to his power. Among them: he cannot travel through time unaided, resurrect the dead, attain solar-system scale stature, or move planet-sized objects unaided. Due to the manner of his search for knowledge, it can be inferred that he is not omniscient, nor precognitive.", 
            "realname": "Unknown", 
            "speed": 7, 
            "strength": 7, 
            "universe": "Marvel Universe", 
            "weight": "Variable\n"
        }
    }
}