{
    "citizenship": [
        "United States Citizen", 
        "With No Known Criminal Record"
    ], 
    "content": "With the help of his good friend, Doctor Emilio Licciardo, Martin Strong is able to use his mutant genius level abilities to create the company Strong Industries. Through Strong Industries, Emilio Licciardo helps develop a synthetic body for himself, giving him a 'normal' appearance. This synthetic body was also capable of enduring incredible amounts of damage and granted him super human strength.Martin Strong would eventually get married, and have two children (one daughter, one son). However, his wife, upon discovering that he was a mutant, feared that their children might end up mutants as well, took them and fled.Hating how his body had become disfigured, because of his genetic mutant DNA, Henry Strong sought to 'cure' the world of all mutants.Martin Strong became aware that someone was closing in on his idea the 'cure' the world of mutants, and used Michelle Balters Neurotap to lure them out. As it turned out, Sam Guthrie Cannonball and Theresa Cassidy Syrin of X-Force had been undercover, interning for Doctor Licciardo.Letting Michelle 'escape' from Strong Industries, he then sent Adam-X X-Treme after her. Michelle is rescued by X-Force, and explains what Strong Industries does to Cable. Elsewhere, Shatterstar and Rictor briefly fight with Adam-X, before forming an alliance. Together, they all agree to try and take down Strong Industries.However, at that same time, Martin Strong confronted Sam and Theresa at Strong Industries, and easily defeated them and placed them in the same holding cell as their teammate, Feral, whom Martin Strong had previously captured.Adam-X returns to Strong Industries, with Rictor and Boomer as his prisoners, however, it turns out to be a ploy to surprise Henry Strong and get the rest of X-Force within Strong Industries. Henry Strong, however, decides to make his escape, rather than confront X-Force. When Cable gives the command to tear the entire facility down to find Strong, Neurotap stops and explains that the machines in the room are the only thing keeping some of the mutants alive. Cable agrees to leave the testing room standing.A short while later, however, Strong appears and ambushes X-Force. He also, at that time, explains how he's disappointed in Adam-X's betrayal and how he would have helped him the way he helped Michelle. It's then that the others realize that Michelle had betrayed them to Henry Strong. Using her power, she renders everyone unconscious, save for Adam-X, who uses his own power to cut her and \"flash fry\" her blood, rendering her unconscious.Cable then uses a Ionic Molecular Blade to cut through Henry Strong's durable flesh; once cut, Adam-X uses his power to flash fry him. The result is something no one expects; as Henry Strong's synthetic body explodes, revealing Henry Strong's true form; a smaller body, whose mutated hands and feet have become fins.Doctor Licciardo explains that Michelle had little choice, as it was Henry Strong who was paying for the medical bills of Michelle's parents, who were both vegetative comas. X-Force leaves without pursuing it further, and Doctor Licciardo is left to pick up the pieces of Henry Strong's life - once again.Henry Strong is seen next, when Shatterstar and Domino attempt to sneak into Hannigan Electronics, which is a division of Strong Industries. Floating within the liquid tank, Strong's mutant body is seen floating; awaiting his next synthetic body.Strong's next body was actually a symbiotic \"relationship\" with a mutant by the name of Freddy. Freddy, whose mutant power, manifested itself and deformed his body so that bones jutted out, with skin growing into an umbrella-like state. His exterior collapsing into an interior shell. With Henry Strong lowered into Freddy's \"spider like\" body, Henry could once again move - and not only that, \"feel\" Freddy's mind and the joy it gave him to connect with Strong, and have a purpose.When Strong finds himself under attack by Shatterstar, Rictor, and Ashi (who also goes by the name Hanransha), it's the arrival of Danielle Moonstar Moonstar, Thunderbird, and Cannonball that breaks up the fight. Strong explains that Ashi's body is rapidly deteriorating. He goes on to explain that Hanna Verschlagen, one of his own scientists had bred all of the test subjects with a dependency for a neural cortical enzyme - that without it - would cause their bodies to deteriorate. He also revealed that Hanna Verschlagen was going to use these bred mutants to jump start her own latent mutant abilities.", 
    "durability": 1, 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "X-FORCE ANNUAL #2\n", 
    "groupaffiliation": "Strong Industries", 
    "hair": "None\n", 
    "height": 0, 
    "id": "Strong,_Martin", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unnamed Wife, Unnamed Son, Unnamed Daughter", 
    "occupation": "Owner of Strong Industries", 
    "origin": "X-Force Annual #2", 
    "powers": "Martin Strong is a mutant, whose ability granted him incredible intelligence. Unfortunately, a side effect of Martin Strong's mutant genes, also deformed his body, so that both his hands and feet are fins, granting him enhanced movement in the water.", 
    "realname": "Martin Henry Strong", 
    "significantissues": "X-Force Annual #2, X-Force Annual 1999, X-Force #35", 
    "speed": 1, 
    "strength": 1
}