{
    "add": {
        "doc": {
            "aliases": [
                "John Sublime", 
                "Hypercortisone-D/Kick", 
                "Michael Grand", 
                "Fantomex", 
                "Emapth", 
                "Tattoo"
            ], 
            "citizenship": "Inapplicable", 
            "content": "After taking the Transpecies Movement public, Sublime purchased an old prison near Hong Kong whose sole inmate was the mutant Kuan-Yin Xorn. Sublime sought to transform the prison into a mutant organ farm, but its plan was thwarted when the X-Men were alerted to the situation by Xorn’s warden, Ao Jun. Sublime later met with X-Men Cyclops and Emma Frost, and used the living brain of mutant Martha Johansson to subdue them for harvesting. Sublime then ordered his U-Men to attack the X-Men’s home at the Xavier Institute to use it as an organ farm, but the X-Man Jean Grey defeated them. Cyclops and Emma escaped and confronted Sublime, whom Johansson telepathically forced to fall from the building, killing its human host. Taking a new host, Sublime rewrote their DNA to match John Sublime’s and set about replicating a part of itself to create the aerosol drug Hypercortisone-D, a.k.a. “Kick,” which enhanced mutant powers while causing violent insanity. As Kick, Sublime compelled student Quentin Quire to cause a riot at the Institute and incited Xorn to launch an all-out attack on New York as Magneto.Later, the Weapon X program’s newest agent, Chamber, assassinated Sublime’s human host, but it simply took on another host body and altered its DNA to become John Sublime once more. The former Weapon Plus agent Fantomex subsequently teamed with Weapon X’s Agent Zero and Wolverine in confronting Sublime, though Sublime’s U-Men forced the trio to retreat. Sublime later posed as Megacorp head Michael Grand to obtain a new breed of genetically-enhanced super-beings created by Mister Sinister to use in an army to oppose Weapon X. For a year, Fantomex killed many of Sublime’s hosts until, during one such attempted assassination, Sublime’s host body was instead killed by Chamber, and it chose Fantomex as its next host. Subsequently, thirty years into the future of at least Earth-5700, Sublime abandoned Fantomex and infected Wolverine, whose consciousness had been sent to the past of Earth-616 to the time of his initial escape from Weapon X. Sublime infected Wolverine’s past body to ensure he scarred Colcord, setting in motion the chain of events that would lead to the future decimation of mutant-kind. Rejected by Wolverine’s healing factor, the Sublime bacteria then infected John Sublime, creating a temporal loop.", 
            "durability": 6, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "(Host) Blue\n", 
            "fighting": 1, 
            "firstappearance": "(As John Sublime) New X-Men Annual 2001 (2001); (as Kick) New X-Men #134 (2003); (as Michael Grand) Weapon X #26 (2004)\n", 
            "groupaffiliation": [
                "(John Sublime) Weapon Plus", 
                "Transpecies Movement (founder)", 
                "U-Men (founder)", 
                "formerly Weapon X", 
                "(Michael Grand) MegaCorp (founder)"
            ], 
            "hair": "(Host) Black\n", 
            "height": 0, 
            "id": "Sublime", 
            "identity": "Secret", 
            "intelligence": 4, 
            "knownrelatives": "Unrevealed", 
            "occupation": [
                "Terrorist", 
                "cult leader", 
                "businessman", 
                "scientist"
            ], 
            "origin": "New X-Men #154 (2004)", 
            "placeofbirth": "Prehistoric Earth", 
            "powers": "The Sublime bacterium can possess other sentient beings and usurp their consciousness. Like all bacteria, Sublime replicates via binary fission, with a single cell dividing into two duplicate cells. It can control this geometric progression, as when it.", 
            "realname": "Sublime", 
            "significantissues": [
                "John Sublime worked as assistant on original Weapon X program, possessed by Sublime bacteria (Weapon X #23/Weapon X: Days of Future Now #5, 2004/2006)", 
                "Sublime’s \"The 3rd Species\" book implicated in shooting incidents, responded to allegations in televised debate, met with Cyclops & Emma Frost, captured them using Martha Johansson’s mutant brain, sent U-Men to attack Xavier Institute (New X-Men #118-119, 2001)", 
                "U-Men defeated by Jean Grey, Cyclops & Emma Frost escaped, confronted Sublime, Frost forced to drop Sublime out office window by Johansson which killed its host body (New X-Men #120, 2001)", 
                "followed Wolverine’s consciousness back into past of Earth-616 to force Wolverine into scarring Colcord during escape from Weapon X, thus ensuring Colcord would go on to create Sentinel army to decimate mutant-kind in future (Weapon X: Days of Future Now #5, 2006)\nNote: For complete listing view Official Bibliography"
            ], 
            "speed": 2, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 162
        }
    }
}