{
    "aliases": "Famine", 
    "citizenship": "Japan", 
    "content": "Invited to join Saburo in America, Tomo incited Shiro to attack the Capitol building in Washington, but he was opposed by the heroic mutant X-Men. Saburo sought to reason with Shiro but was shot and killed by Tomo, who in turn was killed by Shiro. Deported back to Japan, Shiro found himself a social outcast for having dishonored his father. He fled to Tokyo’s slums and fell in with the criminal Dragon-Lord of Krakinowa, who sought to restore Japan’s status as a world power. Sunfire was sent to destroy an American cargo ship, leading to conflict with Namor the Sub-Mariner, who made Sunfire realize the ramifications of his actions and teamed with him to defeat the Dragon-Lord. Having redeemed himself, Sunfire was accepted as Japan’s protector. Sunfire soon encountered the American hero Iron Man in Vietnam, but was kidnapped by the would-be conqueror the Mandarin. Iron Man intervened and rescued Sunfire, who then sought revenge, but was opposed by the Mandarin’s giant robot Ultimo. Once again saved by Iron Man, Sunfire began to rethink his anti-American beliefs.Later, Sunfire was contacted by Professor Xavier, who was recruiting a new team of X-Men to help rescue the original group from the living island Krakoa. Sunfire joined up long enough to help defeat Krakoa, but refused to stay with the team as he was devoted to serving Japan. Later, when Moses Magnum was threatening to sink Japan into the sea, Sunfire was unwilling to accept the X-Men’s help; but he was countermanded by Japan’s Prime Minister, who forced Sunfire to work with them. Together, they defeated Magnum, and Sunfire’s opinion of the X-Men improved as a result. Later, the X-Men and Sunfire were among the many heroes forced to participate in the Grandmaster’s Contest of Champions, during which Sunfire battled Darkstar to a standstill. After the giant green dragon named “Puff” attacked Tokyo, Sunfire was sent to work with the X-Men again by his cousin Mariko, now leader of Clan Yashida.Sunfire later investigated the new designer drug “Sleet,” tracing its origins to the island nation of Madripoor, where he teamed with mutant soldier Cable (an old friend of his father’s), the New Mutants and the X-Man Wolverine against the Mutant Liberation Front. Returning to Japan, Sunfire was captured by Doctor Demonicus and brainwashed into serving as a member of his terrorist Pacific Overlords. Sunfire and fellow pyrokinetic Pele were sent to Hawaii to disrupt a ceremony honoring Namor for his World War II heroism. Opposed by Namor and the Avengers, they freed Sunfire from Demonicus’ thrall, and he joined the heroes in defeating the Overlords. The Japanese government soon outfitted Sunfire with a specially-designed suit of armor, the successful test of which inadvertently ruptured a dimensional void that threatened to swallow the entire Earth. Working together, the X-Men and Sunfire resealed the void. Later, after Wolverine became involved in a war between Clan Yashida and the ninja Hand clan, Sunfire came to his aid, but was unable to prevent Mariko from being poisoned. Sunfire was subsequently tasked with escorting a Japanese whaling fleet to Antarctica to protect them from hostile Atlanteans. Sunfire erroneously believed Namor was responsible, but the true culprit was ultimately revealed to be Namor’s rival Attuma.When the X-Men’s nemesis Magneto released an electromagnetic pulse across the globe, the energy overloaded Sunfire’s body and caused his powers to flare out of control directly over Tokyo. This forced the Japanese government to imprison Sunfire, but he was soon freed by his cousin the Silver Samurai and Wolverine to help oppose a government plan to outfit giant Red Ronin robots with mutant-hunting technology. Battling one of the robots, Sunfire’s powers again flared out of control and Wolverine suggested he seek aid from Canada’s Department H, unaware that the Department had fallen into malevolent hands. Informed by the Department’s scientists that he had radiation poisoning, Sunfire remained with them seeking a cure. Unknown to Sunfire, the scientists had injected him with Zero Fluid, a compound that turned half his body jet black and created an ambient charge of bio-kinetic energy within his body that conflicted with his bio-atomic powers. Frustrated by the scientists’ inability to cure him, Sunfire returned home, seeking refuge in an abandoned monastery. There, he was contacted by the Japanese government to join the fledgling super-team Big Hero 6. Sunfire initially declined, but later joined the team to help defeat the Everwraith. Possessed by the ethereal creature, Sunfire resisted its attempts to release his powers, but when his young teammate Hiro learned the truth of his condition, Sunfire expelled the entire bio-kinetic charge instead, dispersing the Everwraith. Eventually, the Zero Fluid was removed from his system, and he was assigned to work as a field agent with the Yakiba, the Japanese military intelligence. His first mission was to expose a shapeshifter that had infiltrated the military. Mistakenly believing this to be Mystique, Sunfire sought her out, but encountered Rogue instead. Together, they discovered that the true culprit was an alien Skrull who had been watching Sunfire as part of an alliance with the eternal mutant Apocalypse and his plans involving the legendary Twelve, mutants supposedly destined to usher in a golden age for their kind. In truth, Apocalypse sought to gather them together so as to siphon their collective powers to grant himself godlike power, and to that end he sent his Horseman Famine to capture Sunfire. Ultimately, the Twelve were able to break free, and Apocalypse was defeated.After the mystic city of K’un-Lun began appearing in the midst of Tokyo, Sunfire teamed with several American heroes to prevent its full manifestation. A short time later, Sunfire was approached by the feral mutants Sabretooth and Wild Child with an ultimatum to join the subversive Weapon X organization. Sunfire declined and attacked Sabretooth, but was in turn shot by Wild Child and left for dead. Sunfire survived this encounter and soon after accepted an offer from Xavier to join the X-Corporation, a global mutant search and rescue operation, in its Mumbai, India headquarters. Still acting as protector of Japan, Sunfire encountered the alien Titannus, who sought to forcibly recruit Earth’s heroes into an army to wage intergalactic war. Titannus easily defeated Sunfire, and then attacked Tokyo, resulting in several of Earth’s heroes teaming up to defeat him. Later, Sunfire was implicated in Clan Yashida’s criminal activities and his status as Japan’s protector was suspended. Sunfire sought to clear his name and joined with Rogue to oppose the perpetrator, Dark Wind’s daughter Lady Deathstrike. In the ensuing clash, Deathstrike severed Sunfire’s legs and defeated Rogue, imprisoning them both with Deathstrike’s other captive, Blindspot. Sunfire bade Rogue absorb his powers, and he seemingly died from the strain. After Deathstrike was defeated, Rogue returned to her hideout, but Sunfire’s body was gone. During the mutant Scarlet Witch’s reshaping of reality, Sunfire was seen alive and well as the Emperor of Japan.", 
    "durability": 4, 
    "education": "College graduate", 
    "energy": 7, 
    "eyes": "Dark brown\n", 
    "fighting": 6, 
    "firstappearance": "X-Men #64 (1970)\n", 
    "groupaffiliation": [
        "Marauders", 
        "formerly Horsemen of Apocalypse", 
        "X-Corporation", 
        "Yakiba", 
        "Twelve", 
        "Big Hero 6", 
        "Pacific Overlords", 
        "Death's champions", 
        "X-Men"
    ], 
    "hair": "Black\n", 
    "height": 70, 
    "id": "Sunfire", 
    "identity": "Secret (known to some government officials)", 
    "intelligence": 4, 
    "knownrelatives": "Saburo Yoshida (father, deceased), unidentified mother (deceased), Tomo Yoshida (uncle, deceased), Leyu Yoshida (Sunpyre, half-sister, deceased), Yoshi (cousin, deceased), Shingen Harada (first cousin once removed, deceased), Mariko Yashida (second cousin, deceased), Kenuichio Harada (Silver Samurai, second half-cousin)", 
    "occupation": [
        "Terrorist", 
        "former adventurer", 
        "government agent", 
        "student"
    ], 
    "origin": "X-Men #64 (1970)", 
    "placeofbirth": [
        "Agarashima", 
        "Japan"
    ], 
    "powers": "Sunfire can biochemically ionize matter and convert it into the super-heated plasma state of matter, generating temperatures of about 1,000,000º Fahrenheit which he most often releases as force blasts from his hands. Sunfire can recharge and enhance his stored power by absorbing both solar and electromagnetic energy. He can also view his surroundings in the infrared spectrum. Sunfire can create super-heated air currents which enable him to fly while leaving a trail of flame behind him. Sunfire also generates an invisible field of psionic energy which protects him from the heat and radiation generated by his own powers, as well as from outside sources. The field also shields him from air friction and the light generated by his plasma, as well as lending a certain level of protection from kinetic impact.", 
    "realname": "Shiro Yoshida", 
    "significantissues": [
        "Briefly teamed with Mystique, Rogue & Blindspot (Rogue #10, 2005)", 
        "attacked Capitol, vs X-Men (X-Men #64, 1970)", 
        "with Dragon-Lord, vs Namor (Sub-Mariner #52-54, 1972)", 
        "with Iron Man, vs Mandarin & Ultimo (Iron Man #68-70, 1974)", 
        "briefly joined X-Men (Giant-Size X-Men #1/X-Men #94, 1975)", 
        "with X-Men, vs Moses Magnum (X-Men #118-120, 1979)", 
        "with Pacific Overlords, vs Namor (Avengers West Coast #71 & 74, 1991)", 
        "sought help from Department H, exposed to Zero Fluid, left Department H (Alpha Flight #1-2, 7-8 & 13, 1997-1998)", 
        "briefly joined Big Hero 6 (Sunfire & Big Hero 6 #1-3, 1998)", 
        "active with X-Corporation (New X-Men #133, 2002)", 
        "vs Titannus (Marvel Team-Up #4-6 & 8-9, 2005)", 
        "crippled by Deathstrike, powers permanently absorbed by Rogue (Rogue #10-12, 2005)", 
        "became emperor of Japan during Scarlet Witch’s reality warp (New X-Men: Academy X #16-19, 2005)", 
        "joined Marauders (X-Men #200, 2007)"
    ], 
    "speed": 6, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 175
}