{
    "aliases": "None", 
    "citizenship": "Japan", 
    "content": "Shortly thereafter, the Timebroker plucked Sunfire out of her reality and placed her with the Exiles. He informed Sunfire that if she did not help the Exiles succeed in their mission her powers would manifest as uncontrollable radiation.During her initial missions, Morph helped her adjust to being an Exile and, in the process, developed feelings for Sunfire. Morph eventually revealed his feelings for Mariko, but was rebuffed. Morph still cared deeply for her and agreed to remain friends.In a reality where the Legacy Virus combined with a techno virus, Sunfire briefly dated Spider-Woman. They formed a strong bond in a short amount of time, but the relationship ended when the team completed their mission and teleported away.On a subsequent mission, Sunfire was bitten by an Avenger vampire. The Exiles sought to save her by defeating Captain America, whom they assumed to be the head vampire. Regaining consciousness just in time, Sunfire was able to save this reality from the brutal reign of the new vampire king, Union Jack. The dying Union Jack cast a spell on the Exiles as they teleported away and the team was separated.Nocturne and Sunfire were returned to the Legacy Virus world. Stranded for weeks, Sunfire's relationship with Spider-Woman became very serious. Sunfire was the happiest she had ever been. Eventually, against Sunfire's wishes, the Timebroker reunited the Exiles and Sunfire lost her true love.", 
    "durability": 1, 
    "education": "College", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Exiles #2\n", 
    "groupaffiliation": [
        "Formerly Exiles", 
        "X-Men"
    ], 
    "hair": "Black\n", 
    "height": 66, 
    "id": "Sunfire_(Earth-2109)", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Former adventurer", 
        "reality traveler"
    ], 
    "placeofbirth": [
        "Tokyo", 
        "Japan"
    ], 
    "powers": "Sunfire was a mutant with the ability to produce super-hot plasma. She could generate plasma temperatures that could conceivably rival that of the sun, although what that would have done to her is unknown. She could also use her heat-producing abilities to generate thrust, allowing her to fly close to 100 miles an hour.", 
    "realname": "Mariko Yashida", 
    "significantissues": "Deceased (Exiles #37)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Unrevealed", 
    "weight": 125
}