{
    "aliases": [
        "Robert DaCosta", 
        "Bobby", 
        "Black Rook", 
        "Black King", 
        "Reignfire"
    ], 
    "citizenship": "Brazil", 
    "content": "At one point, he was reunited with his long-lost mother who, because she was an archeologist on an expedition, had remained estranged from her son for many years. She invited Roberto and his teammates to join her on an expedition in Brazil, but unknown to all, Roberto’s father, Emmanuel da Costa, had formed an alliance with the Hellfire Club and was determined to stop her, as he had business interests in the same area. The Club’s assassin, Axe, failed to kill her, thanks to the New Mutants, and her expedition soon led to the discovery of Nova Roma and the New Mutant’s subsequent recruit, Magma. Emmanuel da Costa would go on to become a member of the Inner Circle of the Hellfire Club, the same group that originally tried to kidnap his son. Despite his Roberto’s protests when he found this out, his father went on to become the White Rook of the Inner Circle.Sunspot left the New Mutants at one point, feeling that the others blamed him unfairly for using his powers and injuring their teammate Cannonball during a soccer game. He made his way to Los Angeles, followed by the Warlock, and encountered the gang called the Fallen Angels. The two stayed with the Fallen Angels for a brief time, until it was revealed they had been gathered by Ariel, who was a member of an alien race studying mutations. Ariel betrayed the Angels to her alien race, who kidnapped the team for study. Sunspot helped the Angels escape, after which he and Warlock returned to the New Mutants.Just prior to the disbanding of the New Mutants, Sunspot learned that his father had died, and he was contacted by Gideon, a businessman and mutant who wanted to help da Costa assume his new role as leader of the da Costa family fortune. In reality, Gideon was a member of the Externals, a subset of the mutant race who believed themselves immortal, and they believed da Costa to be an External as well. Gideon initially groomed Bobby for his role as an External, even to the point of being responsible for his father's death by poisoning him. However, Gideon soon discovered that he wrong. He instead subjected Bobby to hideous experiments. Sunspot was later rescued by his friends who now made up the team X-Force, and Sunspot joined their number.One of Gideon’s experiments was the attempt to reproduce Sunspot's powers in another being. A test subject named \"Project 19\" was given a transfusion of Sunspot's blood, resulting in the being Reignfire. Reignfire became the leader of the Mutant Liberation Front, and when the team clashed with X-Force, he hinted that he was actually Sunspot. About the same time, the true Sunspot entered a transport portal when battling the M.L.F.’s Locus and was separated from his team. Unfortunately, it was months before X-Force encountered Reignfire again, and when they did, their leader, Cable, used his telepathic powers to “restore” Sunspot/Reignfire’s memory, since they believed that Reignfire must be a version of Sunspot from the future.In fact, Reignfire had captured Sunspot through a telepathic link between them that gave Reignfire all of Sunspot's memories and allowed him to control the mutant. Reignfire then switched places with his counterpart, convincing X-Force that Sunspot was Reignfire instead, controlling Sunspot to the point that it he still appeared to be Reignfire leading the M.L.F. Shortly, however, Cable discovered the truth, breaking the telepathic link and ousting Reignfire. Still, Reignfire retained Sunspot's powers and memories, and in their next encounter he was able to siphon Sunspot's powers into his own body. In his final battle with X-Force, Reignfire's physical form was destroyed by a molecular disruptor, and he took possession of Sunspot's form. With the aid of the disruptor and his teammate Siryn, Sunspot eventually regained control. Sunspot then drained Reignfire of all of his energy, leaving him powerless.Da Costa was later blackmailed into joining the Hellfire Club by its Black Queen, Selene. Selene originally taunted Sunspot by claiming that Damocles Foundation, formerly run by Gideon, was seeking to begin a new experiment similar to the process that created Reignfire. The two raced to stop it, and they were joined by X-Force. However, Selene wanted the process for herself, and she subdued Sunspot and X-Force. She then offered to resurrect the spirit of Juliana, Sunspot’s first love, in exchange for his agreement to become a member of her new Hellfire Club. Sunspot, distraught, agreed, although Juliana was resurrected in the body of an unknown girl. Sunspot agreed, although whether or not he was truly reunited with Juilana was never revealed.Presumably, many of Sunspot’s allies remain unaware of his involvement with the Hellfire Club, as Bobby also served as head of the Los Angeles branch of the X-Corporation before its dissolution. About the same time, he was approached by Sebastian Shaw who claimed to be the Club’s Lord Imperial, Once again, Donald Pierce appeared to challenge Shaw. Pierce was defeated with the combined efforts of both the X-Men and Shaw, being decapitated in the process. Even so, Shaw was severely injured, and he stepped down to allow da Costa to become the Lord Imperial.", 
    "durability": 4, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "Brown\n", 
    "fighting": 5, 
    "firstappearance": "Marvel Graphic Novel #4\n", 
    "groupaffiliation": [
        "New Mutants", 
        "formerly Hellfire Club", 
        "X-Corporation", 
        "Mutant Liberation Front", 
        "X-Force", 
        "Fallen Angels"
    ], 
    "hair": "Black\n", 
    "height": 68, 
    "id": "Sunspot", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Emmanuel da Costa (father, deceased), Nina da Costa (mother)", 
    "occupation": [
        "Adventurer", 
        "businessman"
    ], 
    "placeofbirth": [
        "Rio de Janeiro", 
        "Brazil"
    ], 
    "powers": "Able to absorb solar energy and metabolize it into physical strength, convert it into thrust to enable flight, or rechannel it as heat or infrared radiation. When doing so, DaCosta's features melt away into a black mass of crackling dark energy. In unlighted places, DaCosta suffers a slight drop in his power levels.", 
    "realname": "Roberto da Costa", 
    "speed": 4, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 170
}