{
    "aliases": "None", 
    "citizenship": "U.S.A. (criminal record)", 
    "content": "The Swordsman later tried to infiltrate the Avengers as a way to get away with his crimes more easily.  The Swordsman became involved in a scuffle with the Scarlet Witch and Quicksilver.  He was identified by Clint who was now the heroic Hawkeye and was sent away. The Mandarin teleported Duquesne to his ship where he modified the Swordsman’s sword and made a deal with him to destroy the Avengers by again infiltrating them. Through the Mandarin’s tricks, the Avengers accepted the Swordsman who went through a trial and fought alongside them for a time. When the time came to destroy the Avengers, the Swordsman planted the bomb the Mandarin gave him, but could not bring himself to gain victory in that way. When seen trying to deactivate the bomb, he was misunderstood and was forced to flee.The Swordsman clashed with the Avengers many times after that, including in a partnership with Powerman and the Enchantress and as part of a team of villains assembled by the Mandarin. In their clashes, Hawkeye had proved himself no longer inferior to the Swordsman and proclaimed his freedom from his old mentor. The Swordsman eventually did join the Avengers for righteous reasons and served well. During this time he had a romantic relationship with the Mantis. On one of the Avengers missions, the Swordsman was slain, dying a hero.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Avengers #19 (1964)\n", 
    "groupaffiliation": [
        "Formerly Batroc's Brigade", 
        "Legion of the Unliving", 
        "Avengers", 
        "the Mandarin's unnamed super villain team", 
        "partner of Powerman and the Enchantress", 
        "formerly employed by the Mandarin"
    ], 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Swordsman_(Jacques_Duquesne)", 
    "identity": "Known to authorities", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Formally Adventurer", 
        "criminal", 
        "circus performer"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "None", 
    "realname": "Jacques Duquesne", 
    "significantissues": "Avengers #19", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 250
}