{
    "add": {
        "doc": {
            "aliases": [
                "Margali of the Winding Way", 
                "Sorceress Supreme", 
                "Fata Morgana", 
                "Red Queen"
            ], 
            "citizenship": "France", 
            "content": "Margali aided Dr. Strange against the demon Thog in the dimension of Sominus, but Strange distrusted Szardos. When Jimaine applied to be Strange's disciple, Margali and Strange locked horns, and after testing Strange's strength, Margali le Strange to believe her powers rested in her wand of power, and that its destruction left her powerless. During a low point on the path, Margali was briefly captured by the demon D'spayre and rescued by Kurt and Jimaine; shortly thereafter, the sorcerer Gravemoss, who was just ahead of Margali on the Winding Way, attempted to gain the mystic Soulsword. Margali had Jimaine oppose Gravemoss and acquired the sword, and Margali then used the sword to destroy those preceding her on the Way, binding their spirits to her caravan home. This induced cravings for greater power, and when she discovered a demon bound below London, she joined that city's Hellfire Club as the Red Queen. Using their resources, she freed the demon, which trapped her. Jimaine defeated it, but Belasco snatched Margali away before she could recover. Imprisoned, Margali switched minds with her daughter, but soon returned to free Jimaine, who became lord of Belasco's Limbo (A.K.A Otherplace). The extradimensional Ruined captured Margali in Paris as a sacrifice; the Fantastic Four rescued her but the French authorities bound her in la Citadel, a sorcerers prison. Seeking her help for their associate Alyssa Moy against the New York Hellfire Club, the Fantastic Four freed her months later. Margali aided the Fantastic Four, Daimon Hellstrom, and the Mechamage in binding that Club's Black Queen, Selene, and her summoned ally Blackheart below Manhattan. Margali, Mechamage, and Moy joined forces thereafter as the Shadow Hunters.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Glowing Yellow (variable)\n", 
            "fighting": 1, 
            "firstappearance": "X-Men Annual #4 (1980)\n", 
            "groupaffiliation": [
                "Shadow Hunters", 
                "formerly Hellfire Club"
            ], 
            "hair": "Green (Variable)\n", 
            "height": 62, 
            "id": "Szardos,_Margali", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "Jimaine Szardos (Amanda Sefton,Magik biological daughter), Stefan Szardos (biological son, deceased), Nightcrawler (adopted son)", 
            "occupation": [
                "Sorceress", 
                "former fortune teller"
            ], 
            "placeofbirth": [
                "Paris", 
                "France"
            ], 
            "powers": "Margali is the equal of almost any sorcerer on Earth, occupying the \"The Winding Way's\" supreme position. The Winding Way grants great power, but that power waxes and wanes predictably; the strength of its followers varies with their position upon the winding path. Margali's full powers are undisclosed, but she is a master of self-alteration.", 
            "realname": "Margali Szardos", 
            "significantissues": "Official Handbook Bibliography", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 115
        }
    }
}