{
    "aliases": "Talisman", 
    "citizenship": "Canada", 
    "content": "As a college archeology student, Elizabeth was excavating the site of the original Fort Calgary when she discovered a skull. When she touched it an apparition appeared that only she could see. Frightened, she sought out her father, whom she recognized as Shaman despite a spell he had cast to prevent himself from being so recognized. Together they investigated the skull, determining that it was the source of ancient anger or ancient evil.Meanwhile, a young woman named Emily Strang was tending to her great-grandfather, Lucas Strang, when she was attacked by a mystical force manifesting itself through scrambled eggs (eggs being both a symbol of new life and a symbol of potential life unfulfilled). Shaman and Elizabeth traveled to the site of the manifestation and Shaman seemingly defeated it. However, the force again manifested itself, this time through Lucas, and possessed Emily. As the possessed Emily attacked Elizabeth, Shaman identified it as Ranaq the Devourer, one of the Great Beasts of the North. Under Ranaq's barrage, Elizabeth found herself growing stronger until she was able instinctively to turn the force of Ranaq's attack back against it. Shaman launched an attack on Ranaq as well and together they drove the beast out of Emily, saving her life. Shortly thereafter, Elizabeth reached into Shaman's mystical medicine pouch at his bidding and withdrew a coronet (later identified as the \"Coronet of Enchantment\"). Placing it on her brow, she was transformed into Talisman, with the power to manipulate vast magical energies and command the spirits of nature to do her will. Talisman joined with Alpha Flight, only to be horrified to later learn that she was unable to remove the Coronet without enduring unbearable, agonizing pain.", 
    "durability": 1, 
    "education": "College graduate", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "(Twoyoungmen) Alpha Flight #5 (1983); (Talismen) Alpha Flight #19 (1985)\n", 
    "groupaffiliation": [
        "Formerly Omega Flight", 
        "Beta Flight", 
        "Alpha Flight"
    ], 
    "hair": "Black\n", 
    "height": 64, 
    "id": "Talisman_(Elizabeth_Twoyoungmen)", 
    "identity": "Public", 
    "intelligence": 1, 
    "knownrelatives": "Micheal Twoyoungman (father, allegedly deceased), Katheryn Twoyoungmen (mother, deceased), unidentified grandfather (deceased), unidentified great-grandfather (deceased)", 
    "occupation": [
        "Sarcee shaman", 
        "archaeologist", 
        "government agent"
    ], 
    "origin": [
        "Alpha Flight #19 (1985)", 
        "Alpha Flight #83 (1989)"
    ], 
    "placeofbirth": [
        "Calgary", 
        "Alberta", 
        "Canada"
    ], 
    "powers": "All of Talisman's powers stem from the ancient Coronet of Enchantment, which she wears on her forehead. However, even without the Coronet, she has shown to possess the ability to absorb and redirect magical energy used against her, but her powers will always be greater when she wears the Coronet. Talisman cannot remove the Coronet without it causing her severe mental pain, however if someone else wears it, returning the Coronet to the true owner would spare them the pain.", 
    "realname": "Elizabeth \"Liz\" Twoyoungmen", 
    "significantissues": "See Handbook Bibliography", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 137
}