{
    "add": {
        "doc": {
            "citizenship": "Shi'ar", 
            "content": "The original Nova Corp was destroyed when the Annihilation Wave tore through the positive matter universe and destroyed the Xandar Cluster and its inhabitants. The human Richard Rider was the only Corps member to survive the destruction of Xandar. During his escape Rider’s body was fused with the Xandarian Worldmind. The Worldmind acted without the knowledge of Rider and secretly begin recruiting five new Nova Corps Centurions:Irani Rael, Qubit, Morrow,  and Fraktur. Tarcel was the fifth and final member of the squadron of Centurions.Tarcel and his comrades journeyed to Earth during the end of the Skrull Secret Invasion. They quickly joined forces with Rider, in his peace keeping efforts. Tarcel and crew battled the likes of the Serpent Society, Black Mamba and Dragon Man during their brief stay on Earth.During the cosmic event known as the War of Kings, the mighty Shi’ar fought the Inhumans and the battle ridden Kree. Tarcel found himself at odds with the Shi’ar, due to his being a loyalist to the rule of Lilandra Neramani. He was not willing to succumb to the psychopathic machinations of the mutant Emperor Vulcan. He looked at all those that followed Vulcan as adversaries to the throne of the Shi’ar.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "White\n", 
            "fighting": 1, 
            "firstappearance": "Nova #19 (2009)\n", 
            "groupaffiliation": "Nova Corps", 
            "hair": "Black\n", 
            "id": "Tarcel,_Malik", 
            "identity": "The general populace of Earth was unaware of Malik's existence.", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Warrior/soldier", 
            "placeofbirth": "Unrevealed", 
            "powers": "As a member of the avian Shi'ar Malik possessed super human strength and durability.", 
            "realname": "Tarcel Malik", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}