{
    "aliases": [
        "Captain America", 
        "Contingency T", 
        "Tony Masters"
    ], 
    "citizenship": "U.S.A.", 
    "content": "The man who would become the Taskmaster was born a prodigious savant of mnemonic talents. [1] He discovered his unusual abilities in childhood when, after watching a cowboy television program, he found he could duplicate the rope tricks he had seen the actors perform. Growing to understand his ability, he saw a man perform a difficult backwards leap from a diving board; he duplicated the dive, but nearly drowned because he didn’t know how to swim. Afterwards, his mother called in psychiatrists who studied his ability, terming it “photographic reflexes.” He employed his talent several times during his youth for professional gain, most notably when he became a star quarterback of his high school football team after watching one pro football game. After graduating high school he contemplated becoming a crimefighter, but decided crime would be more lucrative.He then began a program of observing the fighting techniques of various super heroes and their techniques through archival television news broadcasts to expand his combat repertoire. Initially committing several grand larcenies, he decided it was smarter to avoid risking direct confrontation with law enforcers, and used his stolen capital to establish himself as a combat trainer for aspiring professional criminals, specializing in producing henchmen for super villains and criminal organizations around the world. Designing a costume, he took the moniker “Taskmaster”; one unidentified early graduate of his criminal academy would become espionage legend Spymaster. [2] Taskmaster set up the Solomon Institute for the Criminally Insane as a front for one of his training academies, but its administrator Dr. Pernell Solomon developed heart problems and had Taskmaster’s science staff grow him a clone, Selbe, to harvest for a replacement organ; Selbe escaped and ran to the Avengers, who exposed the operation with the aid of their ally Ant-Man (Scott Lang). Taskmaster single-handedly held his own against both Captain America (Steve Rogers) and Iron Man in combat; while tempted to test himself against all the Avengers, he realized that he would not be able to run his business from jail and fled after the unfamiliar abilities of obscure robotic Avengers associate Jocasta threw him off balance. [3]Along with skull-crushing Canadian mercenary Tyrell Farsa and telepathic mind-altering assassin Black Swan, Taskmaster was hired to kill a militant group by an unrevealed country trying to maintain control of an airstrip. Upon completion of the mission, Farsa disrespected the cultured Black Swan by using his silk handkerchief, and Taskmaster assisted Farsa when the Black Swan attacked, but Black Swan defeated them both. [4] Taskmaster briefly joined the criminal Frightful Four with Wizard (born Bentley Wittman), Deadpool (“Wade Wilson”) and Constrictor to battle the Fantastic Four, but when Deadpool went after Franklin Richards, Franklin proved to be more trouble than planned. When the Fantastic Four soon arrived home and Taskmaster, Wizard, and Constrictor left Deadpool to face the Fantastic Four alone, and this Frightful Four grouping disbanded soon after. [5]Afterwards, Taskmaster went into hiding and continued to training others, including Brock Rumlow (later Crossbones), Blanche Sitznski (later Anaconda), Rachel Leighton (later Diamondback) and Sheoke Sanada (later Snapdragon). Spider-Man (Peter Parker) and Ant-Man (Scott Lang) soon discovered another of Taskmaster’s schools and battled Taskmaster, preventing his theft of nuclear material. [6] Hawkeye (Clint Barton) and Ant-Man later exposed and halted Taskmaster’s use of the Carson Carnival of Traveling Wonders as a mobile recruiting center, [7] and Spider-Man and Nomad (Jack Monroe) disrupted his recruiting street gangs for Black Abbott. [8]After battling the Thing (Benjamin Grimm) and Vance Astrovik (later Justice) in Ohio, Taskmaster was captured by FBI agents and taken into custody. [9]Under the guise of John Smith, the Red Skull manipulated Douglas Rockwell, head of CSA (Commission on Superhuman Activities), into reducing Taskmaster’s sentence in return for training John Walker (later USAgent) as the next Captain America to disgrace the image of Captain America. [10] After completing this assignment, the Red Skull arranged for the Taskmaster’s escape so he could resume his operations. The Skull funded Taskmaster’s activities, and Taskmaster tutored multiple students in Captain America’s fighting style so that the Red Skull could kill them in his own training exercises in order to get his newly cloned body of Captain America in physical fighting shape for a confrontation with the Captain (Captain America, Steve Rogers) and Captain America (U.S. Agent, John Walker). Later, Taskmaster set up a new academy at Brooklyn, New York mausoleum where he battled Spider-Man, who believed Taskmaster had kidnapped his wife, Mary Jane Watson-Parker; using a magnesium flare, Taskmaster escaped both capture and Spider-Man’s wrath.[11]  When the Spymaster was believed slain, unscrupulous industrialist Justin Hammer hired Taskmaster to train a replacement. Taskmaster’s lethal elimination tests whittled the candidates down to one winner, Nathan Lemon. Taskmaster charged the new Spymaster to retrieve the golden angel ornament from atop of the Christmas tree at Stark Enterprises as a field test in order to graduate before sending him to Justin Hammer. Iron Man decided to let Spymaster walk away with the prize instead of endangering the lives of children in the area. [12]Taskmaster briefly put his operations on hold when a faction of the Hand ninja cult created an assassination contest between Taskmaster and Tombstone to see who could kill the most targets. This led to a battle with vigilantes Daredevil (Matt Murdock) and Punisher (Frank Castle); Taskmaster wound up with the Punisher’s knife in his stomach, and spent some time in a prison hospital recuperating. Taskmaster later resumed operations for the Red Skull and attended an assemblage of Red Skull’s division chiefs, which included Watchdog Prime, Sin (Sinthea Shmidt), Arnim Zola, Minister Blood, Power Broker (Curtiss Jackson), a Scourge of the Underworld, the Resistants’ Crucible (Byron Calley), the Secret Empire’s Number Seven and Hydra’s Baron Strucker. When Crossbones took a leave of absence from the Skeleton Crew, Mother Night, claiming Red Skull requested the training, had Taskmaster train Cutthroat as his replacement.Hired by the Red Skull to kill Spider-Man, Taskmaster took this opportunity to try out new graduates Blood Spider (Michael Bingham), Death-shield (Timothy Karlskin), and Jagged Bow (Joe Emberlin), whom he had trained to be criminal versions of Spider-Man, Captain America and Hawkeye. Spider-Man and the anti-terrorist Solo (James Bourne) defeated the trio as Taskmaster escaped capture once again.Afterwards, Taskmaster battled the Falcon (Sam Wilson) when he helped Tyrone McQuaid escape from one of Taskmaster’s academies; attended the Brass Bishop (Robert Brasman)’s criminal auction in Canada, where he fought Spider-Man and Alpha Flight; crossed swords with Daredevil, Stilt-Man (Wilbur Day), Tatterdemalion and the Wild Boys over restaurant grease believed to be worth half a million dollars; took on Spider-Man and Black Cat (Felicia Hardy) during a bank robbery training session; and testified as a character witness when super-criminal Trapster (Peter Petruski) tried to sue the criminal mechanic Tinkerer for faulty equipment.When the amnesiac Earth-93060 (“Ultraforce”) heroine Siren (Jennifer Pearson) was teleported into one of the academies, Taskmaster gave her an audition to join and eventually developed a relationship with her. Taskmaster also discovered that Diamondback, who had joined under the ruse that she desired more training, had double-crossed him by planting explosives around the academy. When the young mutant Jolt (Kyi), who desired to join Taskmaster’s academy, accidentally triggered one of the explosive devices, Taskmaster had Jolt open a portal large enough for Siren, Jolt and himself to escape. During the journey through the portal, Siren was sent back to her own dimension, Jolt teleported to an unrevealed location, and Taskmaster was pulled forward in time by a dimension-hopping madman as one of many criminals pitted against the Avengers and a distant cosmos’ heroes before being returned to his own time.Taskmaster later kidnapped computer hacker and arms supplier Weasel (Jack Hammer) to retain his services, but after Deadpool defeated Taskmaster, Weasel declined this offer, though he offered his services in the future. Seeking his own death, the mysterious Architect, last of the Shining Ones, arranged a contest involving Blacklash (Mark Scarlotti), Boomerang, the mercenary Bullet, Bushwacker, Elektra Natchios, Fatale, Machete (Alfonso Lopez), Razor-Fist (Douglas Scott), Shatterhead and Maximillian Zaran to see which was fit to kill him. During the contest, Taskmaster overpowered Elektra using Daredevil’s fighting style, but she later returned and defeated him.Later, Taskmaster hired Albino (Augusta Seger), a world renowned biologist specializing in mutagenics (the study of effects of human mutations) to help him duplicate super-powers. Taskmaster employed Batroc (Georges Batroc), Machete (Ferdinand Lopez, Alfonso’s brother), Zaran and Oddball (Elton Healey), along with androids of Beast (Henry McCoy), Black Panther (T’Challa), Captain America, Goliath (Hank Pym), Hulk (Bruce Banner), Iron Man, Quicksilver, Namor, Thor (Thor Odinson), and Vision (“Victor Shade”), to analyze the Avengers’ powers, pitting his operatives against several Avengers members. Taskmaster briefly duplicated the powers of the Avengers Firestar and Justice using Albino’s technology, but he was defeated by the duo and Hawkeye, and his new powers apparently faded. [13] When the Avengers began using proactive tactics, they targeted Taskmaster’s numerous academies, briefly putting a stop to his operations and denying criminals, terrorists and super villains a valuable resource; however, Taskmaster continued to elude them. [14]Taskmaster briefly employed Constrictor, Copycat (disguised as Titania/Mary MacPherran) and the “Deadpool Interns” — Deadair, Deadend, and Deadweight — to seek revenge on Deadpool. Afterwards, Taskmaster entered Madripoor’s Bloodsport tournament to help boost his price in training super villains, but was defeated by the telepathic mass murderer Mister X.Trying to make up for the lost profit, Taskmaster returned to mercenary assignments and accepted Sunset Bain’s commission to sabotage a semiconductor being built by Tony Stark. Taskmaster completed the assignment, but when Bain tried to have him killed, he tricked Triads gangs into attacking her, ultimately harming her organization enough that she finally called off her hit. During this time he became involved with Sandi Brandenberg, but eventually broke it off; while they remained friends, he found it difficult to give her up. When Deadpool employed Sandi as a secretary, she brought Taskmaster in to aid him against the Black Swan. Taskmaster helped set Deadpool on the path to facing the Black Swan, and he also found time to execute Sandi’s then-boyfriend when he learned he had beaten her. When Deadpool seemingly died in an explosion battling the Black Swan, Sandi believed the amnesiac Agent X (Alex Hayden) was Deadpool, and Taskmaster trained him on Sandi’s behalf, then aided Agent X and Outlaw (Inez Temple) when the Four Winds crime family clashed over Agency X’s property. Discovering Agent X was an amalgam of Black Swan's agent Nijo, Deadpool, and Black Swan, they arranged to restore themselves to normal, but when the Black Swan tried to double-cross them, Taskmaster, Outlaw, Sandi and the Eastern Wind helped Deadpool and Agent X defeat Black Swan.The Committee, a cartel of financiers ostensibly dedicated to reviving the US economy through illegal activities, hired Taskmaster to assassinate vigilante Moon Knight (Marc Spector), who had been instrumental in defeating them in the past, after their agent the Profile determined that Moon Knight was without friends or determination. Taskmaster found that this was not the case, as Moon Knight’s friends came to aid him, and he tried to get out of his Committee deal, but Moon Knight pursued him to the Committee’s base and defeated him in battle. [15]Arrested and imprisoned under unrevealed circumstances, Taskmaster was recruited for government service by the CSA during the “Civil War” between US super heroes following passage of the Superhuman Registration Act (SHRA). Assigned to the Thunderbolts, Taskmaster joined other superhuman criminals in attacking Captain America’s anti-SHRA forces. Following Cap’s surrender, Taskmaster was re-arrested, but before being transferred to the Negative Zone prison 42 he was quickly released by Deadpool, who had hoped to re-establish his reputation by defeating Taskmaster in a public display of combat. [16]SHIELD Commander Maria Hill gave Taskmaster a full presidential pardon after he helped test the defenses of a S.H.I.E.L.D. Helicarrier. The CSA then recruited him to train three clones of accidentally slain Fifty State Initiative cadet MVP in Spider-Man’s fighting style so they could become Initiative agents as the Scarlet Spiders. Afterwards, Taskmaster was assigned to Camp Hammond as the Fifty State Initiative recruit drill instructor, where his many students included Ant-Man (Eric O'Grady), Bengal (Duc No Tranh), Cloud 9 (Abigail Boylen), Crusader (Z'reg), Dragon Lord, Geiger, Komodo (Melati Kusama), Melee, Rage, Red 9, Speedball (Earth-8101)’s simian Robbie Baldwin), Stature, Triathlon and Ultragirl. Later, super-criminals Firebrand (Russ Broxtel), King Cobra (Klaus Voorhees), Mauler (Brendan Doyle) and Mister Hyde made a failed attempt to kill the Taskmaster for joining the Initiative. When inept Initiative recruit Butterball was sent home, Taskmaster and Constrictor felt sorry for him and arranged a photo where it looked like Butterball defeated the pair in combat.", 
    "durability": 2, 
    "education": "High School", 
    "energy": 1, 
    "eyes": "Unrevealed\n", 
    "fighting": 7, 
    "firstappearance": "Avengers #195 (1980)\n", 
    "groupaffiliation": [
        "None", 
        "formerly Cabal", 
        "Initiative Instructor", 
        "Thunderbolts", 
        "Agency X", 
        "Frightful Four", 
        "former agent of Hydra and the Red Skull"
    ], 
    "hair": "Brown\n", 
    "height": 72, 
    "id": "Taskmaster", 
    "identity": "Secret", 
    "intelligence": 4, 
    "knownrelatives": "Unidentified mother", 
    "occupation": [
        "Drill instructor", 
        "mercenary", 
        "teacher"
    ], 
    "origin": "Avengers #196 (1980)", 
    "placeofbirth": [
        "Bronx", 
        "New York City", 
        "New York"
    ], 
    "powers": "Taskmaster has no known superhuman powers. However, with the help of the Albino, Taskmaster briefly had the ability to mimic other peoples powers by studying them. This power ended up only being temporary due to the process being interrupted by Hawkeye, Firestar, and Justice.", 
    "realname": "Unrevealed", 
    "significantissues": [
        "First appearance and fought Avengers (Avengers #195-196, 1980)", 
        "trained Super-Patriot (U.S.Agent) to be next Captain America (Captain America #334, 1987)", 
        "briefly gained powers (Hawkeye: Earth's Mightiest Marksman #1, 1989)", 
        "trained new Spymaster and revealed to have trained original Spymaster  (Iron Man #254, 1990)", 
        "Crossbones, Diamondback and Anaconda shown to be students (Captain America #403, 1992)", 
        "Avengers started shutting down academies (Avengers #38, 2001)", 
        "began mercenary missions (Taskmaster #1-4, 2002)", 
        "trained and fought Spider-Woman\n(Spider-Woman: Origin #2-3, 2006)"
    ], 
    "speed": 2, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 220
}