{
    "aliases": [
        "Mad Titan", 
        "Master", 
        "Thanos Rex", 
        "Masterlord", 
        "Overmaster"
    ], 
    "citizenship": "Titan", 
    "content": "Growing in power and infamy as he traveled the universe, Thanos once met Death itself, as it appeared to him embodied in a female form. Thanos was infatuated with the being, and endeavored to make himself worthy in order to earn her love in return. With an army under his command, he nearly destroyed his former home of Titan, declaring himself its ruler. He then sought out the powerful Cosmic Cube, and a number of Earth's heroes assembled to confront him. With the Cube's power, Thanos made himself unto a god, and he easily fought back Captain Marvel and the Avengers. However, Captain Marvel managed to convince Thanos that he had drained the Cube of its power, and the mad Titan discarded it. This allowed Mar-Vell to grab the Cube and restore the universe to its rightful order and drain Thanos of his power. Thanos was shunted back to where he had first launched his bid for power, and was rescued by his starship, Sanctuary II.Thanos believed that Death had rejected him after his failure with the Cosmic Cube, and so he began searching the universe for the powerful Soul Gems, one of which was used by Adam Warlock. Thanos had also learned of the threat of the Magus, a future version of Adam Warlock who would threaten Thanos' own plans.  Thanos was determined to make sure that the future of the Magus would never occur. Using time travel, he created a perfect pawn for his future struggle-- the deadliest woman in the universe. He rescued Gamora as an infant and trained her to be his personal assassin. He also joined forces with Adam Warlock to oppose the Magus, who was using his world-conquering Universal Church of Truth to create a fanatical empire. With this alliance, Thanos helped  ensure that Warlock would never become the Magus, and at the same time, he managed to absorb certain energies of Warlock's Soul Gem that would help him in his subsequent plot.One by one, Thanos collected five other Soul Gems, combining them all in a huge, single, synthetic Soul Gem. He then began to extinguish the very stars themselves, hoping thereby to extinguish all living things in tribute to Death. Thanos was opposed by Gamora, but he slew her as well as Pip the Troll, who was looking for Adam Warlock. Warlock had learned of Thanos' activity and recruited Captain Marvel and the Avengers to again oppose the mad Titan.Captain Marvel managed to destroy the synthetic Soul Gem, but Thanos captured the Avengers and even killed Adam Warlock after an intense one-on-one battle. Spider-Man was on hand to help rescue the heroes, and with the help of Lord Chaos and Master Order, restore Warlock to life. Warlock's resurrection flushed him with cosmic power and he again engaged in battle with Thanos, who was defeated, but not killed. The Eternal was turned to immobile stone-- an ironic punishment since the lover of Death would be forever denied its embrace.Death did in fact come to visit Thanos, however. It revived him and endowed him with even more power, leading him to believe the universe was unbalanced in terms of life and death and that Thanos was needed to restore that balance. Thanos then proceeded to reassemble the Soul Gems, now called the Infinity Gems, and created the powerful Infinity Gauntlet. With a mere thought, Thanos was able to wipe out half of the universe's population of living beings, and once again he had enough power to make himself an omnipotent being. Many of Earth's heroes and heroes from around the galaxy came to oppose him, and they were joined by other abstract entities who knew Thanos' new powers made him a threat to all existence. Thanos again defeated them all. Ultimately, however, Death spurned him, as Thanos' powers had placed him at a level beyond. Thanos was distraught, and this momentary lapse allowed Nebula, who Thanos was toying with for having assumed to have been related to him, to gain control of the Infinity Gauntlet. Thanos was forced to join with Warlock and the other heroes, and Warlock ended up with the Infinity Gauntlet, restoring the universe to its natural state before Thanos' interference, and Warlock divided the Gems among various guardians who became the Infinity Watch.Thanos himself was exiled by Warlock to an uninhabited planet, and he set himself up as a simple farmer, seemingly content to spend the rest of his days as a hermit. However, perhaps because of his new lot in life, Thanos was able to sense that Eternity itself had become catatonic. He sought out Adam Warlock and the Infinity Watch, traveling to the realm of Death to discover that Magus had returned and, by using the power of five Cosmic Cubes, was attempting to recreate reality into a twisted, evil version of itself. During the course of the battle, Magus managed to gain the Infinity Gauntlet for himself. Thanos then confronted Magus, revealing that the Gauntlet was never at its full power, as it used a fake Reality Gem. This allowed Magus to be defeated by Eternity and Infinity, and the Infinity Gems were once more separated to their original guardians. (In fact, Thanos had been the guardian of the Reality Gem, although only Adam Warlock knew of this.)But whereas the Magus was the embodiment of Warlock's \"evil side\", a threat still remained with the Goddess, Warlock's \"good side\" that was created, like Magus, when Warlock held the Infinity Gauntlet. The Goddess gained control of the five Cosmic Cubes and was using them to impose a self-righteous \"order\" upon the galaxy, which included trapping Thanos and Warlock in a shifting reality. Warlock freed them, and, as part of his plan, gave Thanos his Soul Gem to confront the Goddess. Thanos led many of the galaxy's heroes against the Goddess, but it seemed to prove a senseless slaughter-- all were killed. The Goddess then proceeded to destroy the universe, but this destruction (and the slaughter of Thanos and the heroes) were part of an elaborate hallucination created by Warlock. Thanos destroyed the \"Cosmic Egg\" that held the Cosmic Cubes, stopping the Goddess and restoring the universe to normal.Thanos could not wander the universe without growing restless. He sought out the cosmic Oracle using temporary pawns of a Super-Skrull, Nitro, the Rhino, and the Titanium Man, using it to discover the existence of Tyrant. He joined Ganymede, Jack of Hearts, and Legacy in opposing Tyrant, convincing them that his power would be needed to defeat him. Tyrant, however, confronted the group almost immediately. During the conflict, Thanos revealed that he was after the source of Tyrant's power, a sphere of energy that was siphoned from Galactus' Herald, Morg. Thanos further explained Tyrant's origin, battling him while the rest of the heroes escaped. Tyrant was apparently defeated, and Thanos emerged from the destruction wrought by the battle, but without the prize he had sought.The Silver Surfer, long since Thanos' enemy, had come to believe that Death was seeking him out to be a new consort. The Surfer approached Thanos with this concern, but Thanos flew into a rage, attacking the Surfer and killing him. Although he appeared to offer the Surfer's body as a sacrifice, Thanos returned the Surfer to life as an insult. Death retaliated by declaring Thanos to be immortal and thus forever denied entering her realm.Later, Thanos was trapped in a pocket of reality. Parnival Plunder, brother of Ka-Zar, stumbled onto Thanos' reality after contacting the being Consumption, and Thanos set up Parnival to be his pawn. Under Thanos' advice, Parnival created machines that would destroy the Savage Land, but in fact, Thanos absorbed the energy that was released by the machines so that he might open more portals and escape to normal reality. Ka-Zar discovered the truth and battled Thanos directly, and Thanos was toppled into a volcano through one of the portals. He managed to remain stuck in his pocket dimension, however, although he tried to get out by using first the Hulk and then X-Man as mental vessels. The two fought each other due to Thanos' influence, and although the villain managed to return to Earth after such a climactic battle, the two turned on Thanos and forced him to return to the pocket reality once more.Nevertheless, Thanos managed to free himself at some point, as he appeared in Asgard, searching for the \"Designate\", a being of phenomenal cosmic power said to play a major role in the cosmic scheme of eternity. He found allies in Tarakis and the monstrous Mangog, using Mangog to lay waste to the planet Rigel in order to collect the final ingredients to find the Designate. Thanos found her in the person of Tarene, but was confronted by Thor and his allies, a Rigellian recorder android and Firelord. All the signs began to fall into place, and Thanos nearly gained the power of Ragnarok-- the end of the world-- as evidenced by Thanos' destruction of an unknown but inhabited planet. However, Thanos fell under the attack of Thor and his allies, and Tarene wept again for the lives of those slain by Thanos. Her tears seemed to destroy him, causing him to burst into an all-consuming hellfire, seeming vanquished forever.About this time, Thanos had rejected Death outright, regarding himself as a death god and hoping to perform acts in his own name and not that of another's. Soon, a star appeared to announce the maturation of the Celestial Messiah, a being of some cosmic significance. Thanos left to destroy Mantis, his mother and the Celestial Madonna, regarding her and her son to be antithetical to his own self-styled godhood. Instead, Mantis managed to restore herself to god-like status, thwarting Thanos and \neliciting help from an assemblage of Avengers and their ally, Haywire, to find Quoi before Thanos. As part of his quest, Thanos encountered the space pirate Reptyl and the alien Primo, imbuing them with power and calling them gods so as to create a pantheon of his own design. The Avengers and Mantis worked to defeat Thanos's efforts to kill Quoi, and in the process discovered the cosmic Rot, a state of un-being that threatened the existence of Eternity. Thanos and the others were forced to work together to defeat the Rot, and ultimately Death itself appeared, telling them of the Rot's true origin as an offspring of Death and Thanos, created when Thanos first died and entered Death's metaphysical embrace. Thanos and Death worked together to destroy the Rot. Thanos ultimately fled, distraught over his role in creating the Rot in the first place and refusing to accept Death's rekindled interest in him.At some point, Thanos had begun creating duplicates of himself that later became known as the Thanosi, each with its own unique aspect that was heightened through scientific and/or mystical means. These genetic duplicates were kept in stasis, however, when Thanos had no need to test himself against them. An errant meteor freed a number of them, and due to the nihilistic vision they shared with their master, they took it upon themselves to seek out the cosmic \"anchor\" being that kept the universe fixed in its cosmic position and prevented its fall into the void of Final Oblivion. In their search, they were opposed by Warlock, Pip the Troll, Gamora, and others, including Thanos himself. In fact, the anchor being, Atlez, had himself freed Thanos' duplicates in order that Warlock would be drawn into the conflict and search out his replacement, who was born too early but destined to be the next anchor being. The duplicates were defeated and Atlez' replacement was found in time to prevent the Final Oblivion, and the universe was ultimately restored to its natural state.", 
    "durability": 7, 
    "education": "Formal Titanian education", 
    "energy": 7, 
    "eyes": "Red\n", 
    "fighting": 7, 
    "firstappearance": "Iron Man #55 (1973)\n", 
    "groupaffiliation": "Eternals", 
    "hair": "None\n", 
    "height": 79, 
    "id": "Thanos", 
    "identity": "No dual identity", 
    "intelligence": 7, 
    "knownrelatives": "Alars (Mentor, father), Eros (Starfox, brother), Sui-San (mother, deceased), Zuras (uncle, deceased), Cybele (aunt), Thena (cousin), the Rot (offspring, apparently destroyed)", 
    "occupation": [
        "Knoledge seeker", 
        "former god", 
        "destroyer conqueror", 
        "nihilist"
    ], 
    "origin": "Silver Surfer #37 (1990)", 
    "placeofbirth": [
        "Eternal colony", 
        "Titan (moon of Saturn)"
    ], 
    "powers": "Thanos possesses the superhuman physiology of all Eternals, granting him superhuman strength, endurance, reflexes, and agility. His skin in nearly invulnerable, particulary against heat, cold, electricity, radiation, toxins, aging, and disease, and he can survive indefinitely without food or water even before his \"curse\" from Death left him immortal, unable to die. His mind is also invulnerable to most forms of psychic attack, and can project a psionic blast of energy as well as blasts of plasma/cosmic energy from his eyes and hands.", 
    "realname": "Thanos", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 6, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": 985
}