{
    "aliases": "None", 
    "citizenship": "Citizen of Asgard", 
    "content": "However, when Thor became obsessed with ending humankind's suffering by bringing Asgard to Earth and allowing the gods to directly interfere with the mortal world, Zarrko the Tomorrow Man, decided to wage war on Asgard. Together with government soldiers, Zarrko hatched a plan that was meant to destroy Thor. After the attack on Asgard succeeded in destroying most of the golden realm, an enraged Thor gave Zarrko enough of a reason to attempt to flee. Zarrko opened a time portal, but his escape was hindered by falling debris, and Thialfi fell into the portal instead only to be transported into the distant future. Once there, Thor threw a huge party to celebrate the return of his long lost friend, but the reunion would be short lived. Once Thialfi traveled through the realm and saw for himself what the interference of the gods had done to the world of men, he became confused as to what side he should be on. Eventually, Thialfi, along with others such as Thor’s own son, Magni, decided it was their responsibility to stop him. As a weakened Thor was about to enter the Odinsleep to renew his almost depleted powers, Thialfi confronted him in his chambers. Knowing that this would be the only way to defeat the Lord of Asgard, Thialfi had only one chance to end his tyrannical reign. Thor called him a traitor, but Thialfi claimed this act to be one of loyalty to the Thor he once knew. During their conflict, the Enchantress, Thor’s wife, interfered and was met with a hostile reaction by Thialfi who viewed her as a sycophant that only encouraged Thor’s misdeeds. Unfortunately for Thialfi, even on the edge of victory, the Enchantress unleashed Thor’s pet wolf on him, and a surprised Thialfi was mauled by the beast thus ending his life.", 
    "durability": 1, 
    "education": "Thialfi was blessed with wisdom and insight from Odin", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Thor #43 (2002)\n", 
    "groupaffiliation": "Asgardians", 
    "hair": "Brown\n", 
    "id": "Thialfi", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unidentified father (deceased), P'aesi (last name unrevealed) mother (deceased)", 
    "occupation": "Former advisor to Thor", 
    "origin": "Thor #52 (2002)", 
    "placeofbirth": "An unidentified village on Earth", 
    "powers": "Thialfi was given great wisdom and knowledge by the almighty Odin along with the speed to outrun any enemy. Thialfi’s body was also transformed into that of an Asgardian male which benefited him with superhuman strength, endurance and durability.", 
    "realname": "Thialfi", 
    "significantissues": "Thor #49 (Thialfi brings Thor the axe of the Executioner so that Thor can defeat Desak, 2002), Thor #52 (Thialfi’s origin, 2002), Thor #74 (Thialfi confronts Thor in a fight to the death, Thialfi is mauled by Thor’s pet wolf, 2004)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}