{
    "aliases": [
        "Flash", 
        "has impersonated Stilt-Man", 
        "Hobgoblin", 
        "Spider-Man"
    ], 
    "citizenship": "U.S.A. with a criminal record", 
    "content": "Despite his often-obnoxious personality, football prodigy Eugene became one of the most popular (and most conceited) students at Midtown High School, where his speed on the football field earned him the lifelong nickname \"Flash\". His wide circle of friends included Sean \"Tiny\" McKeever, Jason Ionello, Seymour O'Reilly, Charlie and numerous female admirers such as Sally Avril and Liz Allan, who was Flash's steady girlfriend for some time. The more popular Flash became, the more he mocked the shy Peter Parker; however, as Parker (secretly emboldened by his new spider-powers) became more confident, he began to stand up to Flash more often, and even took on Flash in a boxing match that ended with Flash being kayoed by a spider-strength jab that most onlookers misinterpreted as a lucky sucker punch. Flash continued to ride Peter despite this setback, and Peter generally tolerated Flash's abuse since he didn't want to risk revealing his super-powers or seriously injuring Thompson. Gradually impressed by Peter's maturity and sick of Flash's bullying, Liz dumped Flash and began showing strong romantic interest in Peter, which only made Thompson hate Parker all the more.Shortly after Spider-Man first appeared, Flash declared himself the wall-crawler's biggest fan, never dreaming that his hero was the same \"Puny Parker\" he so often tormented. As annoyed as Peter was by Flash in general, he was secretly touched and impressed by Thompson's enduring loyalty to Spider-Man. Flash founded the Forest Hills chapter of the Spider-Man fan club and took it upon himself to defend the oft-maligned Spider-Man's reputation, sometimes in reckless and foolish ways. When Flash impersonated Spider-Man in an attempt to teach Parker some respect for the hero, Flash was mistaken for the real thing and imprisoned by Doctor Doom until the true Spider-Man rescued him. Later, when a humiliating encounter with the Green Goblin (Norman Osborn) had the whole city calling Spider-Man a coward, Thompson donned a Spider-Man costume and tackled some cheap crooks in an effort to restore Spidey's reputation, but all he got for his trouble was a beating. Shortly thereafter, when another Spider-Man impersonator tried to tarnish the hero's name with a string of petty crimes, Flash unmasked the culprit as his own friend Jason Ionello, who wrongly blamed Spider-Man for the recent death of their mutual friend Sally Avril during Spider-Man's battle with the Black Knight. Flash also repeatedly denounced the many anti-Spider-Man tirades by Daily Bugle publisher J. Jonah Jameson, and one angry confrontation between Thompson and Jameson caused the unwitting pair to foil a plot against Spider-Man by Mysterio.When Flash and Peter graduated from Midtown High, both were awarded full scholarships to Empire State University (for athletic and academic achievement, respectively). By this time, relations between the two had begun to thaw ever so slightly, and both soon became part of a circle of friends that included fellow students Gwen Stacy, Harry Osborn (son of Norman) and Mary Jane Watson. By the time Flash left college to join the army, he and Peter parted as friends. During his tour of duty, Flash was stationed in Southeast Asia, where he stumbled across a hidden temple whose residents-notably the beautiful Sha Shan-nursed a wounded Flash back to health; however, after American forces mistakenly shelled the temple despite Flash's efforts to protect it, Flash left the army to return to America, where temple survivors who mistakenly blamed him for the tragedy made attempts on his life. With the aid of Spider-Man, Flash lived to convince the temple survivors of his innocence, and was briefly reunited with Sha Shan. Later, Sha Shan returned to America as Sister Sun, the reluctant bride of cult leader Brother Power (Achmed Korba), himself a pawn of the evil Man-Beast. Sha Shan ultimately turned on Korba, and the Man-Beast was thwarted through the combined efforts of Spider-Man, Razorback and Flash. Korba having died in the battle, Sha Shan became Flash's lover and lived with him for some time.Later, Flash's old friend Betty Brant was struggling to cope with her failing marriage to reporter Ned Leeds, who had secretly been brainwashed into serving as a pawn and occasional stand-in for the criminal Hobgoblin (Roderick Kingsley). Betty sought comfort in the arms of Flash, and soon the two were having a secret affair. Sha Shan realized this and walked out on Flash after a violent argument. The unstable Ned suspected the truth as well, and Flash unwittingly provoked matters further when he insulted the Hobgoblin on television. The Hobgoblin responded by framing Flash as the supposed Hobgoblin, sending Flash to prison, where he would have been killed by the vigilante Scourge if not for the intervention of Spider-Man. Escaping jail, Flash sought refuge with Betty Brant but was attacked by the Hobgoblin, who fled after Betty saw him unmasked as Leeds. Shortly thereafter, word of Ned's double identity leaked out and Leeds was murdered by assassins hired by his rival Jason Macendale, who used Ned's gear to become the new Hobgoblin. Aiding Spider-Man in battle with the new Hobgoblin, Flash suffered an arm injury that ended any hope of restarting his old sports career, but he was cleared of all charges related to the Hobgoblin case and set free.Ned's death sent Betty into a nervous breakdown, and she fell under the influence of a sinister cult known as the Students of Love. Flash, Spider-Man and Reverend Tolliver joined forces to liberate Betty and deprogram her. Having lost all her worldly possessions to the cult (which was destroyed in a fire), Betty took up residence with Thompson until the demonic invasion of New York known as Inferno, when demons posing as Spider-Man and the late Ned attacked Flash's home; the demons were defeated, but Thompson's home was destroyed in the process. Shortly thereafter, Betty and Flash decided they were better off as friends rather than lovers and parted amicably. By now, Peter Parker had married Mary Jane Watson, and Harry Osborn had married Flash's old flame Liz Allan, and odd-man-out Flash was determined to find a new love of his own. For a while, he dated the glamorous adventurer Felicia Hardy, alias the Black Cat. Formerly Spider-Man's lover and partner, Felicia dated Flash mostly to irritate Peter at first, but found herself genuinely falling for Thompson over time; however, Flash ultimately broke up with her since he felt he could never fit into her exotic lifestyle.Directionless, lonely and increasingly bitter, Flash developed a drinking problem like his father before him, leading to a car crash that got Flash arrested again and cost him his job as a school gym teacher. By this time, Flash had begun blaming much of his troubles on his family in general and his father in particular, but a violent confrontation with his father finally forced Flash to realize that he had become the same sort of self-deluded wreck his father was, and that only he could take responsibility for fixing his life. Flash sobered up and started trying to turn his life around, though without much success in terms of either romance or career. His luck seemed to change when wealthy industrialist Norman Osborn offered him a good job with his Oscorp company, but Osborn had actually done this as part of an elaborate plot against his enemy Peter Parker in hopes of turning Flash against Spider-Man, though Flash remained loyal to his boyhood idol despite Osborn's influence. Later, when Osborn stepped up his attacks on Parker, he staged a car crash that sent an Oscorp truck crashing into Midtown High with Thompson at the wheel, and made it look as if Flash had been driving drunk. Rendered comatose by the accident, Flash eventually revived, but was broken in mind and body, wheelchair-bound and trapped in a speechless haze. He was regularly visited by old friends such as Peter Parker and Liz Allan Osborn (now Harry's widow), who used her wealth to provide Flash with an apartment and full-time medical care.", 
    "durability": 2, 
    "education": "High-school graduate, some college courses and military training", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "Amazing Fantasy Vol. 1 #15 (1962)\n", 
    "groupaffiliation": [
        "Alcoholics Anonymous", 
        "Oscorp staff", 
        "U.S. Army", 
        "Spider-Man Fan Club"
    ], 
    "hair": "Reddish blond\n", 
    "height": 74, 
    "id": "Thompson,_Flash", 
    "identity": "No dual identity", 
    "intelligence": 2, 
    "knownrelatives": "Harrison (father), Rosie (mother), Jessie (sister)", 
    "occupation": [
        "High school coach", 
        "former Oscorp employee", 
        "gym teacher", 
        "soldier", 
        "ambulence driver", 
        "college football player"
    ], 
    "placeofbirth": [
        "Forest Hills", 
        "Queens", 
        "NY"
    ], 
    "powers": "None", 
    "realname": "Eugene Thompson", 
    "speed": 2, 
    "strength": 2, 
    "universe": "Marvel Universe", 
    "weight": 185
}