{
    "add": {
        "doc": {
            "aliases": [
                "The Designate", 
                "the Supreme", 
                "Tara Olson", 
                "Hammer Girl", 
                "Thorita", 
                "Hammerette", 
                "Thor Lass", 
                "Asgard Lass", 
                "Thoretta", 
                "Hammer Lass", 
                "the Destroyer", 
                "Spirit of the Jewel (in alternate future)"
            ], 
            "citizenship": [
                "Nucleus of Hope", 
                "rudimentary USA citizenship under Superhuman Registration Act"
            ], 
            "content": "In recent years, the mad Titan Thanos obtained X'Hoss's objects of power and decimated Tarene's homeworld. Opposed by the thunder god Thor, Thanos soon defeated him and Tarene wept for Thor's sacrifice. Collecting her tears in the Chalice of Ruins, Thanos received awesome power. However, when Thor took the Illumination Stone from Thanos, the villain was overwhelmed by power and defeated.Tarene, now aware of her true nature, sought adventure and, using Thor as a template, transformed herself into an Asgardian goddess and journeyed to Earth. As Thor Girl, she became Thor's ally and took the identity of Tara Olson to learn more about humanity. She joined Thor and his allies against the Asgardian demon Surtur, channeling her cosmic power into Thor's father, Odin, who apparently perished while defeating Surtur. As a result of her actions, Thor Girl lost most of her cosmic power. When Thor assumed his father's throne, she remained active on Earth in his place although she has not been seen recently.Thor Girl's activities following the apparent death of Thor remain unrevealed; however, in at least one alternate future, she will, as the Spirit of the Jewel, reach back in time to empower the alien Desak whose campaign against the gods led him to fight Thor himself.", 
            "durability": 6, 
            "education": "Unrevealed", 
            "energy": 7, 
            "eyes": "Blue\n", 
            "fighting": 7, 
            "firstappearance": "Thor #22 (2000)\n", 
            "groupaffiliation": [
                "Initiative Trainees", 
                "former ally of Thor"
            ], 
            "hair": "Blonde, formerly white\n", 
            "height": 69, 
            "id": "Thor_Girl", 
            "identity": "Known to authorities", 
            "intelligence": 7, 
            "knownrelatives": "None", 
            "occupation": [
                "Licensed super hero", 
                "former acolyte"
            ], 
            "origin": "Thor #23 (2000)", 
            "placeofbirth": [
                "Nucleus of Hope", 
                "unidentified galaxy"
            ], 
            "powers": "Thor Girl possesses the near-ageless, superhumanly strong and durable physique of an Asgardian goddess. She formerly possessed virtually limitless cosmic power; her tears contained power which could be tapped via the use of the Chalice of Ruins and the Illumination Stone but which would destroy anyone using the Chalice alone.", 
            "realname": "Tarene", 
            "significantissues": [
                "Captured by Thanos, freed by Thor (Thor #24-25, 2000)", 
                "came to Earth, allied with Thor (Thor Vol. 2 #33-35, 2001)", 
                "transferred into Destroyer by Loki, battled Thor and Sif (Thor #36-38, 2001)", 
                "fought Surtur alongside Thor and others, lost full power (Thor Vol. 2 #40-41, 2001)", 
                "transformed into stone by Grey Gargoyle, restored by Jake Olson (Thor #46-49, 2002)"
            ], 
            "speed": 6, 
            "strength": 6, 
            "universe": "Marvel Universe", 
            "weight": 317
        }
    }
}