{
    "add": {
        "doc": {
            "aliases": "Once and Future Thor", 
            "citizenship": [
                "Corp", 
                "North American Urban Center"
            ], 
            "content": "Dargo Ktor was a part of that cult, but his faith was not as strong as the others. He expected those who attempted to lift Mjolnir to fail, and he believed the stories of Thor to be fairy tales. The Chairman of the Corporation unknowingly hired Loki, God of mischief, to unearth and annihilate the rebels, and Loki was happy to do so. Loki, along with Tyrus, leader of the Rock Trolls, discovered the cult's secret meeting place and set their horde loose on the unsuspecting group, killing all in their path. Dargo instinctively reached for a weapon to defend his people when his hands found the handle of Mjolnir. No sooner than he grabbed it, the power of Thor flooded into his body, and he was transformed into the Thunder god. Thor easily pushed back the invaders, but Dargo was confused by his newfound power and had to clear his head. With the people's faith stronger than ever, they decided to protest against the Corporation feeling that Thor would protect them. Dargo, unsure of his new role, decided that he would not let his people stand alone against the forces of evil. Arriving as the protesters were attacked by Corp soldiers and Loki's forces, Dargo did all he could to protect the cultists. Tyrus, having faced the true Thor, knew Dargo was an imposter, and his suspicions were confirmed as Mjolnir refused to obey its new master. Fraud or not, Dargo defeated Tyrus just as Loki killed the Corp's Chairman and destroyed their facilities. With the threat of the Corporation gone forever, Dargo used Mjolnir to open a portal and threw the hammer into it feeling that it would find its rightful owner. Dargo and Salla looked to the future, and they hoped that those who would go on to form a new tomorrow would prove themselves worthy.In the year 2591, Dargo has somehow gained possession of Mjolnir again and has resumed his responsibilities as Thor. He was sought out by Zarrko, the Tomorrow Man and tricked into traveling to the past in order to battle Eric Masterson, the Thor of the present. Zarrko tricked Dargo by telling him that Masterson would somehow be responsible for the execution of Dargo's timeline, and therefore, the death of his wife Salla. Dargo attacked Masterson, already in battle with the cosmic powerhouse Stellaris, and was surprised that they were so evenly matched. Zarrko revealed that his plan was to siphon off the energy of the two Thor’s enchanted hammers in order to power his Radical Time Stabilizer, so he would become the undisputed master of time. The fighting between the Thor's continued which alerted Beta Ray Bill to the violence, and he journey to Earth to stop them. He told them that they are \"Hammer Brothers\" since they have both proven themselves to be worthy enough to wield Mjolnir, and they should band together to stop their mutual enemy. Reluctantly, Masterson joined Dargo and Bill and pursued Zarrko back to his ship. Once inside, the members of the newly formed Thor Corps were put to the test by Zarrko when he pulled various enemies of the Thunder god out of the time stream to stop them. Despite all of his tricks, Zarrko caused his own downfall when he pulled Loki out of the time stream and attempted to command him as one of his other servants. Zarrko's ship, along with his Radical Time Stabilizer, was about to explode after Loki destroyed the controls, but Beta Ray Bill managed to send Dargo, Masterson and himself back to each perspective timeline they originated from before that happened.On July 29th, 2593 A.D., Dargo will eventually be forced into reuniting with Beta Ray Bill and Eric Masterson, now known as Thunderstrike, by his archenemy, Demonstaff. Together, the Thor Corps will have a time traveling, dimension hopping adventure to ensure the survival of Dargo's wife, Salla, and that of the entire universe as well. It can be assumed that Dargo, having returned to his timeline, still fights for the people using the power of Thor.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "Thor #384 (1987)\n", 
            "groupaffiliation": [
                "Avengers", 
                "Thor Corps", 
                "formerly Cult of the Hammer"
            ], 
            "hair": "Blond\n", 
            "height": 0, 
            "id": "Thor_(Dargo_Ktor)", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Salla Ktor (wife, deceased)", 
            "occupation": [
                "Freedom fighter", 
                "former Corporation employee"
            ], 
            "origin": "Thor #384", 
            "placeofbirth": [
                "North American Urban Center #5", 
                "Earth-8710"
            ], 
            "powers": "When transformed, Dargo Ktor possesses all of the powers of the original Thor, before he became Lord of Asgard, including superhuman strength, endurance, and high resistance to injury", 
            "realname": "Dargo Ktor", 
            "significantissues": "Thor #384, Thor #438-441, Thor Corps limited series #1-4", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 165
        }
    }
}