{
    "aliases": "None", 
    "citizenship": "U.S.A.", 
    "content": "Thunderball initiated their first foray into crime, destroying anything associated with Richmond Enterprises in order to capture his gamma bomb and ransom New York. They were stopped by the Defenders, but Thunderball and the Wrecking Crew were never contained for long.But Thunderball had always felt superior to his teammates, knowing his intelligence set him apart. He often parted company with them, and was seen acting independently on several occasions. Once, he sought out his ex-girlfriend, Rhonda Taddington, holding her friend, Clytemnestra Erwin, hostage and running into conflict with her boyfriend, Rhodes, James as Iron Man. He later took it upon himself to retrieve the Wrecking Crew’s weapons from the authorities, running afoul of Spider-Man, who defeated Thunderball by overloading his wrecking ball with electricity and knocking him out.However, if the Wrecking Crew appeared, Thunderball was sure to be seen as well, including in their abduction to Battleworld by the Beyonder and joining with Doctor Doom's army of super-villains. The Crew also joined Baron Zemo's Masters of Evil. After this, Thor used his hammer to draw the Wrecker’s away from the others who divided it, and Thunderball was left powerless.When imprisoned in the Vault, Thunderball participated in a massive breakout but refused to follow the orders of Venom, battling him over the alliances among their cellmates. However, they were trapped inside with a nuclear reactor that threatened to meltdown, and Thunderball was instrumental in defusing the device with Iron Man.Months later, the Wrecker freed his Crew and restored their power once more. As before, wherever the Wrecking Crew was to be found, Thunderball was among their number. They performed many other acts of villainy, although Thunderball grew dissatisfied with the Wrecker’s leadership, coveting all the power of the Crew for himself. Eventually, the Crew reconciled, seeking out Hercules once more. But battling them helped Hercules overcome the fear of combat he had suffered since the  beating at their hands, and they were defeated.Once, Thunderball was broken out of prison by Midnight on behalf of the Secret Empire. He served alongside Midnight as their agent, coming into conflict with Midnight’s former mentor, Moon Knight as well as Spider-Man and other heroes, until Midnight was betrayed by the organization and destroyed their headquarters.The Wrecking Crew’s powers began fading when many of Asgard's links to Earth were separated. The entire Crew received a power boost when hired by Arnim Zola to battle the Thunderbolts (unaware that the Thunderbolts included many of their former allies in the Masters of Evil).", 
    "durability": 1, 
    "education": "Ph.d.", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Defenders #17 (1974)\n", 
    "groupaffiliation": [
        "Wrecking Crew", 
        "(formerly) Masters of Evil", 
        "Secret Empire"
    ], 
    "hair": "Black\n", 
    "height": 0, 
    "id": "Thunderball", 
    "identity": "Publicly known", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Criminal", 
        "former scientist"
    ], 
    "origin": "Defenders #18 (1974)", 
    "placeofbirth": [
        "Buffalo", 
        "New York"
    ], 
    "powers": "Thunderball shares the Asgardian enchantment originally given to the Wrecker, becoming transformed into a being of superhuman power, slightly less than an Asgardian god. He possesses vast superhuman strength and a high degree of invulnerability with some resistance to cold, heat, fire, corrosives and toxins. (When the Wrecking Crew believed their enchantment was fading, they sought augmentation by geneticist Arnim Zola, who used scientific means to restore their power.)", 
    "realname": "Dr. Eliot Franklin", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 225
}