{
    "aliases": "None", 
    "citizenship": "Shi'ar", 
    "content": "Later, after the formerly-exiled Deathbird had usurped the Shi'ar throne from her sister Lilandra, Titan was amongst those Imperial Guard members who clashed with the British team of costumed adventurers known as Excalibur and the Starjammers over the fate of the then-bearer of the cosmic Phoenix Force, the alternate future daughter of the X-Man Jean Grey named Rachel Summers.Much later, the intergalactic teleporter Lila Cheney transported the X-Men to the Shi'ar Empire at the behest of then-Empress Deathbird in time to see Lilandra regain her throne. Not all was as it seemed, however, as in reality a group of Warskrulls, using technology to allow them to duplicate superpowers, had captured and impersonated the X-Men's founder, the telepathic Professor Charles Xavier, using his telepathy to control Lilandra and the Imperial Guard, including Titan. After the ruse was discovered by the X-Men and all the Warskrull impostors were exposed, Lilandra settled matters with Deathbird, discovering her sister did not want the throne anymore.During the war between the Shi'ar and Kree Empires, Titan was amongst a small contingent of the Imperial Guard that defended their Empress Lilandra against the Kree super-team known as Starforce.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "X-Men #107 (1977)\n", 
    "groupaffiliation": "Imperial Guard (Superguardians)", 
    "hair": "Brown\n", 
    "height": 72, 
    "id": "Titan", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": "Peacekeeper", 
    "placeofbirth": "Unrevealed planet in the Shi'ar Empire", 
    "powers": "Titan is a member of an unnamed alien race who possess the ability to draw mass from a presumed extradimensional source to be able to grow to gigantic size through an act of will. The maximum height that Titan is able to attain has yet to be determined. Titan can also return to his normal height through another act of will, or if rendered unconscious whilst in giant-size.\nIn his regular form, Titan possesses the normal strength and durability of a member of his race. However, when Titan grows in height, his strength and durability increase proportionately.", 
    "realname": "Unrevealed", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 195
}