{
    "aliases": "The Terrible Toad-King", 
    "citizenship": "U.K. (international criminal record)", 
    "content": "Mortimer Toynbee is a former subject of the Alamogordo Project, which observed the development of genetically flawed mutants. Due to his flawed genetic make-up, Toynbee experienced extreme physical changes and mental instability throughout his life, at one point requiring him to ingest a prescription drug Ridilin to remain stable.At some point after achieving adulthood, Toynbee was discovered by Magneto and recruited for his Brotherhood of Evil Mutants. Magneto gave Toynbee the alias of the Toad because of Toynbee's powers, appearance, and personality. The Toad blinded himself to Magneto's continual verbal and physical abuse because Magneto was out to conquer the human race that had rejected the Toad.As a member of the Brotherhood of Evil Mutants, the Toad met the Scarlet Witch and became infatuated with her, though she did not reciprocate the feeling. The team's nefarious schemes would often be confronted and defeated by the mutant heroes known collectively as the X-Men.After one such confrontation with the X-Men, Magneto and the Toad were captured by the alien called the Stranger and imprisoned on the alien's distant world. When Magneto first escaped, he callously left the Toad behind, and the Toad's attitude toward his master began to change. After being recaptured, Magneto escaped a second time and took the Toad with him, but his continued bullying caused the Toad's resentment to increase until it flared into murderous hatred. The Toad abandoned Magneto to die in an explosion that followed an encounter with the Avengers. (Although it was later discovered that Magneto survived.)Toad was once captured with Quicksilver and the Scarlet Witch on the world of Arkon, but after their adventure there, he elected to stay instead of returning to Earth. Eventually, the Toad built a dimensional breach/space ship that allowed him to return to the Stranger's homeworld, where he studied and stole the Stranger's technology and equipment in an effort to become more powerful and thus more appealing to the Scarlet Witch. However, just as he prepared to return to Earth, he learned that the Scarlet Witch had married the Vision. Enraged, he planned to strike out at her, attacked the Avengers to learn her whereabouts, and was defeated.He served a short prison term and was released, at which time he commissioned the criminal Arcade to construct a sort-of \"toad kingdom,\" complete with a series of deadly traps, in a seemingly deserted castle in upstate New York. Renaming himself the Terrible Toad King, he planned to entrap everyone who he felt had abused him, placing them in the palace where they would be killed in the attempt to escape. His first victim was the X-Men’s Angel, but the Toad accidentally kidnapped the Thing, too. Just as the two were about to escape, Arcade stepped in and demanded immediate payment for his services. Unable to pay and fearful for his own life, the Toad fell into a panic. The Angel took pity on Toynbee and formulated an agreement with him to convert the castle into an amusement park, paying the debt in the process. The endeavor was a success until it was discovered that the castle's original owner was the villain Victor von Doom. Doctor Doom sent a robot of himself and a security force to remove the Toad and restore the structure to its original state.Toynbee again fell into despondency and decided to commit suicide, an attempt which was interrupted by Spider-Man. Hoping to make Spider-Man his friend, he hired a group of criminals to attack Spider-Man, but in the process he met Frog-Man and Spider-Kid. The three formed a partnership of their own called the Misfits.Though seeking the help of a psychiatrist during this period, Toynbee was still obsessed with the Scarlet Witch. He used some robot doppelgangers of the original Brotherhood of Evil Mutants, but was stopped by Quicksilver. Toynbee and his automatons were removed to a government research facility (Project: PEGASUS) for study, but one of the robots reactivated on a timed program and freed its builder. Ultimately he again came into conflict with Spider-Man, whose approval he still valued. The Toad defeated Spider-Man and the Vision using a powerful robotic exoskeleton. Forcing his way into the New Jersey home owned by the Scarlet Witch and the Vision, he found the Scarlet Witch eight months pregnant. Finding her repulsive, he attacked her. She defeated him, but he escaped.Months later, Toad resurfaced again with new powers, a heightened intelligence, and a vicious mean streak. He tried to form his own Brotherhood of Evil Mutants (simply called \"the Brotherhood,) and revived a long-dormant Sauron. This brought him into conflict with the fledgling team X-Force, who forced the team to escape. Another time, he sought an ally in the villain Gideon, and the two played a game which pit several groups of mutants against Harness, Piecemeal, and the scientific criminal organization A.I.M. who attempted to resurrect the mutant Proteus. Eventually, however, Toad's Brotherhood simply went their separate ways.At this point, Toad tried to join the Inner Circle of the Hellfire Club, but was soundly rejected. Feeling sorry for him, Hellfire Club member Emma Frost let Toad live on her estate in Canada, where, with fellow-mutant the Surgeon, he built himself head of an army of frogs. When Frost's team of young mutants, Generation X, took temporary residence at the estate, they ended up battling the Toad in a misunderstanding.Later, the Toad was recruited by former teammate Blob to join a new version of the Brotherhood of Mutants, this time in order to help safeguard X-Men leader Professor X from the artificial intelligence, Cerebro. Afterwards, the Toad was recruited into yet another Brotherhood of Mutants, led by Mystique. The team was hired by an unknown source to recover the parts of the android Machine Man, which were believed destroyed after a battle between the Red Skull, S.H.I.E.L.D. and the X-Men. The Brotherhood was forced to retreat by Machine Man, however.At a time when the High Evolutionary stripped all mutants of their powers, the Toad's DNA mutated further when the world's mutants reverted to normal. He since possessed a more normal-looking appearance as well as strange new powers. Afterwards, the Toad was abducted by the sentient space ship Prosh along with others associated with the X-Men, in order to stop a cosmic threat. During this time-traveling adventure, the Toad discovered that, as an infant, he and thousands of other mutant babies were experimented upon and studied by a clandestine facility known as Black Womb, a facility that hoped to track the evolution of mutantkind. Ultimately, in a battle with the alien Stranger, the Toad was wounded to the point of death, but Prosh healed him, resulting in an altered appearance and strange new powers. Prosh then returned the Toad and the others to the present day.The Toad appeared in several disparate areas over the next few months. He briefly joined Mystique's new Brotherhood, he later entered the Blood Sport (an ultimate fighting tournament based in Madripoor) where he killed the villain Eel (although the Eel has since reappeared.) He also turned up in Magneto's nation of Genosha, which had just been destroyed by Sentinels, and the Toad helped construct a monument to Magneto's legacy. When Magneto later reappeared, attempting to take over the world once more, the Toad joined him as an aide-de-camp, often speaking to the masses on behalf of Magneto, until they were defeated by the X-Men. (This Magneto was later revealed to have been Kuan-Yin Xorn in masquerade.)", 
    "durability": 4, 
    "education": "Unrevealed", 
    "energy": 3, 
    "eyes": "Brown\n", 
    "fighting": 6, 
    "firstappearance": "X-Men #4 (1964)\n", 
    "groupaffiliation": [
        "Formerly 198", 
        "Brotherhood of Evil Mutants", 
        "Misfits", 
        "(formerly) associate of Gideon", 
        "Frost", 
        "Emma"
    ], 
    "hair": "Brown\n", 
    "height": 60, 
    "id": "Toad", 
    "identity": "Secret", 
    "intelligence": 5, 
    "knownrelatives": "Unrevealed", 
    "occupation": "Former criminal", 
    "placeofbirth": [
        "York", 
        "England"
    ], 
    "powers": "Orginally, Mortimer Toynbe's mutant power was the sole ability of leaping. His leg muscles are incredibly strong, allowing him to deliver powerful kicks, to jump to great heights, and to rapidly move via jumping. Later, after gaining access to some of the Stranger's technology, he genetically altered himself to be able to secrete a poisonous resin, as well as gain minor super-strength and a malicious evil mind. He had later returned to his previous state, although he appeared able to gain control over a group of sentient carnivorous frogs that he used as spies. Currently, Toynbee has mutated further, and now possesses tongue which can elongate like a whip as well as deliver venomous pheromones that sink through the skin directly into the bloodstream. These pheromones cause any exposed to them to have their will become subservient to the Toynbee's.", 
    "realname": "Mortimer Toynbee", 
    "speed": 5, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 169
}