{
    "add": {
        "doc": {
            "aliases": "Larry", 
            "citizenship": "U.S.A.", 
            "content": "However, Patrick didn't expect a chance encounter with the psychotic Carnage, who was enraged at his own impending asexual pregnancy. Carnage implanted Patrick with his \"other\", and left the new Symbiote to incubate within him. At the same time, Venom argued with Carnage over the Symbiote offspring. Carnage insisted on killing it, but Venom was concerned that as the 1,000th Symbiote of their line, \"Toxin\" could potentially become psychotic as a result of genetic breakdown. Carnage tracked his offspring to Patrick's apartment, and threw Gina down a stairwell. Spider-Man was able to save Gina, while Black Cat managed to distract Carnage.Patrick continued his life, haunted by his encounter with Carnage. He soon discovered that he was much faster and stronger than before, and was easily able to subdue Black Cat before she could escape his questioning. However, Carnage interrupted the conversation, attacking Patrick and the Cat. Patrick became Toxin, saving Cat. Though unnerved by his transformation, Patrick decided that his new powers could be used for good. Teaming up with Spider-Man to stop an armed robbery, Patrick found himself filled with murderous urges. He struggled to keep himself together, telling Spider-Man that he was only \"joking\" about eating the robbers' brains.A short time after fighting Venom and Carnage, Toxin began helping to find the escaped criminals from the Raft. The first criminal he hunted down was King Cobra. Patrick visited Mr. Hyde at Ryker's Island, hoping to obtain information on King Cobra. Hyde gave no help, but did give a piece of King Cobra's skin he had previously shed. Using the piece of skin, Toxin located Cobra, and after a small scuffle, defeated him. After the battle, Spider-Man came to Pat enlisting his aid to bring in the criminal Razor-Fist, giving him a bloody bandage to aid in Toxin's hunt.At this point in his life it was becoming continually more difficult for Mulligan to control the symbiote. Toxin liked the violence, and it was getting increasingly harder for Patrick to refrain from killing. Eventually, Toxin was able to locate Razor Fist, but instead of changing into Toxin, he changed into a small, middle-aged man, Toxin called Larry. A twisted joke Toxin decided to play on Pat for never letting him have any \"fun\". After Patrick pleaded for the symbiote's help, he eventually emerged. After a short fight, RazorFist escaped. Toxin then defeated and captured the criminal known as The Answer. Patrick could think of only one to solution the childlike monster that brought out his worst: suicide.", 
            "durability": 5, 
            "education": "College educated", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 3, 
            "firstappearance": "(as Patrick Mulligan) Venom vs. Carnage #1 (2004); (as Toxin) Venom vs. Carnage #2 (2004)\n", 
            "groupaffiliation": "None", 
            "hair": "Brown\n", 
            "height": 74, 
            "id": "Toxin", 
            "identity": "Secret", 
            "intelligence": 5, 
            "knownrelatives": "Gina Mulligan (wife); Edward Mulligan (son); Mr. Mulligan (father); Mrs. Mulligan (mother); Carnage (symbiote's \"father\"); Venom (symbiote's \"grandfather\")", 
            "occupation": "Former Police officer", 
            "origin": "Venom vs. Carnage #2 (2004)", 
            "placeofbirth": "New York City", 
            "powers": "Toxin possesses the power to stick to walls and create \"tendrils\" to swing between buildings. Toxin can project elongated claws or \"snares\" from his costume in the same manner as Carnage. His symbiotically induced strength (Able to lift 45 tons now currently lifts 90 tons)is greater than that of Venom and Carnage combined. Toxin can also use the symbiote to simulate any type of clothing. Presumably, Toxin possesses the same vulnerability to fire and intense sonic attacks from which all other symbiotes suffer.", 
            "realname": "Patrick \"Paddy\" Mulligan", 
            "speed": 3, 
            "strength": 6, 
            "universe": "Marvel Universe", 
            "weight": 215
        }
    }
}