{
    "citizenship": "U.S.A", 
    "content": "The time came when Trainer was needed by Norman Osborn. Osborn sent out a Scrier to tell Trainer to tamper with the Jackal’s equipment so it would read that the clone was the original Peter Parker, while the real Peter would read as the clone.  Trainer did as he was told and the Jackal received the false examination results, unaware he was actually been duped.  Shortly after this, the clone, who began to call himself Ben Reilly, left New York to pursue a new life. However, Osborn wanted to keep tabs on the clone for future use and  used Trainer to keep track of him. Trainer did his job well, even going as far as making contact with the clone. However, Osborn did not anticipate a bond developing between the two that resembled a father-son relationship. Osborn feared that this bond would complicate his plans.Ben Reilly returned to New York years later when May Parker suffered a massive stroke and  lapsed into a coma. Ben wished to be with her during her final days. Around this time both Ben and Peter made contact with each other but , more importantly, the Jackal had also resurfaced. He began to play mind games by declaring both Peter and Ben to be the clone. Jackal was still under the belief that Ben was the original and Peter the clone and all of his actions were  based on this assumption. His games made Peter and Ben wish to examine themselves conclusively to determine who was the original and who was the clone. Ben suggested they go to his friend Seward Trainer to help them.However, Osborn had sent another of his agents, Mendel Stromm, to make contact with Trainer days earlier. Osborn promised to restore Stromm’s decaying body and knew that Trainer had the scientific knowledge to fulfil this promise. That is why he felt it appropriate for the two of them to make contact.  Stromm threatened to tell Ben and the Jackal about Seward’s betrayal unless he cooperated. He would  tamper with the test results so they would declare Ben to be the original and Peter the clone. Trainer did not want to do it but  Stromm told him that Ben’s fondest wish would be granted-the belief that he was the original Peter Parker after all. With this in mind Trainer agreed to bargain.  Days later, the results were declared and Peter’s life was turned upside down.  After some initial resentment, Peter moved to Portland to start a new life with his wife. He gave Ben his Spidey threads and wished him all the best for the future. With Ben’s dream realised, Trainer couldn’t help but feel tremendous guilt over his deception.However, Peter would shortly return to New York  after the discovery of the Spider skeleton.  Ben requested his help to investigate the findings and also asked for Trainer’s help, only to find he had mysteriously disappeared.  Actually Trainer had relocated to the lab beneath the Multivex building and began developing the procedure to restore Stromm’s body.  Peter began to  doubt Trainer’s allegiance and as such began to suspect that the test results conducted earlier were false. However, Ben would not listen to Peter’s suspicions as he couldn’t believe that his friend would do such a thing. Unfortunately,  Peter’s suspicions proved to be accurate when Ben was attacked by the  Hobgoblin. It was only the intervention of Trainer that prevented the Hobgoblin from killing Ben. With Trainer’s treachery now in the open, both Ben and Peter agreed to help each other find out who was manipulating their lives.", 
    "durability": 1, 
    "education": "College", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Spider-man#54 (1995)\n", 
    "groupaffiliation": "None", 
    "hair": "Brown with white streak\n", 
    "height": 0, 
    "id": "Trainer,_Seward", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Carolyn Trainer (daughter)", 
    "occupation": [
        "Researcher", 
        "", 
        "former assistant to Miles Warren", 
        "formally in the employ of the High Evolutionary"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "None. Seward Trainer has the abilities of a normal man his age.", 
    "realname": "Seward Trainer", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 200
}