{
    "aliases": "Unrevealed", 
    "citizenship": "United States of America with an international criminal record", 
    "content": "After a few more months Trickshot decided that Barton was ready to become his partner in an extortion racket he had planned. On their first mission together, Trickshot and Barton went to the home of a criminal known as Marko, who was coincidentally the man Swordsman was attempting to repay when he stole from the carnival. While trying to rob Marko, Trickshot killed him, and during the escape Barton killed Barney Barton, who had taken a job as a bodyguard for Marko (it was later revealed however that Barney Barton did not die at this time, as he was later killed by Egghead. Shocked by his own actions, Barton rebelled against Trickshot and they fired arrows at each other. After impaling Barton on a tree, Trickshot told Barton that he would return one day to kill him.For the next several years Trickshot worked as a freelance bodyguard, assassin, and mercenary for well-paying clients. As time went on Trickshot was diagnosed with terminal cancer and that he only had a short time to live. Wanting to die a noble death, Trickshot sought out Barton, who had become a very accomplished archer and took the name Hawkeye. Trickshot wanted to set up a duel between he and Hawkeye in which Barton would win. Trickshot then went about luring Hawkeye to an island in Greece, and they fought but Hawkeye found he could not kill his old teacher. Instead the two made their peace and went their separate ways.Later, Trickshot learned that Crossfire had put a bounty on Hawkeye’s shooting arm and had hired a variety of criminals to attack him. At around the same time he received word that his cancer had gone into remission. Wishing to help his former student, Trickshot assisted Hawkeye and his wife Mockingbird in battle against Crossfire, Mad-Dog, the Bullet Biker, Bobcat, the Brothers Grimm, Razorfist, and the Death Throws. After their victory, Trickshot again parted ways with Hawkeye.", 
    "durability": 1, 
    "education": "High school dropout", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Solo Avengers #1\n", 
    "groupaffiliation": "None", 
    "hair": "Grayish-Brown\n", 
    "height": 74, 
    "id": "Trickshot", 
    "identity": "Secret", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Assassin", 
        "mercenary"
    ], 
    "placeofbirth": "Unrevealed", 
    "realname": "Buck Chisholm", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 287
}