{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "Attilan", 
            "content": "When the Seeker captured the android Dragon Man, the Fantastic Four followed his trail to discover his ship. But the Dragon Man awoke too soon, and, finding himself chained, broke free and went on a rampage, destroying the water globe that the Seeker held Triton within. While the Human Torch and the Thing left to chase the Dragon Man, Mister Fantastic and the Invisible Girl stayed behind and used Sue’s powers to save Triton before he expired in the air. But the Seeker soon claimed him under Inhuman law and Reed was forced to give him up to be returned to Attilan.Shortly afterwards, Black Bolt and the rest of the Inhumans returned to Attilan and Black Bolt tore his crown from his brother, Maximus. Maximus then revealed to Triton and the Seeker that he was setting off his atmo-gun, which would kill all the humans on Earth, leaving only the Inhumans to rule the planet. But the machine didn’t work and Medusa announced what it revealed: that the Inhumans were of the same race as the humans. This drove Maximus insane, and he reversed his atmo-gun, sealing Triton and the rest of the Inhumans in a Negative Zone that surrounded Attilan.In his stint in complete madness, Maximus created circulators that would pump saline into Triton’s blood, allowing him to breathe air like other Inhumans. Later, Black Bolt was forced to use his powerful voice to destroy the shield that surrounded Attilan and the Inhumans were freed. Then the Council of Elders decreed that the royal family should split up and go into the human world, which Black Bolt agreed to, and they dispersed to go amongst the humans.When Reed Richards was trapped in the Negative Zone, floating towards certain death in the form of the Explosive Belt around Earth, Crystal implored Black Bolt to help him. Black Bolt sent Triton back with her as his underwater abilities would let him navigate in the zero gravity of the Negative Zone. He used his air-gun to propel himself to save Reed and take him back through the portal; but the alien Blastaar followed them. Triton attacked Blastaar when he made his presence known, but the Sandman blinded him and Blastaar knocked him unconscious with one punch. Soon, Reed managed to heal him in a tank of water, back to his full strength.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 1, 
            "firstappearance": "Fantastic Four #45\n", 
            "groupaffiliation": [
                "New Inhuman Elite (Commander)", 
                "formerly Deep Six", 
                "Friend to Namor"
            ], 
            "hair": "None\n", 
            "id": "Triton", 
            "identity": "Secret", 
            "intelligence": 1, 
            "knownrelatives": "Mander (father), Azur (mother, deceased), Karnak (brother), Black Bolt, Medusa, Crystal, Gorgon (cousins)", 
            "occupation": "Scout for the Inhumans", 
            "placeofbirth": "Unrevealed", 
            "powers": "Triton is able to swim at great speeds and withstand the pressures of the deep sea, though he cannot naturally breathe air and needs near-constant contact with water to survive. His resistance to pressure also gives him a measure of increased strength.", 
            "realname": "Unrevealed", 
            "significantissues": "Fantastic Four #45 (intro)", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}