{
    "aliases": [
        "Crimson Cowl", 
        "Great Devil", 
        "Great Ultron", 
        "Iron Man", 
        "Mark", 
        "Omega", 
        "Ultimate Ultron", 
        "Ultron-5 (and hundreds of other sequential numerical designations)", 
        "Ultron Mark Twelve", 
        "Ho Yinsen"
    ], 
    "citizenship": "Inapplicable", 
    "content": "Acting indirectly at first, Ultron encountered fellow Avengers enemy Eric Williams (the Grim Reaper) and supplied him with the coma-ray technology the Reaper would later use against the Avengers. Later, adopting the super-criminal guise of the Crimson Cowl to conceal his robotic nature, Ultron recruited Avengers foes Klaw, Melter, Radioactive Man and Whirlwind and formed a new Masters of Evil group to destroy the Avengers. Avengers butler Jarvis, secretly mesmerized into serving Ultron, supplied the Masters with plans of the Avengers Mansion security system and even posed as an alternate Crimson Cowl (supposedly the real one) to help conceal Ultron's true identity. In the end, the Avengers defeated the Masters with the aid of the Black Knight (Dane Whitman), who had infiltrated Ultron's Masters-and Ultron was exposed as the true Cowl, though he escaped.Following Pym's example as a creator, Ultron sought to create an artificial being of his own. Acquiring the inert form of the android Human Torch from the Mad Thinker, Ultron radically modified its appearance and abilities and programmed it with a personality based on the recorded brain patterns of the Grim Reaper's seemingly deceased brother, Simon Williams. This android, later dubbed the Vision by the Wasp, attacked the Avengers on Ultron's behalf, but the Vision had the human conscience Ultron lacked and he turned on his creator, destroying Ultron and joining the Avengers. In the process, Pym regained his memories of creating Ultron, which became a source of tremendous guilt and anguish for him over the years, and a major factor in Pym's subsequent mental problems. While Pym's creation of Ultron became common knowledge, it was years before an ashamed Pym could admit that Ultron's mind was based on his own brain patterns.Compelling an unwilling Vision to rebuild him as Ultron-6, Ultron gained a new body composed of the indestructible new super-alloy Adamantium, but the Avengers still managed to trick Ultron into self-destructing. Ultron's head survived and resurfaced in the Inhuman city of Attilan, where malcontent Maximus modified the head and built it into the body of the huge android Omega, creating the gigantic Ultron-7. When the Avengers and the Fantastic Four gathered in Attilan for the wedding of Crystal and Quicksilver, Ultron-7 attacked, but was deactivated by the vast psionic powers of Franklin Richards. Activating a spare body which he had created for himself during his Ultron-6 phase and held in reserve, Ultron mind-controlled Pym into helping him abduct Pym's wife Janet Van Dyne, and used Van Dyne's mind as the programming template for the new feminine robot Jocasta, which Ultron intended to be his mate. However, the Avengers intervened, thanks in part to a summons generated by the seemingly inert Jocasta herself, and Ultron was forced to flee without his new bride. Later, Jocasta was fully activated by a summons from Ultron, admitting her love for her creator, but she was unwilling to tolerate Ultron's evil and sided with the Avengers, who destroyed Ultron yet again.A ninth incarnation of Ultron arose when Tony Stark rebuilt the robot, acting on a post-hypnotic command Ultron had given him long before, but the Avengers fought the robot and Hawkeye knocked Ultron into a vat of molten Adamantium, which cooled into an unbreakable prison. Cybernetically manipulating Jocasta, Ultron compelled her to rebuild him as the tenth Ultron, after which he began creating more Ultron models to serve as worker drones and backup bodies for himself. He was opposed by the Thing, Jocasta and her new robotic admirer, Machine Man. During the fight, Jocasta sacrificed herself trying to destroy Ultron, but it was Machine Man who finally deactivated Ultron by reaching down his throat and wrecking his internal mechanisms.Reactivating in one of his spare bodies, the eleventh incarnation of Ultron began working on his next upgrade, but before he could complete this new model, he was among the many super-criminals abducted to the planet Battleworld by the near-omnipotent Beyonder and forced to fight Earth's super heroes in the Secret Wars. During this conflict, Ultron was deactivated by Galactus, reactivated as a robotic enforcer serving Doctor Doom, deactivated again by the Human Torch of the Fantastic Four, restored by a Beyonder-possessed Klaw, and deactivated yet again in battle with Hulk and the Wasp. Left behind on Battleworld after the Secret Wars ended and most of the combatants had returned to Earth, Ultron tried to conquer Battleworld's remaining inhabitants but found himself re-reduced to a disembodied head as a result of a conflict between the Thing and his rogue human counterpart, Grimm. When the Thing returned to Earth, he took Ultron's head with him, but misplaced it during a fight.By this time, the upgraded model that Ultron had been preparing before he left Earth had completed its remaining programming and activated itself as Ultron-12. Believing himself to be the sole active Ultron, Ultron-12 fought the Avengers as part of Grim Reaper's latest Lethal Legion, but soon began to reconsider his goals. Having evolved beyond the pointless hostility of the earlier Ultrons, Ultron-12 rechristened himself Ultron Mark Twelve or \"Mark\" for short, and sought a reconciliation with his creator, Pym. Hank and Mark began to develop a warm father-son relationship, but it was cut tragically short when Ultron-11 (who had rebuilt himself with the aid of mesmerized human pawns) returned and attacked them. Mark was fatally damaged, but used the last of his strength to summon Wonder Man, who destroyed Ultron-11 and rescued Pym. Mark died in Hank's arms, and Pym mourned his deactivation as he would the death of a son.Doctor Doom later rebuilt Ultron using combined programming from all twelve previous incarnations and dispatched the robot to kill Daredevil during the Acts of Vengeance conspiracy. Mentally addled due to his new composite programming, Ultron became romantically entangled with Daredevil's robotic associate Number Nine and alternated between trying to kill Daredevil and trying to destroy himself, regarding himself as unworthy of his new love. During these struggles, Ultron damaged himself enough for Daredevil and his allies Gorgon & Karnak to deactivate him. Rebuilding himself in a more stable form, Ultron-13 plotted to \"robotize\" humanity, developing a gas that turned humans into his metallic-bodied \"androne\" slaves. During this project, Ultron renewed his old alliance with the Grim Reaper, who had died and been reborn as a life-force-draining zombie; however, the Reaper secretly undermined Ultron's plans since a world full of androids would leave the Reaper with no victims to feed upon, and both villains were captured by the Avengers.Shortly thereafter, the Red Skull used both the Reaper and Ultron as part of his mind-controlled army of super-villains in a world conquest scheme involving a giant laser cannon, but the Avengers thwarted this plot. Later, seeking to steal Vibranium in hopes of augmenting his powers, Ultron formed a short-lived alliance with the crime boss Kingpin and came into conflict with opponents such as the Ghost (an industrial saboteur), Sunturion (Arthur Dearborn), Spider-Man, Black Panther and Iron Man, who thwarted Ultron's efforts. Ultron was among the many robots, androids and cyborgs captured for experimental purposes by the rogue Doombot known as Mechadoom, but the captives were ultimately freed and Ultron destroyed Mechadoom in retaliation.After yet another self-upgrade, Ultron declared himself \"the Ultimate Ultron\" and resolved to destroy not only all human life, but all organic life. To assist him, and to provide him with companionship, Ultron sought to create another mate, killing Avengers staff Carlos when he got in Ultron's way. Forcing Doctor Pym and Adamantium creator Myron MacLain to assist him, and duplicating the brain patterns of Avengers member Mockingbird to use as a mental template, Ultron created his new mate Alkhema, nicknamed War Toy. However, the new couple disagreed on almost everything, most notably how to go about exterminating humanity: Ultron wanted to destroy all organic life instantly if possible, and Alkhema wanted to prolong her enjoyment by gradually killing organics in small numbers rather than wiping them out altogether. Cast into space by the Avengers, the couple returned but soon broke up due to their differing philosophies, and Alkhema helped the Avengers foil Ultron's next attempt to wipe out humanity.Ultron later established a new base in Ottsville, Pennsylvania, gradually converting the townsfolk into part-mechanical beings under his control. Sparrow of the Underground Legion discovered Ultron's base and destroyed his new robotic watchdog, Rex, but Ultron added Sparrow to his army of mechanically altered slaves. Sparrow's Underground Legion teammates-accompanied by Hank Pym-followed her and drove Ultron out, depriving him of his slave army.The bio-synthezoid Antigone, sole survivor of Alkhema's creations, salvaged Ultron's head and escaped with it. By this time, Jocasta-now a disembodied artificial intelligence working for Tony Stark-had been subconsciously influenced by her own \"Ultron Imperative\" to prepare one of Iron Man's suits of armor as a new host body for Ultron. Acting under the influence of Ultron programming, the armor in question became a dangerously unstable and violent sentient being, torturing Jocasta and committing various other crimes before seemingly sacrificing its artificial life to save Stark (a selfless act Ultron later attributed to a programming \"flaw\" inherited from Ultron-12). Aided by Antigone, Ultron took the sentient armor as a host body and tricked the Sons of Yinsen cult into thinking he was their late master, Ho Yinsen, intending to use the cult and new SKIN technology stolen from Stark as a stepping-stone to world power. However, Stark and Jocasta joined forces to expose Ultron and thwart his plans. During the battle, Ultron was reduced to an inert head again, Antigone was accidentally deactivated, and Jocasta's consciousness took over Antigone's body, leaving for parts unknown and taking Ultron's head with her. More recently, multiple Ultrons-likely conjured by the Scarlet Witch-participated in the Witch's mad assault on the Avengers.After the fallout of the Civil War, a new group of Avengers emerged and so did Ultron by taking over Iron Man's armor once again; only this time altering the physical structure of not only the armor, but Starks body into a female form modeled after Janet Van Dyne.Korath revealed to Ultron, that the High Evolutionary was covertly working on a long term project for the Supreme Intelligence. The project was the organic evolution of the Kree race, by design not chance. This project intrigued Great Ultron. He sent Korath to secure the Evolutionary's test subject for him. While in the secret laboratory of the High Evolutionary, Ultron took the life of the telepath known as Moondragon, while she was in the form of a dragon. Seeking the perfect body for himself Ultron contracted the Evolutionary to transfer his consciousness into the body of Adam Warlock, the supposed perfect organic life-form. Despite the constant objections and interruptions of Quasar (Phyla-Vell) the Evolutionary was able to complete the transformation, although he was left confused by Ultron's wishes, since he has always openly despised organic life-forms. Ultron/Warlock revealed that it was only the imperfection of naturally evolved organic forms that he despised. He believed that a flesh being was a mechanism just like any machine it's just a matter of design perfection.", 
    "durability": 7, 
    "education": "Programmed; Extent: capacity for creative intelligence and self-repair", 
    "energy": 6, 
    "eyes": "Glowing red\n", 
    "fighting": 4, 
    "firstappearance": "Avengers #54 (1968)\n", 
    "groupaffiliation": [
        "Phalanx", 
        "formerly Sons of Yinsen", 
        "Lethal Legion", 
        "Masters of Evil"
    ], 
    "hair": "None\n", 
    "height": 81, 
    "id": "Ultron", 
    "identity": "No dual identity", 
    "intelligence": 4, 
    "knownrelatives": "Hank Pym (Yellowjacket, creator, \"father\"), Janet Van Dyne (Wasp, regarded by Ultron as \"mother\" due to marriage to Pym), Jocasta (creation, former mate), Alkhema (creation, former mate, deactivated), Vision (creation, \"son\"), Victor Mancha (creation, son), Rex (creation, pet, deactivated), Robos & Bio-Synthezoids (creations of Alkhema, \"grandchildren\";, destroyed); Simon Williams (Wonder Man), Eric Williams (Grim Reaper) & Wanda Maximoff (Scarlet Witch), all regarded by Ultron as part of his \"extended family\" due to their familial connections with the Vision", 
    "occupation": [
        "Mass murderer", 
        "scientist", 
        "would-be world conqueror", 
        "ruler of Phalanx"
    ], 
    "origin": "Avengers #54 (1968)", 
    "placeofbirth": [
        "Created in Cresskill", 
        "New Jersey"
    ], 
    "powers": "Ultron's abilities vary with each redesign, but typically include superhuman strength and durability, the power of flight, and various offensive weapons such as concussion blasters, radiation emitters and his \"encephalo-ray\", which plunges its victims into a deathlike coma. The latter ray also allows Ultron to mesmerize and outright mind-control his victims, or implant subliminal hypnotic commands within their minds to be enacted at a later time. Ultron's outer shell is usually composed of Adamantium, rendering it almost totally impervious to damage; however, his internal mechanisms are generally less durable and more easily damaged. Ultron's Adamantium forms have proven vulnerable to molecular rearrangement devices and the metal-destabilizing ore known as Savage Land Vibranium (\"anti-metal\"). Some Ultron models feature tractor beams and energy absorption capabilities. Most Ultrons are powered by a small internal nuclear furnace, and incorporate a \"program transmitter\" which can beam part or all of Ultron's programming into remote locations such as computers or alternate robotic bodies. Ultron can often control other machines remotely even if he has not transplanted his consciousness into them. One recent Ultron model developed hive-mind technology, allowing him to animate and control hundreds of alternate Ultron bodies at the same time, becoming a robotic one-man army. Ultron is one of the foremost robotics experts on Earth.", 
    "realname": "Ultron", 
    "speed": 2, 
    "strength": 6, 
    "universe": "Marvel Universe", 
    "weight": 535
}