{
    "aliases": [
        "Brunnhilda", 
        "\"Val", 
        "\" \"Sword Girl", 
        "\" \"Golden Hair", 
        "\" Barbara Norriss", 
        "Val Doe"
    ], 
    "citizenship": "Asgard", 
    "content": "Brunnhilde was selected by Odin, monarch of the gods of the other-dimensional realm of Asgard, to lead the Valkyrior, the Choosers of the Slain, a group of warrior goddesses who would appear over the battlefields of mortal worshippers of the Asgardian gods and choose which of the fallen were worthy to be taken to Valhalla, the land of the honored dead in the dimension of Asgard. Brunnhilde served Asgard capably in this capacity for centuries.According to a sentient, disembodied eye that one belonged to Odin, the Asgardian monarch once gave his son Thor the mortal identity of the warrior Siegmund. Circumstances reluctantly forced Odin to decree that Siegmund must be slain. Brunnhilde, recognizing that Odin was acting against his true wishes, sought to protect Siegmund, but Odin himself then caused Siegmund's death. Brunnhilde helped Siegmund's pregnant lover, Sieglinde, get to safety. As punishment for her defiance, Odin removed Brunnhildes godly powers and immortality and cast her into a trance.She was eventually awakened by Siegfried, who was the son of Siegmund and Sieglinde and was a mortal reincarnation of Thor. Brunnhilde and Siegfried became lovers, but Siegfried fell under the influence of magic and betrayed her. Siegfried was later murdered, and Brunnhilde, still in love with him, she leaped into his blazing funeral pyre. Odin restored both Siegfried and Brunnhilde to life, giving them back their godly roles, powers, and near-immortality as Thor and the Valkyrie, but removing their memories of their recent lives on Earth. It is unclear how much truth, if any, there is to this account by the eye.Brunnhilde and her fellow Valkyries continued to gather heroic mortal warriors for Valhalla until roughly a millennium ago, when Odin was forced to cease virtually all intercourse with the Earth in accordance with a pact that he and the leaders of Earth's other pantheons of gods made with extraterrestrial Celestials. From then onward, the Valkyries could only choose slain heroes from among fallen Asgardian warriors. Brunnhilde was bitter over being barred from choosing warriors on Earth and roamed Asgard in pursuit of something meaningful to do.In a tavern on the outskirts of Marmoragard, Brunnhilde encountered Amora the Enchantress, who offered her a life of adventure. For several weeks Brunnhilde accompanied the Enchantress on her conquests. Brunnhilde soon discovered Amore's inclinations towards immorality and tried to end their partnership. In response Amore entrapped Brunnhilde within a mystic crystal of souls. Whith Brunnhildes body remained in suspended animation; her immortal soul became Amora's plaything. Over the centuries the Enchantress used Brunnhilde's spiritual essence to give the Valkyrie’s powers to herself or to her pawns. The Enchantress usually used her magic to alter the recipient's appearance to resemble Brunnhilde herself.Specific instances of Amore's exploitation of the Valkyrie before recent years are not yet known. The first time Amore assumed the Valkyrie's physical aspect in recent years was in a plot to lead a handful of female superhumans against the male Avengers. Her true identity was discovered, however, and her plan thwarted. Months later, the Enchantress bestowed the Valkyries power upon a socialite named Samantha Parrington in an attempt to get revenge on the Hulk.Finally, a woman driven mad by being trapped in another mystical dimension, Barbara Norriss, was given the Valkyrie's power and consciousness by Amora in order to help the Enchantress and her erstwhile allies, the group of superhumans called the Defenders, escape from the clutches of the sorceress Casiolena. Amora did not undo her spell on Norriss after Casiolena's defeat. As a result, Norrisss body now possessed Brunnhilda's consciousness, appearance, and powers, while Norriss’s own mental essence was trapped in Brunnhilde's real body in Asgard. However, thanks to partial amnesia induced by the Enchantress, Brunnhilde was unaware that she was not in possession of her real body and full memory. Indeed, while trapped in Norriss’s body Brunnhilde personality lacked much of its usual strength of will.It was not until a minor Asgardian warrior named Ollerus attempted to take over Valhalla that the Valkyrie’s two mixed aspects met for the first time. Brunnhilde’s mental essence trapped Norriss’s transformed body, fought Norriss’s mental essence trapped in Brunnhilde’s real body. At the end of that encounter, the Valkyrie’s body, still possessed by Norriss’s mind was consigned to Niffiehelm, the realm inhabited by the spirits at the non-heroic Asgardian dead, while Brunnhilde’s mind in Norriss’s transformed body accompanied the Defenders, who had made the other dimensional journey with her, back to Earth.For reasons yet unknown, Brunnhilde was not concerned at this time about reuniting her mind with her true body. It was not until Barbara Norriss’s body was murdered that the Valkyries spirit and mind were inadvertently freed from their mortal host. With the help of Doctor Strange's magic, Brunnhilde regained her true body, which was rescued from Niffleheim by the Enchantress. Back in her real body, Brunnhilde regained her full memory and normal warrior’s personality as well. Brunnhilde then battled Amore and banished her into the crystal of souls in which she had been trapped.Feeling estranged from Asgard in general and Odin in particular for their neglect of her centuries-long plight, Brunnhilde chose to return to Earth with her mortal friends, the Defenders, rather than to remain in Asgard. She had joined the Defenders after their battle with Casiolena and remained with them continuously until the group finally came to one of its end.Odin placed the dangerously powerful self-styled goddess Moondragon into Brunnhilde's charge. Brunnhilde was to teach Moodragon humility, and Moondragon served alongside Brunnhilde in the Defenders. Brunnhilde was to take action against Moondragon should she again become a menace. Eventually Moondragon reformed, but later she fell once again under the malevolent influence of the alien entity called the Dragon of the Moon. Moondragon attacked the Defenders, but Brunnhilde, given temporary additional powers by Odin for this occasion, including the power to grow to gigantic stature, opposed her. Brunnhilde summoned other Valkyries to her aid and together with two other Defenders, the Angel and Cloud, they battled and, thanks to Cloud especially, defeated Moondragon. Moondragon escaped, howeverMonths later Moondragon returned to attack the Defenders, and during the encounter her power was vastly augmented by the alien Beyonder. In order to defeat the Dragon, Brunnhilde and the Eternal called Interloper projected their immortal life forces against it. They were joined by the Defender, Andromeda and the Defenders’ former foe Manslaughter, for it was necessary that Brunnhilde’s and Interloper’s life forces pass through “mortal instruments” in order that Moondragon be defeated as well. Joining hands, the four allies hurled the tremendous power of their combined life forces at the Dragon, Moondragon, and the Gargoyle, whose body was now under the Dragons control. Three other Defenders went to rescue endangered innocents, and when they returned, Brunnhilde, Interloper, Andromeda, Manslaughter, Moondragon and the Gargoyle had all seemingly been transformed into statues of ashes and dust, and the Dragon of the Moon was apparently gone.Recently when Doctor Strange was on the brink of death, his astral form found itself being drawn towards a realm of the afterlife. His astral form saw Brunnhilda, who had come to escort him into the hereafter. Strange, however, refused, and after considerable effort, returned to life in the mortal world. It’s unclear whether Brunnhilde herself was dead and appeared to Strange in her astral form, or whether she still lives in physical form. It’s clear, however, that she once more serves to escort the spirits of dead heroes into the hereafter.", 
    "durability": 1, 
    "education": "Warrior school graduate, unspecified graduate courses", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "(Enchantress in Valkyrie's form) Avengers #87 (1970), (Samantha Parrington in Valkyrie's form) Incredible Hulk #142 (1971), (Brunnhilde in Barbara Norriss's body) Defenders #3 (1973), (Brunnhilde in her own body) Defenders  #109 (1982).\n", 
    "groupaffiliation": [
        "Valkyrior", 
        "formerly Defenders", 
        "Dragon Circle"
    ], 
    "hair": "Blonde\n", 
    "height": 0, 
    "id": "Valkyrie_(Brunnhilde)", 
    "identity": [
        "Publicly known", 
        "the Valkyrie's godhood is not acknowledged by the general populace of modern day Earth"
    ], 
    "intelligence": 1, 
    "knownrelatives": "Odin (godfather), Grimgerda, Hidegard, Letia. Svava, Sygnet, Valtrauta, two unidentified others (god-sisters)", 
    "occupation": [
        "Chooser of the Slain", 
        "adventurer"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "Brunnhilde the Valkyrie possesses the conventional attributes of an Asgardian woman (\"goddess\"). Like all Asgardians she is extremely long lived (although not immortal like the Olympians), superhumanly strong, immune to all Earthly diseases, and resistant to conventional injury. Asgardian's flesh and bones are about three times as dense as similar human tissue, contributing to all Asgardian superhuman strength and weight. Brunnhilde’s Asgardian metabolism gives her far greater than human endurance at all physical activities: she can exert peak strength for an hour before fatigue impairs her ability level.\nLike all Valkyries, Brunnhilde can perceive and sense the coming of Death. She can see a \"deathglow\" surrounding a person who is in serious danger of dying, although most Asgardians and human beings cannot see the glow. A person surrounded by the deathglow might still be saved from dying (until he or she meets his or her inevitable end at some later time under different circumstances).\n\nBrunnhilde can transport herself and a dying or dead person from the Earth dimension to an other-dimensional realm of the dead, just by willing herself to do so. She can also return through an act of will.", 
    "realname": "Brunnhilde", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 475
}