{
    "aliases": [
        "Aphrodite", 
        "Victoria Nutley Starr"
    ], 
    "citizenship": "Unrevealed", 
    "content": "In 1948, in search of adventure and romance, Venus found employment at Beauty Magazine, whose publisher, Whitney Hammond, doubted her claims of godhood but felt her beauty would provide good publicity. Romance blossomed between Venus and Hammond, although his secretary Della Mason often plotted to keep them apart. At first limited to magazine work and matchmaking endeavors, Venus soon clashed with various threats, beginning with an evil figure identified as Loki; other enemies included the gargoyles of Sylvia Corpo, nightmarish creatures from a co-worker's mind, the Olympian Neptunia, and a demonic vampire creature. At one point, she met government agent Jacob Scott, secretly the Skrull Velmax, later Effigy of the First Line. Eventually, realizing her immortality would place a wedge between her and Hammond, Venus abandoned her mortal identity.During her time as an adventurer, Venus was approached by FBI agent Jimmy Woo, and she agreed to join Jimmy and his allies in freeing President Eisenhower from the clutches of the Yellow Claw. These \"G-Men\" operated for another six months, until the government decreed that the country wasn't ready to learn of such a super-team and its exploits.At some point in the 1980s, her former teammate Gorilla Man returned to his place of origin in Africa. He recounted to Venus horrible stories of the atrocities brought upon by centuries of tribal warfare. Venus took it upon herself to aid the region, using her powers to help unite the warring factions until, years later, they had intermarried and became a blending of the two factions. Venus stayed with these people for many years until Jimmy Woo again recruited allies, this time to help him search for the Atlas Foundation. During the search, Namora revealed the secret about Venus' true nature, having known of the legend of the Siren. The revelation nearly crippled Venus emotionally and threatened to tear the team apart, but she was calmed by Jimmy Woo.The trail eventually led to Mr. Lao, a literal dragon working on behalf of the Yellow Claw. The Claw revealed that Jimmy was a true descendant of Genghis Khan, and he revealed that he became Jimmy's greatest enemy in order to help him build a legend worthy of his lineage. In fact, Jimmy's adventures with his allies had been set up by the Claw and Mr. Lao from the very beginning! For example, it was the Yellow Claw who chartered the fleet that held the magician who transformed the Siren into Venus so many years ago.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "Venus #1 (1948)\n", 
    "groupaffiliation": "Agents of Atlas", 
    "hair": "Blonde\n", 
    "height": 66, 
    "id": "Venus", 
    "identity": [
        "No dual identity", 
        "once believed to be the actual Olympian goddess"
    ], 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Peacemaker", 
        "adventurer", 
        "(formerly) self-proclaimed goddess of love", 
        "college professor", 
        "investigator", 
        "magazine writer/editor"
    ], 
    "origin": "Agents of Atlas #5 (2007)", 
    "placeofbirth": "Unrevealed", 
    "powers": "Venus' voice has a mesmerizing effect, capable of influencing the emotions of others or of placing them in her thrall. As a mystical creature, she can survive harsh environments usually deadly to human beings and has a particular affinity for the sea.", 
    "realname": "Unrevealed", 
    "significantissues": "Recruited by Jimmy Woo to help uncover the truth about the Atlas Foundation (Agents of Atlas #2-6, 2006-7)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 280
}