{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": "U.S.A with a criminal record", 
            "content": "Later, Drago hijacked a prison car and drove through the prison gates. He found the vulture wings exactly where Toomes said they would be. Drago practiced his flying skills over Manhattan. Drago found that he was stronger than Toomes ever was and more inventive and thus designed a helmet with a short wave receiver. Blackie wasted no time starting a one-man crime wave adopting the mantle of the Vulture. The Vulture became the hot news topic in a matter of days.  His only goal was to make money by performing acts of air-piracy. Due to Spider-Man's cold and apparent weakness, Blackie attacked a helicopter and stole its shipment of uncut diamonds without difficulty. His infamy as New York's greatest villain attracted the attention of not only Spider-Man, but also one of Spider-Man's greatest enemies, Kraven the Hunter.In a major battle between Spider-Man, Kraven and the new Vulture, Kraven’s double-barreled ray missed Spider-Man and accidentally collided with the Vulture knocking him unconscious. This gave Spider-Man a chance to tear the ray out of Kraven’s vest and strike him with a heavy punch. Both villains lay defeated. Blackie was returned to prison. It was later revealed that the Toomes was alive and well.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "Amazing Spider-Man #48 (May, 1967)\n", 
            "hair": "Black\n", 
            "height": 72, 
            "id": "Vulture_(Blackie_Drago)", 
            "identity": "Publicly known", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Criminal", 
            "powers": "Possesses the same abilities as his predecessor. Superhuman strength and vitality while wearing a harness that enables him to have the ability to fly due to the Electromagnetic anti-graviton generator built into it. Can fly at speeds of up to 95 MPH for up to 6 hours & can attain maximum altitude of 11,000 feet. He doesn't have the same experience level as the original Vulture. He did add a protective helmet with a built-in shortwave receiver.", 
            "realname": "Blackie Drago", 
            "significantissues": [
                "Defeated by Spider-Man and Kraven (Amazing Spider-Man #49, 1967)", 
                "defeated by the original Vulture (Amazing Spider-Man #63,1968)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 210
        }
    }
}