{
    "aliases": [
        "Proudstar", 
        "Thunderbird"
    ], 
    "citizenship": [
        "U.S.A.", 
        "Apache"
    ], 
    "content": "Proudstar later sought out Xavier and unsuccessfully tried to defeat the X-Men. Ultimately realizing that the X-Men were not responsible, he dropped his vendetta. Declining Xavier's offer to join his team of X-Men protégés, the New Mutants, Proudstar returned to the Hellions as their leader. Eventually, however, James left the Hellions to return home to Camp Verde.Years later, during a trip to New York, Proudstar was approached by Cable to join his formative strike-force, X-Force. Proudstar initially refused the offer and returned home to find that everyone on his reservation had been slaughtered and a Hellfire Club mercenary's mask left behind. Vowing revenge, he accepted Cable's offer under the code-name Warpath, hoping that he could later use the team in his revenge. Warpath adventured with X-Force for a long tenure. Over time, he developed his powers to higher and higher levels. He also developed a crush on his teammate Siryn and was instrumental in helping her recover from alcoholism. Proudstar eventually confronted Emma Frost over the death of his people, but she convinced him that it was not the Hellfire Club that was responsible.After a couple of years, Proudstar left X-Force, after an encounter with a young mutant named Risque. Together, the two wandered the country, and Proudstar was taken in by Risque's seductive ways. Ultimately, however, Risque betrayed Proudstar, drugging him and delivering him to a mutant called Sledge. Sledge later informed Proudstar that a member of his tribe, Michael Whitecloud, had not died in the massacre. Sledge offered to give him to Proudstar for a fee. Proudstar accepted since Whitecloud is the only member of the tribe to know the truth about the massacre. After meeting with Whitecloud, it was revealed that the time-travelling clone of Cable, Stryfe, had engineered the Camp Verde massacre. In order to confront Stryfe, Proudstar had to travel to Hell itself, realm of the demon Mephisto. After a battle, Stryfe wished to switch places with Proudstar. However, the Mephisto's son Blackheart retained Stryfe's soul and allowed Proudstar to return to Earth.James eventually paid the debt he owed Sledge by traveling to an alternate dimension and freeing the Vanisher who was trapped there. (Sledge's motives for this exchange remain unrevealed.) James then returned to X-Force, where he continued to adventure alongside his friends as simply Proudstar.After one adventure, X-Force survived being in the center of a Vibranium bomb explosion. The team decided to let the world believe them dead and to use this status to secretly infiltrate and destroy anti-mutant organizations around the world. After half a year of this hit-and-run strategy, they learned of a great underground complex where Wisdom's sister Romany was infecting people with alien DNA to alter the human race. In the final battle, X-Force destroyed the alien complex and was believed dead. During this time, Proudstar began to exhibit strange fluctuations of power, such as the ability to fly, and he seemingly lost the ability to speak. The reasons behind this change have yet to be fully revealed.Proudstar and X-Force reappeared at a press conference of a new team calling itself X-Force, challenging the team (now called X-Statix) in dispute for their name, although Proudstar and his teammates were ousted, and most of its members went their separate ways. Proudstar went on to join the X-Corporation in its branch at Mumbai, India, and has was later spotted among X-Force once again.", 
    "durability": 6, 
    "education": "Unrevealed", 
    "energy": 1, 
    "fighting": 5, 
    "firstappearance": "New Mutants #16\n", 
    "groupaffiliation": [
        "X-Force", 
        "formerly X-Men", 
        "X-Corporation", 
        "New Mutants", 
        "Hellions"
    ], 
    "hair": "Black\n", 
    "height": 86, 
    "id": "Warpath", 
    "identity": "Publicly known", 
    "intelligence": 3, 
    "knownrelatives": "John Proudstar (Thunderbird, brother, deceased)", 
    "occupation": [
        "Adventurer", 
        "former soldier"
    ], 
    "origin": [
        "X-Force -1", 
        "Classic X-Men #3"
    ], 
    "placeofbirth": [
        "Camp Verde", 
        "Arizona"
    ], 
    "powers": "Enhanced strength, speed, durability, reflexes, and senses; flight", 
    "realname": "James Proudstar", 
    "significantissues": "Attempts assassination on Xavier (Uncanny X-Men #193), discovers Camp Verde massacre, joins X-Force (New Mutants #99/100), accompanies Siryn to Cassidy Keep (X-Force #31), meeting with Emma Frost (X-Force #42), meets Risque (X-Force #51), returns to X-Force after stay with Risque (X-Force #57), betrayed by Risque, learns of Michael Whitecloud's whereabouts from Sledge (X-Force #65/66), retrieves Vanisher from other dimension (X-Force #68/70), learns truth of tribe's massacre, battles Stryfe in Hell (X-Force #72/74), seen as member of X-Corporation in Mumbai (New X-Men #133), joins Cable against the Skornn (X-Force #2/3, 2004), joins X-Men (Uncanny X-Men #475, 2006), rejoins X-Force (Uncanny X-Men #493, 2007)", 
    "speed": 5, 
    "strength": 5, 
    "universe": "Marvel Universe", 
    "weight": 350
}