{
    "aliases": [
        "The Human Top", 
        "Charles Matthews"
    ], 
    "citizenship": "U.S.A.", 
    "content": "Cannon reinvented himself, creating the Whirlwind identity. He also developed an alias of Charles Matthews, to become the Wasp's chauffeur in order to be close to Pym and the Wasp, and he grew to have an unhealthy fixation on her. He used his cover to gain access to the Avengers Mansion, kidnapping the Wasp but was stopped by Quicksilver.Whirlwind was invited to join the Masters of Evil when the team was organized by the Crimson Cowl (secretly Ultron), and although they initially were successful in defeating the Avengers, the Masters were betrayed by the Black Knight. He continued to appear as a member of various teams, including Batroc’s Brigade (working on behalf of the Red Skull) and other iterations of the Masters of Evil. He also worked alongside the agents of Count Nefaria. In every case, he was defeated by the Avengers.Whirlwind was recruited by Egghead to re-form the Masters of Evil. The Masters successfully liberated Hank Pym (then Yellowjacket) from his criminal trial, forcing him to join the Masters and convincing the public he had become a criminal-- all a part of Egghead’s plan to disgrace and humiliate Pym. But Whirlwind’s impatience got the best of him when the Avengers came to investigate. His premature attack allowed Pym to turn the tables on the Masters of Evil and for the Avengers to come to the rescue.His lack of control under pressure led Baron Zemo to dismiss Whirlwind’s attempt to join his version of the Masters of Evil. Instead, Zemo ordered him to detain Captain America while the other villains took over the Avengers Mansion. Whirlwind, determined to prove himself, joined with the Trapster but still failed to stop the Captain. Escaping custody, he joined Tiger Shark for a brief crime spree in San Francisco, but he was stopped  by Henry Pym, who had just reinvented himself as a scientific adventurer.Recently, Cannon's obsession with the Wasp led to his brutal murdering of several prostitutes, indicating that his mental state may now be cause for concern. He tracked Pym and the Wasp to their vacation in Las Vegas, viciously attacking the Wasp and blaming her for his obsession which he said continually drove him into villainy. Nevertheless, Pym and Wasp defeated him again, with Pym at giant-size throwing him into the top of the Luxor hotel and Wasp finishing him off with a roundhouse kick. Whirlwind was remanded to police custody.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 1, 
    "firstappearance": "(as Human Top) Tales to Astonish #50, (as Whirlwind) Avengers #46\n", 
    "groupaffiliation": [
        "Zodiac's Gang", 
        "formerly Thunderbolts Army", 
        "Lethal Legion", 
        "Masters Of Evil", 
        "Batroc’s Brigade", 
        "agent of Count Nefaria"
    ], 
    "hair": "Brown\n", 
    "height": 73, 
    "id": "Whirlwind_(David_Cannon)", 
    "identity": "Publicly known", 
    "intelligence": 1, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Professional criminal", 
        "(formerly) chauffeur", 
        "circus performer", 
        "pro-wrestler", 
        "iceskater"
    ], 
    "placeofbirth": [
        "Kansas City", 
        "Missouri"
    ], 
    "powers": "When Cannon found out he was immune to dizziness, he soon found out he could twirl his body at fantastic speeds. He has since used this power for various effects, such as spinning so fast to avoid grappling attacks, spinning air currents to provide him with a type of body armor, gaining flight for short periods, focusing air into a blast attack, and generating a tornado in his area. He can spin fast enough to outrun normal humans, and with sufficient momentum, can even spin up vertical surfaces.", 
    "realname": "David Cannon", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 220
}