{
    "aliases": [
        "Weapon Omega", 
        "Wildheart"
    ], 
    "citizenship": "U.K. (criminal record in Canada and U.S.)", 
    "content": "Unfortunately, the government disbanded the Department H program and, by extension, its hero teams. Gibney's subsequent activities remain unrevealed until Delphine Courtney and Jerry Jaxon recruited him for Omega Flight. Jaxon hoped to destroy Hudson and his Alpha Flight, which had reassembled as a private team, but Omega Flight was captured by Alpha Flight and its members imprisoned. Gibney managed to break out only once, and in his rampage, began killing indiscriminately. Nearly killing Heather Hudson, it took Wolverine to hunt him down and capture him again.During a period of time in which Alpha Flight was believed dead, the Canadian government decided to reinstate a fully-sanctioned hero team under the name Gamma Flight. Gibney was recruited for the team and pardoned for his previous activities. When Alpha Flight reappeared, the two teams clashed, and Alpha Flight was forced to go on trial. Ultimately, Alpha Flight rejected the government's support and decided to operate independently once more. Gamma Flight continued as the government-sponsored team, and the two teams eventually met again to fight the evil Llan the Sorcerer. Gamma Flight was nearly destroyed in the final battle, but Llan was defeated. Afterward, the two teams combined into one, with Alpha Flight again reinstated as Canada's official superhero group.Kyle soon found himself slipping into his bestial nature more and more often. One time in particular, he savagely went on another rampage, in the process attacking his teammate Pathway. Gamma Flight's former leader, Nemesis, teleported Kyle away to an unknown location, professing to have a solution. He reappeared months later as Weapon Omega, mysteriously cured of his animalistic rages and possessing a handsome appearance. He helped Alpha Flight on numerous occasions, soon joining their team once more. To further disassociate from his past, Kyle took a new code-name, Wildheart. During this time, Gibney and his teammate Aurora fell in love and began a relationship. However, Kyle eventually began to mutate back to his ugly appearance. Since he could not stand to be seen that way by his lover, he left, unaware that his sudden departure would cause Aurora's fragile psyche to deteriorate even further.Kyle Gibney, now calling himself Wild Child once more, accepted an offer to join the United States' sanctioned mutant team, X-Factor. This caused a bit of friction between Gibney and X-Factor's associate, Sabretooth, who was impressed into service. Eventually, however, Gibney's body began mutating even further, and he quit the team to explore his new mutations and to find his true self.Somehow, Kyle ended up in custody of the new Weapon X program, under the auspices of the mysterious Director, who hoped to use the program's mutants for the benefit of humankind, even if that meant performing deadly missions and interning mutant captives. The program’s scientist experimented on Kyle, who became more intelligent but more feral-looking, and was once again dubbed Wild Child. The Director found that Gibney had been twisted so many times that he no longer held an identity of his own, needing only minimal suggestions via conventional methods to follow orders like a machine or an animal.One of Gibney's initial assignments was to recruit mutants for the Weapon X program. On one particular mission, to recruit Sunfire, Kyle's teammate Sabretooth became annoyed with him, lashing out and severing Gibney's vocal cords, rendering him mute. Another assignment was to recruit Kyle's one-time lover, Aurora. (In fact, this assignment was one of the reasons the Director of the program wanted Kyle in the first place.) Wild Child successfully freed Aurora from the mental asylum she was assigned, but, unfortunately, after Aurora was believed cured of her mental condition, she rejected Gibney due to his new freakish appearance.Wild Child continued to serve in Weapon X, even to the point of capturing innocent mutants to be interned at the camp Neverland. In watching Aurora, who was becoming increasingly romantic with the Director, Malcolm Colcord, Gibney was persuaded to join agent Brent Jackson who was hoping to form a group to stage a coup with the Director. Gibney agreed, and Jackson's allies joined the team Underground, led by Cable who hoped to take down the Weapon X program. The Underground was able to infiltrate the Weapon X complex, ousting the Director and nearly crippling the program. However, before the final defeat, agent Jackson betrayed the Underground, turning Cable's psychic powers against his allies. Jackson captured the Underground members and altered their memories to erase everything they saw and learned about the program. Jackson took credit for saving the program and was named the new Director of the Weapon X program.Gibney continued to serve the Weapon X program under Jackson, being named the Head of Security. However, when investigating Weapon X,  Wolverine found the program disappeared, its compound suddenly vacant. Wild Child’s whereabouts and subsequent activities remain unrevealed.After reality was twisted by the Scarlet Witch, many of Earth’s mutants were stripped of their powers. Wild Child was revealed to have been among these, as his mutant energy signature was recognized as having been absorbed by the Collective.", 
    "durability": 4, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "(unidentified) Alpha Flight #1 (1983); (as Wild Child) Alpha Flight #11 (1984); (as Weapon Omega) Alpha Flight #102 (1991), (as Wildheart) Alpha Flight #118 (1993)\n", 
    "groupaffiliation": [
        "Formerly Weapon X", 
        "X-Factor", 
        "Alpha Flight", 
        "Omega Flight", 
        "Gamma Flight"
    ], 
    "hair": "Blonde\n", 
    "height": 0, 
    "id": "Wild_Child", 
    "identity": [
        "Secret", 
        "known to Canadian government officials"
    ], 
    "intelligence": 2, 
    "knownrelatives": "Unrevealed", 
    "occupation": [
        "Former covert operative", 
        "government agent", 
        "adventurer", 
        "criminal"
    ], 
    "origin": "X-Factor #142 (1998)", 
    "placeofbirth": "Canada", 
    "powers": "Gibney's mutant physiology granted him superhuman reflexes and athletic ability as well as sharp claws and teeth that could have been used as weapons. His senses operated at a superhuman level, particularly his olfactory sense, and he could regenerate from wounds on the cellular level. Now depowered", 
    "realname": "Kyle Gibney", 
    "significantissues": [
        "Kidnapped by Secret Empire and turned into killing machine (X-Factor #143)", 
        "found by Dept. H and recruited for Gamma Flight (Alpha Flight #116-118, 1993)", 
        "recruited for Omega Flight, battles Alpha Flight (Alpha Flight #11-12, 1984)", 
        "released from prison to form new Gamma Flight (Alpha Flight #76, 1989)", 
        "taken by Nemesis to be cured of animalistic rages (Alpha Flight #88, 1990)", 
        "returns to Alpha Flight as Weapon Omega (Alpha Flight #102, 1991)", 
        "recruited for X-Factor (X-Factor #112, 1995)", 
        "appears as member of Weapon X, injured by Sabretooth, helps recruit Aurora (Weapon X: The Draft – Wild Child, 2002)", 
        "joins Agent Brent Jackson against Malcolm Colcord (Weapon X #8-13, 2004)", 
        "revealed to have been depowered (New Avengers #18, 2006)", 
        "with powers restored (Wolverine #53, 2007)", 
        "killed ( Wolverine Origins #39, 2009)"
    ], 
    "speed": 2, 
    "strength": 3, 
    "universe": "Marvel Universe", 
    "weight": 135
}