{
    "aliases": "None", 
    "citizenship": "USA", 
    "content": "Wyatt stood up for Johnny in even mundane situations, such as when the football team’s star player, Whitey Mullins, harassed him, goading him about his powers. This attracted the attention of Whitey’s coach, Sam Thorne, who played with Wyatt’s father and wanted Wyatt to join the football team. Wyatt sternly refused, but Thorne made it his duty to convince him.  Later, when the Black Panther sent out an invitation to Wakanda to the Fantastic Four, Johnny invited Wyatt to come along with him. The four heroes and Wyatt discovered that the Panther had lured them there to test himself as his country’s leader, and it was only with Wyatt’s unexpected help that they were able to overcome T’Challa’s traps and gain his respect. Wyatt used his training as a tracker, initially to help against the Black Panther, and then soon afterwards against Klaw’s unexpected attack.When the Fantastic Four prepared to leave Wakanda, Johnny Storm refused to go with them, and instead announced his intention to seek out the Inhumans' city of Attilan and burn his way in to free his love, Crystal. Wyatt immediately offered to help and the Black Panther gave them his Gyro-Cruiser to travel there. After a brief episode with the Wanderer, the pair ran into the Inhuman’s loyal companion, Lockjaw. The canine Inhuman soon took Wyatt and Johnny on a teleporting trip around the planet, and presumably off it, until Wyatt managed to train him to obey orders. Lockjaw briefly brought Johnny and Wyatt back to the Baxter Building where they fought and later rescued the original Human Torch before seeing him destroyed. Then the Inhuman teleported away once more, with both Wyatt and Johnny leaping to follow him, off to another world. But Lockjaw sensed danger and finally teleported them to New York again in time to help against Doctor Doom - who had recently stolen the power cosmic from the Silver Surfer. Wyatt joined the Fantastic Four’s fight, helping out even though he lacked super powers, and together they defeated Doctor Doom.", 
    "durability": 1, 
    "education": "Bachelor's Degree from Metro University, Tribal training in tracking", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Fantastic Four #50\n", 
    "groupaffiliation": "Ally of the Fantastic Four and good friend to the Human Torch and She-Hulk", 
    "hair": "Black\n", 
    "id": "Wingfoot,_Wyatt", 
    "identity": "Publicly Known", 
    "intelligence": 1, 
    "knownrelatives": "Will Wingfoot (father, deceased), Silent Fox (grandfather, deceased)", 
    "occupation": "Former college student", 
    "placeofbirth": [
        "Keewazi Indian Reservation", 
        "Oklahoma"
    ], 
    "powers": "None", 
    "realname": "Wyatt Wingfoot", 
    "significantissues": "Fantastic Four #50 (intro/begins college/meets Johnny)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}