{
    "aliases": "None", 
    "citizenship": [
        "Kamar-Taj", 
        "Tibet", 
        "resident alien in U.S.A."
    ], 
    "content": "One day Kan discovered a strange temple. Exploring it, Kan was drawn against his will through a mystical black mirror into an otherdimensional realm. There Kan met Jehan, king of Siridar, his sister, Princess Shialmar, and their court magician, Vung, the one who had cast the spell drawing Kan through the mirror. Jehan persuaded Kan to lead his people in a war against the Wizard Kings who ruled this otherdimertsional realm. Kan agreed to do so. During his time in this realm, Kan and Shialmar fell in love with each other.Ultimately Kan led his forces to complete victory over the forces of the Wizard Kings, and all but one of the Wizard Kings were killed. But Kan did not realize he was a pawn in Vung's secret plans. Vung captured both Kan and Shialmar and prepared to sacrifice them to the demonic race he secretly served, the N'garai. Shialmar offered, the N'garai her own soul, in exchange for power. The N'garai complied, transforming Shialmar into the Shadowqueen, a sorceress of great mystical power who was nearly incapable of love. The Shadowqueen slew Vung and sent Kan back to China.Back on Earth, Kan returned to the life of a priest. Kan deeply regretted aiding Vung in defeating the Wizard Kings and sought to atone by devoting his life and those of his first-born male descendants to the service of mystics who themselves serve the forces of good. Ever since then, the firstborn males of Wong's family have carried on this tradition. For the ten generations preceding Wong's, the first-born males have served the Ancient One, the former sorcerer supreme of the Earth dimension. The last of the members of Wong's family to serve the Ancient One was Wong's own father, Hamir the Hermit, who remained with the Ancient One up to the time of the latter's death.Wong was the first-born son of Hamir, and thus his life was dedicated to the Ancient One from earliest childhood. When Wong was four years old, Hamir presented him to the Ancient One. Subsequently, Wong was sent to a remote monastery to receive training in how to serve a master sorcerer. Wong's relatives were allowed to visit him on occasions. Shortly before Wong's tenth birthday, Hamir brought a young couple to the monastery to visit Wong and made a marriage pact with them, betrothing Wong to their as yet unborn daughter. During his training at the monastery, Wong mastered certain Oriental martial arts. He remains highly adept in the martial arts, although since actually becoming a servant he no longer practices them as much as he once did.When Wong reached adulthood, the Ancient One sent him to the United States to his disciple, Doctor Steven Strange. Wong was the first member of his family to come to America. Wong has now served Strange loyally and well for many years. During that time Strange has succeeded the Ancient One as sorcerer supreme of the Earth dimension.Strange's secretary, Sara Wolfe, became strongly attracted to Wong, who began to reciprocate her feelings. However, Wong put an end to what might have become a romance with Wolfe when he was notified that Imei Chang, the woman to whom he was betrothed, had at last come of age to be married. Currently, Imei Chang lives in New York City, and the relationship between Wong and Imei appears to be proceeding well.At one point Wong was abducted by otherdimensional sorcerers to the realm that was still ruled by the Shadowqueen. Doctor Strange followed Wong there and rescued him from the Shadowqueen's dungeon. Wong helped Strange battle the Shadowqueen, who finally perished.Wong and the empath, Topaz, were both abducted to another planet by the alien sorcerer, Urthona, when the latter used his magical powers to steal Doctor Strange's house and the mystical talismans and books it contained. Urthona even viciously mutilated Wong's face while holding him prisoner, Strange defeated Urthona and rescued Wong and Topaz. Back on Earth, Topaz used her healing powers to restore Wong's face to normalcy.In order to rescue Wong and Topaz, Strange had found it necessary to unleash mystical forces that, he believed, destroyed the mystical talismans and books that Urthona had stolen, thus preventing Urthona from using them for evil purposes. (In actuality unknown to Strange, the books and talisman, wire not destroyed but were instead spirited away by the mystical entity, Agamotto. The disappearance of these talismans from the Earth dimension broke certain ancient spells holding various mystical menaces in check.Strange subsequently cast a spell causing the population of the world, including Wong and Sara Wolfe, to believe him dead. As a result Wong and Wolfe perceived Strange as a man named Stephen Sanders. Strange made Wong and Wolfe the joint administrators of the Stephen Strange Memorial Metaphysical Institute, an institution for research into the occult. Strange then embarked on a long quest during which he succeeded in defeating a number of the menaces that the disappearance of the talismans had unleashed, most notably Shuma-Gorath.Following the defeat of Shuma-Gorath, Strange returned to New York City and released Wong and Sara Wolfe from his spell. Realizing that Strange was not dead, Wong and Wolfe warmly welcomed him back. Since then, the general populace has also learned that Doctor Strange is still alive and Strange has regained his missing talismans and books.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Brown\n", 
    "fighting": 1, 
    "firstappearance": "Strange Tales #110 (1963); (name revealed) Strange Tales #147 (1966)\n", 
    "groupaffiliation": "None", 
    "hair": "Bald (blond)\n", 
    "height": 0, 
    "id": "Wong", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "Kan (ancestor, presumed deceased), Hamir (father)", 
    "occupation": [
        "Servant", 
        "student of martial and mystic arts", 
        "co-administrator of the Stephen Strange Memorial Metaphysical Institute"
    ], 
    "origin": "Doctor Strange #75 (1986)", 
    "placeofbirth": [
        "Kamar-Taj", 
        "Tibet"
    ], 
    "powers": "None", 
    "realname": "Wong", 
    "significantissues": [
        "Turned into a vampire by Dracula (Tomb of Dracula #44, 1976)", 
        "restored to humanity by Doctor Strange (Doctor Strange #14, 1976)", 
        "abducted to Shadowqueen’s dimension, rescued by Doctor Strange, aided Strange in defeating Shadow queen (Doctor Strange #42-44, 1980)", 
        "attacked by N’Garai demon (Doctor Strange #45 1981)", 
        "severely injured by Urthona (Doctor Strange #81, 1987)", 
        "believed Doctor Strange was dead due to spell cast by Strange (Strange Tales #3, 1987)", 
        "reunited with Doctor Strange, regained full memory of him, united with Imei Chang (Strange Tales #17 1988)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 140
}