{
    "aliases": [
        "Pale Rider", 
        "Kree with no Name", 
        "\"Paleface\""
    ], 
    "citizenship": "Kree Empire", 
    "content": "Thousands of years ago several ancient Kree explorers were lost in this strange place. Once they arrived here, their bodies were invaded by the Exolon. The Exolon were parasitic entities that fed on the souls of living beings. It was through their bonding with the Exolon that these Kree became known as the Nameless. The nameless made Zak-Del into one of their own.He defeated the first wave of the Phalanx and left them dead on their ship. His actions were recorded by the security cameras. He went off looking for the owner of a signet ring, which was his only clue to lead him to the murderer of his family. He found a rebel by the Name of Ra-Venn. She tried to convince him to join her cause, but he refused her. Their meeting was interrupted by the Phalanx, leading to his being captured. He was soon met by the Phalanx Select, known as Ronan the Accuser. Ronan once ruled the mighty Kree, but now he was but a slave. His job was to interrogate Zak and reveal his secrets. Ronan tortured him to the point of disbelief. At that point he called the stranger a ghost or better yet a Wraith. The Stranger liked the sound of the name, and is now known as Wraith. He revealed his origin and purpose to Ronan, just before losing consciousness.He was awakened by a vision of his father Sim-Del, who encouraged him to press onward. Wraith eventually escaped and freed the Super Skrull and Praxagora from the Phalanx. Super Skrull began calling Wraith \"Paleface\". Together they broke free of their Phalanx, and ran into Ra-Veen and her crew once more, and they were also under attack by the Phalanx. Ra-Veen and crew were rescued them from their apparent defeat, by Wraith and the others, who later agreed to join forces with her and take their attack to the universal conquerors.", 
    "durability": 1, 
    "education": "Unrevealed", 
    "energy": 1, 
    "eyes": "Dark red\n", 
    "fighting": 1, 
    "firstappearance": "(vision) Annihilation: Conquest Prologue #1 (2007); (physical) Annihilation: Conquest Wraith #1 (2007); (identified) Annihilation: Conquest Wraith #2 (2007)\n", 
    "groupaffiliation": [
        "Kree underground", 
        "Nameless Kree"
    ], 
    "hair": "Black and white stripes\n", 
    "height": 67, 
    "id": "Wraith_(Zak-Del)", 
    "identity": "Publicly known", 
    "intelligence": 1, 
    "knownrelatives": "Sim-Del (father, deceased), unidentified mother (deceased)", 
    "occupation": "Assassin", 
    "origin": "Annihilation: Conquest Wraith #2 (2007)", 
    "placeofbirth": [
        "Kree Empire", 
        "Megellanic Cloud galaxy"
    ], 
    "powers": "The Exolon parasites cover Wraith's body in a black membrane, enabling regenerative healing, unspecified enhanced strength and immortality; it also prevents scanners from identifying him as a life-form. It is unclear if they help him survive in space. Unlike other Exolon hosts, Wraith can remember his pre-Exolon existence through sheer willpower. Wraith can cause the Exolon to swarm (controlling them from miles away) and use \"the sight of an exposed soul\" to strike deadly fear into his opponents, coat up to 15,000 giant objects at once to protect them from being hacked by techno-organic beings like the Phalanx and absorb energy blasts and the souls of other beings. If he is rendered unconscious, the swarm disperses.", 
    "realname": "None; formerly Zak-Del", 
    "significantissues": "Annihilation: Conquest Wraith #1-4 (2007)", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe", 
    "weight": 147
}