{
    "aliases": "Unrevealed", 
    "citizenship": "Strontian", 
    "content": "The Commandos were led to believe that Quasar confessed to murdering the crew of the Hub.  Quasar easily escaped the Commandos, but Captain Morfex was able to trace his energy signal. They tracked Quasar to the Milky Way Galaxy, but he was no longer alone, he had gained allies in Beta Ray Bill of Asgardian might and the Herald of Galactus the Silver Surfer. In the battle Xenith and the Commandos were defeated and Captain Morfex was blown out of an airlock, and into space.Xenith rushed to his rescue, only to find an alien Skrull in his place. The Skrull revealed himself to be Captain Morfex. He went on to explain to Xenith that they had been deceived; she then made a decision to join Captain Morfex, Beta Ray Bill, Quasar, and the Silver Surfer as the Star Masters. Together they would search for the true culprit of the crime. The Star Masters traveled to the Hub, where they continued their exploration for the truth.There they found an Axi-Tun spacecraft. It wasn’t long after they boarded the ship that the Silver Surfer and Xenith were engaged in battle by Voltan’s servants Dampyre, and Throk. Dampyre used the tentacles from his mouth to incapacitate the Silver Surfer. Xenith was defeated by the massive Throk, who used the strange field that surrounds his body to make her go numb. Both Xenith and the Surfer were placed in the Cauldron of Conversion. Quasar soon came to their rescue; using the Quantum-Bands he was able to free Xenith and the Surfer from the Cauldron of Conversion.Throk had captured a team of Rigellians led by Tana Nile. The group had come to the Hub on a mission to investigate the murders of the Charter members. The Star Masters fought together and freed Tana Nile. Together they stormed the Axi-Tun ship once again. Xenith battled Dampyre only to be thrown aside, and then he attempted to deplete Quasar’s quantum bands of their power. The power of the bands was too much for Dampyre to consume. This action ended with him becoming unconscious. Lord Votan commanded the ship to self destruct, with the Star Masters aboard. Dampyre’s fate was left untold.Xenith and the others managed to escape the death trap, and were honored by the Charter for their heroics. They revealed that the true murderer was Lord Voltan. Xenith and the Star Masters set a course to Tun in pursuit of Lord Votan. The Star Masters were met by an army of Axi-Tuns, who were under the influence of Lord Votan’s powers. The Star Masters themselves had become victims of Votan’s powers, which affect the will of his opponents by basically making them, give up the fight. Once they were stripped of their will to fight back, the Star Masters were imprisoned.They eventually devised a plan to free Quasar, by using Tana Nile as conduit to channel their combined willpower. Once Quasar was freed he kept Votan occupied while the others freed themselves. Xenith surprised Beta Ray Bill by lifting the enchanted Stormbreaker hammer and throwing it to him. This was a feat that can only be done by very few people in the universe. Throk was also able to lift the Stormbreaker, but the power of the hammer disintegrated the massive Axi-Tun. The Star Masters rallied a group of loyal Axi-Tuns, which were in allegiances with Landar the brother of Votan. Together they defeated Votan and then turned him over to The Charter to be punished for his crimes of murder.", 
    "durability": 1, 
    "education": "Unrevealed, although it is known that she had been extensively trained as a combat warrior by the Gladiator.", 
    "energy": 1, 
    "eyes": "Dark brown, yellow when in battle\n", 
    "fighting": 1, 
    "firstappearance": "Star Masters #1 (1995)\n", 
    "groupaffiliation": [
        "Vulcan's New Imperial Guard", 
        "formerly Star Masters", 
        "Cosmic Commandos"
    ], 
    "hair": "Black\n", 
    "id": "Xenith", 
    "identity": "She is not known to the inhabitants of Earth.", 
    "intelligence": 1, 
    "knownrelatives": "Gladiator (Kallark) Cousin", 
    "occupation": [
        "Formerly enforcer of the Charter", 
        "Leader of Personal Guard of Vulcan"
    ], 
    "origin": "Unrevealed", 
    "placeofbirth": "Strontia", 
    "powers": "Xenith like other members of the Strontian race had superhuman strength, near indestructible skin, enhanced stamina and durability. She has the power of flight and can survive in the cold vacuum of space without life support. She has the ability to project energy beams from her eyes.", 
    "realname": "Xenith", 
    "significantissues": [
        "Star Masters # 1-3 (1995-1996)", 
        "Cosmic Powers Unlimited #3-5 (1996)"
    ], 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}