{
    "add": {
        "doc": {
            "aliases": [
                "Desert Ghost", 
                "Controller X"
            ], 
            "citizenship": "Citizen of the United States", 
            "content": "But his friend and fellow ex-Lawless-member, Junkpile, disagreed with his new vision and turned on him, alerting the security force of Las Vegas’ Synge Corporation, who believed Xi’an had murdered their leader, Noah Synge, to the location of the gathering.  Synge sent a sniper in ahead of the security force, and the assassin took a shot at Xi’an when he was making a speech to the assembled crowd.  But Timothy used his mutant power to drain electricity and fire it in the form of energy blasts to ruin the hitman’s shot, but Xi’an was still injured.  The rest of the X-Men rushed to safety during the ensuing raid, bringing Xi’an with them.  But though Xi’an was injured, his mutant powers began to evolve, and his body created a hard, red carapace that acted as cocoon to protect him while he was hurt.  And when he freed himself from the cocoon he found that, in addition to his ability to destroy things with one hand, he was also capable of healing with the other hand.  Upon his emergence from the cocoon, Xi’an found himself in the Synge morgue, with Junkpile attacking his X-Men and standing over the body of Serpentina.  Xi’an fought him, and defeated him, using his powers to break Junkpile’s metal body apart, but leaving him alive, believing that killing him would be the wrong choice.  The X-Men later cleared Xi’an of Synge’s murder.While the rest of the team followed their teammate Meanstreak onto the floating city of Valhalla, Xi’an fought a personal battle against his outlaw personality that appeared to him as a ghost, which continued to haunt him about his past.  This reemergence of his past began to tell on Xi’an, and he snapped at Meanstreak when he returned for leaving without permission.  Later, when the X-Men picked up broadcasts from Mama Hurricane, Xi’an took them to see her to find out if she really was the Great Purge’s hero, Hurricane.  They found that she was, and Xi’an quizzed her about the past, discovering that she worked with a being called the Driver, who would carry mutants to a paradise known as Avalon.  Only afterwards, when fighting a twisted version of the 20th Century’s X-Men, and their leader Zhao, did Xi’an’s dark personality take over while inside the psychic landscape of Xi’an’s mind that Zhao created to dominate him.  Using this personality, Xi’an bested Zhao, leaving him comatose, and letting the old persona take over.  Believing that his dream of peace between mutants and humans was a mistake, along with the creation of the X-Men, Xi’an left them to search out the Driver and the city of Avalon.His fellow X-Man Skullfire joined him, as he was dealing with his own personality issues at the time, and together they hunted down another of Xi’an’s ex-Lawless members, Broken Haiku.  Haiku reluctantly gave Xi’an the whereabouts of the Driver, using the data from a disk of rendezvous points that Hurricane gave him, but in act of revenge she also alerted the Driver that Xi’an was coming for him.  Together with Skullfire, La Lunatica, an escaped member of the Theatre of Pain, and Junkpile, whose betrayal Xi’an quickly forgave, Xi’an set out to locate the Driver.  They found him in Sulphur Springs Valley, Arizona, in a hidden headquarters, where it was revealed that the Driver would take mutants and mentally upload them into a database until the world was ready for them to return.  Xi’an attempted to stop him, but Brimstone Love, the head of the Theatre of Pain, appeared and accidentally destroyed the database while fighting with the Driver.  Instead of claiming Lunatica as he had planned, Brimstone offered Xi’an a place at the Theatre, recognizing him to be a powerful ally.  Much to the surprise of the X-Men present, Xi’an agreed, and Brimstone transported away with Xi’an, leaving Lunatica free for the moment.While the other X-Men worked to break into and destroy the Theatre of Pain, Xi’an began his indoctrination into the Theatre during a psychic trial which took Xi’an through his past, where he confronted old enemies and was eventually broken down and made into Controller X, one of the artists of the Theatre that would record the suffering of individual victims and transmit it to paying customers.  Xi’an later stole the comatose body of Zhao, as well as Zhao’s frozen X-Men, and brought them to the Theatre where Zhao was used to power the Mindfire Machine, and his X-Men were revived and used against Xi’an’s former teammates.  Using the Mindfire Machine, Xi’an and the Theatre began a massive broadcast in which they tapped into the suffering of a crowd of victims and projected that suffering to numerous patrons around the world.  But the X-Men interrupted the broadcast before it could go too far, reversing it on the viewers, and together with the new President Doom’s troops, they brought down the Theatre of Pain.  It was only with the help of Xi’an, who turned the Mindfire Machine on Brimstone Love, hoping to take control of the Theatre himself, that the assembled heroes were able to overcome the leader of the Theatre.  But Brimstone himself disappeared immediately afterwards, never to be seen again.  Lunatica, who used her powers to draw out past suffering, attacked Xi’an and brought him out of his selfish destruction.  Dishonored, Xi’an returned to the X-Men, yet believing himself unworthy of a position as their leader.In repentance, Xi’an set himself up in the polyclinic of Halo City, a city created by President Doom to hold the victims of the Theatre, as a healer to any and all who needed him; despite the physical toll that healing took upon him.  He continued with his healing until the group known as the Undead and their master, the Graverobber, blew up the hospital.  Later, Ten Eagles appeared and told him that a man calling himself the Foolkiller was hunting down their ex-Lawless members, and had even attacked and severed Ten Eagles right arm.  They contacted the other remaining members of the Lawless, Auntie Maim and Mongrel, and together they prepared to fight the Foolkiller.  Once he arrived, he explained that he was the last of a group of religious zealots dedicated to ridding the world of fools, based off of a 20th Century masked killer, and that the Lawless had ridden into his town one day and unfairly massacred the last of his people.  Even though Xi’an tried to convince him that the Lawless had been attacked and tortured, and only destroyed the town out of self defense, the Foolkiller didn’t listen and fought the remaining members of the Lawless until he was distracted when Lunatica attacked and brought up his old memories.  Xi’an gave him one last chance to give up, but the Foolkiller detonated a bomb connected to his chest instead, killing himself instead of admitting he was wrong for doing what he did.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Green\n", 
            "fighting": 1, 
            "firstappearance": "X-Men (2099) #1\n", 
            "groupaffiliation": [
                "Leader of the X-Men", 
                "Former member of the Lawless", 
                "Former member of the Theatre of Pain"
            ], 
            "hair": "Black\n", 
            "id": "Xi%27an_Chi_Xan_(2099)", 
            "identity": "Publicly Known", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "None", 
            "placeofbirth": "Unrevealed", 
            "powers": "Xi'an's left hand is able to break down the molecular structure of anything it touches.  His right hand is able to heal any flesh it touches, but only if the injured person is still alive.  It can also not regenerate any missing limbs.  Xi'an's body will also create a protective cuticle to encase him in the event of an injury, letting him heal.", 
            "realname": "Xi'an Chi Xan", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel 2099 (Earth-928)"
        }
    }
}