{
    "aliases": [
        "Ant-Man", 
        "Giant-Man", 
        "Goliath", 
        "Yellowjacket", 
        "Wasp"
    ], 
    "citizenship": [
        "USA", 
        "currently residing in England"
    ], 
    "content": "One day he discovered a process in which he would manipulate a newly discovered group of subatomic particles through magnetic fields. Pym tested the serums on himself, and had accidentally shrunk himself to the size of an ant and was trapped inside an anthill. Once normal sized, Pym destroyed the serums, thinking that they were too dangerous . He rethought his decision, and recreated the serums, dubbing them \"Pym  Particles\" and developing a formula that would enable himself to shrink and return to normal size. He also worked on a cybernetic helmet to enable him to communicate and study ants. Pym was also working on behalf of the government to find to work on a formula to help provide immunity to low-level radiation. It was then that several Soviet KGB Agents broke in, attempting to kill Pym and destroy his work. Pym donned the cybernetic helmet and newly designed protective suit, shrank himself, and escaped outside, to the anthill. There, he gained control of the ants, and attacked the agents and freed his assistants.Ant-Man and the Wasp were mistakenly called to battle the Hulk with heroes Thor and Iron Man. When the heroes discovered that the Hulk was innocent and it was all a trick formulated by Loki, Pym and the Wasp suggested they form a team, combining their different powers to fight evil, and the Wasp named the team the Avengers. Pym continued to fight alongside the Avengers, but soon felt outclassed by the powerhouses of the team and created the identity of Giant-Man. Later still, Pym proposed to Janet, and the two briefly left the team for their marriage. Pym found himself back in the Avengers, creating another identity of Goliath. Although he usually preferred abstain from adventuring to stay in his lab, he continued to fight off-and-on alongside the Avengers because the Wasp always wanted to.Years later, Pym, who was undergoing severe mental stress, had an accident in his laboratory, breathing in chemical fumes. His sanity warped, and created a fourth identity: Yellowjacket. He returned to the Avengers, kidnapping Janet and forcing her to marry him. When he was confronted by the Avengers and brought back to his right mind, Pym and Janet decided to let the marriage stand. They adventured with the Avengers, and later, they enjoyed a brief tenure alongside the heroes of the Defenders.Pym's mental problems continued to worsen. He returned to the Avengers, determined to prove himself alongside the heavyweights of the team, which only added to his stress. At one point, he struck Janet, and later, during battle with the misguided Elfqueen, Pym lashed out at her just as she was about to surrender. The Avengers began a court-martial process for Pym, who, losing his sanity, created a robot to destroy the Avengers-- but built with a failsafe that Pym would activate to \"save\" his friends and regain his status. The ploy failed, and the Wasp, who discovered Pym's treachery, saved the team. Pym promptly quit, and the Wasp filed for divorce. Pym was further oppressed as his old enemy Egghead framed Pym for stealing nuclear devices, leading to Pym's arrest. Egghead led the Masters of Evil in freeing Pym from his trial, further implicating him in villainy. Pym soon defeated the Masters single-handedly, redeeming himself, but he decided against rejoining the Avengers. Pym later would ally with them when his expertise was needed. Over time, his relationship with the Wasp was reconciled.Later still, Pym found his body could not handle the stress of constant size-changing, and he retired from costumed crime-fighting. He still joined the Avengers, however, when they opened their West Coast branch, in order to oversee the facilities and the scientific research. Growing more despondent, however, he soon decided to commit suicide but was stopped by their associate Firebird (then Espirita,) who helped him to reconcile the two areas of his life-- costumed crime-fighting and scientific research. As Hank Pym, Scientific Adventurer, he would use the aura of Pym Particles his body produced in order to shrink and grow objects around him, and he rejoined the Avengers full-time, often acting as field leader.Although he stayed with the West Coast branch for some time, Pym soon found himself actively adventuring from the New York mansion. Later still, Pym and other size-changing heroes and villains were caught up in an invasion attempt from the natives of the dimension Kosmos, the place where Pym particles stem from. The outcome left Pym able to grow again but not to shrink, and he resumed his old Giant-Man identity.Pym was on hand with the other Avengers who seemingly sacrificed their lives to absorb the energies of the being known as Onslaught. In reality, he was shunted to another dimension. When he and the other heroes were restored to Earth, Pym found that he was capable of his full range of size-changing abilities, although he could not shrink and grow other objects unless he specifically treated them in his laboratory. He and the Wasp also returned to their previous romantic relationship.Pym helped reorganize the Avengers with the Wasp and their teammates, stopping the menace of the sorceress Morgan Le Fay. He then agreed to stay on as a reserve member, returning to his laboratory work full-time. Pym and the Wasp would join with the Avengers on an as-needed basis, such as helping them thwart the villainous Grim Reaper. During this time, Pym switched to his Goliath identity once again.Pym's research was monitored by Ultron, who later kidnapped Pym and other of its so-called \"family.\" Ultron revealed that Pym had used his own brain patterns as a template for Ultron's intelligence, and Ultron intended to do the same with all members of its \"family\" when building a new robot army with Pym's latest research. Ultron was confronted by the Avengers, who freed Pym and allowed him to deliver the blow that defeated Ultron. Soon after, Goliath and the Wasp rejoined the Avengers full-time.At one point, when investigating the machinations of the barbarian sorcerer Kulan Gath, who had transformed a South American village into a version resembling his native time period, Pym was transformed into a giant version of his Yellowjacket identity. Although he was quickly restored to normal, the reversion had unconsciously allowed the Yellowjacket identity to form for itself a body out of the extradimensional mass Pym used to grow. Pym had long sought to suppress the impulsive, egotistical Yellowjacket and instead rely on rationality and prudence, and now the two sides of his personality shared the same mass in the form of two separate bodies. \"Yellowjacket\" surreptitiously helped \"Goliath\" and the Avengers escape Kulan Gath, and he secretly followed them back to their Mansion headquarters. Soon, Yellowjacket kidnapped Goliath, imprisoning him and taking his place as Goliath among the Avengers.Although many of his teammates recognized \"Goliath's\" strange behavior, no one suspected the truth. Yellowjacket would occasionally succumb to debilitating pain, a stress of drawing upon the same mass. The strain eventually became too much, and Yellowjacket began to fade away. Unaware of what was happening, the Avengers found only one source of help, their former enemy, Jonathan Tremont of the Triune Understanding. Tremont helped Pym confront the two sides of personality, and he merged together to restore himself to normal. Pym rejoined the Avengers and assumed his Yellowjacket identity once more, claiming that it would be as Yellowjacket, the identity that gave him the most problems, that he would face his problems and find out if he was truly cured.Pym and the Wasp renewed their romantic relationship, often taking time off together like a whirlwind trip to Las Vegas. Pym again proposed to Janet van Dyne, but she declined, fearing that he might one day lose control under stress. The Wasp then began to explore different avenues of her life. She started to use her size-changing powers to grow in size similar to Giant-Man. She also had a dallying affair with her teammate Hawkeye, which Pym walked in on. The Wasp, Hawkeye, and Pym avoiding come to terms with this uncomfortable new love triangle, as the Avengers were suffered a series of sudden and devastating attacks from friends and enemies alike, part of which resulted in She-Hulk starting a rampage. The Wasp was summarily swatted aside and remanded into a coma. When she recovered, she and Pym renewed their relationship once more. The couple chose not to resume membership when the Avengers disbanded, and Pym took an offer as a research scientist at Oxford University.After the Skrull Invasion, Pym adopted the codename Wasp in tribute to his deceased partner and rejoined the Avengers, leading a team of his own. During the time when his teammates were fighting the Unspoken, the entity Eternity named Pym Earth's Scientist Supreme (the scientific counterpart to the Sorcerer Supreme). Soon after Pym and his team defeated the Unspoken, they fought and defeated Absorbing Man with the help of Norman Osborn's Avengers. Pym's Avengers were previously deputized by agents of G.R.A.M.P.A., ensuring Osborn couldn't arrest them, but that was only temporary. Pym would be asked to give aid during Osborn's siege of Asgard, but he could not due to the return of Ultron.", 
    "durability": 4, 
    "education": "extensive knowledge in various fields of science, currently has a residency in Oxford", 
    "energy": 3, 
    "eyes": "Blue\n", 
    "fighting": 3, 
    "firstappearance": "Tales to Astonish #27 (1962)\n", 
    "groupaffiliation": "Avengers", 
    "hair": "Blond\n", 
    "height": 0, 
    "id": "Yellowjacket_(Henry_Pym)", 
    "identity": "Publicly known", 
    "intelligence": 7, 
    "knownrelatives": "Maria Trovaya (wife, deceased), Janet Van Dyne,(Wasp, second wife, divorced), Ultron (creation, \"son\")", 
    "occupation": [
        "biochemist", 
        "adventurer"
    ], 
    "placeofbirth": [
        "Elmsford", 
        "New York"
    ], 
    "powers": "Originally by imbibing special capsules of Pym particles, Pym was able to shrink to half-inch size and adventure as the Ant-Man and, later, to grow to 30-foot size and adventure as Giant-Man and Goliath. He soon switched from using capsules to a Pym particle-filled gas, but eventually his body had absorbed enough particles to shrink and grow at will. At one point, Pym found himself able to use the Pym particle field about his body to shrink and grow objects in contact with him, and he carried various high and low tech equipment in his jumpsuit. Currently, he can only shrink and grow objects that have been specially-treated with Pym paticles beforehand. When fully grown as Giant-Man or Goliath, he also exhibits superhuman strength.", 
    "realname": "Dr. Henry \"Hank\" Pym", 
    "significantissues": [
        "Tales to Astonish #35 - 1st Ant-Man, Tales to Astonish #49 - 1st Giant-Man, Avengers (vol. 1) #28 - 1st Goliath, Avengers (vol. 1) #59 -1st Yellowjacket", 
        "rejoined Avengers as Wasp (Mighty Avengers #21, 2009)"
    ], 
    "speed": 3, 
    "strength": 4, 
    "universe": "Marvel Universe", 
    "weight": 185
}