{
    "add": {
        "doc": {
            "aliases": [
                "Angel of Vengeance", 
                "The New Morningstar", 
                "He of the Ineffable Sefiroth", 
                "Chief of the Order of Dominions", 
                "Lord of the Black Host"
            ], 
            "citizenship": "Formerly Heaven", 
            "content": "Zadkiel has come into conflict with God. He believed that he needed the power of the Spirits of Vengeance to help him win his war against Heaven and Hell. Zadkiel revealed to John Blaze that he was not a demon of vengeance as he had come to believe due to his being a spirit of vengeance, when actually he is being used as an angel of vengeance. In actuality Roxanne, his ex-wife, made a deal with Mephisto, in hopes that she could save Johnny from life time of damnation in Hell. However, Zadkiel was easy to persuade he had already declared his own war on heaven. He is attempting to overthrow God himself, and he saw Johnny, or the Ghost Rider, as the ideal pawn to complete his intentions.Zadkiel ultimately won his war when his willing pawn, Daniel Ketch, blindly led the Black Host into war with Blaze and the last remaining Ghost Riders. Ketch took the powers of Blaze and his allies, Molek, Bai Gu Jing, Baron Skullfire, and Marinette Bwa Chech. Upon delivering these gifts to Zadkiel, Ketch was cast out of Heaven and had his eyes opened to his master's sinister plan. Daniel took as much Ghost Rider power with him as he could, but it wasn't enough to prevent Zadkiel from overthrowing the kingdom of God.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Unrevealed\n", 
            "fighting": 1, 
            "firstappearance": "Ghost Rider #19, 2008 (By name only); Ghost Rider #27, 2009 (Full appearance)\n", 
            "groupaffiliation": "Formerly Angels of Heaven", 
            "hair": "Unrevealed\n", 
            "id": "Zadkiel", 
            "identity": "The general populace of Earth is unaware of Zadkiel’s existence.", 
            "intelligence": 1, 
            "knownrelatives": "Unrevealed", 
            "occupation": "Seeker of vengeance", 
            "origin": "Unrevealed", 
            "placeofbirth": [
                "Unrevealed", 
                "possibly a realm in Heaven"
            ], 
            "powers": "The true extent of Zadkiel's powers have yet to be revealed.", 
            "realname": "Unrevealed; possibly Zadkiel", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel universe"
        }
    }
}