{
    "aliases": [
        "Ravenger of Souls", 
        "Living Spirits of Vengeance", 
        "Ghost Rider", 
        "impersonated Ben Parker", 
        "Mary Parker", 
        "Richard Parker", 
        "George Stacy"
    ], 
    "citizenship": "None", 
    "content": "2000 years ago, hearing the legends, the mage K'nutu led his starving tribe to find Zarathos' early remains, and against the chief's protest, summoned Zarathos' essences back to Earth. Though diminished because part of him remained trapped in the Medallion, Zarathos led the tribe to conquer their neighbors in return for worship and souls to consume, beginning with the protesting chief. The Cult of Zarathos built a city of Ten Thousand Souls, but the Hell-Lord Mephisto - angered that Zarathos was destroying souls that might otherwise be his and regarding Zarathos as a potential rival - sent a man, later known as Centurious, to confront Zarathos. When Zarathos tried to consume his soul. Centurious proved to be immune, his soul already claimed by Mephisto; momentary doubt amongst Zarathos' followers grew when Zarathos proved unable to defeat a manifestation of Mephisto, allowing Mephisto to claim Zarathos' soul. Over subsequent centuries Mephisto bound Zarathos to human servants, wielding his flames in Mephisto's cause, his memories wiped to make him compliant. Nearly 20 years ago the Zarathos spirit fragment within the shattered Medallion possessed Max Parrish, rescuing his sister Cammy from the ancient sorcerer Comte St. Germaine. Zarathos would have kept his host stolen body, but a youthful Johnny Storm separated Max from the Medallion. Mephisto apparently claimed the errant soul fragment, as Zarathos' essence was reportably absent from the Medallion's later users. Mephisto merged Zarathos with stunt rider Johnny Blaze, one of the Caretakers charges, transforming into the vigilante Ghost Rider. Blaze and Zarathos remained bonded for years, their level of control over their shared form varying; twice they were briefly separated, once by the mage Azaziah hoping to usurp Zarathos' power, and them by Mephisto as part of a wager with Asmodeus, but were rejoined both times. Shortly after Nightmare restored Zarathos' lost memories, Ghost Rider encountered Centurious again; when Centurious was sucked into his own Crystal of Souls, Zarathos willing followed seeking vengeances, breaking his bond with Blaze.", 
    "durability": 7, 
    "education": "Unrevealed", 
    "energy": 7, 
    "eyes": "Blue fire\n", 
    "fighting": 7, 
    "firstappearance": "Marvel Spotlight #5 (1972)\n", 
    "groupaffiliation": [
        "Leader of the Fallen", 
        "Cult of Zarathos", 
        "formerly Lilin"
    ], 
    "hair": "None\n", 
    "height": 0, 
    "id": "Zarathos", 
    "identity": "No Dual identity", 
    "intelligence": 5, 
    "knownrelatives": "Unidentified child", 
    "occupation": "Demon", 
    "origin": [
        "Ghost Rider #77 (1983)", 
        "Ghost Rider #43 (1993)"
    ], 
    "placeofbirth": "Unrevealed", 
    "powers": "Zarathos can control the elements, engulfing his foes in rock and generating an unholy, soul-consuming fire. When sufficiently empowered, he can generate energy shields or grow up to 30 feet, among other feats. Zarathos is also able to teleport.", 
    "realname": "Zarathos", 
    "significantissues": "Official Handbook Bibliography", 
    "speed": 7, 
    "strength": 7, 
    "universe": "Marvel Universe", 
    "weight": "Variable\n"
}