{
    "add": {
        "doc": {
            "aliases": "“Mistress of the Winds”", 
            "citizenship": "Unrevealed", 
            "content": "Zephyr scourged the earth many millennia ago in search of the Ruby Scarab that would be used against her pantheon. During her quest to secure the scarab Zephyr mentally enslaved the Living Mummy (N'Kantu) sending him to Earth to recover the scarab. The Mummy was delayed in his efforts by the Living Pharaoh (Ahmet Abdol) and Rich Harper a thief known as Asp. Zephyr journeyed to Earth herself to obtain the babble. The other Elementals seeing Zephyr as an inferior being grew tired of her slow performance, and also journeyed to Earth, where they bound Zephyr along with their human captives. Zephyr allied herself with Asp against her brethren.", 
            "durability": 1, 
            "education": "Unrevealed", 
            "energy": 1, 
            "eyes": "Brown\n", 
            "fighting": 1, 
            "firstappearance": "Supernatural Thrillers #8 (1974)\n", 
            "groupaffiliation": "Elementals", 
            "hair": "Black\n", 
            "id": "Zephyr", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "None", 
            "occupation": "Wind Goddess", 
            "origin": [
                "Supernatural Thrillers#8 (1974)", 
                "recap of origin given (Astonishing Thor #3", 
                "2011)"
            ], 
            "placeofbirth": "Unrevealed", 
            "powers": "Zephyr possesses superhuman strength, durability and stamina. She could manipulate the wind to do her bidding, creating strong windstorms and making it possible for her to fly on her own accord. Zephyr also possesses mental abilities that manifest as mind control and illusion casting.", 
            "realname": "Zephyr", 
            "significantissues": [
                "Came to Thor as a vision in wind (Astonishing Thor #1, 2011)", 
                "appeared within the Collector's museum (Astonishing Thor #2)", 
                "revealed her past history with Thor to the Collector (Astonishing Thor #3, 2011)"
            ], 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe"
        }
    }
}