{
    "add": {
        "doc": {
            "aliases": "None", 
            "citizenship": [
                "Resident of pre-Cataclysmic Atlantis", 
                "later resident of\nThuria"
            ], 
            "content": "During her time in Thiuria, Zhered-Na defended the Earth against the malevolent extradimensional entity known as the Dweller-In-Darkness, a being who drew power from the fears of others. Aided by Valka and Agamotto, Zhered-Na bested the Dweller, but found her power was insufficient to destroy the scnDalled Fear Lord. Instead she imprisoned him in a pocket dimension, placing him in a state of suspended animation.In an effort to prevent a great cataclysm from occurring during the modern times, the hero Daimon Hellstrom (Son of Satan) returned to the time of the Great Cataclysm in order to understand the cause of the disaster. Zhered-Na was able to aid Hetlstrom in halting the destruction in the modern era, although nothing could be done to stop it during Zhered-Na's time. Zhered-Na sent Helistrom back to his era and returned to her own time, prepared to face the Cataclysm.In her own temple the sorceress made a final prophecy, which concerned demons invading modem day Earth, just as Atlantis began to sink beneath the seas. The Dweller-In-Darkness managed to siphon off some of the great fear of the Atlanteans and used it to imbue a portion of his consciousness with independent life, creating the entity known as D'Spayre. Zhered-Na told her disciples that Atlantis was lost, but that they would be spared its fate. However, the people of the town below Zhered-Na's temple were superstitious and blamed the sorceress and her Cult for causing the tremors. They stormed the temple and attacked the unarmed Cultists. Zhered-Na told her Disciples to flee while she stayed to meet her fate. One of the villagers, under the influence of D'Spayre, slew her with his' sword. The villagers then burnt her temple.", 
            "durability": 1, 
            "education": "Extensive training in magic by Atlantean sorcerers", 
            "energy": 1, 
            "eyes": "Blue\n", 
            "fighting": 1, 
            "firstappearance": "(Adventures into) Fear #15(1973}\n", 
            "groupaffiliation": "Leader of the Cult of Zhered-Na", 
            "hair": "Platinum blonde\n", 
            "height": 71, 
            "id": "Zhered-Na", 
            "identity": "No dual identity", 
            "intelligence": 1, 
            "knownrelatives": "None", 
            "occupation": "Sorceress", 
            "placeofbirth": "Atlantis", 
            "powers": "Zhered-Na was one of the most powerful magic users of her era. She possessed great precognitive powers and could access the astral plane and other dimensions, transport others across dimensional barriers, project magical bolts, and magically extend the lifespan of her disciple Dakimh by over 20,000 years. She could also call upon power from extradimensional entities such as Valka and Agamotto. The full range of her abilities remains unknown. The Tome of Zhered-Na. containing her teachings, remains one of the most powerful books of magic in existence", 
            "realname": "Zhered-Na", 
            "significantissues": "See Handbook Bibliography", 
            "speed": 1, 
            "strength": 1, 
            "universe": "Marvel Universe", 
            "weight": 130
        }
    }
}