{
    "aliases": "Thunderbolt Ross", 
    "citizenship": "Inapplicable", 
    "content": "Later, an accident at a research complex designed to record brain waves of people, collected and re-created the Zzzax entity, who was promptly defeated by the Hulk again. Then, Stark International made the mistake of purchasing the central power core from the same research complex, which released Zzzax once more. Dr. Bruce Banner, the alter ego of the Hulk, was nearby, and he defeated Zzzax by drawing him into a stellar-powered generator, which dissipated Zzzax into space.Zzzax was revived through the powers of Graviton, who wanted an ally with the powers of Zzzax to fulfill his team comprised of those who could control the four fundamental forces, of which Zzzax represented electro-magnetism. Graviton hoped to defeat the Avengers, but they failed. In fact, in their first confrontation with the team, Hawkeye shot a cable arrow through Zzzax and into a puddle of water, easily dissipating the entity.Somehow, Zzzax was imprisoned by the espionage agency S.H.I.E.L.D. after this encounter, and was stored in a large insulated tube in New Mexico. There, the army general General \"Thunderbolt\" Ross wanted to undergo an experiment that would imbue him with the powers of Zzzax in order to defeat the Hulk. Unfortunately, the experiment backfired, and Ross' psionic energy was absorbed into a revived Zzzax-- Ross' consciousness governed Zzzax's body while Zzzax's own personality was submerged. Ross, as Zzzax, fought the Hulk, but Ross was convinced that he inhabited a monster's body, and Zzzax fled, distraught.During a later experiment at Stark International, Tony Stark, a.k.a. Iron Man, ran an experiment that pulled Zzzax out of the air, overloading his generator. Zzzax claimed to have gained enough power to free himself of Ross' influence, which must have returned to Ross' body. Zzzax succeeded in defeating Iron Man, but Iron Man connected Zzzax to the generator and to liquid nitrogen at the last moment, shorting out the entity.Once again, Zzzax's remains were remanded to S.H.I.E.L.D. custody. S.H.I.E.L.D. was later interested in taking down the mutant known as Cable, and S.H.I.E.L.D.'s Agent 18 unleashed Zzzax where Cable would be forced to battle him. Ultimately, Cable was able to defeat Zzzax with an open water main, and Zzzax dissipated.", 
    "durability": 1, 
    "education": "None", 
    "energy": 1, 
    "eyes": "White\n", 
    "fighting": 1, 
    "firstappearance": "Incredible Hulk #166\n", 
    "groupaffiliation": [
        "(Formerly) associate of Graviton", 
        "Halflife", 
        "and Quantum"
    ], 
    "hair": "None\n", 
    "height": 0, 
    "id": "Zzzax", 
    "identity": "No dual identity", 
    "intelligence": 1, 
    "knownrelatives": "None", 
    "occupation": "None", 
    "origin": "Incredible Hulk #166", 
    "placeofbirth": [
        "Consolidated Edison nuclear power plant", 
        "New York City"
    ], 
    "powers": "Zzzax is a being of pure energy-- \"a semi-sentient electromagnetic construct of psionic energy.\" As such, his touch is deadly, and he can fire bolts of energy as well as control magnetic force, being able to fly and travel through electical lines. He can appear as tall as 40 feet. Zzzax is forced, however, to constantly feed off of electrical sources-- be them from power plants or electrolytes in the human brain, and perhaps because of this, he has been known to control individuals through psionic means. Zzzax is also vunerable to attacks that absorb, ground, or control his energy.", 
    "realname": "Zzzax", 
    "speed": 1, 
    "strength": 1, 
    "universe": "Marvel Universe"
}